     H            Y.
     F** ATAR91 ********************************************
     F* 確定発注累積ファイル　ＩＮＺ BY WEEKLY           *
     F*  REFORMAT FIRM ORDER ACCUM FILE (SAVE TO AH#PP31)  *
     F*                                                    *
     F* TCHK1 04/02/07 CREATE(COPY FROM ATAR90)            *
     F* TCHK2 06/07/12 RE-MAKE                             *
     F* TCHK3 03/27/13 CHG DATE COUNT 60 ---> 40           *
JW1  F* JW  2022/03/31 ADD 2 PARTS TO AVOID DUPLICATE LOT#      *
JW2  F* JW  2023/10/09 ADD 1 PARTS TO AVOID DUPLICATE LOT#      *
     F***********************************************************
     FAH#PL11 UF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAH#PP31 O   E                    DISK
     I*
     I            DS
     I                                        1  140WSTIME
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     I            DS
     I                                        1   80CFSKHZ
     I                                        1   40CFSKYY
     I                                        5   60CFSKMM
     I                                        7   80CFSKDD
     I            DS
     I                                        1   80W@YMD
     I                                        1   40W@YY
     I                                        5   60W@MM
     I                                        7   80W@DD
     I            DS
     I                                        1   80W@YMD1
     I                                        1   40W@YY1
     I                                        5   60W@MM1
     I                                        7   80W@DD1
     C******************************************************
     C* MAIN                                               *
     C******************************************************
     C*
     C           *LOVAL    SETLLAH#PL11
     C*
     C                     DO   *HIVAL
     C*
     C                     READ AH#PL11                  98
     C   98                LEAVE
      *
     C           CFHIN1    IFEQ '90910'
     C           CFHIN2    ANDEQ'A2009'
      *
JW1  C           CFHIN1    OREQ '90910'
 .   C           CFHIN2    ANDEQ'A2015'
      *
 .   C           CFHIN1    OREQ '90910'
JW1  C           CFHIN2    ANDEQ'A2018'
      *
JW2  C           CFHIN1    OREQ '90105'
 .   C           CFHIN2    ANDEQ'A0205'
      *
JW2  C           CFHIN1    OREQ '90105'
 .   C           CFHIN2    ANDEQ'A0355'
      *
JW2  C           CFHIN1    OREQ '90910'
 .   C           CFHIN2    ANDEQ'A2019'
      *
JW2  C           CFHIN1    OREQ 'U0805'
 .   C           CFHIN2    ANDEQ'C3112'
      *
      * PURGE IF IT'S OVER 20 DAYS
     C           CFSYHZ    IFLE W@YMD1
     C                     WRITEAH#PP311
     C                     DELETAH#PL111
     C                     ITER
     C                     END
     C                     END
     C*
     C           CFSKJY    IFEQ 'D'
     C           CFSKHZ    ANDLEW@YMD
     C                     WRITEAH#PP311
     C                     DELETAH#PL111
     C                     ITER
     C                     END
      *
     C* PURGE IF IT'S OVER 40 DAYS
     C           CFSYHZ    IFLE W@YMD
     C                     WRITEAH#PP311
     C                     DELETAH#PL111
     C                     ITER
     C                     END
     C*
     C                     ENDDO
     C*
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C******************************************************
     C* INITIAL                                            *
     C******************************************************
     C           *INZSR    BEGSR
     C*
     C                     TIME           WSTIME
     C                     Z-ADD*ZERO     W@YMD
     C                     Z-ADD*ZERO     W@YMD1
     C                     Z-ADD*ZERO     W@CNT   20
     C*
     C           K#AGD     KLIST
     C                     KFLD           WSSYYY
     C                     KFLD           WSSMMM
     C                     KFLD           WSSDDD
     C           K#AGD     SETLLAGDPL12
     C*
     C                     DO   *HIVAL
     C*
     C                     READPAGDPL12                  89
     C   89                LEAVE
     C           F8HIRU    IFEQ '*'
     C                     ITER
     C                     END
     C*
     C                     ADD  1         W@CNT
TCHK3C           W@CNT     IFGE 40
     C                     Z-ADDF8KAYY    W@YY             40 WORKING DAYS
     C                     Z-ADDF8KAMM    W@MM
     C                     Z-ADDF8KADD    W@DD
     C                     LEAVE
     C                     END
      *
TCHK3C           W@CNT     IFEQ 20
     C                     Z-ADDF8KAYY    W@YY1            20 WORKING DAYS
     C                     Z-ADDF8KAMM    W@MM1
     C                     Z-ADDF8KADD    W@DD1
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
