     H            Y
     F************************************************
     F* SHIPMENT NUMBER OF BOXES TOTALIZATION LIST CREATE ATAR88 *
     F************************************************
     FATAWL80 IF  F     250            DISK
     FFGBPL01 IF  E           K        DISK
     FASAPL21 IF  E           K        DISK
     FATAPR88 O   E             88     PRINTER                        UC
     E                    $MSG    1   8 32
     E                    $S      1   9  4
     E                    AR1         3  4 0
     E                    BR1         3  4 0
     IATAWL80 AA  01
     I                                        1   1 TASKJY
     I                                        2   50TASKYY
     I                                        6   70TASKMM
     I                                        8   90TASKDD
     I                                       10  130TAKOYY
     I                                       14  150TAKOMM
     I                                       16  170TAKODD
     I                                       18  190TAKOHH
     I                                       20  210TAKOSS
     I                                       22  31 TAKOME
     I                                       32  36 TAHIN1
     I                                       37  41 TAHIN2
     I                                       42  43 TAHIN3
     I                                       44  44 TAKDAI
     I                                       45  470TAMAIS
     I                                       48  510TAHTYY
     I                                       52  530TAHTMM
     I                                       54  550TAHTDD
     I                                       56  570TAHTBB
     I                                       58  610TASYYY
     I                                       62  630TASYMM
     I                                       64  650TASYDD
     I                                       66  670TASYBB
     I                                       68  710TAMKYY
     I                                       72  730TAMKMM
     I                                       74  750TAMKDD
     I                                       76  770TAMKBB
     I                                       78  810TAKAYY
     I                                       82  830TAKAMM
     I                                       84  850TAKADD
     I                                       86  870TAKABB
     I                                       88  91 TAZENO
  K.YI                                       92  94 TATHNO
     I                                       95  980TABMON
     I                                       99 100 TABLOK
     I                                      101 1040TAMBMN
     I                                      105 105 TATYPE
     I                                      106 109 TAMEK1
     I                                      110 111 TAMEK2
     I                                      112 112 TAMEK3
     I                                      113 1151TABARL
     I                                      116 1181TAMKLT
     I                                      119 119 TACOLR
     I                                      120 1210TASIZE
     I                                      122 1240TAKUBI
     I                                      125 1290TASYUY
     I                                      130 130 TACHYU
     I                                      131 1320TACIHI
     I                                      133 1340TACIBI
     I                                      135 1360TACIOK
     I                                      137 137 TAOFFL
     I                                      138 138 TAMNKB
     I                                      139 1410TAMHKO
     I                                      142 1440TABHK1
     I                                      145 1480TABYY1
     I                                      149 1500TABMM1
     I                                      151 1520TABDD1
     I                                      153 1540TABBB1
     I                                      155 1570TABHK2
     I                                      158 1610TABYY2
     I                                      162 1630TABMM2
     I                                      164 1650TABDD2
     I                                      166 1670TABBB2
     I                                      168 170 TAKBAN
     I                                      171 171 TAKBNC
     I                                      172 1750TAKHAK
     I                                      176 176 TABAN1
     I                                      177 178 TABAN2
     I                                      179 180 TABAN3
     I                                      181 181 TABAN4
     I                                      182 1850TATOKU
     I                                      186 1890TANOYY
     I                                      190 1910TANOMM
     I                                      192 1930TANODD
     I                                      194 1950TANOBB
     I                                      196 196 TAHKAN
     I                                      197 197 TAMLIN
     I                                      198 199 TAJYKN
     I                                      200 200 TAINJI
     I                                      201 2010TAKAIS
     I                                      202 2040TANONU
     I                                      205 2080TAMSYY
     I                                      209 2100TAMSMM
     I                                      211 2120TAMSDD
     I                                      213 2140TAMSBB
     I                                      215 2180TAMMYY
     I                                      219 2200TAMMMM
     I                                      221 2220TAMMDD
     I                                      223 2240TAMMBB
     I                                      225 2280TAMRKY
     I                                      229 2300TAMRKM
     I                                      231 2320TAMRKD
     I                                      233 2340TAMRKB
     I                                      235 235 TAHDAI
     I                                      236 236 TAHCYU
     **
     I            DS
     I                                        1   4 WKZENO
     I                                        5   5 WKUN1
     I                                        6   8 WKTHNO
     I                                        9   9 WKUN2
     I                                       10  10 WKKAIS
     I                                        1  10 WSNO
     I            DS
     I                                        1   40TAMMYY
     I                                        5   60TAMMMM
     I                                        7   80TAMMDD
     I                                        1   80TAMKHZ
     I            DS
     I                                        1   40TAMSYY
     I                                        5   60TAMSMM
     I                                        7   80TAMSDD
     I                                        1   80TASYHZ
     I            DS
     I                                        1   5 WHIN1
     I                                        6   6 WHI1
     I                                        7  11 WHIN2
     I                                       12  12 WHI2
     I                                       13  14 WHIN3
     I                                        1  14 @HINBN
     I            DS
     I                                        1  14 TAHBAN
     I                                        1   5 TAHIN1
     I                                        6   6 F01
     I                                        7  11 TAHIN2
     I                                       12  12 F02
     I                                       13  14 TAHIN3
     I            DS
     I                                        1  18 WKANJ
     I                                        1   1 WKA1
     I                                        2   3 WKA2
     I                                        4   5 WKA3
     I                                        6   7 WKA4
     I                                       10  11 WKA5
     I                                       12  13 WKA6
     I                                       14  15 WKA7
     I                                       16  17 WKA8
     I                                       18  18 WKA9
     I            DS
     I                                        1   4 WKSU11
     I                                        1   1 WKSU12
     I                                        2   3 WKSU13
     I                                        4   4 WKSU14
     I            DS
     I                                        1   4 WKSU21
     I                                        1   1 WKSU22
     I                                        2   3 WKSU23
     I                                        4   4 WKSU24
     C           *ENTRY    PLIST
     C                     PARM           PARM1   5
      *----------------------------------------------------*
      * 940304     K L I S T                               *
      *----------------------------------------------------*
     C           #KEYCH    KLIST
     C                     KFLD           #KBMN   40
     C                     KFLD           #K8990  40
     C**************************
     C* 初期　処理           *
     C**************************
     C                     MOVEL$MSG,4    @NAME  32
     C                     Z-ADD*ZERO     CTRCHK  50
     C                     MOVE *BLANK    FSW     1
     C                     MOVE '-'       F01
     C                     MOVE '-'       F02
     C           *IN81     DOWEQ'0'
     C**************************
     C* 今回便マスター処理   *
     C**************************
     C                     READ ATAWL80                  81
     C           *IN81     CABEQ'1'       LAST
     C                     MOVE 'Y'       PRNSW   1
      *------------------------------------------------------*
      *  940304 可児工場のみ対応                           *
      *          帳票発行停止マスターにてリスト制御        *
      *------------------------------------------------------*
      * 工場部門コードセツト
     C           TABMON    IFEQ 9032
     C                     Z-ADD9032      #KBMN
     C                     END
     C           TABMON    IFEQ 9040
     C                     Z-ADD9032      #KBMN
     C                     END
     C           TABMON    IFEQ 9253
     C                     Z-ADD9032      #KBMN
     C                     END
     C           TABMON    IFEQ 9245
     C                     Z-ADD9032      #KBMN
     C                     END
      * 後工程部門コードセツト
     C                     Z-ADD8990      #K8990
     C                     SETOF                       89
     C           #KEYCH    CHAINASAPL211             89
     C           *IN89     IFEQ '0'
     C           *DATE     ANDGECHSTHZ
     C           *DATE     ANDLECHENHZ
     C           CHNPR7    ANDEQ'Y'
     C                     MOVE 'N'       PRNSW
     C                     END
     C           PRNSW     CABEQ'N'       LSTPAS
      *
     C                     ADD  1         CTRCHK
     C           TABMON    IFNE WBMON
     C           TAMBMN    ORNE WMBMN
     C           TASYHZ    ORNE WSYHZ
     C           TAMSBB    ORNE WSYBB
     C           TAMKHZ    ORNE WMKHZ
     C           TAMMBB    ORNE WMKBB
     C           TAMLIN    ORNE WMLIN
     C           *IN11     IFEQ '1'
     C                     XFOOTAR1       CTR10   40
     C           AR1,1     IFNE *ZERO
     C                     MOVEL$MSG,5    @CONT
     C                     MOVE AR1,1     @KEI
     C                     MOVE *ZERO     AR1,1
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     END
     C           AR1,2     IFNE *ZERO
     C                     MOVEL$MSG,6    @CONT
     C                     MOVE AR1,2     @KEI
     C                     MOVE *ZERO     AR1,2
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     END
     C           AR1,3     IFNE *ZERO
     C                     MOVEL$MSG,7    @CONT
     C                     MOVE AR1,3     @KEI
     C                     MOVE *ZERO     AR1,3
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     END
     C                     MOVE *BLANK    @CONT
     C                     MOVEL'TOTAL'   @CONT
     C                     MOVE CTR10     @KEI
     C                     MOVE *ZERO     CTR10
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     MOVE *ZERO     AR1
     C                     SETOF                       11
     C                     END
     C                     Z-ADD1         WPAGE   40
     C                     MOVE WPAGE     @PAGE
     C**************************
     C* 細目マスター処理     *
     C**************************
     C                     SETOF                       16
     C           TABMON    CHAINFGBPL011             31
     C           *IN31     IFEQ '0'
     C                     MOVELB2SMEI    @KEMI1
     C                     ELSE
     C                     MOVE *BLANK    @KEMI1
     C                     END
     C           TAMBMN    COMP 2682                     16
     C           TAMBMN    IFEQ 0
     C                     Z-ADD8990      TAHNSA  40
     C           TAHNSA    CHAINFGBPL011             32
     C           *IN32     IFEQ '0'
     C                     MOVELB2SMEI    @KEMI2
     C                     ELSE
     C                     MOVE *BLANK    @KEMI2
     C                     END
     C                     ELSE
     C           TAMBMN    CHAINFGBPL011             32
     C           *IN32     IFEQ '0'
     C                     MOVELB2SMEI    @KEMI2
     C                     ELSE
     C                     MOVE *BLANK    @KEMI2
     C                     END
     C                     END
     C                     MOVE TAMSYY    @HYY
     C                     MOVE TAMSMM    @HMM
     C                     MOVE TAMSDD    @HDD
     C                     MOVE TAMSBB    @HBIN   20
     C                     MOVE TAMMYY    @NYY    40
     C                     MOVE TAMMMM    @NMM    20
     C                     MOVE TAMMDD    @NDD    20
     C                     MOVE TAMMBB    @NBIN   20
     C           FSW1      IFEQ *BLANK
     C                     OPEN ATAPR88
     C                     MOVE '*'       FSW1    1
     C                     END
     C           FSW1      IFNE *BLANK
     C                     END
     C                     MOVE TABMON    WBMON   40
     C                     MOVE TAMBMN    WMBMN   40
     C                     MOVE TASYHZ    WSYHZ   80
     C                     MOVE TAMSBB    WSYBB   20
     C                     MOVE TAMKHZ    WMKHZ   80
     C                     MOVE TAMMBB    WMKBB   20
     C                     MOVE TAMLIN    WMLIN   1
     C                     MOVE *ZERO     WCNT    20
     C                     END
     C* OV
     C                     EXSR PCHK
     C           TAKDAI    IFEQ 'C'
     C                     ADD  TANONU    AR1,1
     C                     ADD  TANONU    BR1,1
     C                     END
     C           TAKDAI    IFEQ 'D'
     C                     ADD  TANONU    AR1,2
     C                     ADD  TANONU    BR1,2
     C                     END
     C           TAKDAI    IFEQ 'E'
     C                     ADD  TANONU    AR1,3
     C                     ADD  TANONU    BR1,3
     C           FSW1      IFEQ *BLANK
     C                     OPEN ATAPR88
     C                     MOVE '*'       FSW1    1
     C                     END
     C                     ADD  1         WCNT
     C                     EXSR PCHK
     C                     END
     C                     MOVE TAMLIN    @LIN
     C                     SETON                     11
     C           LSTPAS    TAG
     C                     END
     C           LAST      TAG
     C***
     C           FSW1      CABEQ*BLANK    OWARI
     C                     MOVE *BLANK    @KEMI2
     C                     MOVEL'TOTAL   '@KEMI2
     C                     MOVE 'LIST    '@KEMI2
     C***
     C                     WRITEATAPR881
     C           CTRCHK    IFNE *ZERO
     C                     XFOOTAR1       CTR10   40
     C           AR1,1     IFNE *ZERO
     C                     MOVEL$MSG,5    @CONT
     C                     MOVE AR1,1     @KEI
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     END
     C           AR1,2     IFNE *ZERO
     C                     MOVEL$MSG,6    @CONT
     C                     MOVE AR1,2     @KEI
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     END
     C           AR1,3     IFNE *ZERO
     C                     MOVEL$MSG,7    @CONT
     C                     MOVE AR1,3     @KEI
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     END
     C                     MOVE *BLANK    @CONT
     C                     MOVEL'TOTAL'   @CONT
     C                     MOVE CTR10     @KEI
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     MOVE *ZERO     AR1
     C                     MOVE *BLANK    @KEMI2
     C                     MOVEL'TOTAL'   @KEMI2
     C                     MOVE 'LIST    '@KEMI2
     C                     Z-ADD0         @NYY
     C                     Z-ADD0         @NMM
     C                     Z-ADD0         @NDD
     C                     Z-ADD0         @NBIN
     C                     MOVE *BLANK    @LIN
     C                     Z-ADD*ZERO     @HYY
     C                     Z-ADD*ZERO     @HMM
     C                     Z-ADD*ZERO     @HDD
     C                     Z-ADD0         WCNT    20
     C                     WRITEATAPR883
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     XFOOTBR1       LTR10   40
     C           BR1,1     IFNE *ZERO
     C                     MOVEL$MSG,5    @CONT
     C                     MOVE BR1,1     @KEI
     C                     WRITEATAPR882
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     END
     C           BR1,2     IFNE *ZERO
     C                     MOVEL$MSG,6    @CONT
     C                     MOVE BR1,2     @KEI
     C                     WRITEATAPR882
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     END
     C           BR1,3     IFNE *ZERO
     C                     MOVEL$MSG,7    @CONT
     C                     MOVE BR1,3     @KEI
     C                     WRITEATAPR882
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     END
     C                     MOVE LTR10     @KEI
     C                     MOVE *BLANK    @CONT
     C                     MOVEL$MSG,8    WKANJ  18
     C                     MOVEL@HBIN     S1      10
     C                     MOVE @HBIN     S2      10
     C           S1        IFEQ *ZERO
     C                     MOVE '0   '    WKSU11
     C                     ELSE
     C                     MOVE $S,S1     WKSU11
     C                     END
     C           S2        IFEQ *ZERO
     C                     MOVE '0   '    WKSU21
     C                     ELSE
     C                     MOVE $S,S2     WKSU21
     C                     END
     C                     MOVE WKSU13    WKA5
     C                     MOVE WKSU23    WKA6
     C                     MOVELWKANJ     @CONT
     C                     SETON                       89
     C                     WRITEATAPR882
     C                     ADD  2         WCNT    20
     C                     EXSR PCHK
     C                     END
     C           FSW1      IFNE *BLANK
     C                     CLOSEATAPR88
     C                     END
     C           OWARI     TAG
     C                     SETON                     LR
     C                     RETRN
     C******************************************************
     C*                    ATAPR88 eｰﾌﾞｰﾎﾜｰ ﾅﾎﾞﾓｰk]        *
     C******************************************************
     C           PCHK      BEGSR
     C           *IN88     IFEQ '1'
     C                     ADD  1         WPAGE
     C                     MOVE WPAGE     @PAGE
     C                     WRITEATAPR881
     C                     MOVE *ZERO     WCNT
     C                     SETOF                     88
     C                     END
     C                     ENDSR
**
THE DIVISION
A LIMITED EXPRESS
THE LIMITED EXPRESS  DIVISION
AOYAMA EACH F->BZ F->CHUBU RIKA
PLATING KANBAN
TUNNEL KANBAN
PART WITHDRAWAL KANBAN
TOTAL (BIN)
**
1
2
3
4
5
6
7
8
9
