     H             Y
     F*** ATAR56 ***********************************************
     F*PLATING FACTORY ACCNT RCVABLE DETAILED STATEMENT UNIT PRICE NOT IPUT LIST
     F* PROGRAM-ID. : ATAR56 <RPG>                             *
     F* CREATE DATE. : MAY.17.'1994.                           *
     F* AUTHOR.           : SHINICHIRO.OHTAKE                  *
     F* USER SECTION. : PLAYTING FACTORY                       *
     F*********************************************** ATAR56 ***
     FATAWP56 IP  F     100            DISK
     FATAPR56 O   E             95     PRINTER
     IATAWP56 AA  01
     I                                        1   4 WZENO
     I                                        5  11 WSYR
     I                                       12  16 WHIN1
     I                                       17  21 WHIN2
     I                                       22  23 WHIN3
     I                                       24  312WKEIGR
     **
     C*
     C**********************
     C*見出し処理        *
     C**********************
     C           *IN50     IFEQ '0'
     C                     WRITEATAPR561
     C                     SETON                     50
     C                     MOVE WSYR      WKSYR   7
     C                     GOTO STEP
     C                     END
     C*
     C           *IN95     IFEQ '1'
     C                     WRITEATAPR561
     C                     SETOF                     95
     C                     END
     C*
     C**********************
     C*明細処理          *
     C**********************
     C           STEP      TAG
     C           WKSYR     IFNE WSYR
     C                     MOVE WKSYR     PSYR
     C           WKSYR     IFEQ *BLANK
     C                     MOVE '*******' PSYR
     C                     END
     C                     WRITEATAPR562
     C                     MOVE WSYR      WKSYR
     C                     Z-ADD0         PKEIGR
     C                     END
     C*
     C                     ADD  WKEIGR    PKEIGR
     C*
     C**********************
     C*終了              *
     C**********************
     CLR                   MOVE WKSYR     PSYR
     CLR                   WRITEATAPR562
     CLR                   RETRN
