     H            Y.
     F** ATBR30 ********************************
     F* CREATE  OF SERVICE SCHEDULE INVESTIGATION LIST IN COMPANY
     F*          <PRODUCTION DELIVERY DATE CALCULATION> *
     F*       A.IDOTA          1993.10.13      *
     F******************************** ATBR30 **
     FAGAPL31 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAAKPL11 IF  E           K        DISK
     FAAKPL21 IF  E           K        DISK
     FAAKTL11 IF  E           K        DISK
     FACAPP01 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FATBPR31 O   E             99     PRINTER                        UC
     E                    YR1         7  1               ﾑcﾍﾞ
     E                    ERR1       20  2               d[ｰ ﾃｰnﾞ
     E                    TB1     1  20  2   TB2    60
     I            DS
     I                                        1   80WKDAY
     I                                        1   40#HY
     I                                        5   60#HM
     I                                        7   80#HD
     I            DS
     I                                        1   80WKHAZ
     I                                        1   40WKHAYY
     I                                        5   60WKHAMM
     I                                        7   80WKHADD
     I            DS
     I                                        1   80WKDAYX
     I                                        1   40WKDAYY
     I                                        5   60WKDAYM
     I                                        7   80WKDAYD
     I            DS
     I                                        1   40ANSYY
     I                                        5   60ANSMM
     I                                        7   80ANSDD
     I                                        1   80WKANS
     I            DS
     I                                        1   7 YR1
     I                                        1   1 DFMOND
     I                                        2   2 DFTUED
     I                                        3   3 DFWEDD
     I                                        4   4 DFTHUD
     I                                        5   5 DFFRID
     I                                        6   6 DFSATD
     I                                        7   7 DFSUND
      *
     I            DS
     I                                        1   40WKHHM
     I                                        1   20DFSTHH
     I                                        3   40DFSTMM
     I            DS
     I                                        1   40WKTHM
     I                                        1   20DFTYHH
     I                                        3   40DFTYMM
      *
      *----------- s]ﾇc ﾃcyh ﾈlxb --------------------------*
      *  PARM6  :   'L' OR 'R'   ==> d[ｰﾒﾇn ﾅhﾈb            *
      *             ﾆﾞﾑcg bfﾞb   ==> d[ｰﾒﾇn ﾅhﾈb ﾆob        *
      *                                                     *
      *  PARM7  :   'H'          ==> udﾃcmb ﾉcpｬcﾍﾞﾑﾒ ibﾅ]  *
      *             'M'          ==> xｮg ﾉcpｬcﾍﾞﾑﾒ ibﾅ]     *
      *             'T'          ==> 2ﾆﾞfﾃc ﾉcﾃｬcﾍﾞﾑﾒ ibﾅ]  *
      *             'R'          ==> ﾉcgibﾅ] ﾆﾏcﾒﾑc         *
      *                                                     *
      *  PARM32 :   ' '          ==> ﾉcg ibﾅ] f]ﾒｭc         *
      *             'D'          ==> ﾉcg ibﾅ] ﾎfﾉc          *
      *                                                     *
      *  PARM33 :   'P'          ==> ﾌﾟ[xｰj d[ｰ             *
      *             'M'          ==> uﾇjｰ F d[ｰ             *
      *==( ﾒﾇn ﾌlﾃc hﾎﾞ] )==*                               *
      *  PSW1   :   ' '          ==> d[ｰﾒﾇn vﾌｮﾃc           *
      *             '*'          ==> d[ｰﾒﾇn ﾌｮﾃcﾇv          *
      *==( ﾎabﾓ ﾑvﾃv tctc )=*                               *
      *  READPT :   '1'          ==> CHAIN mﾞ ﾑw            *
      *             ' '          ==> READ(E) mﾞ ﾑw          *
      *==( ﾉcg ﾅ]ﾆｬl fbﾆ/ﾆｬcﾒｭc hﾎﾞ] )=*                    *
      *  START  :   '1'          ==> ibﾅ] fbﾆ               *
      *             ' '          ==> ibﾅ] ﾆｬcﾒｭc            *
      *==( ﾆﾑﾒ hﾎﾞ] )=======*                               *
      *  SHORKB :   'H'          ==> ﾍgnﾒ                   *
      *             'K'          ==> fhmb                   *
      *==( c]ﾃcﾍﾞ ﾑvﾃvﾆﾑﾒ )=*                               *
      *  READOK :   '1'          ==> ﾑvﾃv OK                *
      *             ' '          ==> ﾑvﾃv NG                *
      *  READNG :   '1'          ==> c]ﾃcﾍﾞ] ﾈln NG         *
      *             ' '          ==> c]ﾃcﾍﾞ ﾈln OK          *
      *==( fﾛ]jﾞｰ F ﾑﾃvﾆﾑﾒ )=*                              *
      *  CARDRE :   ' '          ==> ﾑvﾃv OK                *
      *             '*'          ==> ﾑvﾃv NG                *
      *-----------------------------------------------------*
     C           *ENTRY    PLIST
      * INPUT ﾌﾟ[xｰj
     C                     PARM           PARM1   5         *品１
     C                     PARM           PARM2   5         *品２
     C                     PARM           PARM3   2         *品３
     C                     PARM           PARM4   8         *かんばん発行日
     C                     PARM           PARM5   2         *便
     C                     PARM           PARM6   1         * ﾒﾇn hﾎﾞ]
     C                     PARM           PARM7   1         * ibﾅ] fbﾆ ﾎﾞy]
      * I/O ﾌﾟ[xｰj
     C                     PARM           PARM10  8         * udﾃcmbﾍﾞ
     C                     PARM           PARM11  2         * udﾃcmb ﾍﾞ]
     C                     PARM           PARM14  8         * udﾃcmb kｭc
      * OUTPUT ﾌﾟ[xｰj
     C                     PARM           PARM20  8         * xlg ﾍﾞ
     C                     PARM           PARM21  2         * xlg ﾍﾞ]
     C                     PARM           PARM24  8         * xｮg kｭc
     C                     PARM           PARM30  8         * 2ﾆﾞfﾃc ﾍﾞ
     C                     PARM           PARM31  2         * 2ﾆﾞfﾃc ﾍﾞ]
     C                     PARM           PARM32  1         * ﾉcg ibﾅ] ﾎfﾉc FLG
     C                     PARM           PARM33  1         * ERROR FLG
     C                     PARM           PARM34  8         * 2ﾆﾞfﾃc kｭc
      * INPUT ﾌﾟ[xｰj
     C                     PARM           PGMNO   6         * ﾑﾍﾞjﾞﾆ PROGRAM
     C                     PARM           USER   10         * j]ncﾆｫ
      *発着時間
     C                     PARM           PARM40  4        本社発　時
     C                     PARM           PARM41  4        前着　時
     C                     PARM           PARM42  4        前発　時
     C                     PARM           PARM43  4        中ORメ　時
     C                     PARM           PARM44  4        前OR中ﾎﾞy]
     C                     PARM           PARM45  8        中継先　納期
     C                     PARM           PARM46  4        中継先発　時
     C                     PARM           PARM47  4        メッキ着　時
     C                     PARM           PARM48  4        メッキ発　時
     C                     PARM           PARM49  4        中OR２　時
     C                     PARM           PARM50  8        中継先　納期
     C                     PARM           PARM51  4        ２次発　時
     C                     PARM           PARM52  4        ２次着　時
     C                     PARM           PARM53  4        中継先部門
     C                     PARM           PARM54  4        納期　着
     C                     PARM           PARM55  8        前中　着日
     C                     PARM           PARM56  8        xｮg   着日
     C                     PARM           PARM57  8        x中 着日
     C                     PARM           PARM58  8        ２次　着日
     C*-------------------*
     C* K L I S T         *
     C*-------------------*
     C           #SAVDT    KLIST
     C                     KFLD           SAVHY   40
     C                     KFLD           SAVHM   20
     C                     KFLD           SAVHD   20
     C           #KDATE    KLIST
     C                     KFLD           #HY
     C                     KFLD           #HM
     C                     KFLD           #HD
     C           #KEY01    KLIST
     C                     KFLD           WKHIN1
     C                     KFLD           WKHIN2
     C                     KFLD           WKHIN3
     C           #KEY06    KLIST
     C                     KFLD           #KBSY1
     C                     KFLD           #KBSY2
     C                     KFLD           #KSBMN
     C           #KEY03    KLIST
     C                     KFLD           #KBSY1
     C                     KFLD           #KBSY2
     C                     KFLD           #KSBMN
     C                     KFLD           #KBINN
     C           #KEY04    KLIST
     C                     KFLD           #KBSY1
     C                     KFLD           #KBSY2
     C                     KFLD           #KSBMN
     C                     KFLD           #KTYHH
     C                     KFLD           #KTYMM
      *-----------------------------------------------------*
      *     ﾆ ﾏ c ﾒ ﾑ c  ﾆ ﾏ ﾒ                              *
      *-----------------------------------------------------*
     C           PARM7     IFEQ 'R'
      * ﾉcg ibﾅ] ﾎﾉcxbﾅb xｮﾈｰﾆﾞ PRINT
     C           PSW1      IFEQ '*'
     C                     WRITEATBPR313
     C                     Z-ADD1         X
     C                     DO   *HIVAL
     C           ERR1,X    IFEQ *BLANK
     C                     SETON                         22
     C                     ELSE
     C                     SETOF                     21
     C                     Z-ADD1         B
     C           ERR1,X    LOKUPTB1,B                    21
     C           *IN21     IFEQ '1'
     C                     MOVELTB2,B     @ERRNM
     C                     END
     C                     MOVE ERR1,X    @ERR
     C                     WRITEATBPR314
      * d[- xlﾈ-ﾆﾞ OV
     C           *IN99     IFEQ '1'
     C                     WRITEATBPR311
     C                     SETOF                       99
     C                     END
      *
     C                     END
     C                     ADD  1         X
     C  N22                END
     C                     END
      *
     C                     SETON                       LR
     C   LR                RETRN
     C                     END
      *-----------------------------------------------------*
      * ﾌﾟ [ x ｰ j  k d l h                                 *
      *-----------------------------------------------------*
      *
      *== ﾍ]ﾌﾞ] vpcﾒﾑh
      *
     C           PARM1     IFEQ *BLANK
     C           PARM2     ANDEQ*BLANK
     C                     MOVE 'D'       PARM32
     C                     MOVE 'P'       PARM33
     C                     MOVE 'PE01'    @ERRCD
     C                     EXSR $LIST
     C                     END
      *
      *== ibﾅ] fbﾆ ﾆmbﾉ ng ﾉcpｬcﾍﾞ kdｮh
      *
     C           PARM7     IFNE 'H'
     C           PARM7     ANDNE'M'
     C           PARM7     ANDNE'T'
     C                     MOVE 'D'       PARM32
     C                     MOVE 'P'       PARM33
     C                     MOVE 'PEER'    @ERRCD
     C                     EXSR $LIST
     C                     END
      *
     C           PARM7     IFEQ 'M'
     C                     MOVE PARM10    HYMD    80
     C                     MOVE PARM11    BIN     20
     C           HYMD      IFEQ *ZERO
     C           BIN       OREQ *ZERO
     C                     MOVE 'D'       PARM32
     C                     MOVE 'P'       PARM33
     C                     MOVE 'PEER'    @ERRCD
     C                     EXSR $LIST
     C                     END
     C                     END
      *
     C           PARM7     IFEQ 'T'
     C                     MOVE PARM20    HYMD    80
     C                     MOVE PARM21    BIN     20
     C           HYMD      IFEQ *ZERO
     C           BIN       OREQ *ZERO
     C                     MOVE 'D'       PARM32
     C                     MOVE 'P'       PARM33
     C                     MOVE 'PEER'    @ERRCD
     C                     EXSR $LIST
     C                     END
     C                     END
      *
     C           PARM7     IFEQ 'H'
     C                     MOVE PARM4     HYMD    80
     C                     MOVE PARM5     BIN     20
     C           HYMD      IFEQ *ZERO
     C           BIN       OREQ *ZERO
     C                     MOVE 'D'       PARM32
     C                     MOVE 'P'       PARM33
     C                     MOVE 'PEER'    @ERRCD
     C                     EXSR $LIST
     C                     END
     C                     END
     C*-----------------------------------------------------*
     C*  ﾝ ｰ h d ﾒ a   ﾆ ﾑ g f                              *
     C*-----------------------------------------------------*
     C                     MOVE *BLANK    YR1
     C                     MOVE *BLANK    WKKEIM  1
     C                     MOVE *BLANK    WKKEIT  1
     C                     MOVE *BLANK    WKKEIK  1
     C                     MOVE *ZERO     ANSYY
     C                     MOVE *ZERO     ANSMM
     C                     MOVE *ZERO     ANSDD
     C                     MOVE *BLANK    WKJOTI
     C                     MOVE *BLANK    READPT
     C                     MOVE *BLANK    START   1
     C                     MOVE *BLANK    SHORKB  1
     C                     MOVE *BLANK    #KBSY1  2
     C                     MOVE *BLANK    #KBSY2  2
     C                     MOVE *BLANK    READOK  1
     C                     MOVE *BLANK    READNG  1
     C                     MOVE *ZERO     #KSBMN  40
     C                     MOVE *ZERO     #KBINN  20
     C                     MOVE *ZERO     #KTYHH  20
     C                     MOVE *ZERO     #KTYMM  20
     C                     MOVE *ZERO     #KTSEQ  20
     C                     MOVE *ZERO     WKDAY
     C                     MOVE *ZERO     WKHAZ
     C                     MOVE *ZERO     WKANS
     C                     MOVE *ZERO     WKCHUB  40
     C                     MOVE *ZERO     WKKBMN  40
     C                     MOVE *BLANK    WKMKRO  3
     C                     MOVE *BLANK    CHUBNS  4
     C                     MOVE *BLANK    SETFLG  1
     C                     MOVE *BLANK    SETFG1  1        MSK K.K 11/08
     C                     MOVE *BLANK    SW      1        MSK K.K 11/08
     C                     MOVE *ZERO     WKMBME  20
     C                     MOVE *ZERO     AMARI   20
     C                     MOVE *ZERO     WKCNT   20
     C                     Z-ADD0         CHUKI1  40
     C                     Z-ADD0         CHUKI2  40
     C                     Z-ADD0         WKTYHH  20
     C                     Z-ADD0         WKTYMM  20
     C                     Z-ADD0         WKCIK1  20
     C                     Z-ADD0         WKCIK2  20
     C                     Z-ADD0         WKCIK3  20
     C                     Z-ADD0         WKCIKU  20
     C                     Z-ADD0         LOPKAI  20
     C                     Z-ADD0         X       20
     C                     Z-ADD0         B       20
     C                     Z-ADD0         CI      20
     C                     Z-ADD0         WWBIN   20
     C                     Z-ADD0         WWCIK1  20
     C                     Z-ADD0         WWCIK2  20
     C                     Z-ADD0         WWCIK3  20
     C                     SETOF                     818283
      *
     C                     MOVE PARM1     WKHIN1  5
     C                     MOVE PARM2     WKHIN2  5
     C                     MOVE PARM3     WKHIN3  2
     C           PARM7     IFEQ 'H'
     C                     MOVE PARM4     WKDAY
     C                     MOVE PARM4     WKDAYX  80
     C                     MOVE PARM5     WKBIN   20
     C                     MOVE '99999999'PARM10
     C                     MOVE '99'      PARM11
     C                     MOVE '99999999'PARM20
     C                     MOVE '99'      PARM21
     C                     MOVE '99999999'PARM30
     C                     MOVE '99'      PARM31
     C                     END
     C           PARM7     IFEQ 'M'
     C                     MOVE PARM10    WKDAY
     C                     MOVE PARM10    WKDAYX  80
     C                     MOVE PARM11    WKBIN   20
     C                     MOVE '99999999'PARM20
     C                     MOVE '99'      PARM21
     C                     MOVE '99999999'PARM30
     C                     MOVE '99'      PARM31
     C                     END
     C           PARM7     IFEQ 'T'
     C                     MOVE PARM20    WKDAY
     C                     MOVE PARM20    WKDAYX  80
     C                     MOVE PARM21    WKBIN   20
     C                     MOVE '99999999'PARM30
     C                     MOVE '99'      PARM31
     C                     END
      *
     C                     MOVE *BLANK    PARM40
     C                     MOVE *BLANK    PARM41
     C                     MOVE *BLANK    PARM42
     C                     MOVE *BLANK    PARM43
     C                     MOVE *BLANK    PARM44
     C                     MOVE *BLANK    PARM45
     C                     MOVE *BLANK    PARM46
     C                     MOVE *BLANK    PARM47
     C                     MOVE *BLANK    PARM48
     C                     MOVE *BLANK    PARM49
     C                     MOVE *BLANK    PARM50
     C                     MOVE *BLANK    PARM51
     C                     MOVE *BLANK    PARM52
     C                     MOVE *BLANK    PARM53
     C                     MOVE *BLANK    PARM54
     C                     MOVE *BLANK    PARM55
     C                     MOVE *BLANK    PARM56
     C                     MOVE *BLANK    PARM57
     C                     MOVE *BLANK    PARM58
      *-----------------------------------------------------*
      *   sbﾆﾞｬ]f fhmb ﾌｮkﾏc ﾑvﾃv ﾆﾑﾒ                       *
      *-----------------------------------------------------*
     C                     SETOF                     2223
     C           #KEY01    CHAINAGAPL311             22
      *
     C           *IN22     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     22
     C                     END
      *
     C           *IN22     IFEQ '0'
      * udﾃcmb ﾅbhﾓ kdlh
     C           CBMBMN    IFNE *ZERO
     C           CBMSA1    IFEQ *ZERO
     C           CBMSA2    ANDEQ*ZERO
     C           CBMSA3    ANDEQ*ZERO
     C                     MOVE 'D'       PARM32
     C                     MOVE 'M'       PARM33
     C                     MOVE 'MAG2'    @ERRCD
     C                     EXSR $LIST
     C                     END
     C                     END
      * xlg    ﾅbhﾓ kdlh
     C           CBMMKR    IFNE *ZERO
     C           CBTSA1    IFEQ *ZERO
     C           CBTSA2    ANDEQ*ZERO
     C           CBTSA3    ANDEQ*ZERO
     C                     MOVE 'D'       PARM32
     C                     MOVE 'M'       PARM33
     C                     MOVE 'MAG3'    @ERRCD
     C                     EXSR $LIST
     C                     END
     C                     END
      * 2ﾆﾞfﾃc ﾅbhﾓ kdlh
     C           CBNEXT    IFNE *ZERO
     C           CBKSA1    IFEQ *ZERO
     C           CBKSA2    ANDEQ*ZERO
     C           CBKSA3    ANDEQ*ZERO
     C                     MOVE 'D'       PARM32
     C                     MOVE 'M'       PARM33
     C                     MOVE 'MAG4'    @ERRCD
     C                     EXSR $LIST
     C                     END
     C                     END
     C                     END
     C           *IN22     IFEQ '1'
     C                     MOVE 'D'       PARM32
     C                     MOVE 'M'       PARM33
     C                     MOVE 'MAG1'    @ERRCD
     C                     EXSR $LIST
     C                     END
      *==  ﾆｬg] ﾆﾞﾑcjb kdｮh (fﾛ]jﾞｰF ﾑvﾃv)
      *
     C           #KDATE    SETLLAGDPL121
     C                     EXSR $SB800
      *-----------------------------------------------------*
      *   ﾉcg ibﾅ] ﾆﾑﾒ ﾆﾞlﾃc ibjb ﾈln                       *
      *-----------------------------------------------------*
     C           CBMBMN    IFNE *ZERO
     C                     MOVE 'M'       WKKEIM  1
     C                     END
     C           CBMMKR    IFNE *ZERO
     C                     MOVE 'T'       WKKEIT  1
     C                     END
     C           CBNEXT    IFNE *ZERO
     C                     MOVE 'K'       WKKEIK  1
     C                     END
      *
      *== xlg    ﾑﾒ
      *
     C           PARM7     IFEQ 'M'
     C                     MOVE *BLANK    WKKEIM
     C                     END
      *
      *== 2ﾆﾞfﾃc ﾑﾒ
      *
     C           PARM7     IFEQ 'T'
     C                     MOVE *BLANK    WKKEIM
     C                     MOVE *BLANK    WKKEIT
     C                     END
     C           WKKEIM    IFEQ *BLANK
     C                     MOVE '00000000'PARM10
     C                     MOVE '00'      PARM11
     C                     MOVE '00000000'PARM14
     C                     END
     C           WKKEIT    IFEQ *BLANK
     C                     MOVE '00000000'PARM20
     C                     MOVE '00'      PARM21
     C                     MOVE '00000000'PARM24
     C                     END
     C           WKKEIK    IFEQ *BLANK
     C                     MOVE '00000000'PARM30
     C                     MOVE '00'      PARM31
     C                     MOVE '00000000'PARM34
     C                     END
      *
     C*-----------------------------------------------------*
     C*   ﾉ c g  i b ﾅ ]  f b ﾆ                             *
     C*-----------------------------------------------------*
      *
      *== ucﾃcmb
      *
     C           WKKEIM    IFEQ 'M'
     C                     MOVE '1'       START
     C                     MOVE 'H'       SHORKB
     C                     MOVEL'MH  '    @ERRCD
     C           START     DOUEQ*BLANK
      *== ﾍgnﾒﾍﾞ ibﾅ]
     C                     EXSR $SB100
      *== ﾉcpﾏcﾍﾞ ibﾅ]
     C                     EXSR $SB110
     C                     END
     C                     END
      *
      *== xlg
      *
     C           WKKEIT    IFEQ 'T'
     C                     MOVE '1'       START
     C                     MOVE 'H'       SHORKB
     C                     MOVEL'TH  '    @ERRCD
     C           START     DOUEQ*BLANK
      *== ﾍgnﾒﾍﾞ ibﾅ]
     C                     EXSR $SB200
      *== ﾉcpﾏcﾍﾞ ibﾅ]
     C                     EXSR $SB210
     C                     END
     C                     END
      *
      *== 2ﾆﾞfﾃc
      *
     C           WKKEIK    IFEQ 'K'
     C                     MOVE '1'       START
     C                     MOVE 'H'       SHORKB
     C                     MOVEL'KH  '    @ERRCD
     C           START     DOUEQ*BLANK
      *== 2ﾆﾞfﾃc ﾉcpﾏcﾍﾞ ibﾅ]
     C                     EXSR $SB300
     C                     END
     C                     MOVE *BLANK    START
     C                     END
      *
      *== ﾑﾍﾞjﾞﾆ PROGRAM s ynﾞﾓ
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *-----------------------------------------------------*
      *    ud ﾃcmb ﾍgnﾒﾍﾞ  ･ ynxﾓ                           *
      *-----------------------------------------------------*
     CSR         $SB100    BEGSR
     C                     MOVE CBMBMN    WKKBMN  40
     C                     MOVE '0111'    #KSBMN
     C                     MOVELCBHBNS    #KBSY1
     C                     MOVE CBHBNS    #KBSY2
     C                     MOVE WKBIN     #KBINN
     C                     MOVE '1'       READPT  1
      *
      *== c]ﾃcﾍﾞ] ﾎabﾓ ﾑvﾃv
      *
     C                     EXSR $SB910
      *== nckｫh/ﾆｬﾌﾟl ﾆﾞﾃh ﾈｮn
     C                     MOVE DFKTHH    #KTYHH
     C                     MOVE DFKTMM    #KTYMM
     C                     MOVE DFKTHH    WKTYHH
     C                     MOVE DFKTMM    WKTYMM
      *
     C                     MOVELWKHHM     PARM40           t]ﾆｫﾌl
     C                     MOVELWKTHM     PARM41           udﾃcmb kｫh
      *
     C                     MOVE *BLANK    READPT
     C                     MOVE CBMKRO    WKMKRO
     C                     MOVE CBMBMN    WKKBMN
     C                     MOVE CBMBME    WKMBME
     C                     MOVE CBMMKR    NEXTBM  40
      *
     C                     MOVE CBMSA1    WKCIK1
     C                     MOVE CBMSA2    WKCIK2
     C                     MOVE CBMSA3    WKCIK3
      *
      *== ibﾜ uﾇjｰ ﾑvﾃv
      *
     C                     EXSR $SB900
      *
      *== c]ﾃcﾍﾞ] ﾎabﾓ ﾑvﾃv
      *
     C                     MOVELWKBNS1    #KBSY1  2
     C                     MOVE WKBNS1    #KBSY2  2
     C                     Z-ADDDFBINN    #KBINN  20
     C                     MOVE CBMBMN    #KSBMN  40
     C           #KEY04    SETLLAAKTL111             1010
     C           *IN10     IFEQ '1'
     C                     EXSR $SB800
     C                     END
     C                     MOVE '1'       READOK  1
     C                     DO   *HIVAL
     C           READOK    IFEQ '1'
     C                     EXSR $SB910
     C           CARDRE    IFEQ ' '
     C                     MOVE '1'       READNG
     C                     EXSR $SB800
     C                     MOVE '1'       READOK
     C                     END
     C                     END
     C  N60                END
      *== ubpk ﾉcpﾏc
     C           DFGKKB    IFEQ 'M'
     C                     MOVE *ZERO     WKCIK1
     C                     MOVE *ZERO     WKCIK2
     C                     MOVE *ZERO     WKCIK3
     C                     EXSR $SB700
     C                     END
      *== gﾞcﾇc｣gﾇcﾍﾞ ﾉcpｬc
     C           DFGKKB    CASEQ'G'       $SB710
     C           DFGKKB    CASEQ'K'       $SB710
     C                     ENDCS
      *== mbgeg ﾉcpｬc
     C           DFGKKB    CASEQ'I'       $SB720
     C                     ENDCS
      *== ﾑcﾍﾞ ﾆmb
     C           DFSUND    IFEQ '*'
     C           DFMOND    OREQ '*'
     C           DFTUED    OREQ '*'
     C           DFWEDD    OREQ '*'
     C           DFTHUD    OREQ '*'
     C           DFFRID    OREQ '*'
     C           DFSATD    OREQ '*'
     C                     EXSR $SB730
     C                     END
     C                     MOVE 'K'       SHORKB
     C                     MOVE 'MK  '    @ERRCD
     CSR         $S100E    ENDSR
      *-----------------------------------------------------*
      *    ud ﾃcmb ﾉcpｬcﾍﾞ ･ ynxﾓ                           *
      *-----------------------------------------------------*
     CSR         $SB110    BEGSR
     C                     MOVE *BLANK    READPT
     C                     MOVE CBMSA1    WKCIK1
     C                     MOVE CBMSA2    WKCIK2
     C                     MOVE CBMSA3    WKCIK3
      *
      *== ibﾜ uﾇjｰ ﾑvﾃv
      *
     C*                    EXSR $SB900
      *
      *== c]ﾃcﾍﾞ] ﾎabﾓ ﾑvﾃv
      *
     C                     MOVELWKBNS1    #KBSY1  2
     C                     MOVE WKBNS1    #KBSY2  2
     C                     Z-ADDDFBINN    #KBINN  20
     C                     MOVE CBMBMN    #KSBMN  40
     C           #KEY04    SETLLAAKTL111             1010
     C           *IN10     IFEQ '1'
     C                     EXSR $SB800
     C                     END
     C                     MOVE '1'       READOK  1
     C                     DO   *HIVAL
     C           READOK    IFEQ '1'
     C                     EXSR $SB910
     C           CARDRE    IFEQ ' '
     C                     EXSR $SB800
     C                     MOVE '1'       READOK
     C                     END
     C                     END
     C  N60                END
      *== ubpk ﾉcpﾏc
     C           DFGKKB    CASEQ'M'       $SB700
     C                     ENDCS
      *== gﾞcﾇc｣gﾇcﾍﾞ ﾉcpｬc
     C           DFGKKB    CASEQ'G'       $SB710
     C           DFGKKB    CASEQ'K'       $SB710
     C                     ENDCS
      *== mbgeg ﾉcpｬc
     C           DFGKKB    CASEQ'I'       $SB720
     C                     ENDCS
      *== ﾑcﾍﾞ ﾆmb
     C           DFSUND    IFEQ '*'
     C           DFMOND    OREQ '*'
     C           DFTUED    OREQ '*'
     C           DFWEDD    OREQ '*'
     C           DFTHUD    OREQ '*'
     C           DFFRID    OREQ '*'
     C           DFSATD    OREQ '*'
     C                     EXSR $SB730
     C                     END
     C           CBMBMN    IFEQ 0612
     C                     MOVE PARM4     WKDAYX
     C                     EXSR $SB740
     C                     END
      *
      *== OUTPUT ﾌﾟ[xｰj ﾈln
     C*
     C           DFCBIN    IFNE *ZERO
     C                     MOVE DFCBIN    WWBIN
     C                     ELSE
     C                     MOVE WKBIN     WWBIN
     C                     END
     C                     MOVE #HY       ANSYY
     C                     MOVE #HM       ANSMM
     C                     MOVE #HD       ANSDD
     C                     MOVE WKANS     PARM10
     C                     MOVE WWBIN     PARM11
     C                     MOVE WKANS     PARM14
     C                     MOVE *BLANK    START
     C                     MOVE DFKTHH    #KTYHH
     C                     MOVE DFKTMM    #KTYMM
     C                     MOVE WKBIN     #KBINN
     C                     MOVE DFKTHH    WKTYHH
     C                     MOVE DFKTMM    WKTYMM
      *
     C                     MOVELWKHHM     PARM42           udﾃcmb ﾌl
     C                     MOVELWKTHM     PARM43           kﾏc OR xｮg kzh
      *== ckgﾒ ﾌ]jﾞ]
     C           CBKDAI    IFEQ '0'
     C           CBKDAI    OREQ 'E'
 ********** 調整日を見る1994/09/23  ******************************
 *   C           DFCDAY    IFNE *ZERO                              *
 *   C                     MOVE DFCDAY    CI                       *
 *   C                     DO   *HIVAL                             *
 *   C                     SETOF                     84            *
 *   C                     EXSR $SB800                             *
 *   C           *IN81     IFEQ '0'                                *
 *   C                     SUB  1         CI           8484        *
 *   C                     END                                     *
 *   C  N81N84             END                                     *
 *   C                     END                                     *
 *   C                     MOVE WKDAY     PARM14                   *
 *******************************************************************
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C           CHUKI1    IFEQ *ZERO
     C           CHUKI2    ANDEQ*ZERO
     C                     GOTO $S110E
     C                     ELSE
      *=== udﾃcmb kｬcib f] ﾉ ﾆﾑﾒ
      *
     C           CHUKI1    IFNE *ZERO
     C                     MOVE *ZERO     WKMBME
     C                     MOVE CHUKI1    WKCHUB
      *
     C                     MOVELCHUKI1    PARM44  4        udﾃcmb kﾏcibﾅg
      *
     C                     MOVE *ZERO     CHUKI1
     C                     MOVE 'H'       SHORKB
     C                     MOVE WKBNS2    CHUBNS  4        * kﾏcib ﾍﾞ]ﾆﾏ
     C                     END
     C           WKCHUB    DOUEQ*ZERO
     C                     Z-ADD0         WKCIK1
     C                     Z-ADD0         WKCIK2
     C                     Z-ADD0         WKCIK3
     C           SHORKB    IFEQ 'H'
     C                     MOVE 'M1  '    @ERRCD
     C                     EXSR $SB600
     C                     MOVELWKDAY     PARM55           ud kｬc nckｫh
     C                     END
      *
     C                     MOVELWKDAY     WKDAYX
     C                     MOVE 'M2  '    @ERRCD
     C                     MOVELCBMMKR    WKKBMN
     C                     MOVELCBTSA1    WWCIK1
     C                     MOVELCBTSA2    WWCIK2
     C                     MOVELCBTSA3    WWCIK3
     C                     EXSR $SB610
      *
     C           CHUKI2    IFNE *ZERO
     C                     MOVE CHUKI2    WKCHUB
     C                     MOVE *ZERO     CHUKI2
     C                     MOVE WKBNS3    CHUBNS  4        * kﾏcib ﾍﾞ]ﾆﾏ
     C                     END
     C                     END
     C                     END
      *
     C           $S110E    TAG
     C                     MOVELWKDAY     PARM45  8        kｬcibﾅg ﾉcg
     C                     MOVELWKHHM     PARM46  4        kﾏcibﾅg ﾌl
      *
     CSR                   ENDSR
      *-----------------------------------------------------*
      *    xlg  ﾍgnﾒﾍﾞ  ･ ynxﾓ                              *
      *-----------------------------------------------------*
     CSR         $SB200    BEGSR
      *
     C           DFCDAY    IFNE 0
     C                     MOVE DFCDAY    CI
     C                     DO   *HIVAL
     C                     SETOF                     84
     C                     EXSR $SB800
     C           *IN81     IFEQ '0'
     C                     SUB  1         CI           8484
     C                     END
     C  N81N84             END
     C                     END
      *======= MSK K.K 11/08 LOGIC ADD ===================*
      *
      *== ibﾜ uﾇjｰ ﾑvﾃv
      *
     C                     MOVE CBTKRO    WKMKRO
     C                     EXSR $SB900
      *
     C           DFTBMN    IFNE CBMMKR
     C           SW        ANDNE'1'
     C                     MOVELWKBNS1    #KBSY1  2
     C                     MOVE WKBNS1    #KBSY2  2
     C                     Z-ADDDFBINN    #KBINN  20
     C           #KEY04    SETLLAAKTL111             1010
     C           *IN10     IFEQ '1'
     C                     EXSR $SB800
     C                     END
     C                     MOVE '1'       READOK
     C                     DO   *HIVAL
     C           READOK    IFEQ '1'
     C                     EXSR $SB910
     C           CARDRE    IFEQ ' '
     C                     EXSR $SB800
     C                     MOVE '1'       READOK
     C                     END
     C                     END
     C  N60                END
     C                     MOVELWKDAY     PARM56           xｮg nckｫh
     C                     MOVELWKTHM     PARM47  4        xｮgkｫh
     C                     MOVELWKTHM     PARM43  4        xｮgkｫh
     C                     MOVE '1'       SETFG1
     C                     MOVE '1'       READPT
     C                     MOVELWKBNS1    #KBSY1  2
     C                     MOVE WKBNS1    #KBSY2  2
     C                     Z-ADDDFBINN    #KBINN  20
     C                     MOVE CBMMKR    #KSBMN  40
     C                     EXSR $SB910
     C                     MOVE *BLANK    READPT
     C                     MOVE DFKHHH    #KTYHH
     C                     MOVE DFKHMM    #KTYMM
     C                     END
      *
     C           SETFG1    IFEQ *BLANK
     C                     MOVELWKDAY     PARM56           xｮg nckｫh
     C                     MOVELWKTHM     PARM47  4        xｮgkｫh
     C                     END
      *====MSK K.K 11/08-==================================*
     C                     MOVE *BLANK    READPT
     C                     MOVE CBTBME    WKMBME
     C                     MOVE CBMMKR    WKKBMN
     C                     MOVE CBNEXT    NEXTBM  40
     C                     MOVE CBTSA1    WKCIK1
     C                     MOVE CBTSA2    WKCIK2
     C                     MOVE CBTSA3    WKCIK3
     C                     MOVE CBTSA3    WKCIKU
     C                     MOVELWKBNS1    #KBSY1  2
     C                     MOVE WKBNS1    #KBSY2  2
     C                     Z-ADDDFBINN    #KBINN  20
     C                     MOVE WKKBMN    #KSBMN  40
     C           #KEY04    SETLLAAKTL111             1010
     C           *IN10     IFEQ '1'
     C                     EXSR $SB800
     C                     END
     C                     MOVE '1'       READOK
     C                     DO   *HIVAL
     C           READOK    IFEQ '1'
     C                     EXSR $SB910
     C           CARDRE    IFEQ ' '
     C                     EXSR $SB800
     C                     MOVE '1'       READOK
     C                     END
     C                     END
     C  N60                END
      *==kﾑcﾈb pｮﾇc fv
     C                     ADD  DFCDAY    WKCIK3
      *
      *== ubpk ﾉcpﾏc
     C           DFGKKB    IFEQ 'M'
     C                     EXSR $SB700
     C                     END
      *== gﾞcﾇc｣gﾇcﾍﾞ ﾉcpｬc
     C           DFGKKB    IFEQ 'G'
     C           DFGKKB    OREQ 'K'
     C                     EXSR $SB710
     C                     MOVELWKDAY     PARM56           xｮg nckｫh
     C                     MOVE 'K'       SHORKB
     C                     EXSR $SB710
     C                     END
      *== mbgeg ﾉcpｬc
     C           DFGKKB    IFEQ 'I'
     C                     EXSR $SB720
     C                     MOVELWKDAY     PARM56           xｮg nckｫh
     C                     MOVE 'K'       SHORKB
     C                     EXSR $SB720
     C                     END
      *== ﾑcﾍﾞ ﾆmb
     C           DFSUND    IFEQ '*'
     C           DFMOND    OREQ '*'
     C           DFTUED    OREQ '*'
     C           DFWEDD    OREQ '*'
     C           DFTHUD    OREQ '*'
     C           DFFRID    OREQ '*'
     C           DFSATD    OREQ '*'
     C                     EXSR $SB730
     C                     MOVELWKDAY     PARM56           xｮg nckｫh
     C                     MOVE 'K'       SHORKB
     C                     EXSR $SB730
     C                     END
     C           CBMMKR    IFEQ 0612
     C                     MOVE PARM20    WKDAYX
     C                     EXSR $SB740
     C                     MOVELWKDAY     PARM56           xｮg nckｫh
     C                     MOVE 'K'       SHORKB
     C                     EXSR $SB740
     C                     END
     C                     MOVE 'K'       SHORKB
     C                     MOVE 'TK  '    @ERRCD
      *
      *== OUTPUT ﾌﾟ[xｰj ﾈln
     C*
     C           DFCBIN    IFNE *ZERO
     C                     MOVE DFCBIN    WWBIN
     C                     ELSE
     C                     MOVE WKBIN     WWBIN
     C                     END
     C                     MOVE #HY       ANSYY
     C                     MOVE #HM       ANSMM
     C                     MOVE #HD       ANSDD
     C                     MOVE WKANS     PARM20
     C                     MOVE WWBIN     PARM21
     C                     MOVE WKANS     PARM24
     C                     MOVE *BLANK    START
     C                     MOVE WKBIN     #KBINN
     C                     MOVE DFKTHH    #KTYHH
     C                     MOVE DFKTMM    #KTYMM
     C                     MOVE DFKTHH    WKTYHH
     C                     MOVE DFKTMM    WKTYMM
      *
     C                     MOVELWKHHM     PARM48  4        xｮg ﾌl
     C                     MOVELWKTHM     PARM49  4        kｬc OR 2ﾆﾞ kｫh
      *== ckgﾒ ﾌ]jﾞ]
     C           CBKDAI    IFEQ '0'
     C           CBKDAI    OREQ 'C'
     C           CBKDAI    OREQ 'E'
 ********** 調整日を見る1994/09/23  ******************************
 *   C           DFCDAY    IFNE *ZERO                              *
 *   C                     MOVE DFCDAY    CI                       *
 *   C                     DO   *HIVAL                             *
 *   C                     SETOF                     84            *
 *   C                     EXSR $SB800                             *
 *   C           *IN81     IFEQ '0'                                *
 *   C                     SUB  1         CI           8484        *
 *   C                     END                                     *
 *   C  N81N84             END                                     *
 *   C                     END                                     *
 *   C                     MOVE WKDAY     PARM24                   *
 *******************************************************************
     C                     SETON                     LR
     C                     RETRN
     C                     END
     CSR         $S200E    ENDSR
      *-----------------------------------------------------*
      *    xlg ﾉcpｬcﾍﾞ ･ ynxﾓ                               *
      *-----------------------------------------------------*
     CSR         $SB210    BEGSR
      *
      *== kｬcib ﾎﾞy] ﾌ]jﾞ]
      *
     C           CHUKI1    IFEQ *ZERO
     C           CHUKI2    ANDEQ*ZERO
     C                     GOTO $S210E
     C                     ELSE
      *=== xlg kｬcib f] ﾉ ﾆﾑﾒ
      *
     C           CHUKI1    IFNE *ZERO
     C                     MOVE *ZERO     WKMBME
     C                     MOVE CHUKI1    WKCHUB
     C                     MOVELCHUKI1    PARM53
     C                     MOVE *ZERO     CHUKI1
     C                     MOVE 'H'       SHORKB
     C                     MOVE WKBNS2    CHUBNS  4        * kﾏcib ﾍﾞ]ﾆﾏ
     C                     END
     C           WKCHUB    DOUEQ*ZERO
     C                     Z-ADD0         WKCIK1
     C                     Z-ADD0         WKCIK2
     C                     Z-ADD0         WKCIK3
     C           SHORKB    IFEQ 'H'
     C                     MOVE 'T1  '    @ERRCD
     C                     EXSR $SB600
     C                     MOVELWKDAY     PARM57           xｮg kｬc nckｫh
     C                     END
      *
     C                     MOVELWKDAY     WKDAYX
     C                     MOVE 'T2  '    @ERRCD
     C                     MOVELCBNEXT    WKKBMN
     C                     MOVELCBKSA1    WWCIK1
     C                     MOVELCBKSA2    WWCIK2
     C                     MOVELCBKSA3    WWCIK3
     C                     EXSR $SB610
      *
     C           CHUKI2    IFNE *ZERO
     C                     MOVE CHUKI2    WKCHUB
     C                     MOVE *ZERO     CHUKI2
     C                     MOVE WKBNS3    CHUBNS  4        * kﾏcib ﾍﾞ]ﾆﾏ
     C                     END
     C                     END
     C                     END
      *
     C           $S210E    TAG
     C                     MOVELWKDAY     PARM50  8        kｬcibﾅg ﾉcg
     C                     MOVELWKHHM     PARM51  4        2ﾆﾞ ﾌl
     C                     MOVELWKTHM     PARM52  4        2ﾆﾞ kｫh
      *
     CSR                   ENDSR
      *-----------------------------------------------------*
      *    2ﾆﾞfﾃc  ﾍgnﾒﾍﾞ ･ ynxﾓ                            *
      *-----------------------------------------------------*
     CSR         $SB300    BEGSR
      *
     C           DFCDAY    IFNE 0
     C                     MOVE DFCDAY    CI
     C                     DO   *HIVAL
     C                     SETOF                     84
     C                     EXSR $SB800
     C           *IN81     IFEQ '0'
     C                     SUB  1         CI           8484
     C                     END
     C  N81N84             END
     C                     END
     C                     MOVELWKDAY     PARM58           pﾆﾞ nckｫh
      *
     C                     MOVE *BLANK    READPT
     C                     MOVE CBNEXT    WKKBMN
     C                     MOVE CBKBME    WKMBME
     C                     MOVE CBKSA1    WKCIK1
     C                     MOVE CBKSA2    WKCIK2
     C                     MOVE CBKSA3    WKCIK3
     C                     MOVE CBKSA3    WKCIKU
      *
      *== ibﾜ uﾇjｰ ﾑvﾃv
      *
     C                     MOVE CBKKRO    WKMKRO
     C                     EXSR $SB900
     C                     MOVELWKBNS1    #KBSY1  2
     C                     MOVE WKBNS1    #KBSY2  2
     C                     Z-ADDDFBINN    #KBINN  20
     C                     MOVE WKKBMN    #KSBMN  40
     C                     MOVE '1'       READPT
     C                     EXSR $SB910
     C                     MOVE *BLANK    READPT
     C                     MOVE DFKTHH    #KTYHH
     C                     MOVE DFKTMM    #KTYMM
     C           #KEY04    SETLLAAKTL111
      *== kﾑcﾈb pｮﾇc fv
     C                     ADD  DFCDAY    WKCIK3
      *
      *== ubpk ﾉcpﾏc
     C           DFGKKB    IFEQ 'M'
     C                     EXSR $SB700
     C                     END
      *== gﾞcﾇc｣gﾇcﾍﾞ ﾉcpｬc
     C           DFGKKB    IFEQ 'G'
     C           DFGKKB    OREQ 'K'
     C                     EXSR $SB710
     C                     MOVELWKDAY     PARM58           pﾆﾞ nckｫh
     C                     MOVE 'K'       SHORKB
     C                     EXSR $SB710
     C                     END
      *== mbgeg ﾉcpｬc
     C           DFGKKB    IFEQ 'I'
     C                     EXSR $SB720
     C                     MOVELWKDAY     PARM58           pﾆﾞ nckｫh
     C                     MOVE 'K'       SHORKB
     C                     EXSR $SB720
     C                     END
      *== ﾑcﾍﾞ ﾆmb
     C           DFSUND    IFEQ '*'
     C           DFMOND    OREQ '*'
     C           DFTUED    OREQ '*'
     C           DFWEDD    OREQ '*'
     C           DFTHUD    OREQ '*'
     C           DFFRID    OREQ '*'
     C           DFSATD    OREQ '*'
     C                     EXSR $SB730
     C                     MOVELWKDAY     PARM58           pﾆﾞ nckｫh
     C                     MOVE 'K'       SHORKB
     C                     EXSR $SB730
     C                     END
     C           CBNEXT    IFEQ 0612
     C                     MOVE PARM20    WKDAYX
     C                     EXSR $SB740
     C                     MOVELWKDAY     PARM58           pﾆﾞ nckｫh
     C                     MOVE 'K'       SHORKB
     C                     EXSR $SB740
     C                     END
     C                     MOVE 'KK  '    @ERRCD
     C                     MOVE 'K'       SHORKB
      *
      *== OUTPUT ﾌﾟ[xｰj ﾈln
     C*
     C           DFCBIN    IFNE *ZERO
     C                     MOVE DFCBIN    WWBIN
     C                     ELSE
     C                     MOVE WKBIN     WWBIN
     C                     END
     C                     MOVE #HY       ANSYY
     C                     MOVE #HM       ANSMM
     C                     MOVE #HD       ANSDD
     C                     MOVE WKANS     PARM30
     C                     MOVE WWBIN     PARM31
     C                     MOVE WKANS     PARM34
     C                     MOVELWKTHM     PARM54
     C                     MOVE *BLANK    START
 ********** 調整日を見る1994/09/23  ******************************
 *   C           DFCDAY    IFNE *ZERO                              *
 *   C                     MOVE DFCDAY    CI                       *
 *   C                     DO   *HIVAL                             *
 *   C                     SETOF                     84            *
 *   C                     EXSR $SB800                             *
 *   C           *IN81     IFEQ '0'                                *
 *   C                     SUB  1         CI           8484        *
 *   C                     END                                     *
 *   C  N81N84             END                                     *
 *   C                     END                                     *
 *   C                     MOVE WKDAY     PARM34                   *
 *******************************************************************
     CSR         $S300E    ENDSR
      *-----------------------------------------------------*
      *    kﾏcib ﾎﾞy] fﾒﾆﾞﾃh ･ ynxﾓ                         *
      *-----------------------------------------------------*
     CSR         $SB600    BEGSR
     C           #S600     TAG
     C                     SETOF                         84
      *=== nckｫh ﾎﾞy] kﾏcib
     C           DFTBMN    IFEQ WKCHUB
      *== kﾏcib kｫhﾉ fﾒﾆﾞﾃh ･ ynxﾓ==*
     C                     MOVE '1'       READPT
     C                     EXSR $SB910
     C           DFKTMM    ADD  DFTMMM    #KTYMM
     C           DFKTHH    ADD  DFTMHH    #KTYHH
     C           #KTYMM    IFGE 60
     C                     ADD  1         #KTYHH
     C           #KTYMM    SUB  60        #KTYMM
     C                     ADD  DFKTMM    #KTYMM
     C                     END
     C                     Z-ADDDFCDAY    CH      20
     C           #KTYHH    IFLT 32
     C           CH        IFNE *ZERO
     C                     DO   *HIVAL
     C                     EXSR $SB800
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
     C                     SUB  1         CH             84
     C                     END
     C  N81N84             END
     C                     MOVE F8KAYY    #HY
     C                     MOVE F8KAMM    #HM
     C                     MOVE F8KADD    #HD
     C                     END
     C           F8HIRU    IFEQ ' '
     C           F8YORU    ANDEQ' '
     C                     MOVE '3'       WKJOTI  1         * ﾍﾓ ﾑﾓ
     C                     END
     C           F8HIRU    IFEQ ' '
     C           F8YORU    ANDEQ'*'
     C                     MOVE '1'       WKJOTI  1         * ﾍﾓ
     C                     END
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ' '
     C                     MOVE '2'       WKJOTI  1         * ﾑﾓ
     C                     END
     C                     GOTO $S600E
     C                     ELSE
     C           #KTYHH    SUB  24        #KTYHH
     C                     Z-ADDDFCDAY    CH      20
     C           CH        IFNE *ZERO
     C                     DO   *HIVAL
     C                     EXSR $SB800
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
     C                     SUB  1         CH             84
     C                     END
     C  N81N84             END
     C                     MOVE F8KAYY    #HY
     C                     MOVE F8KAMM    #HM
     C                     MOVE F8KADD    #HD
     C                     END
     C           F8HIRU    IFEQ ' '
     C           F8YORU    ANDEQ' '
     C                     MOVE '3'       WKJOTI  1         * ﾍﾓ ﾑﾓ
     C                     END
     C           F8HIRU    IFEQ ' '
     C           F8YORU    ANDEQ'*'
     C                     MOVE '1'       WKJOTI  1         * ﾍﾓ
     C                     END
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ' '
     C                     MOVE '2'       WKJOTI  1         * ﾑﾓ
     C                     END
     C                     GOTO $S600E
     C                     END
      *=== nckｫh ﾎﾞy] kﾏcib bfﾞb
     C                     ELSE
     C                     MOVEA'00'      *IN,83
     C                     MOVE DFTBMN    #KSBMN
     C                     Z-ADD0         #KTYHH
     C                     Z-ADD0         #KTYMM
     C           #KEY04    SETLLAAKTL111
     C                     DO   *HIVAL
     C                     EXSR $SB910
     C           *IN83     IFEQ '0'
     C           WKBIN     IFEQ DFBINN
     C           WKKBMN    COMP DFTBMN                   84
     C  N84                ADD  1         LOPKAI
     C  N84                GOTO #S600
     C   84                MOVE 'A5'      @ERRCD
     C   84                EXSR $LIST
     C                     END
     C                     ELSE
     C                     MOVE 'A5'      @ERRCD
     C                     EXSR $LIST
     C                     END
     C  N83N84             END
     C                     END
     C           $S600E    TAG
     CSR                   ENDSR
      *-----------------------------------------------------*
      *    kﾏcib ﾉcpｬcﾍﾞ ﾈｮn                                *
      *-----------------------------------------------------*
     CSR         $SB610    BEGSR
     C                     SETOF                     8483
     C                     MOVELWKBNS2    #KBSY1
     C                     MOVE WKBNS2    #KBSY2
     C                     MOVE WKCHUB    #KSBMN
     C                     MOVE *BLANK    READPT
     C           #KEY04    SETLLAAKTL111             1010
     C           *IN10     IFEQ '1'
     C                     ADD  1         LOPKAI
     C                     EXSR $SB800
     C                     END
     C                     MOVE '1'       READOK  1
     C                     DO   *HIVAL
     C           READOK    IFEQ '1'
     C                     EXSR $SB910
     C           CARDRE    IFEQ ' '
     C                     EXSR $SB800
     C                     MOVE WKDAY     WKDAYX
     C                     MOVE '1'       READOK
     C                     END
     C                     END
     C  N60                END
     C                     MOVE DFCDAY    WKCIK3
      *
     C           DFGKKB    IFEQ 'M'
     C                     Z-ADD0         WKCIK1
     C                     Z-ADD0         WKCIK2
     C                     Z-ADD0         WKCIK3
     C                     ELSE
     C                     Z-ADDWWCIK1    WKCIK1
     C                     Z-ADDWWCIK2    WKCIK2
     C                     Z-ADDWWCIK3    WKCIK3
     C                     END
      *== ubpk ﾉcpﾏc
     C           DFGKKB    CASEQ'M'       $SB700
     C                     ENDCS
      *== gﾞcﾇc｣gﾇcﾍﾞ ﾉcpｬc
     C           DFGKKB    CASEQ'G'       $SB710
     C           DFGKKB    CASEQ'K'       $SB710
     C                     ENDCS
      *== mbgeg ﾉcpｬc
     C           DFGKKB    CASEQ'I'       $SB720
     C                     ENDCS
      *== ﾑcﾍﾞ ﾆmb
     C           DFSUND    IFEQ '*'
     C           DFMOND    OREQ '*'
     C           DFTUED    OREQ '*'
     C           DFWEDD    OREQ '*'
     C           DFTHUD    OREQ '*'
     C           DFFRID    OREQ '*'
     C           DFSATD    OREQ '*'
     C                     EXSR $SB730
     C                     END
     C           CBNEXT    IFEQ 0612
     C                     MOVE PARM20    WKDAYX
     C                     EXSR $SB740
     C                     END
     C                     SETOF                     8485
     C           DFTBMN    IFEQ NEXTBM
     C                     MOVE WKCHUB    WKKBMN
     C                     MOVE *ZERO     WKCHUB
     C                     ELSE
     C                     MOVEA'00'      *IN,83
     C                     MOVE DFTBMN    #KSBMN
     C                     Z-ADD0         #KTYHH
     C                     Z-ADD0         #KTYMM
     C           #KEY04    SETLLAAKTL111
     C                     DO   *HIVAL
     C                     EXSR $SB910
     C                     SETOF                     8485
     C           *IN83     IFEQ '0'
     C           WKBIN     IFEQ DFBINN
     C           WKCHUB    COMP DFTBMN                   84
     C           DFTBMN    COMP NEXTBM                   85
     C  N84                ADD  1         LOPKAI
     C   84                MOVE 'A5'      @ERRCD
     C   84                EXSR $LIST
     C                     END
     C                     ELSE
     C                     MOVE 'A5'      @ERRCD
     C                     EXSR $LIST
     C                     END
     C  N83N84N85          END
     C                     END
     C           *IN85     IFEQ '1'
     C                     MOVE WKCHUB    WKKBMN
     C                     MOVE *ZERO     WKCHUB
     C                     MOVE DFKTHH    #KTYHH
     C                     MOVE DFKTMM    #KTYMM
     C                     END
     C                     MOVELWKDAY     WKDAYX
     CSR         $S610E    ENDSR
      *-----------------------------------------------------*
      *    ubpk ﾉcpﾏc                                       *
      *-----------------------------------------------------*
     CSR         $SB700    BEGSR
     C                     MOVE WKCIK3    CI
     C           #S700     TAG
     C           LOPKAI    IFGE 50
     C                     MOVE 'D'       PARM32  1
     C                     MOVE '*'       PARM33  1
     C                     MOVE 'L1'      @ERRCD
     C                     EXSR $LIST
     C                     Z-ADD0         LOPKAI
     C                     END
     C                     SETOF                       84
     C                     Z-ADDDFTSEQ    WKSEQ   20
     C                     MOVE WKBIN     #KBINN  20
     C*==  ﾅbhﾓ ﾎﾞ] c]ﾃcﾍﾞ] ﾎabﾓ READ ==*
     C           CI        IFNE *ZERO
     C                     DO   *HIVAL
     C                     EXSR $SB910
     C           *IN83     IFEQ '0'
     C           READOK    IFEQ '1'
     C                     SUB  1         CI             84
     C                     MOVE DFBINN    WKBIN   20
     C                     END
     C                     END
     C  N84N83             END
     C                     END
      *
     C           CI        IFNE 0
     C                     ADD  1         LOPKAI
     C                     EXSR $SB800
     C                     GOTO #S700
     C                     END
     C           CI        IFEQ 0
      * ﾆmbﾍﾞ] fﾞ obng
     C           WKMBME    IFEQ 0
     C                     GOTO $S700E
     C                     END
      * ﾆmbﾍﾞ] fﾞ aﾓng
     C           WKMBME    IFNE 0
     C           WKMBME    DOUEQWKBIN
     C                     EXSR $SB910
     C           CARDRE    IFEQ *BLANK
     C                     ADD  1         LOPKAI
     C                     EXSR $SB800
     C                     END
     C                     END
     C                     END
     C                     END
     CSR         $S700E    ENDSR
      *-----------------------------------------------------*
      *    gﾇc｣hﾞcﾇc ﾉcpﾏc                                  *
      *-----------------------------------------------------*
     CSR         $SB710    BEGSR
     C                     MOVE '0'       GETFLG  1
      *=== ﾍgnﾒﾍﾞ ﾉ kdlh
     C           SHORKB    IFEQ 'H'
     C           GETFLG    DOUEQ'0'
     C           #HD       DIV  2         WKCNT   20
     C                     MVR            AMARI
     C           DFGKKB    IFEQ 'G'
     C           AMARI     ANDEQ*ZERO
     C                     MOVE '1'       GETFLG
     C                     GOTO $S710E
     C                     END
     C           DFGKKB    IFEQ 'K'
     C           AMARI     ANDNE*ZERO
     C                     MOVE '1'       GETFLG
     C                     GOTO $S710E
     C                     END
     C                     DO   *HIVAL
     C                     SETOF                         84
     C                     EXSR $SB800
     C           F8HIRU    IFEQ *BLANK
     C                     SETON                         84
     C                     END
     C  N84                END
     C                     END
     C                     GOTO $S710E
     C                     END
      *
      *=== fhmbﾍﾞ ･ ynxﾓ
      *
     C           SHORKB    IFEQ 'K'
     C                     SETOF                         84
     C                     Z-ADDWKCIK1    CARD    20
      *== ﾅbhﾓ (ﾍ)ﾎﾞ] READ
     C           WKCIK1    IFNE *ZERO
     C                     DO   *HIVAL
     C                     EXSR $SB800
     C           *IN81     IFEQ '0'
     C           F8HIRU    ANDEQ' '
     C                     SUB  1         CARD           84
     C                     END
     C  N81N84             END
     C                     END
     C                     MOVE '0'       GETFLG
      *
      *== ﾉcpﾏc ﾍlﾞi fhmb ==*
      *
     C           GETFLG    DOUEQ'1'
     C           F8KADD    DIV  2         WKCNT
     C                     MVR            AMARI
      *== hﾞcﾇc ﾆmb
     C           DFGKKB    IFEQ 'G'
     C           AMARI     ANDEQ*ZERO
     C                     MOVE F8KADD    #HD
     C                     MOVE F8KAMM    #HM
     C                     MOVE F8KAYY    #HY
     C                     Z-ADD01        WKBIN
     C                     MOVE '1'       GETFLG
     C                     GOTO $S710E
     C                     END
      *== gﾇc ﾆmb
     C           DFGKKB    IFEQ 'K'
     C           AMARI     ANDNE*ZERO
     C                     MOVE F8KADD    #HD
     C                     MOVE F8KAMM    #HM
     C                     MOVE F8KAYY    #HY
     C                     Z-ADD01        WKBIN
     C                     MOVE '1'       GETFLG
     C                     GOTO $S710E
     C                     END
      *
     C                     DO   *HIVAL
     C                     SETOF                         84
     C                     EXSR $SB800
     C           F8HIRU    IFEQ *BLANK
     C                     SETON                         84
     C                     END
     C  N84                END
     C                     END
     C                     END
     CSR         $S710E    ENDSR
      *-----------------------------------------------------*
      *    mbgeg ﾉcpﾏc                                      *
      *-----------------------------------------------------*
     CSR         $SB720    BEGSR
     C           SHORKB    IFEQ 'H'
     C                     SETOF                       21
     C           WKKBMN    CHAINACAPP011             21
     C           *IN21     IFEQ '0'
     C           K1SKJY    ANDEQ*BLANK
     C                     MOVE K1NOYY    WKHAYY
     C                     MOVE K1NOMM    WKHAMM
     C                     MOVE K1NODD    WKHADD
     C                     MOVE K1NOYY    #HY
     C                     MOVE K1NOMM    #HM
     C                     MOVE K1NODD    #HD
     C/SPACE 1
     C*==== ﾆbﾛﾅg uﾇjｰ ﾉ ﾌlﾃcﾍﾞ kdlh ==============*
     C           WKHAZ     IFEQ *ZEROS
     C                     MOVE 'D'       PARM32  1
     C                     MOVE 'M'       PARM33  1
     C                     MOVE 'A4'      @ERRCD
     C                     EXSR $LIST
     C                     END
     C/SPACE 1
     C*==== ﾌﾟ[xｰj ﾌlﾃcﾍﾞ  < ﾆbﾛﾅg ﾌlﾃcﾍﾞ kdlh ============*
     C           WKDAYX    IFLT WKHAZ
     C                     MOVE 'D'       PARM32  1
     C                     MOVE 'M'       PARM33  1
     C                     MOVE 'A4'      @ERRCD
     C                     EXSR $LIST
     C                     END
      *
     C           READNG    IFEQ '1'
     C                     MOVE F8KAYY    WKDAYY
     C                     MOVE F8KAMM    WKDAYM
     C                     MOVE F8KADD    WKDAYD
     C                     MOVE *BLANK    READNG
     C                     END
      *
     C           #KDATE    SETGTAGDPL121
      *
     C           #S720     TAG
     C                     MOVE WKCIK1    CI
     C                     DO   *HIVAL
     C                     SETOF                         84
     C                     EXSR $SB800
     C                     MOVE F8KAYY    WKHAYY
     C                     MOVE F8KAMM    WKHAMM
     C                     MOVE F8KADD    WKHADD
     C           F8HIRU    IFEQ *BLANK
     C                     SUB  1         CI             84
     C                     END
     C  N81N84             END
     C           WKHAZ     IFGE WKDAYX
     C                     MOVE F8KAYY    #HY
     C                     MOVE F8KAMM    #HM
     C                     MOVE F8KADD    #HD
     C                     GOTO $S720E
     C                     END
     C                     GOTO #S720
     C                     END
     C                     END
      *== ﾉcﾃﾏcﾍﾞ fhmb
     C           SHORKB    IFEQ 'K'
     C                     SETOF                       22
     C           WKCIK1    MULT WKCIK3    CI
     C                     MOVELWKTYHH    NTIME   40
     C                     MOVE WKTYMM    NTIME
     C                     MOVELDFKTHH    STIME   40
     C                     MOVE DFKTMM    STIME
      *
     C           CI        IFNE *ZERO
     C                     DO   *HIVAL
     C                     SETOF                         84
     C                     EXSR $SB800
     C                     MOVE F8KAYY    WKHAYY
     C                     MOVE F8KAMM    WKHAMM
     C                     MOVE F8KADD    WKHADD
     C           F8HIRU    IFEQ *BLANK
     C                     SUB  1         CI             84
     C                     END
     C  N81N84             END
     C                     END
     C                     MOVE F8KAYY    #HY
     C                     MOVE F8KAMM    #HM
     C                     MOVE F8KADD    #HD
     C                     END
     CSR         $S720E    ENDSR
      *-----------------------------------------------------*
      *    ﾑcﾍﾞ ﾆmb                                         *
      *-----------------------------------------------------*
     CSR         $SB730    BEGSR
     C           SHORKB    IFEQ 'H'
     C                     Z-ADDF8YOBI    IX      20
     C           YR1,IX    CABEQ'*'       $S730E
     C           YR1,IX    DOUEQ'*'
     C                     EXSR $SB800
     C           F8HIRU    IFEQ *BLANK
     C                     MOVE F8KAYY    #HY
     C                     MOVE F8KAMM    #HM
     C                     MOVE F8KADD    #HD
     C                     MOVE F8YOBI    IX
     C                     END
     C                     END
     C                     GOTO $S730E
     C                     END
      * ﾉcpｬcﾍﾞ fhmb
     C           SHORKB    IFEQ 'K'
     C                     Z-ADDWKCIK3    CI
     C                     SETOF                       84
     C           CI        IFNE *ZERO
     C                     DO   *HIVAL
     C                     EXSR $SB800
     C                     Z-ADDF8YOBI    IX      20
     C           F8HIRU    IFEQ *BLANK
     C           YR1,IX    ANDEQ'*'
     C                     SUB  1         CI             84
     C                     END
     C  N84                END
     C                     END
     C                     MOVE F8KAYY    #HY
     C                     MOVE F8KAMM    #HM
     C                     MOVE F8KADD    #HD
     C                     END
     CSR         $S730E    ENDSR
      *-----------------------------------------------------*
      *    bﾌﾞ[gﾞ  ﾈ]ﾑc ﾓｰk]                                *
      *-----------------------------------------------------*
     CSR         $SB740    BEGSR
      *---- 1995/06/06 MSK. KUNIEDA ------------------------*
      *     ﾍlﾞiﾉ fhﾉc dﾒa ﾈln                              *
     C                     Z-ADD0         SAVHY   40        *
     C                     Z-ADD0         SAVHM   20        *
     C                     Z-ADD0         SAVHD   20        *
      *-----------------------------------------------------*
     C                     SETOF                     10  83
     C                     MOVELWKBNS1    #KBSY1  2
     C                     MOVE WKBNS1    #KBSY2  2
     C                     Z-ADDDFBINN    #KBINN  20
     C                     MOVE WKKBMN    #KSBMN  40
     C                     Z-ADD1         #KTSEQ
     C                     Z-ADD0         #KTYMM
     C                     Z-ADD0         #KTYHH
     C           #KEY04    SETLLAAKTL111             1010
     C           #KEY06    READEAAKTL111                 83
     C                     SETOF                       8481
     C                     MOVE WKDAYX    WKDAY
      *--1995/06/06 -------*
     C                     MOVEL#HY       SAVHY
     C                     MOVEL#HM       SAVHM
     C                     MOVEL#HD       SAVHD
      *
     C                     MOVE 'K'       WK0612  1
     C           #KDATE    SETLLAGDPL121
     C           $0612S    TAG
     C                     SETOF                       84
      * ﾉcpﾏcﾍﾞ fhmb
     C           WK0612    IFEQ ' '
     C                     Z-ADD01        WKBIN
     C                     MOVE F8KAYY    #HY     40
     C                     MOVE F8KAMM    #HM     20
     C                     MOVE F8KADD    #HD     20
     C                     GOTO $S740E
     C                     END
      *
     C                     READ AGDPL121                 81
     C                     DO   *HIVAL
     C                     READ AGDPL121                 81
     C           *IN81     IFEQ '0'
     C           F8YOBI    IFEQ 1
     C           DFMOND    ANDEQ'*'
     C                     SETON                         84
     C                     END
     C           F8YOBI    IFEQ 2
     C           DFTUED    ANDEQ'*'
     C                     SETON                         84
     C                     END
     C           F8YOBI    IFEQ 3
     C           DFWEDD    ANDEQ'*'
     C                     SETON                         84
     C                     END
     C           F8YOBI    IFEQ 4
     C           DFTHUD    ANDEQ'*'
     C                     SETON                         84
     C                     END
     C           F8YOBI    IFEQ 5
     C           DFFRID    ANDEQ'*'
     C                     SETON                         84
     C                     END
     C           F8YOBI    IFEQ 6
     C           DFSATD    ANDEQ'*'
     C                     SETON                         84
     C                     END
      *--- 1995/06/06 MSK. KUNIEDA ------------------------*
      *    kﾑcg gﾏcﾆﾞl jbec                                *
      *    fﾞbncﾍﾞﾉ ﾈﾞ]ﾆﾞl fﾞ gﾏcﾆﾞlﾉ ng ﾍgnﾒﾍﾞmﾞob        *
      *----------------------------------------------------*
     C           *IN84     IFEQ '1'                        *
     C                     MOVE F8KAYY    SAVHY            *
     C                     MOVE F8KAMM    SAVHM            *
     C                     MOVE F8KADD    SAVHD            *
     C                     SETOF                       82  *
     C                     READPAGDPL121                 81*
     C           F8HIRU    IFEQ '*'                        *
     C           *IN81     ANDEQ'0'                        *
     C                     SETOF                         84*
     C                     END                             *
     C           #SAVDT    CHAINAGDPL121             82    *ncfﾞbﾍﾞ ﾈln
     C                     END                             *
      *                                                    *
     C                     END
     C  N81N84             END
     C           *IN81     IFEQ '0'
     C           *IN84     ANDEQ'1'
     C           WK0612    IFEQ 'N'
     C                     MOVE ' '       WK0612
     C                     END
     C           WK0612    IFEQ 'H'
     C                     MOVE 'N'       WK0612
     C                     END
     C           WK0612    IFEQ 'K'
     C                     MOVE 'H'       WK0612
     C                     END
     C                     GOTO $0612S
     C                     END
     C                     MOVE F8KAYY    #HY     40
     C                     MOVE F8KAMM    #HM     20
     C                     MOVE F8KADD    #HD     20
     CSR         $S740E    ENDSR
      *-----------------------------------------------------*
      *    fﾛ]jﾞｰ ﾎabﾓ ﾑvﾃv ﾆﾑﾒ                             *
      *-----------------------------------------------------*
     CSR         $SB800    BEGSR
     C                     DO   *HIVAL
     C                     READ AGDPL121                 81
     C                     SETOF                         66
     C           *IN81     IFEQ '1'
     C                     MOVE 'D'       PARM32
     C                     MOVE 'M'       PARM33
     C                     MOVE 'A2'      @ERRCD
     C                     EXSR $LIST
     C                     END
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
     C                     SETON                     66
      *==  kｬczg]
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     MOVE '3'       WKJOTI  1
     C                     END
      *== ﾍﾓg] ﾉv
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ'*'
     C                     MOVE '1'       WKJOTI  1
     C                     END
      *== zg] ﾉv
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ*BLANK
     C                     MOVE '2'       WKJOTI  1
     C                     END
     C                     MOVE F8KAYY    #HY     40
     C                     MOVE F8KAMM    #HM     20
     C                     MOVE F8KADD    #HD     20
     C                     END
     C  N66                END
      *
     C           CARDRE    IFEQ ' '
     C                     Z-ADD08        #KTYHH
     C                     Z-ADD00        #KTYMM
     C                     SETOF                     83
     C           #KEY04    SETLLAAKTL111
     C                     END
     CSR         $S800E    ENDSR
      *-----------------------------------------------------*
      *    ibﾜ uﾇjｰ   ﾑvﾃv ﾆﾑﾒ                              *
      *-----------------------------------------------------*
     CSR         $SB900    BEGSR
      *
     C                     MOVE *BLANK    WKBNS1  4         * jﾞb1ﾍﾞ]ﾆﾏ
     C                     Z-ADD0         CHUKI1  40        * kﾏcib 1
     C                     MOVE *BLANK    WKBNS2  4         * kﾏcib1 ﾍﾞ]ﾆﾏ
     C                     Z-ADD0         CHUKI2  40        * kﾏcib 2
     C                     MOVE *BLANK    WKBNS3  4         * kﾏcib2 ﾍﾞ]ﾆﾏ
     C                     SETOF                       21
     C           WKMKRO    CHAINAAKPL211             21
     C           *IN21     IFEQ '0'
     C           DFSKJY    ANDEQ'D'
     C           DFSKHZ    ANDLEWKDAYX
     C                     SETON                       21
     C                     END
     C           *IN21     IFEQ '1'
     C                     MOVE 'D'       PARM32
     C                     MOVE 'M'       PARM33
     C                     MOVE 'A1'      @ERRCD
     C                     EXSR $LIST
     C                     ELSE
      *== ibﾜ uﾇjｰ ﾆﾞﾑctc ﾝｰh dﾒa ﾈln
      *
     C                     MOVE DGBNS1    WKBNS1  4         * jﾞb1ﾍﾞ]ﾆﾏ
     C                     MOVE DGBMN1    CHUKI1  40        * kﾏcib 1
     C                     MOVE DGBNS2    WKBNS2  4         * kﾏcib1 ﾍﾞ]ﾆﾏ
     C                     MOVE DGBMN2    CHUKI2  40        * kﾏcib 2
     C                     MOVE DGBNS3    WKBNS3  4         * kﾏcib2 ﾍﾞ]ﾆﾏ
     C                     END
     CSR         $S900E    ENDSR
      *-----------------------------------------------------*
      *    c]ﾃcﾍﾞ] ﾎabﾓ ﾑvﾃv ﾆﾑﾒ                            *
      *-----------------------------------------------------*
     CSR         $SB910    BEGSR
      *
     C           LOPKAI    IFGE 50
     C                     MOVE 'D'       PARM32  1
     C                     MOVE 'L'       PARM33  1
     C                     MOVE 'L1'      @ERRCD
     C                     EXSR $LIST
     C                     Z-ADD0         LOPKAI
     C                     END
      *
     C           READPT    IFEQ '1'
     C                     SETOF                       21
     C           #KEY03    CHAINAAKPL111             21
     C           *IN21     IFEQ '0'
     C           DFSKJY    ANDEQ'D'
     C           DFSKHZ    ANDLEWKDAYX
     C                     SETON                       21
     C                     END
     C           *IN21     IFEQ '1'
     C                     MOVE 'D'       PARM32
     C                     MOVE 'M'       PARM33
     C                     MOVE 'A3'      @ERRCD
     C                     EXSR $LIST
     C                     END
     C                     END
      *
     C           READPT    IFEQ *BLANK
     C                     SETON                         60
     C                     MOVE *BLANK    CARDRE
     C                     MOVE ' '       READOK
     C*==  kｬcz ﾆｬg] ==*
     C           #KEY06    READEAAKTL111                 83
     C           *IN83     IFEQ '0'
     C*==  ﾍﾓg]  ==*
     C           DFHRYR    IFEQ WKJOTI
     C                     MOVE '*'       CARDRE
     C                     MOVE '1'       READOK
     C                     END
      *== kﾏczg] ==*
     C           WKJOTI    IFEQ '3'
     C                     MOVE '*'       CARDRE  1
     C                     MOVE '1'       READOK  1
     C                     END
      *
     C                     END
     C           CARDRE    IFEQ ' '
     C                     SETOF                       60
     C                     ADD  1         LOPKAI
     C                     GOTO $S910E
     C                     END
     C                     MOVE DFBINN    WKBIN   20
     C                     END
     CSR         $S910E    ENDSR
     C*-----------------------------------------------------*
     C*  ERR LIST SUBRTN                                    *
     C*-----------------------------------------------------*
     C           $LIST     BEGSR
     C           PARM6     IFEQ 'L'
     C           PARM6     OREQ 'R'
     C           PSW1      IFEQ ' '
      *
     C                     MOVE UDATE     @DATE
     C                     TIME           @TIME
     C                     MOVE *BLANK    @NAME
     C           USER      CHAINRGAPL11              25
     C           *IN25     IFEQ '0'
     C                     MOVELJ8NAME    @NAME
     C                     END
     C                     MOVE PGMNO     PGMID
      *
     C                     OPEN ATBPR31
     C                     WRITEATBPR311
     C                     MOVE '*'       PSW1    1
     C                     END
     C                     MOVE PARM10    @HYMD1
     C                     MOVE PARM11    @BIN1
     C                     MOVE PARM20    @HYMD2
     C                     MOVE PARM21    @BIN2
     C                     MOVE PARM30    @HYMD3
     C                     MOVE PARM31    @BIN3
     C                     MOVE PARM4     @HYMD4
     C                     MOVE PARM5     @BIN4
     C                     MOVE WKHIN1    @HIN1
     C                     MOVE WKHIN2    @HIN2
     C                     MOVE WKHIN3    @HIN3
      *-- d[ｰ ﾃｰnﾞ fhﾉc
     C                     SETOF                     2526
     C                     MOVE @ERRCD    WKERR   2
     C                     Z-ADD1         X       20
     C           WKERR     LOKUPERR1,X                   25
     C           *IN25     IFEQ '0'
     C                     Z-ADD0         X
     C           1         DO   20        X
     C           ERR1,X    IFEQ *BLANK
     C                     MOVE WKERR     ERR1,X
     C                     SETON                         26
     C                     END
     C  N26                END
     C                     END
      *
     C                     WRITEATBPR312
     C                     MOVE *ZERO     @HYMD1
     C                     MOVE *ZERO     @BIN1
     C                     MOVE *ZERO     @HYMD2
     C                     MOVE *ZERO     @BIN2
     C                     MOVE *ZERO     @HYMD3
     C                     MOVE *ZERO     @BIN3
     C           *IN99     IFEQ '1'
     C                     WRITEATBPR311
     C                     SETOF                     99
     C                     END
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     ENDSR
**
01 P/N IS NOT INPUT YET
ER INPUT PARM ERROR
A1 ROUTE M/F DOESN'T EXIST
A2 CALENDAR F ERROR
A3 SERVICE BIN M/F DOESN'T EXIST
A4 LAST PICK-UP DATE + K PUBLICATION AT SUPPLY M/S DON'T MATCH            IER
A5 SERVICE BIN M/F SETTING ERROR
LI IT READS SERVICE BIN M/S MORE THAN 50 TIMES
G1 LEVELLED PRODUCTION FIXED ORDERING F DOESN'T EXIST
G2 PRECEDING PROCESS CYCLE(DATE.BIN.DELAY) HAVEN'T SETTED
G3 PLATING CYCLE(DATE.BIN.DELAY)HAVEN'T SETTED
G4 2 PROCESSING CYCLE(DATE.BIN.DELAY)HAVEN'T SETTED
