     H            Y.
     F** ATBR01 ********************
     F* CREATE  CZ SALES DATA
     F* A-IDOTA 1992.10.19 *
     F******************** ATBR01 **
     FATBWP01 IP  F     100            DISK
     FATBWP02 O   F     100            DISK
     IATBWP01 AA
     I                                       22  33 SHIN  L1
     I                                       61  620DD    L1
     I                                    P  63  660SRYO
     I                                       74  750MM    L1
      *
     C           *IN01     IFEQ '0'
     C                     Z-ADD0         GSRYO   80
     C                     SETON                     01
     C                     END
      *集計*
     C                     ADD  SRYO      GSRYO
     CL1                   EXCPTDT
     CL1                   Z-ADD0         GSRYO
      ********************
      * 出力レイアウト *
      ********************
      *
     OATBWP02 E                DT
     O                         SHIN      12
     O                         GSRYO     20
     O                         MM        22
     O                         DD        24
