     H            Y.
     FAU#PP21 UP  E                    DISK
     C           CQNONY    IFNE 0
     C           CQNUKE    IFNE 'CJ  '
     C                     Z-ADD3411      CQTOKU
     C                     MOVE *BLANK    CQTKOJ
     C                     MOVE *BLANK    CQTUKE
     C                     UPDATAU#PP211
     C                     END
     C                     END
