     H            Y.
     F** AU#R80 ****************************************
     F*   A-PICS PICK OUT DATA ACCUMULATION FILE  ..   *
     F*       I-HASADA                 87.09.18        *
JW1  F*       J-WATANABE             2016.06.03        *
     F**************************************** AU#R80 **
     FAU#PP21 IP  E                    DISK
     FAU#WP80 O   E                    DISK
JW1  FAU#PP21BO   E                    DISK
     F            AU#PP211                          KRENAMEAU#PP21X
     I            DS
     I                                        1   80CQNOHZ
     I                                        1   40CQNOYY
     I                                        5   60CQNOMM
     I                                        7   80CQNODD
     C           *ENTRY    PLIST
     C                     PARM           PHIZK   8
     C                     PARM           PRECD   9
     C                     PARM           PKENS   9
     C                     MOVE PHIZK     WHIZK   80
      *
     C                     ADD  1         WRECD   90
      *
     C           CQNOHZ    IFGT WHIZK
     C                     ADD  1         WKENS   90
     C                     WRITEAU#WP801
JW1  C                     ELSE
JW1  C                     WRITEAU#PP21X
     C                     END
      *
     CLR                   MOVE WRECD     PRECD
     CLR                   MOVE WKENS     PKENS
