     H            Y.
     F** AU#R10 *****************************************/
     F* .. A-PICS ORDER RECEIPT NUMBER ABNORMAL LIST .. */
     F*                                                 */
     F* CODING:K.OKACHI    2002/07/16                   */
     F***************************************************/
     FAU#PW10 CF  E                    WORKSTN
     FAU#PL15 IF  E           K        DISK
     FAU#WP10 O   F     512            DISK
     E                    ER      1  14 60               ERROR MESSAGE
      *
     I              '0123456789'          C         DIG
      *
     I           SDS
     I                                        1   8 @PGM
     I                                      244 253 @WSID
     I                                      254 263 @USER
     I            DS
     I                                        1   8 SDATE
     I                                        1   4 SYY
     I                                        5   6 SMM
     I                                        7   8 SDD
     I            DS
     I                                        1   8 EDATE
     I                                        1   4 EYY
     I                                        5   6 EMM
     I                                        7   8 EDD
     I            DS
     I                                        1   80WSDATE
     I                                        1   40WSYY
     I                                        5   60WSMM
     I                                        7   80WSDD
     I            DS
     I                                        1   80WEDATE
     I                                        1   40WEYY
     I                                        5   60WEMM
     I                                        7   80WEDD
      *
     C           STEP0     TAG
     C                     MOVE *BLANK    SDATE
     C                     MOVE *BLANK    EDATE
     C                     Z-ADD50        RATIO
      *
     C           STEP1     TAG
     C                     EXFMTAU#PW101
     C                     SETOF                     010203
     C                     SETOF                     99
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
      *
     C           SDATE     IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STEP1
     C                     ENDIF
      *
     C                     Z-ADD1         @A      20
     C                     SETOF                     50
     C           DIG       CHECKSDATE     @A             50
     C           *IN50     IFEQ '1'
     C                     SETON                     0199
     C                     MOVE ER,3      MSG
     C                     GOTO STEP1
     C                     END
      *
     C           EDATE     IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVE ER,2      MSG
     C                     GOTO STEP1
     C                     ENDIF
      *
     C                     Z-ADD1         @A
     C                     SETOF                     50
     C           DIG       CHECKEDATE     @A             50
     C           *IN50     IFEQ '1'
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     GOTO STEP1
     C                     END
      *
     C           SMM       IFGT '12'
     C           SMM       ORLT '01'
     C           SDD       ORGT '31'
     C           SDD       ORLT '01'
     C                     SETON                     0199
     C                     MOVE ER,3      MSG
     C                     GOTO STEP1
     C                     ENDIF
      *
     C           EMM       IFGT '12'
     C           EMM       ORLT '01'
     C           EDD       ORGT '31'
     C           EDD       ORLT '01'
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     GOTO STEP1
     C                     ENDIF
      *
     C           SDATE     IFGT EDATE
     C                     SETON                     010299
     C                     MOVE ER,3      MSG
     C                     GOTO STEP1
     C                     ENDIF
      *
     C           RATIO     IFEQ 0
     C                     SETON                     0399
     C                     MOVE ER,4      MSG
     C                     GOTO STEP1
     C                     ENDIF
      *
     C           *INKE     IFNE '1'
     C                     GOTO STEP1
     C                     ENDIF
      *
     C                     MOVE SDATE     WSDATE
     C                     MOVE EDATE     WEDATE
     C           KEY1      KLIST
     C                     KFLD           WSDATE
     C                     SETOF                     50
     C           KEY1      SETLLAU#PL151
     C                     DO   *HIVAL
     C                     READ AU#PL151                 50
     C           *IN50     IFEQ '0'
     C           CQTHHZ    IFLE WEDATE
     C           CQNONY    IFNE 0
     C           CQSRYO    ANDGT0
     C                     EXCPTDAT
     C                     END
     C                     ELSE
     C                     LEAVE
     C                     END
     C                     END
     C  N50                ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
     OAU#WP10 E                DAT
     O                         CQSKJY
     O                         CQSKYY
     O                         CQSKMM
     O                         CQSKDD
     O                         CQKOYY
     O                         CQKOMM
     O                         CQKODD
     O                         CQKOHH
     O                         CQKOSS
     O                         CQKOME
     O                         CQTOKU
     O                         CQTKOJ
     O                         CQTUKE
     O                         CQNONY
     O                         CQNKOJ
     O                         CQNUKE
     O                         CQSHN1
     O                         CQSHN2
     O                         CQSHN3
     O                         CQMHN1
     O                         CQMHN2
     O                         CQMHN3
     O                         CQKOBI
     O                         CQSEBN
     O                         CQKANR
     O                         CQTANK
     O                         CQTKUB
     O                         CQTKTI
     O                         CQNOCR
     O                         CQSRYO
     O                         CQTANI
     O                         CQNSYK
     O                         CQTHYY
     O                         CQTHMM
     O                         CQTHDD
     O                         CQTHJI
     O                         CQTHPN
     O                         CQSBKJ
     O                         CQSBRO
     O                         CQSBRT
     O                         CQSBDN
     O                         CQCIC1
     O                         CQCIC2
     O                         CQCIC3
     O                         CQNOYY
     O                         CQNOMM
     O                         CQNODD
     O                         CQNOBB
     O                         CQKJYN
     O                         CQTHAI
     O                         CQSKKB
     O                         CQHAKO
     O                         CQSYUY
     O                         CQSTAN
     O                         CQKIBN
     O                         CQHBSB
     O                         CQROTN
     O                         CQPAGN
     O                         CQOCRD
     O                         CQDTSY
     O                         CQDTSO
     O                         CQGYOM
     O                         CQURYY
     O                         CQURMM
     O                         CQURDD
     O                         CQURJI
     O                         CQURPN
     O                         CQJTNO
     O                         CQBNKA
     O                         SDATE
     O                         EDATE
     O                         RATIO
**  ER
E-01 START DATE ISN'T IT. INPUT IT.
E-02 END DATE ISN'T IT. INPUT IT.
E-03 THE INPUT VALUE IS DIFFERENT.
E-04 RATIO ISN'T IT. INPUT IT.
