     H            Y.
     F**** AUAR42 ******************************************
     F*    かんばん受注チェックリストの、作成      D605  *
     F*      M-OKUDA        1984.11.07      A:N.HAYAKAWA   *
     F******************************************************
     FFCCPL11 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FFAEPL01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFAAPL02 IF  E           K        DISK
     FFAAPL06 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I            DS
     I                                        1   5 WMHN3
     I                                        2   5 WMHN34
     I            DS
     I                                        2   50UNONY
     I                                        6   6 UNKOJ
     I                                        7  10 UNUKE
     I            DS
     I                                        1   60WNOBI
     I                                        1   20WYY
     I                                        3   40WMM
     I                                        5   60WDD
     I                                        7   70WUBIN
     I            DS
     I                                        1  12 NHBAN
     I                                        1   5 B4MHN1
     I                                        6  10 B4MHN2
     I                                       11  15 B4MHN3
     I            DS
     I                                        1   60SHIZK
     I                                        1   20B4SRYY
     I                                        3   40B4SRMM
     I                                        5   60B4SRDD
     I            DS
     I                                        1   60TRHIZ
     I                                        1   20A2TRYY
     I                                        3   40A2TRMM
     I                                        5   60A2TRDD
     I            DS
     I                                        1  15 USHIN
     I                                        1   5 USHN1
     I                                        6  10 USHN2
     I                                       11  12 USHN3
     C******************************************************
     C* M-NO AA.2.1        ﾌﾟ[x-j- ﾉ cinﾒ                  *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           PNONY   4
     C                     PARM           PNOBI   6
     C                     PARM           PUBIN   1
     C                     PARM           PNKOJ   1
     C                     PARM           PNKBN   1
     C                     MOVE PNONY     UNONY
     C                     MOVE PNOBI     WNOBI
     C                     MOVE PUBIN     WUBIN
     C                     MOVE PNKOJ     UNKOJ   1
     C                     TIME           WTIME   60
     C                     MOVE *BLANK    NMEI   16
     C******************************************************
     C* M-NO AA.2.2.1      1ﾅbhﾓ ﾉ ﾆﾑﾒ                     *
     C******************************************************
     C                     SETOF                     01
     C           UNONY     CHAINFGBPL011             01
     C           *IN01     IFEQ '0'
     C           B2SKJY    IFNE 'D'
     C                     MOVELB2KEMI    NMEI
     C                     END
     C                     END
     C           PNKBN     IFEQ 'I'
     C                     MOVE 'I mbﾆﾞﾑc'NCMT    8
     C                     ELSE
     C           PNKBN     IFEQ 'T'
     C                     MOVE 'T nlgﾏc 'NCMT
     C                     END
     C                     END
     C                     MOVE *BLANK    WNUKE   4
     C                     MOVE *BLANK    WSBAN   4
     C                     MOVE *BLANK    WMHN1   5
     C                     MOVE *BLANK    WMHN2   5
     C                     MOVE *BLANK    WMHN3   5
     C           WUBIN     IFEQ 1
     C                     SETON                     02
     C                     ELSE
     C           WUBIN     IFEQ 3
     C                     SETON                     02
     C                     ELSE
     C           WUBIN     IFEQ 2
     C                     SETON                     03
     C                     ELSE
     C           WUBIN     IFEQ 4
     C                     SETON                     03
     C                     ELSE
     C                     GOTO END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     EXCPTHD
     C******************************************************
     C* M-NO AA.2.2.2      f]ﾌﾞ]uﾇj- KEY ﾉ ﾈln             *
     C******************************************************
     C           KKEY      KLIST
     C                     KFLD           WMM
     C                     KFLD           UNONY
     C                     KFLD           UNKOJ
     C                     KFLD           WNUKE
     C                     KFLD           WSBAN
     C                     KFLD           WMHN1
     C                     KFLD           WMHN2
     C                     KFLD           WMHN3
     C           KKEY      SETLLFCCPL111
     C******************************************************
     C* M-NO AA.2.2.3      f]ﾌﾞ]uﾇj- ﾉ ﾑvﾃv                *
     C******************************************************
     C           STEP01    TAG
     C                     SETOF                     04
     C                     READ FCCPL111                 04
     C   04                GOTO STEP02
     C           B4SKBN    CABEQ'D'       STEP01
     C           UNONY     CABNEB4NONY    STEP02
     C           UNKOJ     IFNE *BLANK
     C           UNKOJ     CABNEB4NKOJ    STEP02
     C                     END
     C           *IN02     IFEQ '1'
     C           B4KNMI    CABEQ0         STEP01
     C                     ELSE
     C           *IN03     IFEQ '1'
     C           B4GKMI    CABEQ0         STEP01
     C                     END
     C                     END
     C******************************************************
     C* M-NO AA.2.2.3.1    f]ﾌﾞ]ﾍgnﾒxbﾅb KEY ﾉ kdlh        *
     C******************************************************
     C           WKOJ      IFNE B4NKOJ
     C           WKOJ      IFNE *BLANK
     C                     EXCPTTO1
     C                     EXCPTTO2
     C                     EXCPTHD
     C                     END
     C                     MOVE B4NKOJ    WKOJ    1
     C                     MOVE B4NUKE    WUKE    4
     C                     EXSR SKYU
     C                     GOTO STEP05
     C                     END
     C           WUKE      IFNE B4NUKE
     C           WUKE      IFNE *BLANK
     C                     EXCPTTO1
     C                     EXCPTHD
     C                     END
     C                     MOVE B4NUKE    WUKE
     C                     EXSR SKYU
     C                     END
     C           STEP05    TAG
     C******************************************************
     C* M-NO AA.2.2.4      gﾑclcﾍ] ﾏcw ﾉ kdlh              *
     C******************************************************
     C           KYKEYC    KLIST
     C                     KFLD           WTOKU
     C                     KFLD           WNONY
     C                     KFLD           B4MHN1
     C                     KFLD           B4MHN2
     C                     Z-ADDB4TOKU    WTOKU   40
     C                     Z-ADDB4NONY    WNONY   40
     C                     SETOF                     07
     C           KYKEYC    CHAINFAAPL061             07
     C           *IN07     CABEQ'0'       STEP81
     C                     Z-ADD8990      WTOKU
     C                     Z-ADD8990      WNONY
     C                     SETOF                     07
     C           KYKEYC    CHAINFAAPL061             07
     C           *IN07     CABEQ'0'       STEP81
     C                     GOTO STEP82
     C           STEP81    TAG
     C******************************************************
     C* M-NO AA.2.2.4      ﾏ-ﾅﾞ-ﾍ]ﾌﾞ] 15ij                 *
     C******************************************************
     C           KYKEY     KLIST
     C                     KFLD           WTOKU
     C                     KFLD           WNONY
     C                     KFLD           WNKOJ
     C                     KFLD           WNUKE
     C                     KFLD           B4MHN1
     C                     KFLD           B4MHN2
     C                     KFLD           WMHN3
     C                     Z-ADDB4TOKU    WTOKU   40
     C                     Z-ADDB4NONY    WNONY   40
     C                     MOVE B4NKOJ    WNKOJ   1
     C                     MOVE B4NUKE    WNUKE   4
     C           B4MHN3    IFEQ '00   '
     C                     MOVE *BLANK    WMHN3
     C                     ELSE
     C                     MOVE B4MHN3    WMHN3
     C                     END
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C                     MOVE *BLANK    WNKOJ
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C                     MOVE B4NKOJ    WNKOJ
     C                     MOVE *BLANK    WNUKE
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C                     MOVE *BLANK    WNKOJ
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C                     Z-ADD8990      WTOKU
     C                     Z-ADD8990      WNONY
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C******************************************************
     C* M-NO AA.2.2.4      ﾏ-ﾅﾞ-ﾍ]ﾌﾞ] 11ij                 *
     C******************************************************
     C                     Z-ADDB4TOKU    WTOKU   40
     C                     Z-ADDB4NONY    WNONY   40
     C                     MOVE B4NKOJ    WNKOJ   1
     C                     MOVE B4NUKE    WNUKE   4
     C                     MOVE *BLANK    WMHN34
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C                     MOVE *BLANK    WNKOJ
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C                     MOVE B4NKOJ    WNKOJ
     C                     MOVE *BLANK    WNUKE
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C                     MOVE *BLANK    WNKOJ
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C                     Z-ADD8990      WTOKU
     C                     Z-ADD8990      WNONY
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C******************************************************
     C* M-NO AA.2.2.4      ﾏ-ﾅﾞ-ﾍ]ﾌﾞ] 10ij                 *
     C******************************************************
     C                     Z-ADDB4TOKU    WTOKU   40
     C                     Z-ADDB4NONY    WNONY   40
     C                     MOVE B4NKOJ    WNKOJ   1
     C                     MOVE B4NUKE    WNUKE   4
     C                     MOVE *BLANK    WMHN3
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C                     MOVE *BLANK    WNKOJ
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C                     MOVE B4NKOJ    WNKOJ
     C                     MOVE *BLANK    WNUKE
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C                     MOVE *BLANK    WNKOJ
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C                     Z-ADD8990      WTOKU
     C                     Z-ADD8990      WNONY
     C                     SETOF                     07
     C           KYKEY     CHAINFAAPL021             07
     C           *IN07     IFEQ '0'
     C           B7SKBN    CABNE'D'       STEP08
     C                     END
     C           STEP82    TAG
     C                     MOVELNHBAN     USHIN
     C                     MOVELWMHN3     USHN3
     C                     GOTO STEP09
     C           STEP08    TAG
     C                     MOVE B7SHN1    USHN1
     C                     MOVE B7SHN2    USHN2
     C                     MOVE B7SHN3    USHN3
     C           STEP09    TAG
     C******************************************************
     C* M-NO AA.2.2.4.1    f]ﾌﾞ]ﾍgnﾒxbﾅb xbﾅbOUT ﾆﾞﾏ]ﾍﾞ    *
     C******************************************************
     C           HKEY      KLIST
     C                     KFLD           USHN1
     C                     KFLD           USHN2
     C                     KFLD           USHN3
     C                     MOVE 'S'       UBAN1
     C                     MOVE 'ﾌﾞ'      UBAN2
     C                     MOVE ']k'      UBAN3
     C                     MOVE *BLANK    UBAN4
     C                     SETOF                     13
     C           HKEY      CHAINFCEPL011             13
     C   13                GOTO STEP04
     C           A2GSKD    CABEQ'D'       STEP04
     C           A2TEHI    IFEQ 'G'
     C           WNOBI     IFLT TRHIZ
     C                     MOVE A2KTRK    UBAN1   1
     C                     MOVE A2KTRT    UBAN2   2
     C                     MOVE A2KTRR    UBAN3   2
     C                     MOVE A2KTRD    UBAN4   1
     C                     ELSE
     C                     MOVE A2STRK    UBAN1
     C                     MOVE A2STRT    UBAN2
     C                     MOVE A2STRR    UBAN3
     C                     MOVE A2STRD    UBAN4
     C                     END
     C                     ELSE
     C                     MOVE 'Z'       UBAN1
     C                     MOVE 'ﾌﾞ'      UBAN2
     C                     MOVE ']k'      UBAN3
     C                     MOVE *BLANK    UBAN4
     C                     END
     C           STEP04    TAG
     C           B4MHN3    IFEQ *BLANK
     C                     MOVE *BLANK    UMHN3   5
     C                     MOVE *BLANK    F1      1
     C                     ELSE
     C                     MOVELB4MHN3    UMHN3
     C                     MOVE '-'       F1
     C                     END
     C           B4TOKU    IFNE B4NONY
     C                     MOVE B4TOKU    LTOKU   4
     C                     ELSE
     C                     MOVE *BLANK    LTOKU
     C                     END
     C           WNOBI     IFLT SHIZK
     C                     Z-ADDB4OSRO    WSYUY   50
     C                     MOVE B4OTNI    TANI    1
     C                     ELSE
     C                     Z-ADDB4NSRO    WSYUY
     C                     MOVE B4NTNI    TANI
     C                     END
     C                     MOVELB4KANR    KBAN   10
     C           *IN02     IFEQ '1'
     C                     Z-ADDB4KSRO    WSRYO   70
     C                     MOVELB4KNBS    WNBAN   7
     C                     Z-ADDB4KNMI    HAKO    30
     C                     Z-ADDB4KINP    ISYUY   50
     C                     ELSE
     C           *IN03     IFEQ '1'
     C                     Z-ADDB4GSRO    WSRYO
     C                     MOVELB4GNBN    WNBAN
     C                     Z-ADDB4GKMI    HAKO
     C                     Z-ADDB4GINP    ISYUY
     C                     END
     C                     END
     C           B4RUIK    ADD  WSRYO     WRUIK   80       ﾓbib
     C           HAKO      ADD  UTOT      UTOT    40
     C           HAKO      ADD  KTOT      KTOT    40
     C                     EXCPTMS
     C   OF                EXCPTHD
     C   OF                EXCPTCM1
     C   OF                EXCPTCM2
     C                     SETOF                     OF
     C                     GOTO STEP01
     C******************************************************
     C* M-NO AA.2.2.5      f]ﾌﾞ]ﾍgnﾒxbﾅb END ﾆﾑﾒ           *
     C******************************************************
     C           STEP02    TAG
     C                     EXCPTTO1
     C                     EXCPTTO2
     C                     EXCPTCM1
     C                     EXCPTCM2
     C           END       TAG
     C                     SETON                     LR
     C******************************************************
     C* M-NO AA            ﾆﾏlf j]ncﾆz INPUT ﾅﾎﾞﾓ-k]       *
     C******************************************************
     C           SKYU      BEGSR
     C           SKEY      KLIST
     C                     KFLD           B4TOKU
     C                     KFLD           B4NONY
     C                     KFLD           B4NKOJ
     C                     KFLD           B4NUKE
     C                     MOVE *BLANK    TANA    3
     C                     Z-ADD0         TANT    40
     C           SKEY      CHAINGADPL111             10
     C  N10      B5SKJY    CABEQ'D'       STEP11
     C                     Z-ADDB5TANT    TANT
     C           WUBIN     IFEQ 1
     C                     MOVE B51TNA    TANA
     C                     ELSE
     C           WUBIN     IFEQ 2
     C                     MOVE B52TNA    TANA
     C                     ELSE
     C           WUBIN     IFEQ 3
     C                     MOVE B53TNA    TANA
     C                     ELSE
     C           WUBIN     IFEQ 4
     C                     MOVE B54TNA    TANA
     C                     ELSE
     C                     MOVE *BLANK    TANA
     C                     END
     C                     END
     C                     END
     C                     END
     C           STEP11    TAG
     C                     SETOF                     11
     C           TANT      CHAINFAEPL011             11
     C           *IN11     IFEQ '0'
     C                     MOVELG1TMEI    TMEI   15
     C                     ELSE
     C                     MOVE *BLANK    TMEI
     C                     END
     C                     ENDSR
     OQPRINT  E  202           HD
     O                                  101 '納品書区分'
     O                         NCMT     111
     O                         PAGE  Z  126
     O                         PAGE1 Z  132
     O        E  1             HD
     O                         UNONY     14
     O                         NMEI      32
     O                         WYY   Z  102
     O                         WMM   Z  106
     O                         WDD   Z  110
     O                         UYEAR Z  123
     O                         UMONTHZ  127
     O                         UDAY  Z  131
     O        E     09         HD
     O                                  121 '時刻'
     O                         WTIME Y  131
     O        E  2             MS
     O                         UBAN1      6
     O                                    7 '-'
     O                         UBAN2      9
     O                                   10 '-'
     O                         UBAN3     12
     O                                   13 '-'
     O                         UBAN4     14
     O                         TANA      22
     O                         KBAN      33
     O                                   35 '1'
     O                                   37 'A'
     O                         LTOKU     42
     O                         B4SBAN    54
     O                         B4NKOJ    44
     O                         B4NUKE    49
     O                         B4MHN1    66
     O                                   67 '-'
     O                         B4MHN2    72
     O                         F1        73
     O                         UMHN3     78
     O                         ISYUY 2  101
     O                         TANI     104
     O                         HAKO  Z  108
     O                         WNBAN    119
     O        E  1             TO1
     O                                  101 '受入・合計'
     O                         UTOT   B 108 ' , * '
     O        E  1             TO2
     O                                  101 '工場・合計'
     O                         KTOT   B 108 ' , * '
     O        E   63           CM1
     O                         UNONY    112
     O                         NMEI     128
     O        E   65           CM2
     O                         TANT     112
     O                         TMEI     128
