     H            Y.
     F********************************************
     F*  INQUIRY OF UNDELIVERED INFORMATION (COMPLETION STORAGE)  AUBR57  *
     F*                      M S K 87.05.15 *
     F********************************************
     FAUBPW57 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                        RRN2  KSFILE SFL02
     F                                        RRN3  KSFILE SFL03
     F                                        RRN4  KSFILE SFL04
     F                                        RRN5  KSFILE SFL05
     FAS#TL16 IF  E           K        DISK
     FAS#TL17 IF  E           K        DISK
     FAH#TL17 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FAAFTL01 IF  E           K        DISK
     FAAGTL01 IF  E           K        DISK
     FAAHTL01 IF  E           K        DISK
     FAAPTL01 IF  E           K        DISK
     FAUBPR57 O   E             91     PRINTER                        UC
     E                    $MSG    1   6 60
     I            DS
     I                                        1   4 NYY
     I                                        5   5 NDT1
     I                                        6   7 NMM
     I                                        8   8 NDT2
     I                                        9  10 NDD
     I                                       11  13 NDT3
     I                                       14  15 NBB
     I                                        1  15 WK01
     I            DS
     I                                        3  10 @KENSY
     I                                        1   4 KNYY
     I                                        5   5 KNT1
     I                                        6   7 KNMM
     I                                        8   8 KNT2
     I                                        9  10 KNDD
     I            DS
     I                                        1   9 WKANBA
     I                                        1   1 @WA1
     I                                        2   2 @WB1
     I                                        3   4 @WA2
     I                                        5   5 @WB2
     I                                        6   7 @WA3
     I                                        8   8 @WB3
     I                                        9   9 @WA4
     I            DS
     I                                        1   80CUBNHZ
     I                                        9  100CUBNBB
     I                                        1  100MINOU
     I                                        1   80@NKHZ
     I            DS
     I                                        1   80CUSMHZ
     I                                        9  100CUSMBB
     I                                        1  100MSAI
     I            DS
     I                                        1   80CUMKHZ
     I                                        9  100CUMKBB
     I                                        1  100WKMKHZ
     I            DS
     I                                        1   40WNY
     I                                        5   5 WT1
     I                                        6   70WNM
     I                                        8   8 WT2
     I                                        9  100WND
     I                                       11  11 WT3
     I                                       12  130WMB
     I                                        3  13 @NYUNE
     I            DS
     I                                        1   4 WKY
     I                                        5   5 WKH1
     I                                        6   7 WKM
     I                                        8   8 WKH2
     I                                        9  10 WKD
     I                                       11  11 WKH3
     I                                       12  13 WKB
     I                                        1  13 WK02
     I            DS
     I                                        1   5 WHN1
     I                                        6   6 WB1
     I                                        7  11 WHN2
     I                                       12  12 WB2
     I                                       13  14 WHN3
     I                                        1  14 WKHIN
     I            DS
     I                                        1   4 SGY1
     I                                        5   5 WBAR1
     I                                        6   8 SGY2
     I                                        1   8 @SGYOU
     I                                        9   9 WBAR2
     I                                       10  10 SGY3
     I                                        1  10 @SAGYO
     I            DS
     I                                        1   40WY
     I                                        5   60WM
     I                                        7   80WD
     I                                        9  100WB
     I                                        1   80WYMD
     I                                        1  100WYMDB
     I            DS
     I                                        1   40WWY
     I                                        5   5 WWH1
     I                                        6   70WWM
     I                                        8   8 WWH2
     I                                        9  100WWD
     I                                        1  10 WK03
     C           *ENTRY    PLIST
     C                     PARM           PARM1  10
     C                     PARM           PARM2   1
     C*-------------------*
     C* K L I S T         *
     C*-------------------*
     C           #KEY      KLIST
     C                     KFLD           #KBAN   1
     C                     KFLD           #YEAR   40
     C                     KFLD           #MONT   20
     C                     KFLD           #DAY    20
     C           #KEY2     KLIST
     C                     KFLD           #HIN1   5
     C                     KFLD           #HIN2   5
     C                     KFLD           #HIN3   2
     C           #KEY1     KLIST
     C                     KFLD           #KBAN   1
     C                     KFLD           #YEAR   40
     C                     KFLD           #MONT   20
     C                     KFLD           #DAY    20
     C                     KFLD           #BIN    20
     C*-------------------------------------*
     C*   ﾆｭg ﾆﾑﾒ                           *
     C*-------------------------------------*
     C                     TIME           @TIME
     C                     Z-ADD*DATE     @DATE
     C                     MOVE *YEAR     @YY
     C                     MOVE UMONTH    @MM
     C                     MOVE UDAY      @DD
     C                     MOVE *ZERO     @BB
     C                     MOVE 'B'       @JOKEN
     C                     MOVE 'N'       @YN
     C                     MOVE 'N'       @PRINT
     C                     MOVEL*YEAR     WKHYM   60
     C                     MOVE UMONTH    WKHYM
     C                     MOVELWKHYM     WKHYMD  80
     C                     MOVE UDAY      WKHYMD
     C*----------------------------------------------------*
     C*   jﾞbbk fﾞx] ﾆﾑﾒ                                   *
     C*----------------------------------------------------*
     C           $100S     TAG
     C                     EXFMTAUBPW571
     C                     MOVE *BLANK    @ERR
     C                     SETOF                     101112
     C                     SETOF                     131415
     C                     SETOF                     99
     C                     MOVE @YY       WY
     C                     MOVE @MM       WM
     C                     MOVE @DD       WD
     C                     MOVE @BB       WB
     C           *INKA     IFEQ '1'
     C                     SETON                       LR
     C                     RETRN
     C                     END
     C           *INKC     IFEQ '1'
     C                     MOVE '3'       PARM2
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*-------------------*
     C*  ﾈ]jh kｩｮh        *
     C*-------------------*
     C           @KBAN     IFNE 'A'
     C           @KBAN     IFNE 'B'
     C           @KBAN     IFNE 'C'
     C                     SETON                       1099
     C                     MOVEL$MSG,1    @ERR
     C                     GOTO $100S
     C                     END
     C                     END
     C                     END
     C*-------------------*
     C*  ﾆﾞｭci]ﾉ kｩｮh     *
     C*-------------------*
     C           @JOKEN    IFNE 'A'
     C           @JOKEN    IFNE 'B'
     C           @JOKEN    IFNE 'C'
     C                     MOVEL$MSG,2    @ERR
     C                     SETON                     1399
     C                     GOTO $100S
     C                     END
     C                     END
     C                     END
     C           @JOKEN    IFEQ 'A'
     C           @JOKEN    OREQ 'B'
     C           WYMD      IFEQ *ZERO
     C                     SETON                       1299
     C                     MOVEL$MSG,3    @ERR
     C                     GOTO $100S
     C                     END
     C                     END
     C*-------------------*
     C*  Y N kｩｮh         *
     C*-------------------*
     C           @YN       IFNE 'Y'
     C           @YN       IFNE 'N'
     C                     SETON                       1499
     C                     MOVEL$MSG,4    @ERR
     C                     GOTO $100S
     C                     END
     C                     END
     C           @PRINT    IFNE 'Y'
     C           @PRINT    IFNE 'N'
     C                     SETON                       1599
     C                     MOVEL$MSG,4    @ERR
     C                     GOTO $100S
     C                     END
     C                     END
     C                     MOVE @YY       #YEAR
     C                     MOVE @MM       #MONT
     C                     MOVE @DD       #DAY
     C                     MOVE @BB       #BIN
     C           @KBAN     IFEQ 'A'
     C                     MOVE 'C'       #KBAN
     C                     END
     C           @KBAN     IFEQ 'B'
     C                     MOVE 'D'       #KBAN
     C                     END
     C           @KBAN     IFEQ 'C'
     C                     MOVE 'E'       #KBAN
     C                     END
     C           @PRINT    IFEQ 'Y'
     C                     MOVEA'000'     *IN,80
     C                     SETOF                         34
     C                     MOVE *BLANK    PSW1
     C           @KBAN     IFEQ 'A'
     C           @BB       IFEQ *ZERO
     C           #KEY      SETLLAS#TL161
     C                     ELSE
     C           #KEY1     SETLLAS#TL161
     C                     END
     C                     END
     C           @KBAN     IFEQ 'B'
     C           @BB       IFEQ *ZERO
     C           #KEY      SETLLAS#TL171
     C                     ELSE
     C           #KEY1     SETLLAS#TL171
     C                     END
     C                     END
     C           @KBAN     IFEQ 'C'
     C           @BB       IFEQ *ZERO
     C           #KEY      SETLLAH#TL171
     C                     ELSE
     C           #KEY1     SETLLAH#TL171
     C                     END
     C                     END
     C           PARM2     DOWEQ' '
     C                     EXSR $SB500
     C           PARM2     IFEQ *BLANK
     C                     EXSR $SB600
     C                     END
     C                     END
     C                     MOVE *BLANK    PARM2
     C                     MOVE *BLANK    @PRINT
     C                     END
     C/SPACE 1
     C                     MOVE *BLANK    PARM2
     C                     Z-ADD*ZERO     X
     C                     Z-ADD*ZERO     CTRX
     C*---------------------------------------*
     C* fhﾓｰk] sﾉ ﾎﾞ]gﾆｭﾒ                     *
     C*---------------------------------------*
     C           PARM2     DOWEQ' '
     C           @KBAN     IFEQ 'A'
     C                     MOVE 'C'       #KBAN
     C                     EXSR $SB100
     C           *IN99     CABEQ'1'       $100S
     C                     END
     C           @KBAN     IFEQ 'B'
     C                     MOVE 'D'       #KBAN
     C                     EXSR $SB200
     C           *IN99     CABEQ'1'       $100S
     C                     END
     C           @KBAN     IFEQ 'C'
     C                     MOVE 'E'       #KBAN
     C                     EXSR $SB300
     C           *IN99     CABEQ'1'       $100S
     C                     END
     C                     END
     C*
     C           PARM2     IFEQ '9'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C           PARM2     IFEQ '3'
     C           PARM2     OREQ '5'
     C                     MOVE *BLANK    @KBAN
     C                     MOVE *YEAR     @YY
     C                     MOVE UMONTH    @MM
     C                     MOVE UDAY      @DD
     C                     MOVE *ZERO     @BB
     C                     MOVE 'B'       @JOKEN
     C                     MOVE 'N'       @YN
     C                     MOVE 'N'       @PRINT
     C                     MOVE *BLANK    PARM2
     C                     SETOF                     99
     C                     SETON                     70
     C                     WRITESFLCT1
     C                     WRITESFLCT2
     C                     WRITESFLCT3
     C                     WRITESFLCT4
     C                     WRITESFLCT5
     C                     SETOF                     70
     C                     GOTO $100S
     C                     END
     C                     GOTO $100S
     C*-------------------------------------*
     C*  xｮgf]ﾌﾞ]ﾉ ﾆｭﾒ      'A'             *
     C*-------------------------------------*
     CSR         $SB100    BEGSR
     C                     SETOF                         80
     C                     Z-ADD*ZERO     RRN1    40
     C                     Z-ADD*ZERO     RRN2    40
     C                     Z-ADD*ZERO     X
     C                     Z-ADD1         SFLRC1
     C                     Z-ADD1         SFLRC2
     C           @BB       IFEQ *ZERO
     C           #KEY      SETLLAS#TL161
     C                     ELSE
     C           #KEY1     SETLLAS#TL161
     C                     END
     C           READ      TAG
     C                     EXSR $SB500
     C           *IN80     CABEQ'1'       DSPLAY
     C                     ADD  1         X       20
     C                     ADD  1         RRN1
     C                     ADD  1         RRN2
     C                     ADD  1         CTRX    40
     C*-------------------------------------*
     C*  ﾅﾎﾞﾎｦbﾓ fgﾃv  ﾆｭﾒ                  *
     C*-------------------------------------*
     C           @YY       IFNE *ZERO
     C                     MOVE @YY       NYY
     C                     MOVE '.'       NDT1
     C                     MOVE @MM       NMM
     C                     MOVE '.'       NDT2
     C                     MOVE @DD       NDD
     C                     ELSE
     C                     MOVE *BLANK    WK01
     C                     END
     C           @BB       IFEQ *ZERO
     C                     MOVE *BLANK    NBB
     C                     MOVE *BLANK    NDT3
     C                     ELSE
     C                     MOVE ' - '     NDT3
     C                     MOVE @BB       NBB
     C                     END
     C                     MOVE WK01      @NYUKO
     C** pｬcﾃﾍﾞ **
     C           CUMKYY    IFNE *ZERO
     C                     MOVE CUMKYY    NYY
     C                     MOVE '.'       NDT1
     C                     MOVE CUMKMM    NMM
     C                     MOVE '.'       NDT2
     C                     MOVE CUMKDD    NDD
     C                     MOVE ' - '     NDT3
     C                     MOVE CUMKBB    NBB
     C                     ELSE
     C                     MOVE *BLANK    WK01
     C                     END
     C                     MOVE WK01      @YMD1
     C** ﾍ]ﾌﾞ] **
     C                     MOVE CUHIN1    WHN1
     C                     MOVE '-'       WB1
     C                     MOVE CUHIN2    WHN2
     C                     MOVE CUHIN3    WHN3
     C           CUHIN3    IFEQ *BLANK
     C                     MOVE *BLANK    WB2
     C                     ELSE
     C                     MOVE '-'       WB2
     C                     END
     C                     MOVE WKHIN     @HBAN
     C** ﾎﾞy] 1,2 **
     C                     MOVE CUBMON    @BMON1           *udﾃcmb
     C           CUKAKO    IFNE *ZERO
     C                     MOVE CUKAKO    @BMON2           *xｮg
     C                     ELSE
     C                     MOVE *BLANK    @BMON2
     C                     END
     C** ﾅbﾉcpｬcﾍﾞ **
     C           CUSMYY    IFNE *ZERO
     C                     MOVE CUSMYY    WKY
     C                     MOVE '.'       WKH1
     C                     MOVE CUSMMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CUSMDD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CUSMBB    WKB
     C                     ELSE
     C                     MOVE *BLANK    WK02
     C                     END
     C                     MOVE WK02      @YMD2
     C** ﾎﾞ]flﾌﾃﾇc 1,2 **
     C                     MOVE CUBSU1    @HAKO1
     C                     MOVE CUBSU2    @HAKO2
     C** ﾌﾞ]fbﾍﾞ **
     C           CUBNYY    IFNE *ZERO
     C                     MOVE CUBNYY    WKY
     C                     MOVE '.'       WKH1
     C                     MOVE CUBNMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CUBNDD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CUBNBB    WKB
     C                     ELSE
     C                     MOVE *BLANK    WK02
     C                     END
     C                     MOVE WK02      @YMD3
     C*------ i]ﾆｬciｮf ------*
     C** pｬcﾃﾍﾞ, ﾍ]ﾌﾆﾞ] **
     C                     MOVE @YMD1     @HIZK1
     C                     MOVE @HBAN     @HINBA
     C** ﾌﾃﾇc **
     C                     MOVE CUHAKM    @HAKS1
     C** i]ﾆｬcﾍﾞ **
     C           CUKNYY    IFNE *ZERO
     C                     MOVE CUKNYY    WWY
     C                     MOVE '.'       WWH1
     C                     MOVE CUKNMM    WWM
     C                     MOVE '.'       WWH2
     C                     MOVE CUKNDD    WWD
     C                     ELSE
     C                     MOVE *BLANK    WK03
     C                     END
     C                     MOVE WK03      @KENSY
     C** ibﾒｭcﾃﾞﾌﾃﾇc, ﾌﾇc **
     C                     MOVE CURKHK    @HAKS2
     C                     MOVE CURHSU    @HASU1
     C** ﾎﾒｭcﾎﾞy] ﾌﾃﾇc, ﾌﾇc **
     C           CUFSRY    DIV  CUSYUY    SYOU    30
     C                     MVR            SEKI    50
     C                     MOVE SYOU      @HAKS3
     C                     MOVE SEKI      @HASU2
     C                     WRITESFL01
     C                     WRITESFL02
     C/SPACE 1
     C           X         CABNE15        READ
     C           DSPLAY    TAG
     C           CTRX      IFEQ *ZERO
     C                     SETON                       99
     C                     MOVEL$MSG,5    @ERR
     C                     GOTO $100E
     C                     END
     C*-------------------*
     C* jﾞb1 SFL ﾍﾑcﾆﾞ    *
     C*-------------------*
     C           $200S     TAG
     C                     SETON                     307131
     C                     WRITEAUBPW999
     C                     EXFMTSFLCT1
     C                     SETOF                       71
     C                     SETOF                       99
     C                     MOVE *BLANK    @ERR
     C*===== ROLL UP =====*
     C           *IN51     IFEQ '1'
     C           *IN80     IFEQ '0'
     C                     MOVE *BLANK    @ERR
     C                     MOVE *BLANK    @NYUKO
     C                     MOVE *BLANK    @YMD1
     C                     MOVE *BLANK    @YMD2
     C                     MOVE *BLANK    @YMD3
     C                     MOVE *BLANK    @HBAN
     C                     MOVE *BLANK    @HIZK1
     C                     MOVE *BLANK    @BMON1
     C                     MOVE *BLANK    @BMON2
     C                     MOVE *BLANK    @HINBA
     C                     MOVE *BLANK    @KENSY
     C                     MOVE *ZERO     @HAKO1
     C                     MOVE *ZERO     @HAKO2
     C                     MOVE *ZERO     @HAKS1
     C                     MOVE *ZERO     @HAKS2
     C                     MOVE *ZERO     @HAKS3
     C                     MOVE *ZERO     @HASU1
     C                     MOVE *ZERO     @HASU2
     C                     MOVE *ZERO     @BMON
     C                     Z-ADD*ZERO     X
     C           RRN1      ADD  1         SFLRC1
     C           RRN2      ADD  1         SFLRC2
     C                     GOTO READ
     C                     ELSE
     C                     SETON                     99
     C                     MOVEL$MSG,6    @ERR
     C                     GOTO $200S
     C                     END
     C                     END
     C** CMD-1 **
     C           *INKA     IFEQ '1'
     C                     MOVE '9'       PARM2
     C                     SETON                       LR
     C                     RETRN
     C                     END
     C** CMD-3 **
     C           *INKC     IFEQ '1'
     C                     MOVE '3'       PARM2
     C                     SETON                     70
     C                     WRITESFLCT1
     C                     WRITESFLCT2
     C                     SETOF                     70
     C                     MOVE *BLANK    @PRINT
     C                     MOVE *BLANK    @JOKEN
     C                     MOVE *BLANK    @YN
     C                     GOTO $100E
     C                     END
     C           *INKG     IFEQ '1'
     C                     GOTO $210S
     C                     END
     C                     GOTO $200S
     C*-------------------*
     C* jﾞb 2 SFL ﾍﾑcﾆﾞ   *
     C*-------------------*
     C           $210S     TAG
     C                     SETOF                     3031
     C                     SETON                     7132
     C                     WRITEAUBPW999
     C                     EXFMTSFLCT2
     C                     SETOF                     71
     C           *INKG     IFEQ '1'
     C                     SETOF                     9932
     C                     SETON                     3031
     C                     GOTO $200S
     C                     END
     C                     GOTO $210S
     CSR         $100E     ENDSR
     C*-------------------------------------*
     C*  n]rﾓf]ﾌﾞ]ﾉ ﾆｭﾒ     'B'             *
     C*-------------------------------------*
     CSR         $SB200    BEGSR
     C                     SETOF                         81
     C                     Z-ADD*ZERO     RRN3    40
     C                     Z-ADD*ZERO     RRN4    40
     C                     Z-ADD*ZERO     X
     C                     Z-ADD1         SFLRC3
     C                     Z-ADD1         SFLRC4
     C           @BB       IFEQ *ZERO
     C           #KEY      SETLLAS#TL171
     C                     ELSE
     C           #KEY1     SETLLAS#TL171
     C                     END
     C           READ1     TAG
     C                     EXSR $SB500
     C           *IN81     CABEQ'1'       DSP2
     C                     ADD  1         X
     C                     ADD  1         RRN3
     C                     ADD  1         RRN4
     C                     ADD  1         CTRX
     C*-------------------------------------*
     C*  ﾅﾎﾞﾎｦbﾓ fgﾃv  ﾆｭﾒ                  *
     C*-------------------------------------*
     C           @YY       IFNE *ZERO
     C                     MOVE @YY       NYY
     C                     MOVE '.'       NDT1
     C                     MOVE @MM       NMM
     C                     MOVE '.'       NDT2
     C                     MOVE @DD       NDD
     C                     ELSE
     C                     MOVE *BLANK    WK01
     C                     END
     C                     MOVE @BB       NBB
     C           @BB       IFEQ *ZERO
     C                     MOVE *BLANK    NDT3
     C                     MOVE *BLANK    NBB
     C                     ELSE
     C                     MOVE ' - '     NDT3
     C                     END
     C                     MOVE WK01      @NYUKO
     C** pｬcﾃﾍﾞ **
     C                     MOVE CUKAYY    NYY
     C           NYY       IFEQ '0000'
     C                     MOVE *BLANK    WK01
     C                     ELSE
     C                     MOVE '.'       NDT1
     C                     MOVE CUKAMM    NMM
     C                     MOVE '.'       NDT2
     C                     MOVE CUKADD    NDD
     C                     MOVE ' - '     NDT3
     C                     MOVE CUKABB    NBB
     C                     MOVE WK01      @YMD1
     C                     END
     C** ﾍ]ﾌﾞ] **
     C                     MOVE CUHIN1    WHN1
     C                     MOVE '-'       WB1
     C                     MOVE CUHIN2    WHN2
     C                     MOVE CUHIN3    WHN3
     C           CUHIN3    IFEQ *BLANK
     C                     MOVE *BLANK    WB2
     C                     ELSE
     C                     MOVE '-'       WB2
     C                     END
     C                     MOVE WKHIN     @HBAN
     C** ﾎﾞy] 1,2,3 **
     C                     MOVE CUBMON    @BMON1           *udﾃcmb
     C           CUKAKO    IFNE *ZERO
     C                     MOVE CUKAKO    @BMON2           *xｮg
     C                     ELSE
     C                     MOVE *BLANK    @BMON2
     C                     END
     C           CUKAKO    IFNE *ZERO
     C                     MOVE CUBMN2    @BMON3           *2ﾆﾞfﾃc
     C                     ELSE
     C                     MOVE *BLANK    @BMON3
     C                     END
     C** ﾅbﾉcpｬcﾍﾞ **
     C                     MOVE CUKSYY    WKY
     C           WKY       IFEQ '0000'
     C                     MOVE CUKAYY    WKY
     C                     MOVE '.'       WKH1
     C                     MOVE CUKAMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CUKADD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CUKABB    WKB
     C                     ELSE
     C                     MOVE CUKSYY    WKY
     C                     MOVE '.'       WKH1
     C                     MOVE CUKSMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CUKSDD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CUKSBB    WKB
     C                     END
     C                     MOVE WK02      @YMD2
     C** ﾌﾃﾇc  **
     C                     MOVE CUHAKM    @HAKSU
     C** ﾌﾞ]fbﾍﾞ **
     C                     MOVE CUBNYY    WKY
     C           WKY       IFEQ '0000'
     C                     MOVE *BLANK    WK02
     C                     ELSE
     C                     MOVE '.'       WKH1
     C                     MOVE CUBNMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CUBNDD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CUBNBB    WKB
     C                     END
     C                     MOVE WK02      @YMD3
     C*------ i]ﾆｬciｮf ------*
     C** pｬcﾃﾍﾞ, ﾍ]ﾌﾞ] **
     C                     MOVE @YMD1     @HIZK1
     C                     MOVE @HBAN     @HINBA
     C** ﾌﾃﾇc **
     C                     MOVE CUHAKM    @HAKS1
     C** i]ﾆｬcﾍﾞ **
     C           CUKNYY    IFNE *ZERO
     C                     MOVE CUKNYY    WWY
     C                     MOVE '.'       WWH1
     C                     MOVE CUKNMM    WWM
     C                     MOVE '.'       WWH2
     C                     MOVE CUKNDD    WWD
     C                     ELSE
     C                     MOVE *BLANK    WK03
     C                     END
     C                     MOVE WK03      @KENSY
     C** ibﾒｭcﾃﾞﾌﾃﾇc, ﾌﾇc **
     C                     MOVE CURKHK    @HAKS2
     C                     MOVE CURHSU    @HASU1
     C** ﾎﾒｭcﾎﾞy] ﾌﾃﾇc, ﾌﾇc **
     C           CUFSRY    DIV  CUSYUY    SYOU    30
     C                     MVR            SEKI    50
     C                     MOVE SYOU      @HAKS3
     C                     MOVE SEKI      @HASU2
     C                     WRITESFL03
     C                     WRITESFL04
     C/SPACE 1
     C           X         CABNE15        READ1
     C           DSP2      TAG
     C           CTRX      IFEQ *ZERO
     C                     SETON                       99
     C                     MOVEL$MSG,5    @ERR
     C                     GOTO $200E
     C                     END
     C*-------------------*
     C* jﾞb3 SFL ﾍﾑcﾆﾞ    *
     C*-------------------*
     C           $A200S    TAG
     C                     SETON                     307131
     C                     WRITEAUBPW999
     C                     EXFMTSFLCT3
     C                     SETOF                       71
     C                     SETOF                       99
     C                     MOVE *BLANK    @ERR
     C*===== ROLL UP =====*
     C           *IN51     IFEQ '1'
     C           *IN81     IFEQ '0'
     C                     MOVE *BLANK    @ERR
     C                     MOVE *BLANK    @NYUKO
     C                     MOVE *BLANK    @YMD1
     C                     MOVE *BLANK    @YMD2
     C                     MOVE *BLANK    @YMD3
     C                     MOVE *BLANK    @HBAN
     C                     MOVE *BLANK    @HIZK1
     C                     MOVE *BLANK    @BMON1
     C                     MOVE *BLANK    @BMON2
     C                     MOVE *BLANK    @HINBA
     C                     MOVE *BLANK    @KENSY
     C                     MOVE *ZERO     @HAKO1
     C                     MOVE *ZERO     @HAKO2
     C                     MOVE *ZERO     @HAKS1
     C                     MOVE *ZERO     @HAKS2
     C                     MOVE *ZERO     @HAKS3
     C                     MOVE *ZERO     @HASU1
     C                     MOVE *ZERO     @HASU2
     C                     MOVE *ZERO     @BMON
     C                     Z-ADD*ZERO     X
     C           RRN3      ADD  1         SFLRC3
     C           RRN4      ADD  1         SFLRC4
     C                     GOTO READ1
     C                     ELSE
     C                     SETON                     99
     C                     MOVEL$MSG,6    @ERR
     C                     GOTO $A200S
     C                     END
     C                     END
     C** CMD-1 **
     C           *INKA     IFEQ '1'
     C                     SETON                       LR
     C                     RETRN
     C                     END
     C** CMD-3 **
     C           *INKC     IFEQ '1'
     C                     MOVE '3'       PARM2
     C                     SETOF                       99
     C                     SETON                     70
     C                     WRITESFLCT3
     C                     WRITESFLCT4
     C                     SETOF                     70
     C                     MOVE *BLANK    @PRINT
     C                     MOVE *BLANK    @JOKEN
     C                     MOVE *BLANK    @YN
     C                     GOTO $200E
     C                     END
     C           *INKG     CABEQ'0'       $A200S
     C*-------------------*
     C* jﾞb 4 SFL ﾍﾑcﾆﾞ   *
     C*-------------------*
     C           $A210S    TAG
     C                     SETOF                     3031
     C                     SETON                     7132
     C                     WRITEAUBPW999
     C                     EXFMTSFLCT4
     C                     SETOF                     71
     C           *INKG     IFEQ '1'
     C                     SETOF                     9932
     C                     GOTO $A200S
     C                     END
     C                     GOTO $A210S
     CSR         $200E     ENDSR
     C*-------------------------------------*
     C*  ﾍgnﾒf]ﾌﾞ]ﾉ ﾆｭﾒ     'C'             *
     C*-------------------------------------*
     CSR         $SB300    BEGSR
     C                     SETOF                         82
     C                     Z-ADD*ZERO     RRN5    40
     C                     Z-ADD*ZERO     X
     C                     Z-ADD1         SFLRC5
     C           @BB       IFEQ *ZERO
     C           #KEY      SETLLAH#TL171
     C                     ELSE
     C           #KEY1     SETLLAH#TL171
     C                     END
     C           READ2     TAG
     C                     EXSR $SB500
     C           *IN82     CABEQ'1'       DSP3
     C                     ADD  1         X
     C                     ADD  1         RRN5
     C                     ADD  1         CTRX
     C*-------------------------------------*
     C*  ﾅﾎﾞﾎｦbﾓ fgﾃv  ﾆｭﾒ                  *
     C*-------------------------------------*
     C           @YY       IFEQ *ZERO
     C                     MOVE *BLANK    WK01
     C                     ELSE
     C                     MOVE @YY       NYY
     C                     MOVE '.'       NDT1
     C                     MOVE @MM       NMM
     C                     MOVE '.'       NDT2
     C                     MOVE @DD       NDD
     C                     END
     C           @BB       IFEQ *ZERO
     C                     MOVE *BLANK    NBB
     C                     MOVE *BLANK    NDT3
     C                     ELSE
     C                     MOVE ' - '     NDT3
     C                     MOVE @BB       NBB
     C                     END
     C                     MOVE WK01      @NYUKO
     C** pｬcﾃﾍﾞ **
     C                     MOVE CFMNYY    NYY
     C           NYY       IFEQ '0000'
     C                     MOVE *BLANK    WK01
     C                     ELSE
     C                     MOVE '.'       NDT1
     C                     MOVE CFMNMM    NMM
     C                     MOVE '.'       NDT2
     C                     MOVE CFMNDD    NDD
     C                     MOVE ' - '     NDT3
     C                     MOVE CFMNBB    NBB
     C                     MOVE WK01      @YMD1
     C                     END
     C** ﾍ]ﾌﾞ] **
     C                     MOVE CFHIN1    WHN1
     C                     MOVE '-'       WB1
     C                     MOVE CFHIN2    WHN2
     C                     MOVE CFHIN3    WHN3
     C           CFHIN3    IFEQ *BLANK
     C                     MOVE *BLANK    WB2
     C                     ELSE
     C                     MOVE '-'       WB2
     C                     END
     C                     MOVE WKHIN     @HBAN
     C** ﾎﾞy]  **
     C                     MOVE CFBMON    @BMON1           *udﾃcmb
     C** ﾌﾞ]fbﾍﾞ 1 **
     C                     MOVE CFBYY1    NYY
     C           NYY       IFEQ '0000'
     C                     MOVE *BLANK    WK01
     C                     ELSE
     C                     MOVE CFBMM1    NMM
     C                     MOVE '.'       NDT1
     C                     MOVE CFBDD1    NDD
     C                     MOVE '.'       NDT2
     C                     MOVE CFBBB1    NBB
     C                     MOVE ' - '     NDT3
     C                     END
     C           CFMNKB    IFEQ '2'
     C                     MOVE CFMNYY    NYY
     C           NYY       IFEQ '0000'
     C                     MOVE *BLANK    WK01
     C                     ELSE
     C                     MOVE '.'       NDT1
     C                     MOVE CFMNMM    NMM
     C                     MOVE '.'       NDT2
     C                     MOVE CFMNDD    NDD
     C                     MOVE ' - '     NDT3
     C                     MOVE CFMNBB    NBB
     C                     END
     C                     END
     C                     MOVE WK01      @XMD2
     C** ﾌﾃﾇc  **
     C                     MOVE CFBHK1    @HAKO1
     C           CFMNKB    IFEQ '2'
     C           CFMAIS    SUB  CFMHKO    @HAKO1
     C                     END
     C** ﾌﾞ]fbﾍﾞ 2 **
     C                     MOVE CFBYY2    NYY
     C           NYY       IFEQ '0000'
     C                     MOVE *BLANK    WK01
     C                     ELSE
     C                     MOVE '.'       NDT1
     C                     MOVE CFBMM2    NMM
     C                     MOVE '.'       NDT2
     C                     MOVE CFBDD2    NDD
     C                     MOVE '-'       NDT3
     C                     MOVE CFBBB2    NBB
     C                     END
     C           CFMNKB    IFEQ '2'
     C           CFBHZ1    IFNE *ZERO
     C           CFMHKO    IFEQ CFBHK1
     C                     MOVE CFBYY1    NYY
     C           NYY       IFEQ '0000'
     C                     MOVE *BLANK    WK01
     C                     ELSE
     C                     MOVE '.'       NDT1
     C                     MOVE CFBMM1    NMM
     C                     MOVE '.'       NDT2
     C                     MOVE CFBDD1    NDD
     C                     MOVE '-'       NDT3
     C                     MOVE CFBBB1    NBB
     C                     END
     C                     END
     C                     END
     C                     END
     C                     MOVE WK01      @XMD3
     C** ﾌﾃﾇc  **
     C           CFBHZ2    IFNE *ZERO
     C           CFMHKO    SUB  CFBHK1    @HAKO2
     C                     ELSE
     C                     MOVE *ZERO     @HAKO2
     C                     END
     C           CFMNKB    IFEQ '2'
     C           CFBHZ1    IFNE *ZERO
     C           CFMHKO    IFEQ CFBHK1
     C                     Z-ADDCFBHK1    @HAKO2
     C                     END
     C                     END
     C                     END
     C                     WRITESFL05
     C/SPACE 1
     C           X         CABNE15        READ2
     C           DSP3      TAG
     C           CTRX      IFEQ *ZERO
     C                     SETON                       99
     C                     MOVEL$MSG,5    @ERR
     C                     GOTO $300E
     C                     END
     C*-------------------*
     C* jﾞb 5 SFL ﾍﾑcﾆﾞ   *
     C*-------------------*
     C           $A300S    TAG
     C                     SETON                     3171
     C                     SETOF                     30
     C                     WRITEAUBPW999
     C                     EXFMTSFLCT5
     C                     SETOF                       71
     C                     SETOF                       99
     C*===== ROLL UP =====*
     C           *IN51     IFEQ '1'
     C           *IN82     IFEQ '0'
     C                     MOVE *BLANK    @ERR
     C                     MOVE *BLANK    @NYUKO
     C                     MOVE *BLANK    @YMD1
     C                     MOVE *BLANK    @YMD2
     C                     MOVE *BLANK    @YMD3
     C                     MOVE *BLANK    @HBAN
     C                     MOVE *BLANK    @HIZK1
     C                     MOVE *BLANK    @BMON1
     C                     MOVE *BLANK    @BMON2
     C                     MOVE *BLANK    @HINBA
     C                     MOVE *BLANK    @KENSY
     C                     MOVE *ZERO     @HAKO1
     C                     MOVE *ZERO     @HAKO2
     C                     MOVE *ZERO     @HAKS1
     C                     MOVE *ZERO     @HAKS2
     C                     MOVE *ZERO     @HAKS3
     C                     MOVE *ZERO     @HASU1
     C                     MOVE *ZERO     @HASU2
     C                     MOVE *ZERO     @BMON
     C                     Z-ADD*ZERO     X
     C                     Z-ADD*ZERO     CTRX
     C           RRN5      ADD  1         SFLRC5
     C                     GOTO READ2
     C                     ELSE
     C                     SETON                     99
     C                     MOVEL$MSG,6    @ERR
     C                     GOTO $A300S
     C                     END
     C                     END
     C** CMD-1 **
     C           *INKA     IFEQ '1'
     C                     SETON                       LR
     C                     RETRN
     C                     END
     C** CMD-3 **
     C           *INKC     IFEQ '1'
     C                     MOVE '3'       PARM2
     C                     SETOF                       99
     C                     SETON                     70
     C                     WRITESFLCT5
     C                     SETOF                     70
     C                     MOVE *BLANK    @PRINT
     C                     MOVE *BLANK    @JOKEN
     C                     MOVE *BLANK    @YN
     C                     GOTO $300E
     C                     END
     C                     GOTO $A300S
     CSR         $300E     ENDSR
     C*-------------------------------------*
     C*  READ ﾓｰk]                          *
     C*-------------------------------------*
     CSR         $SB500    BEGSR
     C           @KBAN     CABEQ'B'       RTN1
     C           @KBAN     CABEQ'C'       RTN2
     C           RETRY     TAG
     C           @JOKEN    IFEQ 'A'
     C                     READPAS#TL161                 80
     C                     END
     C           @JOKEN    IFEQ 'B'
     C           @BB       IFEQ *ZERO
     C           #KEY      READEAS#TL161                 80
     C                     ELSE
     C           #KEY1     READEAS#TL161                 80
     C                     END
     C                     END
     C           @JOKEN    IFEQ 'C'
     C                     READ AS#TL161                 80
     C                     END
     C           *IN80     CABEQ'1'       LAST
     C           CUSKJY    CABEQ'D'       RETRY
     C                     MOVE *BLANK    WKA
     C                     MOVE *BLANK    WKC
     C           @JOKEN    IFEQ 'A'
     C           @JOKEN    OREQ 'C'
     C           #KBAN     IFEQ CUKDAI
     C                     ELSE
     C                     GOTO RETRY
     C                     END
     C                     END
     C           @YN       IFEQ 'N'
     C           CUBNHZ    IFNE *ZERO
     C           WKMKHZ    IFLT MINOU
     C                     MOVE '*'       WKA     1
     C                     END
     C                     END
     C           CUSMHZ    IFNE *ZERO
     C           WKMKHZ    IFLT MSAI
     C                     MOVE '*'       WKC     1
     C                     END
     C                     END
     C           WKA       IFEQ *BLANK
     C           WKC       ANDEQ*BLANK
     C                     GOTO RETRY
     C                     END
     C                     END
     C           @YN       IFEQ 'Y'
     C           CUBNHZ    IFNE *ZERO
     C           CUMKHZ    IFEQ *DATE
     C           CUBNHZ    ANDEQ*DATE
     C           CUMKBB    IFLT CUBNBB
     C                     MOVE '*'       WKA
     C                     END
     C                     END
     C           CUMKHZ    IFLE *DATE
     C           CUBNHZ    ANDGE*DATE
     C                     MOVE '*'       WKA
     C                     END
     C                     END
     C           CUBNHZ    IFEQ *DATE
     C           CUMKHZ    ANDEQ*DATE
     C           CUMKBB    ANDEQCUBNBB
     C                     MOVE *BLANK    WKA
     C                     END
     C           CUSMHZ    IFNE *ZERO
     C           CUMKHZ    IFEQ *DATE
     C           CUSMHZ    ANDEQ*DATE
     C           CUMKBB    IFLT CUSMBB
     C                     MOVE '*'       WKC
     C                     END
     C                     END
     C           CUMKHZ    IFLE *DATE
     C           CUSMHZ    ANDGE*DATE
     C                     MOVE '*'       WKC
     C                     END
     C                     END
     C           CUSMHZ    IFEQ *DATE
     C           CUMKHZ    ANDEQ*DATE
     C           CUMKBB    ANDEQCUSMBB
     C                     MOVE *BLANK    WKC
     C                     END
     C           WKA       IFEQ *BLANK
     C           WKC       ANDEQ*BLANK
     C                     GOTO RETRY
     C                     END
     C                     END
     C                     GOTO LAST
     C***  B ***
     C           RTN1      TAG
     C           @JOKEN    IFEQ 'A'
     C                     READPAS#TL171                 81
     C                     END
     C           @JOKEN    IFEQ 'B'
     C           @BB       IFEQ *ZERO
     C           #KEY      READEAS#TL171                 81
     C                     ELSE
     C           #KEY1     READEAS#TL171                 81
     C                     END
     C                     END
     C           @JOKEN    IFEQ 'C'
     C                     READ AS#TL171                 81
     C                     END
     C           *IN81     CABEQ'1'       LAST
     C           CUSKJY    CABEQ'D'       RTN1
     C                     MOVE *BLANK    WKA
     C                     MOVE *BLANK    WKC
     C           @JOKEN    IFEQ 'A'
     C           @JOKEN    OREQ 'C'
     C           #KBAN     IFEQ CUKDAI
     C                     ELSE
     C                     GOTO RTN1
     C                     END
     C                     END
     C           @YN       IFEQ 'N'
     C           CUKSHZ    IFNE *ZERO
     C           CUKAHZ    IFLT CUKSHZ
     C                     MOVE '*'       WKA
     C                     END
     C                     END
     C           CUBNHZ    IFNE *ZERO
     C           CUMKHZ    IFLT CUBNHZ
     C                     MOVE '*'       WKC
     C                     END
     C                     END
     C           WKA       IFEQ *BLANK
     C           WKC       ANDEQ*BLANK
     C                     GOTO RTN1
     C                     END
     C                     END
     C           @YN       IFEQ 'Y'
     C           CUKSHZ    IFNE *ZERO
     C           CUKAHZ    IFLT *DATE
     C           CUKSHZ    ANDGT*DATE
     C                     MOVE '*'       WKA
     C                     END
     C                     END
     C           CUBNHZ    IFNE *ZERO
     C           *DATE     IFEQ CUKSHZ
     C                     ELSE
     C           CUKSHZ    IFEQ *ZERO
     C           *DATE     IFEQ CUKAHZ
     C                     MOVE '*'       WKC
     C                     END
     C                     END
     C                     END
     C                     END
     C           WKA       IFEQ *BLANK
     C           WKC       ANDEQ*BLANK
     C                     GOTO RTN1
     C                     END
     C                     END
     C                     GOTO LAST
     C***  C ***
     C           RTN2      TAG
     C           @JOKEN    IFEQ 'A'
     C                     READPAH#TL171                 82
     C                     END
     C           @JOKEN    IFEQ 'B'
     C           @BB       IFEQ *ZERO
     C           #KEY      READEAH#TL171                 82
     C                     ELSE
     C           #KEY1     READEAH#TL171                 82
     C                     END
     C                     END
     C           @JOKEN    IFEQ 'C'
     C                     READ AH#TL171                 82
     C                     END
     C           *IN82     CABEQ'1'       LAST
     C           CFSKJY    CABEQ'D'       RTN2
*****************発行区分'*'だったら除外 1995/02/03 *************
*    C           CFOFFL    IFEQ '*'                                 *
*    C                     GOTO RTN2                                *
*    C                     END                                      *
*********************************************************************
     C                     MOVE *BLANK    WKA
     C                     MOVE *BLANK    WKC
     C           @JOKEN    IFEQ 'A'
     C           @JOKEN    OREQ 'C'
     C           #KBAN     IFEQ CFKDAI
     C                     ELSE
     C                     GOTO RTN2
     C                     END
     C                     END
     C           @YN       IFEQ 'Y'
     C           CFMNKB    IFEQ '1'
     C           CFMNKB    OREQ '2'
     C           CFMNKB    IFEQ '1'
     C           CFBHZ1    IFNE *ZERO
     C           CFBHK1    ADD  CFBHK2    WHAKO   20
     C           WHAKO     IFEQ CFMAIS
     C                     GOTO RTN2
     C                     ELSE
     C           CFBHZ2    IFNE *ZERO
     C                     GOTO RTN2
     C                     END
     C                     END
     C                     END
     C                     END
     C*
     C           CFMNKB    IFEQ '2'
     C           CFBHZ1    IFNE *ZERO
     C           CFMHKO    SUB  CFBHK1    WHAKO
     C           WHAKO     IFEQ *ZERO
     C                     GOTO RTN2
     C                     END
     C                     END
     C                     END
     C*
     C                     ELSE
     C                     GOTO RTN2
     C                     END
     C                     END
     C           LAST      TAG
     C   80
     COR 81
     COR 82                MOVE '5'       PARM2
     C           @PRINT    IFEQ 'Y'
     C           *IN80     IFEQ '1'
     C                     MOVE CTR       @KENSU
     C                     WRITEAUBPR573
     C           PSW1      IFEQ '*'
     C                     CLOSEAUBPR57
     C                     END
     C                     END
     C           *IN81     IFEQ '1'
     C                     MOVE CTR       @KENSU
     C                     WRITEAUBPR573
     C           PSW1      IFEQ '*'
     C                     CLOSEAUBPR57
     C                     END
     C                     END
     C           *IN82     IFEQ '1'
     C                     MOVE CTR       @KENSU
     C                     WRITEAUBPR573
     C           PSW1      IFEQ '*'
     C                     CLOSEAUBPR57
     C                     END
     C                     END
     C                     END
     CSR                   ENDSR
     C*-------------------------------------*
     C* PRINT ROUTINE                     *
     C*-------------------------------------*
     CSR         $SB600    BEGSR
     C           @KBAN     IFEQ 'B'
     C                     GOTO NEXT
     C                     END
     C           @KBAN     IFEQ 'C'
     C                     GOTO NEXT1
     C                     END
     C           PSW1      IFEQ ' '
     C                     OPEN AUBPR57
     C                     Z-ADD1         @PAGE
     C                     MOVE *DATE     @HADAY
     C           PARM1     CHAINRGAPL111             21
     C           *IN21     IFEQ '0'
     C                     MOVELJ8NAME    @HASYA
     C                     END
     C                     WRITEAUBPR571
     C                     MOVE '*'       PSW1    1
     C                     END
     C*---- DETAILS----*
     C** INCOMING DAY * *
     C           CUMKYY    IFNE *ZERO
     C                     MOVE CUMKYY    WKY
     C                     MOVE '.'       WKH1
     C                     MOVE CUMKMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CUMKDD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CUMKBB    WKB
     C                     ELSE
     C                     MOVE *BLANK    WK02
     C                     END
     C                     MOVE WK02      @NYUNE
     C** PART NUMBER **
     C                     SETOF                     40
     C                     MOVE CUHIN1    @NO1
     C                     MOVE CUHIN2    @NO2
     C                     MOVE CUHIN3    @NO3
     C           CUHIN3    IFNE *BLANK
     C                     SETON                     40
     C                     END
     C** WORK LIST * *
     C                     MOVE CUZENO    SGY1
     C                     MOVE '-'       WBAR1
     C                     MOVE CUTHNO    SGY2
     C           CUBKAS    IFEQ *ZERO
     C                     MOVE *BLANK    SGY3
     C                     MOVE *BLANK    WBAR2
     C                     ELSE
     C                     MOVE CUBKAS    SGY3
     C                     MOVE '-'       WBAR2
     C                     END
     C** SECTION **
     C                     MOVE CUBMON    @MABUM           *前工程
     C                     MOVE CUKAKO    @BZBUM           *xｮg
     C** ORDERING NUMBER OF SHEETS **
     C                     MOVE CUMAIS    @MAISU
     C** NUMBER OF BOXES **
     C                     MOVE CUHAKM    @HAKO1
     C** REDELIVERY DATE * *
     C           CUSMYY    IFNE *ZERO
     C                     MOVE CUSMYY    WKY
     C                     MOVE '.'       WKH1
     C                     MOVE CUSMMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CUSMDD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CUSMBB    WKB
     C                     ELSE
     C                     MOVE *BLANK    WK02
     C                     END
     C                     MOVE WK02      @YMD2
     C** NUMBER OF BOXES **
     C           CUBSU1    ADD  CUBSU2    @HAKO2
     C** RETRIEVAL DAY * *
     C           CUBNYY    IFNE *ZERO
     C                     MOVE CUBNYY    WKY
     C                     MOVE '.'       WKH1
     C                     MOVE CUBNMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CUBNDD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CUBNBB    WKB
     C                     ELSE
     C                     MOVE *BLANK    WK02
     C                     END
     C                     MOVE WK02      @YMD3
     C** DATE OF PECEIVING INSPECTION **
     C           CUKNYY    IFNE *ZERO
     C                     MOVE CUKNYY    KNYY
     C                     MOVE '.'       KNT1
     C                     MOVE CUKNMM    KNMM
     C                     MOVE '.'       KNT2
     C                     MOVE CUKNDD    KNDD
     C                     ELSE
     C                     MOVE *BLANK    @KENSY
     C                     END
     C**AFTER  WEIGHING || NUMBER OF BOXES , FRACTIONS * *
     C                     MOVE CURKHK    @HAKO3
     C                     MOVE CURHSU    @TANSU
     C* COMPLETION LOCATION *
     C                     MOVE CUHIN1    #HIN1
     C                     MOVE CUHIN2    #HIN2
     C                     MOVE CUHIN3    #HIN3
     C           #KEY2     CHAINFCEPL011             71
     C           *IN71     IFEQ '0'
     C                     MOVELA2TRYY    WKCHGY  60
     C                     MOVE A2TRMM    WKCHGY
     C                     MOVELWKCHGY    WKCHGD  80
     C                     MOVE A2TRDD    WKCHGD
     C           WKHYMD    IFLT WKCHGD
     C                     MOVE A2KTRK    @WA1
     C                     MOVE '-'       @WB1
     C                     MOVE A2KTRT    @WA2
     C                     MOVE '-'       @WB2
     C                     MOVE A2KTRR    @WA3
     C                     MOVE '-'       @WB3
     C                     MOVE A2KTRD    @WA4
     C                     ELSE
     C                     MOVE A2STRK    @WA1
     C                     MOVE '-'       @WB1
     C                     MOVE A2STRT    @WA2
     C                     MOVE '-'       @WB2
     C                     MOVE A2STRR    @WA3
     C                     MOVE '-'       @WB3
     C                     MOVE A2STRD    @WA4
     C                     END
     C                     ELSE
     C                     MOVE *BLANK    WKANBA
     C                     END
     C                     MOVE WKANBA    @KANBA
     C*----- COUNT ----*
     C           CUMKHZ    IFNE WKHZ
     C           *IN34     IFEQ '1'
     C                     MOVE CTR       @KENSU
     C                     WRITEAUBPR573
     C                     MOVE *ZERO     @KENSU
     C                     Z-ADD*ZERO     CTR
     C                     ELSE
     C                     SETON                     34
     C                     END
     C                     MOVE CUMKHZ    WKHZ    80
     C                     END
     C*
     C                     WRITEAUBPR572
     C                     ADD  1         CTR     20
     C*---- OVFL ----*
     C           *IN91     IFEQ '1'
     C                     ADD  1         @PAGE
     C                     WRITEAUBPR571
     C                     SETOF                     91
     C                     END
     C                     GOTO END
     C** B **
     C           NEXT      TAG
     C           PSW1      IFEQ ' '
     C                     OPEN AUBPR57
     C                     Z-ADD1         @PAGE
     C                     MOVE *DATE     @HADAY
     C           PARM1     CHAINRGAPL111             21
     C           *IN21     IFEQ '0'
     C                     MOVE J8NAME    @HASYA
     C                     END
     C                     WRITEAUBPR574
     C                     MOVE '*'       PSW1    1
     C                     END
     C*---- DETAILS----*
     C** INCOMING DAY * *
     C           CUKAYY    IFNE *ZERO
     C                     MOVE CUKAYY    WKY
     C                     MOVE '.'       WKH1
     C                     MOVE CUKAMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CUKADD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CUKABB    WKB
     C                     ELSE
     C                     MOVE *BLANK    WK02
     C                     END
     C                     MOVE WK02      @NYUNE
     C** PART NUMBER **
     C                     SETOF                     40
     C                     MOVE CUHIN1    @NO1
     C                     MOVE CUHIN2    @NO2
     C                     MOVE CUHIN3    @NO3
     C           CUHIN3    IFNE *BLANK
     C                     SETON                     40
     C                     END
     C** WORK LIST * *
     C                     MOVE CUZENO    SGY1
     C                     MOVE '-'       WBAR1
     C                     MOVE CUTHNO    SGY2
     C           CUBKAS    IFEQ *ZERO
     C                     MOVE *BLANK    SGY3
     C                     MOVE *BLANK    WBAR2
     C                     ELSE
     C                     MOVE CUBKAS    SGY3
     C                     MOVE '-'       WBAR2
     C                     END
     C** SECTION **
     C                     MOVE CUBMON    @MABUM           *前工程
     C                     MOVE CUKAKO    @BZBUM           *xｮg
     C                     MOVE CUBMN2    @2BUMO           *２次加工
     C** ORDERING NUMBER OF SHEETS **
     C                     MOVE CUMAIS    @MAISU
     C** NUMBER OF BOXES **
     C                     MOVE CUBSU1    @HAKO1
     C**REDELIVERY DATE
     C           CUKSYY    IFNE *ZERO
     C                     MOVE CUKSYY    WKY
     C                     MOVE '.'       WKH1
     C                     MOVE CUKSMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CUKSDD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CUKSBB    WKB
     C                     ELSE
     C                     MOVE *BLANK    WK02
     C                     END
     C                     MOVE WK02      @YMD2
     C** NUMBER OF BOXES **
     C                     MOVE CUBSU2    @HAKO2
     C** RETRIEVAL DAY * *
     C           CUBNYY    IFNE *ZERO
     C                     MOVE CUBNYY    WKY
     C                     MOVE '.'       WKH1
     C                     MOVE CUBNMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CUBNDD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CUBNBB    WKB
     C                     ELSE
     C                     MOVE *BLANK    WK02
     C                     END
     C                     MOVE WK02      @MEBAD
     C** DATE OF PECEIVING INSPECTION **
     C           CUKNYY    IFNE *ZERO
     C                     MOVE CUKNYY    KNYY
     C                     MOVE '.'       KNT1
     C                     MOVE CUKNMM    KNMM
     C                     MOVE '.'       KNT2
     C                     MOVE CUKNDD    KNDD
     C                     ELSE
     C                     MOVE *BLANK    @KENSY
     C                     END
     C**AFTER  WEIGHING || NUMBER OF BOXES , FRACTIONS * *
     C                     MOVE CURKHK    @HAKO3
     C                     MOVE CURHSU    @TANSU
     C*----- COUNT ----*
     C           CUKAHZ    IFNE WKHZ
     C           *IN34     IFEQ '1'
     C                     MOVE CTR       @KENSU
     C                     WRITEAUBPR573
     C                     MOVE *ZERO     @KENSU
     C                     Z-ADD*ZERO     CTR
     C                     ELSE
     C                     SETON                     34
     C                     END
     C                     MOVE CUKAHZ    WKHZ    80
     C                     END
     C*
     C                     WRITEAUBPR575
     C                     ADD  1         CTR     20
     C*---- OVFL ----*
     C           *IN91     IFEQ '1'
     C                     ADD  1         @PAGE
     C                     WRITEAUBPR574
     C                     SETOF                     91
     C                     END
     C                     GOTO END
     C** C **
     C           NEXT1     TAG
     C           PSW1      IFEQ ' '
     C                     OPEN AUBPR57
     C                     Z-ADD1         @PAGE
     C                     MOVE *DATE     @HADAY
     C           PARM1     CHAINRGAPL111             21
     C           *IN21     IFEQ '0'
     C                     MOVELJ8NAME    @HASYA
     C                     END
     C                     WRITEAUBPR576
     C                     MOVE '*'       PSW1    1
     C                     END
     C*---- DETAILS----*
     C** INCOMING DAY * *
     C                     MOVE CFMNYY    WKY
     C           WKY       IFEQ '0000'
     C                     MOVE *BLANK    WK02
     C                     ELSE
     C                     MOVE '.'       WKH1
     C                     MOVE CFMNMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CFMNDD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CFMNBB    WKB
     C                     MOVE WK02      @NYUNE
     C                     END
     C** PART NUMBER **
     C                     MOVE CFHIN1    @NO1
     C                     MOVE CFHIN2    @NO2
     C                     MOVE CFHIN3    @NO3
     C           CFHIN3    IFNE *BLANK
     C                     SETON                         40
     C                     END
     C** WORK LIST * *
     C                     MOVE CFZENO    SGY1
     C                     MOVE '-'       WBAR1
     C                     MOVE CFTHNO    SGY2
     C** SECTION **
     C                     MOVE CFBMON    @MABUM           *前工程
     C** ORDERING NUMBER OF SHEETS **
     C                     MOVE CFMAIS    @MAISU
     C** RETRIEVAL DAY 1**
     C                     MOVE CFBYY1    WKY
     C           WKY       IFEQ '0000'
     C                     MOVE *BLANK    WK02
     C                     ELSE
     C                     MOVE CFBMM1    WKM
     C                     MOVE '.'       WKH1
     C                     MOVE CFBDD1    WKD
     C                     MOVE '.'       WKH2
     C                     MOVE CFBBB1    WKB
     C                     MOVE '-'       WKH3
     C                     END
     C           CFMNKB    IFEQ '2'
     C                     MOVE CFMNYY    WKY
     C           WKY       IFEQ '0000'
     C                     MOVE *BLANK    WK02
     C                     ELSE
     C                     MOVE '.'       WKH1
     C                     MOVE CFMNMM    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CFMNDD    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CFMNBB    WKB
     C                     END
     C                     END
     C                     MOVE WK02      @BANK1
     C** NUMBER OF BOXES **
     C                     MOVE CFBHK1    @HAKO1
     C           CFMNKB    IFEQ '2'
     C           CFMAIS    SUB  CFMHKO    @HAKO1
     C                     END
     C** RETRIEVAL DAY 2**
     C                     MOVE CFBYY2    WKY
     C           WKY       IFEQ '0000'
     C                     MOVE *BLANK    WK02
     C                     ELSE
     C                     MOVE '.'       WKH1
     C                     MOVE CFBMM2    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CFBDD2    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CFBBB2    WKB
     C                     END
     C           CFMNKB    IFEQ '2'
     C           CFBHZ1    IFNE *ZERO
     C           CFMHKO    IFEQ CFBHK1
     C                     MOVE CFBYY1    WKY
     C           WKY       IFEQ '0000'
     C                     MOVE *BLANK    WK02
     C                     ELSE
     C                     MOVE '.'       WKH1
     C                     MOVE CFBMM1    WKM
     C                     MOVE '.'       WKH2
     C                     MOVE CFBDD1    WKD
     C                     MOVE '-'       WKH3
     C                     MOVE CFBBB1    WKB
     C                     END
     C                     END
     C                     END
     C                     END
     C                     MOVE WK02      @BANK2
     C** NUMBER OF BOXES **
     C           CFBHZ2    IFNE *ZERO
     C           CFMHKO    SUB  CFBHK1    @HAKO2
     C                     ELSE
     C                     MOVE *ZERO     @HAKO2
     C                     END
     C           CFMNKB    IFEQ '2'
     C           CFBHZ1    IFNE *ZERO
     C           CFMHKO    IFEQ CFBHK1
     C                     Z-ADDCFBHK1    @HAKO2
     C                     END
     C                     END
     C                     END
     C** MACHINE NO **
     C                     MOVE CFKBAN    @KIBAN
     C* LOCATION
     C*( HALF COMPLETION PART)
     C                     MOVE CFHIN1    #HIN1
     C                     MOVE CFHIN2    #HIN2
     C                     MOVE CFHIN3    #HIN3
     C           CFKDAI    IFEQ '0'
     C           #KEY2     SETLLAAPTL011
     C                     DO   *HIVAL
     C           #KEY2     READEAAPTL011                 73
     C                     SETOF                       74
     C                     MOVELL5STYY    WKCHGY  60
     C                     MOVE L5STMM    WKCHGY
     C                     MOVELWKCHGY    WKCHGD  80
     C                     MOVE L5STDD    WKCHGD
     C           WKCHGD    IFGT WKHYMD
     C           L5SKJY    ANDEQ*BLANK
     C                     MOVE L5KTR1    @WA1
     C                     MOVE '-'       @WB1
     C                     MOVE L5KTR2    @WA2
     C                     MOVE '-'       @WB2
     C                     MOVE L5KTR3    @WA3
     C                     MOVE '-'       @WB3
     C                     MOVE L5KTR4    @WA4
     C                     ELSE
     C                     SETON                       74
     C                     END
     C   74N73             END
     C                     END
     C*( PLATING KANBAN )
     C           CFKDAI    IFEQ 'C'
     C           #KEY2     SETLLAAFTL011
     C                     DO   *HIVAL
     C           #KEY2     READEAAFTL011                 73
     C                     SETOF                       74
     C                     MOVELA3STYY    WKCHGY  60
     C                     MOVE A3STMM    WKCHGY
     C                     MOVELWKCHGY    WKCHGD  80
     C                     MOVE A3STDD    WKCHGD
     C           WKCHGD    IFGT WKHYMD
     C           A3SKJY    ANDEQ*BLANK
     C                     MOVE A3MTK1    @WA1
     C                     MOVE '-'       @WB1
     C                     MOVE A3MTK2    @WA2
     C                     MOVE '-'       @WB2
     C                     MOVE A3MTK3    @WA3
     C                     MOVE '-'       @WB3
     C                     MOVE A3MTK4    @WA4
     C                     ELSE
     C                     SETON                         74
     C                     END
     C   74N73             END
     C                     END
     C*( TUNNEL KANBAN )
     C           CFKDAI    IFEQ 'D'
     C           #KEY2     SETLLAAGTL011
     C                     DO   *HIVAL
     C           #KEY2     READEAAGTL011                 73
     C                     SETOF                       74
     C                     MOVELO4STYY    WKCHGY  60
     C                     MOVE O4STMM    WKCHGY
     C                     MOVELWKCHGY    WKCHGD  80
     C                     MOVE O4STDD    WKCHGD
     C           WKCHGD    IFGT WKHYMD
     C           O4SKJY    ANDEQ*BLANK
     C                     MOVE O4MTK1    @WA1
     C                     MOVE '-'       @WB1
     C                     MOVE O4MTK2    @WA2
     C                     MOVE '-'       @WB2
     C                     MOVE O4MTK3    @WA3
     C                     MOVE '-'       @WB3
     C                     MOVE O4MTK4    @WA4
     C                     ELSE
     C                     SETON                       74
     C                     END
     C   74N73             END
     C                     END
     C*( PICK-UP KANBAN )
     C           CFKDAI    IFEQ 'E'
     C           #KEY2     SETLLAAHTL011
     C                     DO   *HIVAL
     C           #KEY2     READEAAHTL011                 73
     C                     SETOF                       74
     C                     MOVELL6STYY    WKCHGY  60
     C                     MOVE L6STMM    WKCHGY
     C                     MOVELWKCHGY    WKCHGD  80
     C                     MOVE L6STDD    WKCHGD
     C           WKCHGD    IFGT WKHYMD
     C           L6SKJY    ANDEQ*BLANK
     C                     MOVE L6MTK1    @WA1
     C                     MOVE '-'       @WB1
     C                     MOVE L6MTK2    @WA2
     C                     MOVE '-'       @WB2
     C                     MOVE L6MTK3    @WA3
     C                     MOVE '-'       @WB3
     C                     MOVE L6MTK4    @WA4
     C                     ELSE
     C                     SETON                       74
     C                     END
     C   74N73             END
     C                     END
     C                     MOVE WKANBA    @MKOBA
     C* COMPLETION LOCATION *
     C           #KEY2     CHAINFCEPL011             71
     C           *IN71     IFEQ '0'
     C                     MOVELA2TRYY    WKCHGY  60
     C                     MOVE A2TRYY    WKCHGY
     C                     MOVELWKCHGY    WKCHGD  80
     C                     MOVE A2TRDD    WKCHGD
     C           WKHYMD    IFLT WKCHGD
     C                     MOVE A2KTRK    @WA1
     C                     MOVE '-'       @WB1
     C                     MOVE A2KTRT    @WA2
     C                     MOVE '-'       @WB2
     C                     MOVE A2KTRR    @WA3
     C                     MOVE '-'       @WB3
     C                     MOVE A2KTRD    @WA4
     C                     ELSE
     C                     MOVE A2STRK    @WA1
     C                     MOVE '-'       @WB1
     C                     MOVE A2STRT    @WA2
     C                     MOVE '-'       @WB2
     C                     MOVE A2STRR    @WA3
     C                     MOVE '-'       @WB3
     C                     MOVE A2STRD    @WA4
     C                     END
     C                     ELSE
     C                     MOVE *BLANK    WKANBA
     C                     END
     C                     MOVE WKANBA    @KANBA
     C*----- COUNT ----*
     C           CFMNHZ    IFNE WKHZ
     C           *IN34     IFEQ '1'
     C                     MOVE CTR       @KENSU
     C                     WRITEAUBPR573
     C                     MOVE *ZERO     @KENSU
     C                     Z-ADD*ZERO     CTR
     C                     ELSE
     C                     SETON                     34
     C                     END
     C                     MOVE CFMNHZ    WKHZ    80
     C                     END
     C*
     C                     WRITEAUBPR577
     C                     ADD  1         CTR     20
     C*---- OVFL ----*
     C           *IN91     IFEQ '1'
     C                     ADD  1         @PAGE
     C                     WRITEAUBPR576
     C                     SETOF                     91
     C                     END
     C                     GOTO END
     C           END       TAG
     CSR                   ENDSR
**
SELECT SIGN ERROR
THE INPUT CONDITION ERROR
INPUT A DATE.
INPUT ERROR ONLY  'Y' 'N'
OBJECT DATA NO EXIST.
THE DATA DISPLAYED ALL
