     H            Y.
     F****************************************************************
     F* PROGRAM NAME.:INQUIRY OF MANUFACTURING INST FINISHED ORD RECEIPT INFORM
     F* PROGRAM ID. : AUBR11. <RPG>                                  *
     F* CREATE DATE. : FEB.25,'87.                                   *
     F* AUTHOR.              : MR.?.                                 *
      *
      * JUL/18/02  TCH   ADD  GYOM '32'
      * AUG/29/13  TCHK1 ADD  GYOM '51'
     F****************************************************************
     FAUBPW11 CF  E                    WORKSTN
     FAU#PL21 IF  E           K        DISK
     E                    UKBN    2   2  1               cibﾛ hﾎﾞ]
     E                    UKNM    2   2  6               cibﾛ hﾎﾞ] xb
     E                    GKBN   30  30  2               gﾞｭcw hﾎﾞ]
     E                    GKNM   10  30  6               gﾞｭcw hﾎﾞ] xb
     E                    MSG     1   4 42               d[ｰ xｮﾈｰﾆﾞ
     E                    NO         16  2 0             NO
     E                    TOK        16  4 0             nhbﾅg CD
     E                    NON        16  4 0             ﾉcpｬcﾅg CD
     E                    KOJ        16  1               ﾃcﾆﾞｭc CD
     E                    UKE        16  4               cibﾛ CD
     E                    SYD        16  6 0             ﾆｬｮﾃ ﾍﾞ
     E                    NOD        16  6 0             ﾉcpｬc ﾍﾞ
     E                    SUR        16  7 0             ﾉcpｬc ﾇc
     E                    KBA        16  1               cibﾛ hﾎﾞ]
     E                    NMA        16  6               cibﾛ hﾎﾞ] xb
     E                    KBB        16  2               gﾞｭcw hﾎﾞ]
     E                    NMB        16  6               gﾞｭcw hﾎﾞ] xb
     I            DS
     I                                        1  14 HIN
     I                                        1   5 HINA
     I                                        6   6 HINB
     I                                        7  11 HINC
     I                                       12  12 HIND
     I                                       13  14 HINE
     I            DS
     I                                        1  32 NO
     I                                        1   20NO01
     I                                        3   40NO02
     I                                        5   60NO03
     I                                        7   80NO04
     I                                        9  100NO05
     I                                       11  120NO06
     I                                       13  140NO07
     I                                       15  160NO08
     I                                       17  180NO09
     I                                       19  200NO10
     I                                       21  220NO11
     I                                       23  240NO12
     I                                       25  260NO13
     I                                       27  280NO14
     I                                       29  300NO15
     I                                       31  320NO16
     I            DS
     I                                        1  64 TOK
     I                                        1   40TOK01
     I                                        5   80TOK02
     I                                        9  120TOK03
     I                                       13  160TOK04
     I                                       17  200TOK05
     I                                       21  240TOK06
     I                                       25  280TOK07
     I                                       29  320TOK08
     I                                       33  360TOK09
     I                                       37  400TOK10
     I                                       41  440TOK11
     I                                       45  480TOK12
     I                                       49  520TOK13
     I                                       53  560TOK14
     I                                       57  600TOK15
     I                                       61  640TOK16
     I            DS
     I                                        1  64 NON
     I                                        1   40NON01
     I                                        5   80NON02
     I                                        9  120NON03
     I                                       13  160NON04
     I                                       17  200NON05
     I                                       21  240NON06
     I                                       25  280NON07
     I                                       29  320NON08
     I                                       33  360NON09
     I                                       37  400NON10
     I                                       41  440NON11
     I                                       45  480NON12
     I                                       49  520NON13
     I                                       53  560NON14
     I                                       57  600NON15
     I                                       61  640NON16
     I            DS
     I                                        1  16 KOJ
     I                                        1   1 KOJ01
     I                                        2   2 KOJ02
     I                                        3   3 KOJ03
     I                                        4   4 KOJ04
     I                                        5   5 KOJ05
     I                                        6   6 KOJ06
     I                                        7   7 KOJ07
     I                                        8   8 KOJ08
     I                                        9   9 KOJ09
     I                                       10  10 KOJ10
     I                                       11  11 KOJ11
     I                                       12  12 KOJ12
     I                                       13  13 KOJ13
     I                                       14  14 KOJ14
     I                                       15  15 KOJ15
     I                                       16  16 KOJ16
     I            DS
     I                                        1  64 UKE
     I                                        1   4 UKE01
     I                                        5   8 UKE02
     I                                        9  12 UKE03
     I                                       13  16 UKE04
     I                                       17  20 UKE05
     I                                       21  24 UKE06
     I                                       25  28 UKE07
     I                                       29  32 UKE08
     I                                       33  36 UKE09
     I                                       37  40 UKE10
     I                                       41  44 UKE11
     I                                       45  48 UKE12
     I                                       49  52 UKE13
     I                                       53  56 UKE14
     I                                       57  60 UKE15
     I                                       61  64 UKE16
     I            DS
     I                                        1  96 SYD
     I                                        1   60SYD01
     I                                        7  120SYD02
     I                                       13  180SYD03
     I                                       19  240SYD04
     I                                       25  300SYD05
     I                                       31  360SYD06
     I                                       37  420SYD07
     I                                       43  480SYD08
     I                                       49  540SYD09
     I                                       55  600SYD10
     I                                       61  660SYD11
     I                                       67  720SYD12
     I                                       73  780SYD13
     I                                       79  840SYD14
     I                                       85  900SYD15
     I                                       91  960SYD16
     I            DS
     I                                        1  96 NOD
     I                                        1   60NOD01
     I                                        7  120NOD02
     I                                       13  180NOD03
     I                                       19  240NOD04
     I                                       25  300NOD05
     I                                       31  360NOD06
     I                                       37  420NOD07
     I                                       43  480NOD08
     I                                       49  540NOD09
     I                                       55  600NOD10
     I                                       61  660NOD11
     I                                       67  720NOD12
     I                                       73  780NOD13
     I                                       79  840NOD14
     I                                       85  900NOD15
     I                                       91  960NOD16
     I            DS
     I                                        1 112 SUR
     I                                        1   70SUR01
     I                                        8  140SUR02
     I                                       15  210SUR03
     I                                       22  280SUR04
     I                                       29  350SUR05
     I                                       36  420SUR06
     I                                       43  490SUR07
     I                                       50  560SUR08
     I                                       57  630SUR09
     I                                       64  700SUR10
     I                                       71  770SUR11
     I                                       78  840SUR12
     I                                       85  910SUR13
     I                                       92  980SUR14
     I                                       99 1050SUR15
     I                                      106 1120SUR16
     I            DS
     I                                        1  16 KBA
     I                                        1   1 KBA01
     I                                        2   2 KBA02
     I                                        3   3 KBA03
     I                                        4   4 KBA04
     I                                        5   5 KBA05
     I                                        6   6 KBA06
     I                                        7   7 KBA07
     I                                        8   8 KBA08
     I                                        9   9 KBA09
     I                                       10  10 KBA10
     I                                       11  11 KBA11
     I                                       12  12 KBA12
     I                                       13  13 KBA13
     I                                       14  14 KBA14
     I                                       15  15 KBA15
     I                                       16  16 KBA16
     I            DS
     I                                        1  96 NMA
     I                                        1   6 NMA01
     I                                        7  12 NMA02
     I                                       13  18 NMA03
     I                                       19  24 NMA04
     I                                       25  30 NMA05
     I                                       31  36 NMA06
     I                                       37  42 NMA07
     I                                       43  48 NMA08
     I                                       49  54 NMA09
     I                                       55  60 NMA10
     I                                       61  66 NMA11
     I                                       67  72 NMA12
     I                                       73  78 NMA13
     I                                       79  84 NMA14
     I                                       85  90 NMA15
     I                                       91  96 NMA16
     I            DS
     I                                        1  32 KBB
     I                                        1   2 KBB01
     I                                        3   4 KBB02
     I                                        5   6 KBB03
     I                                        7   8 KBB04
     I                                        9  10 KBB05
     I                                       11  12 KBB06
     I                                       13  14 KBB07
     I                                       15  16 KBB08
     I                                       17  18 KBB09
     I                                       19  20 KBB10
     I                                       21  22 KBB11
     I                                       23  24 KBB12
     I                                       25  26 KBB13
     I                                       27  28 KBB14
     I                                       29  30 KBB15
     I                                       31  32 KBB16
     I            DS
     I                                        1  96 NMB
     I                                        1   6 NMB01
     I                                        7  12 NMB02
     I                                       13  18 NMB03
     I                                       19  24 NMB04
     I                                       25  30 NMB05
     I                                       31  36 NMB06
     I                                       37  42 NMB07
     I                                       43  48 NMB08
     I                                       49  54 NMB09
     I                                       55  60 NMB10
     I                                       61  66 NMB11
     I                                       67  72 NMB12
     I                                       73  78 NMB13
     I                                       79  84 NMB14
     I                                       85  90 NMB15
     I                                       91  96 NMB16
     I            DS
     I                                        1   80THYMD
     I                                        1   40CQTHYY
     I                                        5   60CQTHMM
     I                                        7   80CQTHDD
     I            DS
     I                                        1   80NOYMD
     I                                        1   40CQNOYY
     I                                        5   60CQNOMM
     I                                        7   80CQNODD
     I            DS
     I                                        1   80FRYMD
     I                                        1   40FRYY
     I                                        5   60FRMM
     I                                        7   80FRDD
     I            DS
     I                                        1   80SKYMD
     I                                        1   40CQSKYY
     I                                        5   60CQSKMM
     I                                        7   80CQSKDD
     C****************************************************************
     C*  START PROGRAM  <AUBR11>                                     *
     C****************************************************************
     C           STP01     TAG
     C                     MOVE *BLANK    SHN1
     C                     MOVE *BLANK    SHN2
     C                     MOVE *BLANK    SHN3
     C                     Z-ADD0         FRYY
     C                     Z-ADD0         FRMM
     C                     Z-ADD0         FRDD
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
     C**************************
     C*    fﾞx] 1. ﾍｭcﾆﾞ       *
     C**************************
     C           STP02     TAG
     C                     EXFMTAUBPW111
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
     C* DSP1.CHECK
     C           KEY1      KLIST
     C                     KFLD           SHN1
     C                     KFLD           SHN2
     C                     KFLD           SHN3
     C           KEY1      SETLLAU#PL211                 70
 N70 C           *IN70     IFEQ '0'
     C                     MOVELMSG,1     ERR
     C                     MOVEA'111'     *IN,01
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP02
 N70 C                     END
     C*
     C           FRYMD     IFNE *ZERO
     C           FRYY      COMP *ZERO                  0404
     C  N04      FRYY      COMP *YEAR                04
     C           FRMM      COMP *ZERO                  0505
     C  N05      FRMM      COMP 12                   05
     C           FRDD      COMP *ZERO                  0606
     C  N06      FRDD      COMP 31                   06
     C   04
     COR 05
     COR 06                DO
     C                     MOVELMSG,2     ERR
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP02
     C                     END
     C                     END
     C*
     C* DSP2.CLR
     C                     MOVELSHN1      HINA
     C                     MOVEL'-'       HINB
     C                     MOVELSHN2      HINC
     C                     MOVEL'-'       HIND
     C                     MOVELSHN3      HINE
     C                     Z-ADD*ZERO     NO
     C                     Z-ADD*ZERO     TOK
     C                     Z-ADD*ZERO     NON
     C                     MOVE *BLANK    KOJ
     C                     MOVE *BLANK    UKE
     C                     Z-ADD*ZERO     SYD
     C                     Z-ADD*ZERO     NOD
     C                     Z-ADD*ZERO     SUR
     C                     MOVE *BLANK    KBA
     C                     MOVE *BLANK    NMA
     C                     MOVE *BLANK    KBB
     C                     MOVE *BLANK    NMB
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'00000'   *IN,11
     C                     MOVEA'0'       *IN,16
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
     C*
     C* (DSP2) FIRST.SET
     C           KEY2      KLIST
     C                     KFLD           SHN1
     C                     KFLD           SHN2
     C                     KFLD           SHN3
     C                     KFLD           FRYY
     C                     KFLD           FRMM
     C                     KFLD           FRDD
     C           KEY2      SETLLAU#PL211
     C                     MOVE '*'       SW      1
     C                     Z-ADD0         CNT     20
     C*
  DO C                     DO   16        I       20
     C           KEY1      READEAU#PL211                 77
  77 C           *IN77     IFEQ '0'
     C                     Z-ADDI         CNT
     C                     Z-ADDI         NO,I
     C                     Z-ADDCQTOKU    TOK,I
     C                     Z-ADDCQNONY    NON,I
     C                     MOVELCQNKOJ    KOJ,I
     C                     MOVELCQNUKE    UKE,I
     C                     Z-ADDTHYMD     SYD,I
     C                     Z-ADDNOYMD     NOD,I
     C                     Z-ADDCQSRYO    SUR,I
     C                     MOVELCQSKKB    KBA,I
     C                     Z-ADD1         Q       20
     C           CQSKKB    LOKUPUKBN,Q                   88
     C   88                MOVELUKNM,Q    NMA,I
     C                     MOVELCQGYOM    KBB,I
     C                     Z-ADD1         Q
     C           CQGYOM    LOKUPGKBN,Q                   88
     C   88                MOVELGKNM,Q    NMB,I
      *
     C           CQGYOM    IFEQ '32'
     C                     MOVEL'CMBINE'  NMB,I
     C                     ENDIF
     C           CQGYOM    IFEQ '51'
     C                     MOVEL'3POINT'  NMB,I
     C                     ENDIF
     C*
     C           CQSRYO    IFLT 0
     C           CQGYOM    IFEQ '13'
     C                     MOVEL'  T-  '  NMB,I
     C                     END
     C           CQGYOM    IFEQ '14'
     C                     MOVEL'  P-  '  NMB,I
     C                     END
     C           CQGYOM    IFEQ '15'
     C                     MOVEL'  R-  '  NMB,I
     C                     END
     C           CQGYOM    IFEQ '16'
     C                     MOVEL'  S-  '  NMB,I
     C                     END
     C                     END
     C*
     C           SW        IFEQ '*'
     C                     MOVE *BLANK    SW
     C                     END
 E77 C                     ELSE
  SW C           SW        IFEQ '*'                         (fﾞbnc oﾆ)
     C                     MOVELMSG,3     ERR
     C                     MOVEA'11111'   *IN,01
     C                     MOVEA'1'       *IN,06
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP02
  SW C                     END
     C                     MOVEA'1'       *IN,I             (非表示)
  77 C                     END
  DO C                     END
     C**************************
     C*    fﾞx] 2. ﾍｭcﾆﾞ       *
     C**************************
     C           STP03     TAG
     C                     MOVEA'00'      *IN,81
     C                     EXFMTAUBPW112
     C                     MOVE *BLANK    ERR
     C                     MOVEA'0'       *IN,99
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C           *INKC     CABEQ'1'       STP01
     C**************************
     C*        ROLL-UP         *
     C**************************
  81 C           *IN81     IFEQ '1'
     C           *IN16     IFEQ '1'
     C                     MOVELMSG,4     ERR
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP03
     C                     END
     C                     MOVE '*'       SW
     C*
  DO C                     DO   16        I
     C           KEY1      READEAU#PL211                 77
  77 C           *IN77     IFEQ '0'
  SW C           SW        IFEQ '*'
     C                     Z-ADD0         CNT
     C                     Z-ADD*ZERO     NO
     C                     Z-ADD*ZERO     TOK
     C                     Z-ADD*ZERO     NON
     C                     MOVE *BLANK    KOJ
     C                     MOVE *BLANK    UKE
     C                     Z-ADD*ZERO     SYD
     C                     Z-ADD*ZERO     NOD
     C                     Z-ADD*ZERO     SUR
     C                     MOVE *BLANK    KBA
     C                     MOVE *BLANK    NMA
     C                     MOVE *BLANK    KBB
     C                     MOVE *BLANK    NMB
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'00000'   *IN,11
     C                     MOVEA'0'       *IN,16
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    SW
  SW C                     END
     C                     Z-ADDI         CNT
     C                     Z-ADDI         NO,I
     C                     Z-ADDCQTOKU    TOK,I
     C                     Z-ADDCQNONY    NON,I
     C                     MOVELCQNKOJ    KOJ,I
     C                     MOVELCQNUKE    UKE,I
     C                     Z-ADDTHYMD     SYD,I
     C                     Z-ADDNOYMD     NOD,I
     C                     Z-ADDCQSRYO    SUR,I
     C                     MOVELCQSKKB    KBA,I
     C                     Z-ADD1         Q
     C           CQSKKB    LOKUPUKBN,Q                   88
     C   88                MOVELUKNM,Q    NMA,I
     C                     MOVELCQGYOM    KBB,I
     C                     Z-ADD1         Q
     C           CQGYOM    LOKUPGKBN,Q                   88
     C   88                MOVELGKNM,Q    NMB,I
     C*
      *
     C           CQGYOM    IFEQ '32'
     C                     MOVEL'CMBINE'  NMB,I
     C                     ENDIF
     C           CQGYOM    IFEQ '51'
     C                     MOVEL'3POINT'  NMB,I
     C                     ENDIF
     C           CQSRYO    IFLT 0
     C           CQGYOM    IFEQ '13'
     C                     MOVEL'  T-  '  NMB,I
     C                     END
     C           CQGYOM    IFEQ '14'
     C                     MOVEL'  P-  '  NMB,I
     C                     END
     C           CQGYOM    IFEQ '15'
     C                     MOVEL'  R-  '  NMB,I
     C                     END
     C           CQGYOM    IFEQ '16'
     C                     MOVEL'  S-  '  NMB,I
     C                     END
     C                     END
     C*
 E77 C                     ELSE
  SW C           SW        IFEQ '*'
     C                     MOVELMSG,4     ERR
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP03
     C                     ELSE
     C                     MOVEA'1'       *IN,I             (非表示)
  SW C                     END
  77 C                     END
  DO C                     END
     C*
  81 C                     END
     C**************************
     C*       ROLL-DOWN        *
     C**************************
  82 C           *IN82     IFEQ '1'
     C*
     C           *IN77     IFEQ '1'
     C           KEY1      SETGTAU#PL211
     C                     ENDIF
     C           CNT       ADD  16        RDCNT   20
     C                     ADD  1         RDCNT
  DO C                     DO   RDCNT
     C**                   READPAU#PL211                 78
     C           KEY1      REDPEAU#PL211                 78
  78 C           *IN78     IFEQ '0'
     C           CQSHN1    COMP SHN1                     50
     C   50      CQSHN2    COMP SHN2                     50
     C   50      CQSHN3    COMP SHN3                     50
     C  N50                MOVEA'1'       *IN,78
     C                     END
     C  N78                END
     C*
     C   78      KEY1      SETLLAU#PL211
     C*
     C                     Z-ADD0         CNT
     C                     Z-ADD*ZERO     NO
     C                     Z-ADD*ZERO     TOK
     C                     Z-ADD*ZERO     NON
     C                     MOVE *BLANK    KOJ
     C                     MOVE *BLANK    UKE
     C                     Z-ADD*ZERO     SYD
     C                     Z-ADD*ZERO     NOD
     C                     Z-ADD*ZERO     SUR
     C                     MOVE *BLANK    KBA
     C                     MOVE *BLANK    NMA
     C                     MOVE *BLANK    KBB
     C                     MOVE *BLANK    NMB
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'00000'   *IN,11
     C                     MOVEA'0'       *IN,16
     C                     MOVEA'0'       *IN,99
     C*
  DO C                     DO   16        I
     C           KEY1      READEAU#PL211                 77
  77 C           *IN77     IFEQ '0'
     C                     Z-ADDI         CNT
     C                     Z-ADDI         NO,I
     C                     Z-ADDCQTOKU    TOK,I
     C                     Z-ADDCQNONY    NON,I
     C                     MOVELCQNKOJ    KOJ,I
     C                     MOVELCQNUKE    UKE,I
     C                     Z-ADDTHYMD     SYD,I
     C                     Z-ADDNOYMD     NOD,I
     C                     Z-ADDCQSRYO    SUR,I
     C                     MOVELCQSKKB    KBA,I
     C                     Z-ADD1         Q
     C           CQSKKB    LOKUPUKBN,Q                   88
     C   88                MOVELUKNM,Q    NMA,I
     C                     MOVELCQGYOM    KBB,I
     C                     Z-ADD1         Q
     C           CQGYOM    LOKUPGKBN,Q                   88
     C   88                MOVELGKNM,Q    NMB,I
     C*
      *
     C           CQGYOM    IFEQ '32'
     C                     MOVEL'CMBINE'  NMB,I
     C                     ENDIF
     C           CQGYOM    IFEQ '51'
     C                     MOVEL'3POINT'  NMB,I
     C                     ENDIF
     C           CQSRYO    IFLT 0
     C           CQGYOM    IFEQ '13'
     C                     MOVEL'  T-  '  NMB,I
     C                     END
     C           CQGYOM    IFEQ '14'
     C                     MOVEL'  P-  '  NMB,I
     C                     END
     C           CQGYOM    IFEQ '15'
     C                     MOVEL'  R-  '  NMB,I
     C                     END
     C           CQGYOM    IFEQ '16'
     C                     MOVEL'  S-  '  NMB,I
     C                     END
     C                     END
     C*
 E77 C                     ELSE
     C                     MOVEA'1'       *IN,I             (非表示)
  77 C                     END
  DO C                     END
  82 C                     END
     C**************************
     C*    fﾞx]2 s ynﾞﾓ        *
     C**************************
     C                     GOTO STP03
**  UKBN
KC
**  UKNM
KANBANINST
**  GKBN
010203040506070809101112131415161718192021222324252627282930
**  GKNM
OT    OR T  OR D  OR T  BI    GENRL RCV   DELV DO DELVB II
SK    UPDATET+    P+    R+    S+    UNWK_NR T   R B   RE_ORD
O INCMO SALEINV CTRE-FRAAPOKANKUMAMOA TTL NT    RE-NG
**  MSG
E-01 THE SAME INT CO. P/N DOESN'T HAVE
E-02 APPOINTMENT OF INST DAY ISN'T RIGHT
E-03 THERE ISN'T APPLICABLE RECORD
E-04 IT IS AN END OF APPLICABLE RECORD
