     F** AUDRSB ********************************************
     F*Ａ－ＰＩＣＳ受注№取得                            *
     F*      T.SAKASHITA                   2004.10.26      *
     F******************************************** AUDRSB **
     FAUDPPNO UF  E                    DISK                      A
     C*
     C           *ENTRY    PLIST
     C                     PARM           P@JYNO  70
     C*
     C                     EXSR #JYNO
     C*
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------------------
      * A-PICS 受注№取得
      *----------------------------------------------------------------
     C           #JYNO     BEGSR
     C                     Z-ADD0         P@JYNO  70
     C                     SETOF                     11
     C           1         CHAINAUDPPNO1             11
     C           *IN11     IFEQ '1'
     C                     Z-ADDUMONTH    ACTUKI
     C                     Z-ADD8500001   ACRENO
     C                     Z-ADD8500001   P@JYNO
     C                     WRITEAUDPPNO1
     C                     ELSE
     C           ACTUKI    IFNE UMONTH
     C                     Z-ADDUMONTH    ACTUKI
     C                     Z-ADD8500001   ACRENO
     C                     Z-ADD8500001   P@JYNO
     C                     UPDATAUDPPNO1
     C                     ELSE
     C           ACRENO    ADD  1         ACRENO
     C                     Z-ADDACRENO    P@JYNO
     C                     UPDATAUDPPNO1
     C                     END
     C                     END
     C           EJYNO     ENDSR
