     H            Y.
     F** AZAR03 **********************************************************
     F*  CREATE ANALYSIS DATA OF COMPONENT PART                          *
     F*                                                                  *
     F*  TCH 2001.03.29                                                  *
     F*                                                                  *
     F*  *IN90=1(NOT READ GDGPL18:ORDER FILE,ORDER DATE)                 *
     F*  *IN91=1(NOT READ AKBPL01:COMPONENT PART MASTER)                 *
     F*  *IN92=1(NOT READ GDGPL18:ORDER FILE,ORDER NUMBER+PART)          *
     F*  *IN93=1(NOT READ BTAPP41:ADJUSTMENT FILE)                       *
     F*  *IN94=1(NOT READ MCENP13:COMPONENT UDED RESULT)                 *
     F*                                                                  *
     F* TCH 2001.05.07 FIELD DEFINITION OF AAZAKAN,AZBKAN,AZCKAN,AZDKAN  *
     F*                IS CHANGED TO 7S0
     F* TCH 2001.10.26 ADD A FIELD OF BOX/DAY                            *
     F********************************************************************
     FAKBPL01 IF  E           K        DISK
     FMCENP13 IF  E           K        DISK
     FBTAPP41 IF  E           K        DISK
     FGDGPL18 IF  E           K        DISK                           UC
     FMBDPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAZAPP30 O   E                    DISK
     FAZAPP03 O   E           K        DISK
     E********************************************************************
     E                    ODR         7  6 0             ORDER NUMBER
     E                    QTY         7  5 0             ORDER BOX
     I********************************************************************
     I* ACTUAL ORDERED QTY.(GDGPP15)
     I            DS
     I                                        1  350QTY
     I                                        1   50AZODR1
     I                                        6  100AZODR2
     I                                       11  150AZODR3
     I                                       16  200AZODR4
     I                                       21  250AZODR5
     I                                       26  300AZODR6
     I                                       31  350AZODR7
     I********************************************************************
     C           *ENTRY    PLIST
     C                     PARM           PUSR   10
     C                     PARM           PNOHZ   6
     C                     PARM           PFLAG   1
     C******************************************************************
     C* GDGPL18
     C           K1        KLIST
     C                     KFLD           K11              ORDER NUMBER
     C                     KFLD           L1SHN1           PART 1
     C                     KFLD           L1SHN2                2
     C                     KFLD           L1SHN3                3
     C* BTAPP41
     C           K2        KLIST
     C                     KFLD           L1SHN1           PART 1
     C                     KFLD           L1SHN2                2
     C                     KFLD           L1SHN3                3
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
     C                     KFLD           K@DD    20
      *
     C           K#MCN     KLIST
     C                     KFLD           MCSHN1
     C                     KFLD           MCSHN2
     C                     KFLD           MCSHN3
     C******************************************************************
     C                     MOVE PNOHZ     WNOHZ   60
     C                     MOVE *BLANK    PFLAG
     C                     Z-ADD*ZERO     I       20
     C                     Z-ADD*ZERO     WTOTL   50
     C                     Z-ADD*ZERO     ODR
     C                     Z-ADD*ZERO     QTY
KK   C*                    Z-ADD*ZERO     W#KAN   52
KK   C*                    Z-ADD*ZERO     W#AKAN  72
KK   C                     Z-ADD*ZERO     W#KAN   72
KK   C                     Z-ADD*ZERO     W#AKAN  92
      * WORKING DAYS
     C                     Z-ADD*YEAR     K@YY
     C                     Z-ADD*MONTH    K@MM
     C                     Z-ADD*ZERO     K@DD
     C                     Z-ADD*ZERO     @@CNT   20
     C           K#AGD     SETLLAGDPL12
     C           *IN80     DOUEQ*ON
     C                     READ AGDPL12                  80
     C           *IN80     IFEQ *OFF
     C           *YEAR     IFNE F8KAYY
     C           *MONTH    ORNE F8KAMM
     C           F8KADD    ORGT *DAY
     C                     LEAVE
     C                     ENDIF
     C           F8HIRU    IFNE *BLANK
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         @@CNT
     C                     ENDIF
     C                     ENDDO
     C******************************************************************
     C* CREATE TABLE(ORDER NUMBER)
     C                     OPEN GDGPL18
     C*
     C           WNOHZ     SETLLGDGPL181
     C                     READ GDGPL181                 90
     C           *IN90     DOWEQ'0'
     C*
     C                     ADD  1         I
     C                     Z-ADDICODER    ODR,I
     C*
     C           ICODER    SETGTGDGPL181
     C                     READ GDGPL181                 90
     C                     END
     C*
     C                     CLOSEGDGPL18
     C******************************************************************
     C                     OPEN GDGPL18
     C* CREATE WORK FILE
     C           *LOVAL    SETLLAKBPL011
     C                     READ AKBPL011                 91
B01  C           *IN91     DOWEQ'0'
     C*
B02  C           L1SKJY    IFNE ' '
     C           L1STYY    ORNE 9999
     C                     GOTO #READ
     C                     END
     C*
     C                     CLEARAZAPP031
     C*
     C* SET DATA FROM MASTER
     C                     MOVE L1SHN1    AZSHN1           PART 1
     C                     MOVE L1SHN2    AZSHN2                2
     C                     MOVE L1SHN3    AZSHN3                3
     C                     MOVE L1TKR1    AZTKR1           OLD LOC 1
     C                     MOVE L1TKR2    AZTKR2                   2
     C                     MOVE L1TKR3    AZTKR3                   3
     C                     MOVE L1TKR4    AZTKR4                   4
     C                     MOVE L1KTR1    AZKTR1           NEW LOC 1
     C                     MOVE L1KTR2    AZKTR2                   2
     C                     MOVE L1KTR3    AZKTR3                   3
     C                     MOVE L1KTR4    AZKTR4                   4
     C                     Z-ADDL1SYOS    AZSYOS           QTY/CONT.
     C                     Z-ADDL1KMAX    AZCKAN           KANBAN MASTER
     C                     Z-ADDL1KTSU    AZDKAN           KAN/DAY MASTER
      *
     C* SET DATA FROM ORDER FILE
     C                     Z-ADD1         I
     C                     Z-ADD*ZERO     WTOTL
     C*
     C                     DO   7         I
     C                     MOVE ODR,I     K11     60
     C           K1        CHAINGDGPL181             92
     C           *IN92     IFEQ '0'
     C           ICSKJY    ANDEQ' '
     C                     Z-ADDICMAIS    QTY,I
     C*****                ADD  ICMAIS    WTOTL
     C*
     C                     ELSE
     C                     Z-ADD*ZERO     QTY,I
     C                     END
     C*
     C                     END
     C*****                Z-ADDWTOTL     AZOTOT
     C*
     C* SET DATA FROM BTAPP41
     C           K2        SETLLBTAPP411
     C           K2        READEBTAPP411                 93
     C           *IN93     DOWEQ'0'
      *
     C           B4SKJY    IFEQ ' '
     C                     ADD  B4MAIS    AZADJS
     C                     END
      *
     C           K2        READEBTAPP411                 93
     C                     END
     C*
     C* SET DATA FROM MCENP13(COMPONENT USED RESULT)
     C                     Z-ADD*ZERO     WKBKAN
     C                     Z-ADD*ZERO     @@QTY   90
     C                     Z-ADD*ZERO     AZBOXQ
     C           K2        SETLLMCENP131
     C           K2        READEMCENP131                 94
     C           *IN94     DOWEQ'0'
      *
     C*          F3SKJY    IFEQ ' '
     C                     ADD  MCSRYO    WKBKAN  90
     C                     EXSR #BOX
     C*                    END
      *
     C           K2        READEMCENP131                 94
     C                     END
     C*
      * DAILY QTY
     C           @@CNT     IFNE *ZERO
     C           @@QTY     DIV  @@CNT     @@DQTY  70
     C                     MVR            @@MVR   50
     C           @@MVR     IFNE *ZERO
     C                     ADD  1         @@DQTY
     C                     ENDIF
      *
     C           L1SYOS    IFNE *ZERO
     C           @@DQTY    DIV  L1SYOS    @@BOX   50
     C                     MVR            @@MVR   50
     C           @@MVR     IFNE *ZERO
     C                     ADD  1         @@BOX
     C                     ENDIF
     C                     ADD  @@BOX     AZBOXQ
     C                     ENDIF
      *
     C                     ENDIF
     C* CAL. ACTUAL QTY. PAR DAY
     C           WKBKAN    DIV  20        AZBKAN
     C*
     C* CAL. ACTUAL # OF KANBAN PAR DAY
     C           AZSYOS    IFNE *ZERO
     C           AZBKAN    DIV  AZSYOS    W#KAN
     C                     ELSE
     C                     Z-ADD*ZERO     W#KAN
     C                     END
     C*
     C           W#KAN     MULT L1LTIM    W#AKAN
     C           W#AKAN    ADD  0.9       AZAKAN
     C                     Z-ADDL1LTIM    AZLTIM
     C*
     C* CAL. # OF KANBAN VARIANCE (BETWEEN ACT&MASTER)
     C****       AZAKAN    SUB  AZOTOT    AZACTQ
      *
      *
     C                     WRITEAZAPP031
     C                     MOVE '1'       PFLAG
      *
     C           #READ     TAG
     C                     READ AKBPL011                 91
     C                     END
      *
     C                     CLOSEGDGPL18
     C*
     C******************************************************************
     C*
     C                     CLEARAZAPP301
     C                     MOVE ODR,1     AXODR1
     C                     MOVE ODR,2     AXODR2
     C                     MOVE ODR,3     AXODR3
     C                     MOVE ODR,4     AXODR4
     C                     MOVE ODR,5     AXODR5
     C                     MOVE ODR,6     AXODR6
     C                     MOVE ODR,7     AXODR7
     C                     WRITEAZAPP301
     C******************************************************************
     C*
     C                     SETON                     LR
     C                     RETRN
     C******************************************************************
     C           #BOX      BEGSR
     C*
     C           K#MCN     SETLLMBDPL01
     C           *IN80     DOUEQ*ON
     C           K#MCN     READEMBDPL01                  80
     C           *IN80     IFEQ *OFF
     C                     ADD  F3TNSU    @@QTY
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
