     H            Y.
     F** AZAR10 *******************************
     F*  SUMMARY LIST OF ORDER FILE           *
     F*                                       *
     F*  N.HYOTO 2001.04.03                   *
     F*                                       *
     F*  USE  PARAMETER FOR YEAR & MONTH      *
     F*                                       *
     F*  K.KASHIWAGI 2001.04.06               *
     F******************************* AB#R21 **
     FAZAPW10 CF  E                    WORKSTN
     FAB#PL12 IF  E           K        DISK
     FAB#PL06 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     C*****************************************************************
     E                    MSGTBL  1   2 60
     C*
     C           K1        KLIST
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C*
     C           K2        KLIST
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C*
     C           K3        KLIST
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           WKNODD
      *
     C                     MOVEL'01'      W@ID    2
      *
     C           W@ID      DOWNE'9O'
     C           *INKA     ANDNE'1'
     C           W@ID      CASEQ'01'      @DSP1
     C           W@ID      CASEQ'02'      @MAIN
     C                     ENDCS
     C                     ENDDO
     C                     SETON                     LR
     C                     RETRN
      *--------------*
      * FIRST SCREEN *
      *--------------*
     C           @DSP1     BEGSR
     C                     EXFMTAZAPW101
     C                     MOVEL*BLANKS   MSG
     C                     MOVEL'0'       *IN99
     C                     MOVEL'0'       *IN30
     C                     MOVEL'0'       *IN31
      *
     C           DYEAR     IFLT 2000
     C                     SETON                     3099
     C                     MOVELMSGTBL,1  MSG
     C                     ENDIF
      *
     C           DMM       IFEQ 0
     C           DMM       ORGT 12
     C           *IN99     IFEQ '0'
     C                     SETON                     3199
     C                     MOVELMSGTBL,2  MSG
     C                     ELSE
     C                     SETON                     31
     C                     ENDIF
     C                     ENDIF
      * IF NO ERROR, GET DATA TO BE PRINTED
     C           *IN99     IFEQ '0'
     C           *INKE     ANDEQ'1'
     C                     MOVEL'02'      W@ID
     C                     ENDIF
      *
     C                     ENDSR
      *
     C           @MAIN     BEGSR
     C                     Z-ADDDYEAR     BANOYY
     C                     Z-ADDDMM       BANOMM
     C                     Z-ADD*ZERO     WKNODD  20
     C                     SETOF                     5051
      * READ DATA WITH YEAR AND MONTH ENTERED
     C           K1        SETLLAB#PL121
     C           K1        READEAB#PL121                 90
      *
     C           *IN90     DOWEQ'0'
     C           BASKJY    IFEQ ' '
      *
      * GET INFORMATION FOR HEADER
      *
     C           *IN51     IFEQ '0'
     C                     SETON                     5051
     C                     TIME           WTIME   60
     C                     Z-ADDBANOHZ    WKNOHZ  80
     C                     Z-ADDBANODD    WKNODD
     C                     EXCPTHED
     C                     END
      *
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    WSYOS   70
     C                     ELSE
     C                     Z-ADDBASYOS    WSYOS
     C                     END
     C*
     C           BASRYO    DIV  WSYOS     WHAKO   30
     C                     MVR            WK      50
     C           WK        IFNE *ZERO
     C                     ADD  1         WHAKO
     C                     END
      *
      * WHENEVER DATE BREAK OCCURED, START READ SALES FILE
      *
     C           BANODD    IFNE WKNODD
      *
     C                     SETOF                     91
     C           K3        SETLLAB#PL061
     C           K3        READEAB#PL061                 91   SALES FILE
      *
      * IF RECORD NOT FOUND, 0 OUT FOR # OF BOX FOR SALES AT DETAIL
      *
     C           *IN91     IFEQ '1'
     C                     Z-ADD0         WKHAK2  60       SALES # OF BOX
     C                     END
      *
     C           *IN91     DOWEQ'0'
     C           B1SKJY    IFEQ ' '
     C                     ADD  B1HAKO    WKHAK2  60
     C                     ADD  B1HAKO    THAK2   60
     C                     ENDIF
     C           K3        READEAB#PL061                 91   SALES FILE
     C                     ENDDO
      *
     C                     EXCPTDTL
     C                     Z-ADD*ZERO     WKHAKO
     C                     Z-ADD*ZERO     WKHAK2
     C                     Z-ADDBANOHZ    WKNOHZ
     C                     Z-ADDBANODD    WKNODD
     C                     END
      *
     C                     ADD  WHAKO     WKHAKO  90
     C                     ADD  WHAKO     THAKO   90
      *
     C                     END
     C           K1        READEAB#PL121                 90
     C                     END
     C*****************************************************************
     C                     EXCPTDTL
     C                     EXCPTTOT
      *
     C                     SETON                     LR
     C                     MOVEL'90'      W@ID
     C                     RETRN
     C                     ENDSR
     C*****************************************************************
     OQPRINT  E  102   50      HED
     O       OR        OF
     O                                  131 '.....................'
     O        E  1     50      HED
     O       OR        OF
     O                                  131 '.         .         .'
     O        E  1     50      HED
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O        E  2     50      HED
     O       OR        OF
     O                                   10 'AZAR10-1'
     O*                        WNAME     27
     O                                   59 '**  ORDER FILE SUMMARY'
     O                                   68 'LIST  **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        E  2     50      HED
     O       OR        OF
     O                                   17 'PICK-UP DATE'
     O*                                  23 'BIN'
     O*                                  45 'QUANTITY'
     O                                   65 'NUMBER OF BOX'
     O                                   83 'NUMBER OF BOX'
     O                                   93 'FOR SALES'
     O        E  1             DTL
     O                         WKNOHZ    16 '    .  .  '
     O*                        BANOBN    22
     O*                        BASRYO1   45
     O                         WKHAKO1   65
     O                         WKHAK21   93
     O************************************************************
     O        E  2             TOT
     O                                   17 'GRAND TOTAL'
     O                         THAKO J   66
     O                         THAK2 J   94
**
INVALID YEAR
INVALID MONTH
