     H            Y/
     F***************************************************
     F*  ADJUST INVENTORY                               *
     F*                                                 *
     F*                                                 *
     F*                                                 *
     F***************************************************
     FAZAPW32 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FAKBPL08 IF  E           K        DISK
     FMCENP13 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAZAPL51 IF  E           K        DISK
     FAB#PL18 IF  E           K        DISK
     FGDGPL28 IF  E           K        DISK
     FGDGPL41 IF  E           K        DISK
     FAZAPL52 UF  E           K        DISK                      A
      *------------------------------------------------------------
     E                    CMD     1   1 78
     E                    ERR     1   1 78
     E                    COM         4 12               COMPONENT PART
     E                    NEC         4  1 0             NECESSARY QTY.
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1  48 COM
     I                                        1   5 A21HB5
     I                                        6  10 A22HB5
     I                                       11  12 A23HB2
     I                                       13  17 A24HB5
     I                                       18  22 A25HB5
     I                                       23  24 A26HB2
     I                                       25  29 A27HB5
     I                                       30  34 A28HB5
     I                                       35  36 A29HB2
     I                                       37  41 A210B5
     I                                       42  46 A211B5
     I                                       47  48 A212B2
     I            DS
     I                                        1   40NEC
     I                                        1   10A2SYK1
     I                                        2   20A2SYK2
     I                                        3   30A2SYK3
     I                                        4   40A2SYK4
     I            DS
     I                                        1   80K@YMD
     I                                        1   60K@YM
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80F8YMD
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1  12 L1HIN
     I                                        1   5 L1SHN1
     I                                        6  10 L1SHN2
     I                                       11  12 L1SHN3
     I            DS
     I                                        1   80W@DATE
     I                                        1   40IENYUY
     I                                        5   60IENYUM
     I                                        7   80IENYUD
     I            DS
     I                                        1   80IETYMD
     I                                        1   40IETOYY
     I                                        5   60IETOYM
     I                                        7   80IETOYD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD    20
     C           K#KEY     KLIST
     C                     KFLD           S@PRT1
     C                     KFLD           S@PRT2
     C                     KFLD           S@PRT3
     C           K#AZA     KLIST
     C                     KFLD           K@YYMM
     C                     KFLD           S@PRT1
     C                     KFLD           S@PRT2
     C                     KFLD           S@PRT3
     C           K#KEYX    KLIST
     C                     KFLD           L1SHN1
     C                     KFLD           L1SHN2
     C                     KFLD           L1SHN3
     C                     KFLD           K@RCVD  80
     C           K#APP     KLIST
     C                     KFLD           MCSHN1
     C                     KFLD           MCSHN2
     C                     KFLD           MCSHN3
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C           K#GDG     KLIST
     C                     KFLD           L1SHN1
     C                     KFLD           L1SHN2
     C                     KFLD           L1SHN3
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C           K#MCN     KLIST
     C                     KFLD           MCSHN1
     C                     KFLD           MCSHN2
     C                     KFLD           MCSHN3
      *
     C                     Z-ADD*YEAR     K@YY
     C                     Z-ADD*MONTH    K@MM
     C                     Z-ADD*ZERO     K@DD
     C                     Z-ADDK@YMD     K@RCVD
     C                     Z-ADD*DAY      W@DD    20
     C                     Z-ADDK@YM      K@YYMM  60
      *
     C                     EXSR #SET1
      *
     C                     MOVEL'01'      W@ID    2
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CLEAR
      *------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00000000'*IN,60
     C                     MOVE *BLANK    D@MSG
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA
      *------------------------------------------------------
     C           #SET1     BEGSR
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
      *
     C           *LOVAL    SETLLAKBPL08
     C           *IN80     DOUEQ*ON
     C                     READ AKBPL08                  80
     C           *IN80     IFEQ *OFF
     C           L1SKJY    IFNE *BLANK
     C                     ITER
     C                     ENDIF
     C           L1STYY    IFNE 9999
     C                     ITER
     C                     ENDIF
      *
     C                     CLEARSFL01
      *
     C                     MOVE L1TKR1    S@LOC1
     C                     MOVE L1TKR2    S@LOC2
     C                     MOVE L1TKR3    S@LOC3
     C                     MOVE L1TKR4    S@LOC4
     C                     MOVE L1SHN1    S@PRT1
     C                     MOVE L1SHN2    S@PRT2
     C                     MOVE L1SHN3    S@PRT3
      * INVNETORY
     C           K#AZA     CHAINAZAPL51              90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDZ5BOXQ    S@INV
     C                     ELSE
     C                     Z-ADD*ZERO     S@INV
     C                     ENDIF
      * ACTUAL BOX
     C                     EXSR #BOX
      * RECEIVED
     C                     EXSR #RCV
      * ADJUST
     C           K#AZA     CHAINAZAPL52             N90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDZ2BOXQ    S@AJST
     C                     ELSE
     C                     Z-ADD*ZERO     S@AJST
     C                     ENDIF
      *
     C           S@INV     ADD  S@RCV     S@CRNT
     C                     SUB  S@USG     S@CRNT
     C                     ADD  S@AJST    S@CRNT
      *
     C                     Z-ADDS@CRNT    H@CRNT
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDIF
     C                     ENDDO
      *
     C           RRN1      IFEQ *ZERO
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     MOVE ERR,1     D@MSG
     C                     ENDIF
      *
     C                     Z-ADD1         #RCNO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  SHIPPED BOXES
      *------------------------------------------------------
     C           #BOX      BEGSR
      *
     C                     Z-ADD*ZERO     @@QTY  112
     C           K#KEY     SETLLMCENP131
     C           *IN94     DOUEQ*ON
     C           K#KEY     READEMCENP131                 94
     C           *IN94     IFEQ *OFF
     C                     EXSR #BOX1
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           L1SYOS    IFNE *ZERO
     C           @@QTY     DIV  L1SYOS    S@USG     H
      *
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  SHIPPED BOXES
      *------------------------------------------------------
     C           #BOX1     BEGSR
      *
     C                     Z-ADD*ZERO     WKNEC   10
     C           K#MCN     SETLLFCEPL01
     C           *IN90     DOUEQ*ON
     C           K#MCN     READEFCEPL01                  90
     C           *IN90     IFEQ *OFF
     C           A2GSKD    ANDEQ*BLANK
     C                     Z-ADD1         B       10
     C           L1HIN     LOKUPCOM,B                    79
     C           *IN79     IFEQ '1'
     C                     Z-ADDNEC,B     WKNEC
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* ACTUAL
     C           K#APP     SETLLAB#PL18
     C           *IN90     DOUEQ*ON
     C           K#APP     READEAB#PL18                  90
     C           *IN90     IFEQ *OFF
     C           BASKJY    ANDEQ' '
     C           BANODD    IFGT W@DD
     C                     LEAVE
     C                     ENDIF
      *
     C           BASRYO    MULT WKNEC     WKSAIZ  92
     C                     ADD  WKSAIZ    @@QTY
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   RECEIVED BOXES
      *------------------------------------------------------
     C           #RCV      BEGSR
      *
     C                     Z-ADD*ZERO     S@RCV
     C           K#GDG     SETLLGDGPL28
     C           *IN94     DOUEQ*ON
     C           K#GDG     READEGDGPL28                  94
     C           *IN94     IFEQ *OFF
     C           IESKJY    ANDEQ' '
     C           IEHANY    ANDEQ'S'
     C                     ADD  IESBOX    S@RCV
     C                     ENDIF
      *
     C                     ENDDO
      * SPECIAL ORDER
     C           K#KEYX    SETLLGDGPL41
     C           *IN94     DOUEQ*ON
     C           K#KEY     READEGDGPL41                  94
     C           *IN94     IFEQ *OFF
     C           G4SKJY    ANDEQ*BLANK
     C                     ADD  G4NOHK    S@RCV
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVELCMD,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     Z-ADD@@REC     #RCNO
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD
     C                     MOVE '99'      W@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
      *
     C                     Z-ADD*ZERO     @RRN    40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @RRN
     C           @RRN      CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           H@CRNT    IFNE S@CRNT
     C           S@INV     ADD  S@RCV     @@QTY
     C                     SUB  S@USG     @@QTY
     C           S@CRNT    SUB  @@QTY     S@AJST
     C                     ENDIF
     C                     UPDATSFL01
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  UPDATE
      *------------------------------------------------------
     C           #UPD      BEGSR
      *
     C                     Z-ADD*ZERO     @RRN    40
     C           *IN95     DOUEQ*ON
     C                     ADD  1         @RRN
     C           @RRN      CHAINSFL01                95
     C           *IN95     IFEQ *OFF
     C           K#AZA     CHAINAZAPL52              90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDS@AJST    Z2BOXQ
     C                     Z-ADD*DATE     Z2UPDT
     C                     TIME           Z2UPTM
     C                     MOVEL#USER     Z2USER
     C                     MOVEL#PGM      Z2UPGM
     C                     UPDATAZAPP521
     C                     ELSE
     C           S@AJST    IFNE *ZERO
     C                     CLEARAZAPP521
     C                     Z-ADDS@AJST    Z2BOXQ
     C                     Z-ADD*DATE     Z2UPDT
     C                     TIME           Z2UPTM
     C                     MOVEL#USER     Z2USER
     C                     MOVEL#PGM      Z2UPGM
     C                     MOVELS@PRT1    Z2PRT1
     C                     MOVELS@PRT2    Z2PRT2
     C                     MOVELS@PRT3    Z2PRT3
     C                     Z-ADDK@YYMM    Z2YYMM
     C                     WRITEAZAPP521
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
**  CMD
F1: EXIT    F5: UPDATE
**  ERR
  NO DATA.
