     H            Y.
     F** AZZR13 ********************************************
     F* ASCII KANJI CODE IS CONVERTED INTO JIS
     F* C: N.HAYAKAWA                    86.09.12          *
     F******************************************************
     FFGAPLIA IF  E           K        DISK
     E                    CD         15  2               s]f] dﾒa
     C*****************************************************
     C* FROM ASCII TO JIS KANJI CODE
     C*****************************************************
     C           *ENTRY    PLIST
     C                     PARM           PCD    30
     C                     MOVEAPCD       CD
     C                     Z-ADD1         Z       20
     C           1         DO   15        Z
     C                     SETOF                     02
     C                     MOVE CD,Z      KEY     2
     C           KEY       CHAINFGAPLIA1             02
     C           *IN02     IFEQ '0'
     C                     MOVE T4JISH    CD,Z
     C                     END
     C                     END
     C                     MOVEACD        PCD
     C                     RETRN
