     H            Y.
     F** AZZR19 ******************************************
     F* ..CONVERT  EBCDIC KANJI CODE INTO JIS *.
     F* I-HASADA                          92.05.07       *
     F****************************************** AZZR19 **
     FFGAPLIJ IF  E           K        DISK
     E                    CD         15  2               s]f] dﾒa
     C*-----------------------------------------------------*
     C*   ＥＢＣＤＩＣ漢字コード　から　ＪＩＳ区点に変換  *
     C*-----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PCD    30
     C                     MOVEAPCD       CD
      *
     C                     Z-ADD1         Z       20
     C           1         DO   15        Z
     C                     SETOF                     02
     C                     MOVE CD,Z      KEY     2
     C           KEY       CHAINFGAPLIJ1             02
     C           *IN02     IFEQ '0'
     C                     MOVE T4JISH    CD,Z
     C                     END
     C                     END
      *
     C                     MOVEACD        PCD
     C                     RETRN
