     H            Y.
     F****************************************
     F* REV. KANBAN ISSUE DATA GEN.          *
     F*                                      *
     F*   B#AR23                             *
     F*                                      *
     F*   H.ITO                              *
     F*                                      *
     F*  %0001 A.MAMIYA 01/06/29             *
     F*        H.AMANO  2001.09.21           *
     F* UPDATE:K.OKACHI    2002.06.05    %0002 *
     F* TCHK1 08/26/06 ADD WORK FILE         *
     F* TCHK2 02/22/13 CHG J6RONO TO OUT     *
     F* %0003  T.SAKAKI 07/23/18 ADD TEMPORARY KANBAN OPTION *
     F* %0004  T.SAKAKI 07/30/18 ADD ISSUE LOG   *
%05  F*     2019/01/09かんばんレイアウト修正　ＱＲ追加
%06  F*     2019/02/05めっきかんばん　臨時追加
%07  F*     2019/11/11  ADD KANBAN PRINT DATA & TIME
     F*----------+-----+----------+-----------------------------------*
     F*2021.03.02|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F*2021.03.10|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F*2021.03.24|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F*2021.06.28|     |T.TODA    | CHANGES(20199)
%08  F*2021.09.21|     |T.SAKAKI  | CHANGE OQ,LOQ BARCODE
     F*****************************************************************
     FB#APW21 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL01
     FAAFPL03 IF  E           K        DISK
     FADHPL03 IF  E           K        DISK
%0002 *
     FAANPL03 IF  E           K        DISK
     FFCEPL41 IF  E           K        DISK
     F            FCEPP401                          KRENAMEFCEPL411
     FGCKPL21 IF  E           K        DISK
%0002 *
     FFCEPL01 IF  E           K        DISK
     FOABPL01 IF  E           K        DISK
     FAATPL01 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FFCETL06 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FMBDPL01 IF  E           K        DISK
%0003FABHPPC1 UF  E           K        DISK                      A
%05  FDATA1   O   F    1024            DISK                      A    UC
%05  FDATA2   O   F    1024            DISK                      A    UC
%0002FOUTPUT6 O   F     512            DISK                      A    UC
TCHK1FAANWP21 O   E                    DISK
      * KANBAN ISSUE LOG   *
%0004FABHPPC2 O   E           K        DISK
      *
      * ...PLATING KANBAN ISSUE HISTORY       *
     FAAFPL30 IF  E           K        DISK                      A
      *
      * QUENCHING (OQ)KANBAN ISSUE HISTORY
     FADHPL30 IF  E           K        DISK                      A
      * BOX COLOR M/F
     FABHPP40 IF  E           K        DISK
      *
     E                    ZMSG    1  13 60               * d[ｰxｮﾈｰﾆﾞ
     E                    ZCMT    1   3 24               * f]ﾌﾞ] ﾆｬﾓb
     E                    #CHK    1  22  2               pﾇfﾞj kｩｮh
     E                    #NJK        4  2               xｮg pﾇfﾞj JOK
     E                    #MJK        2  2                   xｮg  JOK
     E                    ZNJK        4  2               n]rﾓ pﾇfﾞj JOK
     E                    ZMJK        2  2                    xｮg JOK
     E                    ZKJK        3  2                    fﾃc JOK
     E                    @NJK        4  2               ﾍgnﾒ pﾇfﾞj JOK
     E                    @HJK        3  2                    ﾍgnﾒ JOK
     E                    WHNM        3 16               * ﾍgnﾒ JOKxb
     E                    WKNM        3 16               * fﾃc JOKxb
     E                    A3JOK       8  2               ﾆﾞｭci] (2ij)
     E                    W3JK        6  2               ﾆﾞｭci](pﾇfﾞjkｩｮh)
     E                    WMNM        2 12
     E                    WNNM        4 20
     E                    HIR         2  1               箱色
     E                    WIR         2  5               箱色名称
     E*****               CT1     1   8  1   CT2     5   箱色名称
     E                    WJK         5  5               条件名
     E                    JOK         5  2               条件
      *
     E                    OKOT       15  3               旧工程
     E                    OBMN       15  4 0             旧部門
     E                    OKBN       15  3               旧機番
     E                    OLC        15  6               旧番地
     E                    NKOT       15  3               新工程
     E                    NBMN       15  4 0             新部門
     E                    NKBN       15  3               新機番
     E                    NLC        15  6               新番地
     E                    NUKH       15 10 0             かんばん切替日
     E                    AKT        15  3               決定工程
     E                    ABM        15  4 0             決定部門
     E                    AKB        15  3               決定機番
%08  E                    ALC        15  6                LOCATION
%0002E                    CMT1    1  13  1   CMT2    6   ﾊｺｲﾛ
      *
     E                    IRO     1   2  1               かんばん色
      *
     I*
     I           SDS
     I                                     *PROGRAM S@PGID
     I                                      244 253 S@WSID
     I                                      254 263 S@USID
     I                                      264 269 S@JBID
     I            DS
     I                                        1  48 WHNM
     I                                        1  16 WHNM1
     I                                       17  32 WHNM2
     I                                       33  48 WHNM3
     I            DS
     I                                        1  48 WKNM
     I                                        1  16 WKNM1
     I                                       17  32 WKNM2
     I                                       33  48 WKNM3
     I            DS
     I                                        1   60@DATE
     I                                        1   20WYY
     I                                        3   40WMM
     I                                        5   60WDD
     I            DS
     I                                        1   6 @TKRA
     I                                        1   1 @TKR1
     I                                        2   3 @TKR2
     I                                        4   5 @TKR3
     I                                        6   6 @TKR4
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   9 @MSTBI
     I                                        1   20@MSTY
     I                                        3   40@MSTM
     I                                        5   60@MSTD
     I                                        7   7 @MST
     I                                        8   90@MSTB
     I            DS
     I                                        1  14 WKHINB
     I                                        1   5 WKHIN1
     I                                        6   6 WKH2
     I                                        7  11 WKHIN2
     I                                       12  12 WKH3
     I                                       13  14 WKHIN3
     I            DS
     I                                        1  15 WKTKR
     I                                        1   1 WKTKR1
     I                                        3   3 WKT2
     I                                        5   6 WKTKR2
     I                                        8   8 WKT3
     I                                       10  11 WKTKR3
     I                                       13  13 WKT4
     I                                       15  15 WKTKR4
     I            DS
     I                                        1   9 WWTKR
     I                                        1   1 WWTKR1
     I                                        2   2 WWT2
     I                                        3   4 WWTKR2
     I                                        5   5 WWT3
     I                                        6   7 WWTKR3
     I                                        8   8 WWT4
     I                                        9   9 WWTKR4
     I            DS
     I                                        1   8 WKKTE
     I                                        1   3 WKKTE1
     I                                        4   4 WKK2
     I                                        5   80WKKTE2
     I            DS
     I                                        1   9 WKHZ
     I                                        1   20WKYY
     I                                        3   40WKMM
     I                                        5   60WKDD
     I                                        7   7 WKHZ1
     I                                        8   90WKBIN
     I            DS
     I                                        1   80A3UKYD
     I                                        1   40A3UKYY
     I                                        5   60A3UKMM
     I                                        7   80A3UKDD
     I            DS
     I                                        1   80A3STYD
     I                                        1   40A3STYY
     I                                        5   60A3STMM
     I                                        7   80A3STDD
     I            DS
     I                                        1   30@SYOK
     I                                        1   20WPGNO
     I            DS
     I                                        1  20 DCNAMK
     I                                        2   7 WNAMK1
     I                                        2   9 WNAMK4
     I                                        2  13 WNAMK2
     I            DS
     I                                        1  16 A5JOK2
     I                                        2   9 WNAMK3
     I            DS
     I                                        1  30 ZNME1
     I                                        1   8 ZNAME1
     I            DS
     I                                        1  30 ZNME2
     I                                        1  14 ZNAME2
     I            DS
     I                                        1  30 ZNME3
     I                                        1  10 ZNAME3
     I            DS
     I                                        1  30 ZNME4
     I                                        1  10 ZNAME4
     I            DS
     I                                        1   3 WBAREB
     I                                        1   1 WBAB1
     I                                        2   2 WBAB2
     I                                        3   3 WBAB3
     I            DS
     I                                        1   21A3BARB
     I                                        1   10A3B1
     I                                        2   20A3B2
     I            DS
     I                                        1   21O4BARB
     I                                        1   10O4B1
     I                                        2   20O4B2
     I            DS
     I                                        1   4 WBAREA
     I                                        1   1 WBAA1
     I                                        2   3 WBAA2
     I                                        4   4 WBAA3
     I            DS
     I                                        1   2 @BARA
     I                                        1   1 @BARA1
     I            DS
     I                                        1   2 A3ATK2
     I                                        1   1 @T2
     I            DS
     I                                        1   2 A3ATK3
     I                                        1   1 @T3
     I            DS
     I                                        1   2 A3MTK2
     I                                        1   1 @K2
     I            DS
     I                                        1   2 A3MTK3
     I                                        1   1 @K3
     I            DS
     I                                        1   2 O4BAN2
     I                                        1   1 @@T2
     I            DS
     I                                        1   2 O4BAN3
     I                                        1   1 @@T3
     I            DS
     I                                        1   2 O4MTK2
     I                                        1   1 @@K2
     I            DS
     I                                        1   2 O4MTK3
     I                                        1   1 @@K3
     I            DS
     I                                        1   2 L6ATK2
     I                                        1   1 @@@T2
     I            DS
     I                                        1   2 L6ATK3
     I                                        1   1 @@@T3
     I            DS
     I                                        1   2 L6MTK2
     I                                        1   1 @@@K2
     I            DS
     I                                        1   2 L6MTK3
     I                                        1   1 @@@K3
     I            DS
     I                                        1   2 @CBKO
     I                                        1   1 @CBKO1
     I            DS
     I                                        1  16 A3JOK
     I                                        1  12 A3JK
     I                                        1   2 A3JOK1
     I                                        3   4 A3JOK2
     I                                        5   6 A3JOK3
     I                                        7   8 A3JOK4
     I                                        9  10 A3JOK5
     I                                       11  12 A3JOK6
     I                                       13  14 A3JOK7
     I                                       15  16 A3JOK8
     I*
     I            DS
     I                                        1  10 JOK
     I                                        1   2 J6JOK1
     I                                        3   4 J6JOK2
     I                                        5   6 J6JOK3
     I                                        7   8 J6JOK4
     I                                        9  10 J6JOK5
     I*
     I            DS
     I                                        1  12 W3JK
     I            DS
     I                                        1  16 WMKJNM
     I            DS
     I                                        1  16 WJBUNM
     I            DS
     I                                        1   2 WCBKO
     I                                        1   1 WCBKO1
     I            DS
     I                                        1  24 WMNM
     I                                        1  12 WMNM1
     I                                       13  24 WMNM2
     I            DS
     I                                        1  80 WNNM
     I                                        1  20 WNNM1
     I                                       21  40 WNNM2
     I                                       41  60 WNNM3
     I                                       61  80 WNNM4
      *
     I            DS
     I                                        1   2 HIR
     I                                        1   1 J6HIR1
     I                                        2   2 J6HIR2
%0001I*
     I            DS
     I                                        1  45 OKOT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600OBMN
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  45 OKBN
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN10
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I            DS
     I                                        1  90 OLC
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1  45 NKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600NBMN
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  45 NKBN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  90 NLC
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1 1500NUKH
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1   6 J6H
     I                                        1   1 J6HTK1
     I                                        2   3 J6HTK2
     I                                        4   5 J6HTK3
     I                                        6   6 J6HTK4
      *
     I            DS
     I                                        1   6 J6ATK
     I                                        1   1 J6ATK1
     I                                        2   3 J6ATK2
     I                                        4   5 J6ATK3
     I                                        6   6 J6ATK4
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      * **
      *
     I            DS
     I                                        1  12 A3SHN
     I                                        1   5 A31HB5
     I                                        6  10 A32HB5
     I                                       11  12 A33HB2
      *  **
     I            DS
     I                                        1  12 J6SHN
     I                                        1   5 J6SHN1
     I                                        6  10 J6SHN2
     I                                       11  12 J6SHN3
      *
      * バーコード作成
     I            DS
     I                                        1  11 B$BAR
     I                                        1   3 B$ONDO
     I*******                                 4   4 B$YOBI
     I                                        4   6 B$CO2P
     I                                        7  10 B$ZETI
     I                                       11  11 B$CD11
     I            DS
     I                                        1   7 C$BAR
     I                                        1   3 C$ONDO
     I                                        4   4 C$YOBI
     I                                        5   6 C$HOJI
     I                                        7   7 C$CD7
      *  **
     I            DS
     I                                        1   80A0KOHZ
     I                                        1   40A0KOYY
     I                                        5   60A0KOMM
     I                                        7   80A0KODD
     I                                        9  140A0KOTM
     I                                        9  100A0KOHH
     I                                       11  120A0KOSS
      *  **
     I            DS
     I                                        1   80J3KOHZ
     I                                        1   40J3KOYY
     I                                        5   60J3KOMM
     I                                        7   80J3KODD
     I                                        9  140J3KOTM
     I                                        9  100J3KOJJ
     I                                       11  120J3KOFF
      *//////////////////////////////////////////
      * ＱＲレイアウト
      *//////////////////////////////////////////
      *めっき
     IQRDAT1      DS
     I                                        1   3 Q1KBN
     I                                        4   4 Q1HKKB
     I                                        5   5 Q1HNDI
     I                                        6   6 Q1HNSY
     I                                        7  10 Q1HNZT
     I*                   発行№分母
     I                                       11  15 Q1KMAX
     I*                   かんばんキー     16  27
     I                                       28  28 Q1KCD1
     I                                       29  29 Q1KCD2
     I                                       30  34 Q11HB5
     I                                       35  39 Q12HB5
     I                                       40  41 Q13HB2
     I                                       42  42 Q1ATK1
     I                                       43  44 Q1ATK2
     I                                       45  46 Q1ATK3
     I                                       47  47 Q1ATK4
     I                                       48  48 Q1KANR
     I                                       49  52 Q1ZETI
     I                                       53  55 Q1999
     I                                       56  60 Q10000
     I                                       61  61 WNIJI
     I                                       62  62 WTAIKB
     I                                       63  63 WYUKO
     I                                       64  64 Q1SSYT
     I                                       65  65 Q1MTK1
     I                                       66  67 Q1MTK2
     I                                       68  69 Q1MTK3
     I                                       70  70 Q1MTK4
     I                                       71  74 Q1MAKB
     I                                       75  78 Q1ATOB
     I                                       79  85 Q1MEKI
     I                                       86  86 Q1RAIN
     I                                       87  88 Q1BARA
     I                                       89  90 Q1BARB
     I                                       91  92 Q1CBKO
     I                                       93  97 Q1SSYS
     I                                       98  98 Q1SSY2
     I                                       99 100 Q1JOK1
     I                                      101 102 Q1JOK2
     I                                      103 104 Q1JOK3
     I                                      105 106 Q1JOK4
     I                                      107 108 Q1JOK5
     I                                      109 110 Q1JOK6
     I*     引取条件二次加工１ 2          111 112
     I*     引取条件二次加工２ 2          113 114
     I*     引取条件二次加工３ 2          115 116
     I                                      117 119 Q1ATOK
     I                                      120 127 Q1UKYD
     I                                      128 129 Q1UBIN
     I                                      130 137 Q1STYD
     I                                      138 139 Q1SBIN
%07  I                                      140 147 Q1KHDT
     I                                      148 153 Q1KHTM
     I                                      154 161 Q1HKHZ
     I                                      162 163 Q1HKBB
     I**    予備              36          164 199
     I                                      200 200 Q1AST
      *
      *焼入れ
     IQRDAT2      DS
     I                                        1   3 Q2KBN
     I                                        4   4 Q2HKKB
     I                                        5   5 Q2HNDI
     I                                        6   6 Q2HNSY
     I                                        7  10 Q2HNZT
     I* 発行№分母      5
     I                                       11  15 Q2KMAX
     I* かんばんキー   12                  16  27
     I                                       28  28 Q2KCD1
     I                                       29  29 Q2KCD2
     I                                       30  33 Q2ZETI
     I                                       34  38 Q2SHN1
     I                                       39  43 Q2SHN2
     I                                       44  45 Q2SHN3
     I                                       46  48 Q2ATOK
     I                                       49  52 Q2ATOB
     I                                       53  53 Q2ATK1
     I                                       54  55 Q2ATK2
     I                                       56  57 Q2ATK3
     I                                       58  58 Q2ATK4
     I                                       59  62 WMZET
     I                                       63  74 WMSHN
     I                                       75  78 Q2MAKB
     I                                       79  79 Q2MTK1
     I                                       80  81 Q2MTK2
     I                                       82  83 Q2MTK3
     I                                       84  84 Q2MTK4
     I                                       85  870$$LOTO
     I                                       88  88 Q2KSNK
     I                                       89  90 Q2BCOD
     I                                       91  95 Q2PAGE
     I                                       96  96 Q2SYOT
     I                                       97 103 Q2SYOS
     I                                      104 1071N@HKJR
     I                                      108 114 Q2SOZI
     I                                      115 1171$$TUSZ
     I                                      118 1222$$KUBI
     I                                      123 1250$$SETO
     I                                      126 128 Q2RONO
     I* 区分            1                 129 129
     I                                      130 1320$$HOJI
     I                                      133 135 Q2ONDO
     I                                      136 138 Q2CO2P
     I                                      139 158 ZINM2
     I                                      159 161 Q2KIK1
     I                                      162 164 Q2KIK2
     I                                      165 168 Q2UKYY
     I                                      169 170 Q2UKMM
     I                                      171 172 Q2UKDD
     I                                      173 174 Q2UBIN
     I                                      175 177 Q2ATO2
     I                                      178 181 Q2STYY
     I                                      182 183 Q2STMM
     I                                      184 185 Q2STDD
     I                                      186 187 Q2SBIN
%0003I                                      188 195 Q2KHDT
     I                                      196 201 Q2KHTM
     I                                      202 209 Q2HKHZ
     I                                      210 211 Q2HKBB
     I********  FILLER                      212 239 Q2FILL
     I                                      240 240 Q2AST
      * **
     C           *ENTRY    PLIST
     C                     PARM           PARM1   1        * f]ﾌﾞ] ﾆｬﾓb
     C                     PARM           PARM2   1        * gｫ]ﾈﾓﾎ[hﾞ
     C                     PARM           PARM3   1        * CMD1
      *
     C           #ENTRY    PLIST
     C                     PARM           #PARM1  5        f]ﾌﾞ] ALL
     C                     PARM           #PARM2  5              MIN
     C                     PARM           #PARM3  5              MAX
     C                     PARM           #PARM4  5              ﾆｭﾒ
     C                     PARM           #PARM5  1        ﾌｮﾃchﾎﾞ]
     C                     PARM           #PARM6  5        ﾌｮﾃcNOﾆｭgk
     C                     PARM           #PARM7  5        ﾌｮﾃcubﾇc
     C                     PARM           #PARM8  5        b]ﾆﾞubﾇc
      *-----------*
      * KEY LIST  *
      *-----------*
     C           #KEY01    KLIST
     C                     KFLD           #KTKR1  1
     C                     KFLD           #KTKR2  2
     C                     KFLD           #KTKR3  2
     C                     KFLD           #KTKR4  1
     C           #KEY02    KLIST
     C                     KFLD           #KTKR1  1
     C                     KFLD           #KTKR2  2
     C                     KFLD           #KTKR3  2
     C                     KFLD           #KTKR4  1
     C                     KFLD           #KUKYY  40
     C                     KFLD           #KUKMM  20
     C                     KFLD           #KUKDD  20
     C                     KFLD           #KUBIN  20
     C           #KEY03    KLIST
     C                     KFLD           #KBMON  40
     C                     KFLD           #KTAIP  1
     C           #KEY04    KLIST
     C                     KFLD           A31HB5
     C                     KFLD           A32HB5
     C                     KFLD           A33HB2
     C           #KEY05    KLIST
     C                     KFLD           A3MAKB
     C                     KFLD           A3MTYP
     C           #KEY06    KLIST
     C                     KFLD           A3ATOB
     C                     KFLD           A3ATYP
     C           #KEY07    KLIST
     C                     KFLD           WJOKEN
     C                     KFLD           A3KCD1
     C           #KEY08    KLIST
     C                     KFLD           KJOK
     C                     KFLD           KSYU
     C           #KEY09    KLIST
     C                     KFLD           J6SHN1
     C                     KFLD           J6SHN2
     C                     KFLD           J6SHN3
      * %0003
     C           #KEY10    KLIST
     C                     KFLD           J6SHN1
     C                     KFLD           J6SHN2
     C                     KFLD           J6SHN3
     C                     KFLD           J6ATOK
     C                     KFLD           WRENO
      *
     C           K#MBD1    KLIST
     C                     KFLD           A31HB5
     C                     KFLD           A32HB5
     C                     KFLD           A33HB2
     C                     KFLD           K@NONY
     C           K#MBD2    KLIST
     C                     KFLD           J6SHN1
     C                     KFLD           J6SHN2
     C                     KFLD           J6SHN3
     C                     KFLD           K@NONY
     C                     Z-ADD3931      K@NONY  40
     C*
      *----------------------------------------------------*
      *   ﾆﾏlﾒﾑh ﾎabﾓ OPEN                                 *
      *----------------------------------------------------*
      *===  xｮg f]ﾌﾞ]
     C           PARM1     IFEQ 'C'
     C                     OPEN DATA1
     C                     END
      *===  ﾔｷｲﾚ ｶﾝﾊﾞﾝ
     C           PARM1     IFEQ 'B'
     C                     OPEN DATA2
     C                     END
%0002 *===  ﾊﾝｾｲﾋﾝ ｶﾝﾊﾞﾝ
     C           PARM1     IFEQ '6'
     C                     OPEN OUTPUT6
     C                     END
%0002 *
      *----------------------------------------------------*
      *   ﾆｭg ﾈｮmb ﾆｭﾒ                                     *
      *----------------------------------------------------*
     C                     MOVE UDATE     @DATE
     C                     TIME           WTIME
     C                     Z-ADD0         WKKENS  40
     C                     Z-ADD0         @TMAI
     C                     MOVE *BLANK    WKBN    1
     C                     MOVEL'0'       WMSGKB  1
     C                     MOVEL*BLANK    WMSGTX 32
      *=== f]ﾌﾞ] ﾆｬﾓb xb ﾈｮn ===*
     C           PARM1     IFEQ 'C'
     C                     MOVE '  1 '    @CMT1
     C                     MOVELZCMT,1    @CMT2
%06  C                     SETON                     29
     C                     END
      *
     C           PARM1     IFEQ 'B'
     C                     MOVE '  2 '    @CMT1
     C                     MOVELZCMT,2    @CMT2
     C                     SETON                     29
     C                     END
%0002 *
     C           PARM1     IFEQ '6'
     C                     MOVE '  3 '    @CMT1
     C                     MOVELZCMT,3    @CMT2
     C                     END
%0002 *
      *----------------------------------------------------*
      *  jﾞb 2 fﾞx] ﾆｭﾒ  <ﾆﾞﾃcmb nﾃﾜﾌﾞ]k pｬcﾒｭh> (B#APW212)*
      *----------------------------------------------------*
     C           ZDSP02    TAG
     C                     EXFMTB#APW212
     C                     SETOF                     2099
     C                     MOVE *BLANK    @ERR
      *=== CMD1 ===*
     C           *IN01     IFEQ '1'
      *----------------------------------------------------*
      *   ﾆﾏlﾒﾑh ﾎabﾓ CLOSE                                *
      *----------------------------------------------------*
      *===  xｮg f]ﾌﾞ]
     C           PARM1     IFEQ 'C'
     C                     CLOSEDATA1
     C                     END
      *=== ﾔｷｲﾚ ｶﾝﾊﾞﾝ
     C           PARM1     IFEQ 'B'
     C                     CLOSEDATA2
     C                     END
%0002 *
      *=== ﾊﾝｾｲﾋﾝ ｶﾝﾊﾞﾝ
     C           PARM1     IFEQ '6'
     C                     CLOSEOUTPUT6
     C                     END
%0002 *
     C*
     C                     MOVE '1'       PARM3
     C           @AAMRS    IFEQ '*'
     C                     MOVE '9'       P@OPCL
     C                     CALL 'AAMRS3'  AAMRS3
     C                     ENDIF
     C                     SETON                       LR
     C                     RETRN
     C                     END
      *=== CMD2 ===*
     C           *IN02     IFEQ '1'
      *----------------------------------------------------*
      *   ﾆﾏlﾒﾑh ﾎabﾓ CLOSE                                *
      *----------------------------------------------------*
      *===  xｮg f]ﾌﾞ]
     C           PARM1     IFEQ 'C'
     C                     CLOSEDATA1
     C                     END
      *===  ﾔｷｲﾚ ｶﾝﾊﾞﾝ
     C           PARM1     IFEQ 'B'
     C                     CLOSEDATA2
     C                     END
%0002 *
      *=== ﾊﾝｾｲﾋﾝ ｶﾝﾊﾞﾝ
     C           PARM1     IFEQ '6'
     C                     CLOSEOUTPUT6
     C                     END
%0002 *
     C*
     C                     MOVE '3'       PARM2
     C           @AAMRS    IFEQ '*'
     C                     MOVE '9'       P@OPCL
     C                     CALL 'AAMRS3'  AAMRS3
     C                     ENDIF
     C                     SETON                       LR
     C                     RETRN
     C                     END
      *-------------------------*
      *   pｬcﾒｭh ﾃcyh kｩｮh      *
      *-------------------------*
     C           @TKRA     IFEQ *BLANK
     C                     SETON                     2099
     C                     MOVELZMSG,1    @ERR
     C                     GOTO ZDSP02
     C                     END
      *=== ]ﾅﾞb kｩｮh ===*
     C                     SETOF                     81
     C                     MOVE @TKR1     #KTKR1
     C                     MOVE @TKR2     #KTKR2
     C                     MOVE @TKR3     #KTKR3
     C                     MOVE @TKR4     #KTKR4
     C                     Z-ADD0         #KUKYY
     C                     Z-ADD0         #KUKMM
     C                     Z-ADD0         #KUKDD
     C                     Z-ADD0         #KUBIN
      *--- tﾟb]jｰ ﾈｮn ---*
     C           PARM1     IFEQ 'C'
     C           #KEY01    SETLLAAFPL031                 81
     C                     END
      *
     C           PARM1     IFEQ 'B'
     C           #KEY01    SETLLADHPL031                 81
     C                     END
%0002 *
     C           PARM1     IFEQ '6'
     C           #KEY01    SETLLAANPL031                 81
     C                     END
%0002 *
     C           *IN81     IFEQ '0'
     C                     SETON                     2099
     C                     MOVELZMSG,2    @ERR
     C                     GOTO ZDSP02
     C                     END
      *-------------------------*
      *   jﾞb 3 fﾞx] ﾃcyh ﾈｮn   *
      *-------------------------*
      *=== fﾞx] hﾒaｰ ===*
     C                     SETON                     70
     C                     WRITESFLREC
     C                     SETOF                     70
      *=== ﾅﾎﾞﾎｦbﾓ ﾃcyh ﾈｮmb ===*
     C                     Z-ADD1         SFLRCD
     C                     Z-ADD0         RRN     40
     C                     Z-ADD0         WKNO1   40
     C                     Z-ADD0         WKNO2   40
     C                     Z-ADD0         WKKEY1  40
     C                     Z-ADD0         WKKEY2  20
     C                     Z-ADD0         WKKEY3  20
     C                     Z-ADD0         WKKEY4  20
      *
     C           PARM1     CASEQ'C'       ZSB100           * xｮg f]ﾌﾞ]
     C           PARM1     CASEQ'B'       ZSB200           * ﾔｷｲﾚ ｶﾝﾊﾞﾝ
%0002C           PARM1     CASEQ'6'       ZSB300           * ﾊﾝｾｲﾋﾝ ｶﾝﾊﾞﾝ
     C                     END
      *--- jbﾆｭc mﾞｰj oﾆ ---*
     C           CTR       IFEQ *ZERO
     C                     SETON                     99
     C                     MOVELZMSG,3    @ERR
     C                     GOTO ZDSP02
     C                     END
      *=== ﾆﾞﾃcmb nﾃﾜﾌﾞ]k s]ﾆｬc ===*
     C                     MOVE *BLANK    WWTKR
     C                     MOVE @TKR1     WWTKR1
     C                     MOVE @TKR2     WWTKR2
     C                     MOVE @TKR3     WWTKR3
     C                     MOVE @TKR4     WWTKR4
     C           WWTKR2    IFNE *BLANK
     C                     MOVE '-'       WWT2
     C                     END
     C           WWTKR3    IFNE *BLANK
     C                     MOVE '-'       WWT3
     C                     END
     C           WWTKR4    IFNE *BLANK
     C                     MOVE '-'       WWT4
     C                     END
     C                     MOVE WWTKR     @TKRB
      *----------------------------------------------------*
      *  jﾞb 3 fﾞx] ﾆｭﾒ  <ﾅﾎﾞﾎｦｧﾓ>               (B#APW213)*
      *----------------------------------------------------*
     C           ZDSP03    TAG
     C                     WRITEB#APW213
     C                     WRITEB#APW215
     C                     SETON                     71
     C                     EXFMTSFLREC
     C                     SETOF                     71
     C                     SETOF                     2199
     C                     MOVE *BLANK    @ERR
      *=== CMD1 ===*
     C           *IN01     IFEQ '1'
      *----------------------------------------------------*
      *   ﾆﾏlﾒﾑh ﾎabﾓ CLOSE                                *
      *----------------------------------------------------*
      *===  xｮg f]ﾌﾞ]
     C           PARM1     IFEQ 'C'
     C                     CLOSEDATA1
     C                     END
      *===  ﾔｷｲﾚ ｶﾝﾊﾞﾝ
     C           PARM1     IFEQ 'B'
     C                     CLOSEDATA2
     C                     END
%0002 *===  HALF-FINISHED KANBAN
     C           PARM1     IFEQ '6'
     C                     CLOSEOUTPUT6
     C                     END
%0002 *
     C*
     C                     MOVE '1'       PARM3
     C           @AAMRS    IFEQ '*'
     C                     MOVE '9'       P@OPCL
     C                     CALL 'AAMRS3'  AAMRS3
     C                     ENDIF
     C                     SETON                       LR
     C                     RETRN
     C                     END
      *=== CMD2 ===*
     C           *IN02     IFEQ '1'
     C                     SETOF                     202199
     C                     MOVE *BLANK    @TKRA
     C                     Z-ADD0         @BANGO
     C                     MOVE *BLANK    @ERR
     C                     GOTO ZDSP02
     C                     END
      *=== ROLL-UP ===*
     C           *IN51     IFEQ '1'
     C           @BANGO    OREQ *ZERO
     C                     SETOF                     51
     C                     Z-ADDRRN       WKRRN   40
     C           RRN       ADD  1         SFLRCD
     C                     Z-ADDWKKEY1    #KUKYY
     C                     Z-ADDWKKEY2    #KUKMM
     C                     Z-ADDWKKEY3    #KUKDD
     C                     Z-ADDWKKEY4    #KUBIN
      *
     C           PARM1     IFEQ 'C'
     C           #KEY02    SETGTAAFPL031
     C                     EXSR ZSB100                     * xｮg f]ﾌﾞ]
     C                     END
      *
     C           PARM1     IFEQ 'B'
     C           #KEY02    SETGTADHPL031
     C                     EXSR ZSB200                     * ﾔｷｲﾚ ｶﾝﾊﾞﾝ
     C                     END
%0002 *
     C           PARM1     IFEQ '6'
     C           #KEY02    SETGTAANPL031
     C                     EXSR ZSB300                     * ﾊﾝｾｲﾋﾝ
     C                     END
%0002 *
     C           CTR       IFEQ *ZERO
     C                     Z-ADDWKRRN     SFLRCD
     C                     SETON                     99
     C                     MOVELZMSG,12   @ERR
     C                     GOTO ZDSP03
     C                     END
     C                     END
      *-------------------------*
      *   pｬcﾒｭh ﾃcyh kｩｮh      *
      *-------------------------*
      *=== ﾅhﾈb ﾌﾞ]ﾃﾞc ===*
     C           @BANGO    IFLT WKNO1
     C           @BANGO    ORGT WKNO2
     C                     SETON                     2199
     C                     MOVELZMSG,4    @ERR
     C                     GOTO ZDSP03
     C                     END
      *
     C                     SETOF                     82
     C           @BANGO    CHAINSFL01                82
     C           *IN82     IFEQ '1'
     C                     SETON                     99
     C                     MOVELZMSG,3    @ERR
     C                     GOTO ZDSP03
     C                     END
      *=== jﾞb 4 fﾞx] ﾃcyh ﾈｮn ===*
     C           *IN82     IFEQ '0'
     C                     MOVE @HINB     @MHINB
     C                     MOVE @KTE1     @MKTE1
     C                     MOVE @KTE2     @MKTE2
     C                     MOVE @BANC     @MBANC
     C                     MOVE @STBI     @MSTBI
     C                     MOVE @EDBI     @MEDBI
     C                     Z-ADD@MAIS     @MMAIS
     C                     END
      *----------------------------------------------------*
      *  jﾞb 4-1 fﾞx] ﾆｭﾒ  <ﾌｮﾃc tｰtｰ pｬcﾒｭh>    (B#APW214)*
      *----------------------------------------------------*
     C           ZDSP04    TAG
     C                     SETOF                     32
     C                     WRITEB#APW218
     C                     WRITEB#APW214
     C                     EXFMTB#APW216
     C                     SETOF                     2299
     C                     MOVE *BLANK    @ERR
      *=== CMD2 ===*
     C           *IN02     IFEQ '1'
     C                     SETOF                     212299
     C                     Z-ADD0         @BANGO
     C                     MOVE *BLANK    @KBN
     C                     MOVE *BLANK    @ERR
     C                     GOTO ZDSP03
     C                     END
      *=== CMD3 ===*
     C           *IN03     IFEQ '1'
     C                     SETOF                     202122
     C                     SETOF                     99
     C                     MOVE *BLANK    @TKRA
     C                     Z-ADD0         @BANGO
     C                     MOVE *BLANK    @KBN
     C                     MOVE *BLANK    @ERR
     C                     GOTO ZDSP02
     C                     END
      *-------------------------*
      *   pｬcﾒｭh ﾃcyh kｩｮh      *
      *-------------------------*
     C           @KBN      IFEQ *BLANK
     C                     SETON                     2299
     C                     MOVELZMSG,5    @ERR
     C                     GOTO ZDSP04
     C                     END
      *
     C           @KBN      IFNE 'A'
     C           @KBN      ANDNE'B'
     C           @KBN      ANDNE'C'
     C                     SETON                     2299
     C                     MOVELZMSG,6    @ERR
     C                     GOTO ZDSP04
     C                     END
      * %0003
     C           PARM1     IFNE 'B'
%06  C           PARM1     ANDNE'C'
     C           @KBN      IFEQ 'C'
     C                     SETON                     2299
     C                     MOVELZMSG,6    @ERR
     C                     GOTO ZDSP04
     C                     ENDIF
%06  C                     ENDIF
      *=== ﾈbgﾞｭ ﾍｭcﾆg ON ===*
     C                     SETOF                     3031
     C           @KBN      IFEQ 'B'
     C                     SETON                     30
     C                     END
     C           @KBN      IFEQ 'C'
     C                     SETON                     31
     C                     END
      *== ﾌlﾃc tctc A ﾉ ng
     C           @KBN      IFEQ 'A'
     C                     SETOF                       3031
     C                     END
      *----------------------------------------------------*
      *  jﾞb 4-2 fﾞx] ﾆｭﾒ  <ﾌｮﾃc NO pｬcﾒｭh>      (B#APW214)*
      *----------------------------------------------------*
     C           ZDSP05    TAG
     C                     SETON                     32
     C                     WRITEB#APW218
     C                     WRITEB#APW214
     C                     WRITEB#APW216
     C                     EXFMTB#APW217
     C                     SETOF                     232425
     C                     SETOF                     99
     C                     MOVE *BLANK    @ERR
     C                     Z-ADD0         CHKMIS  50
      *=== CMD2 ===*
     C           *IN02     IFEQ '1'
     C                     SETOF                     222324
     C                     SETOF                     2599
     C                     MOVE *BLANK    @KBN
     C                     Z-ADD0         @STNO
     C                     Z-ADD0         @EDNO
     C                     Z-ADD0         @TMAI
     C                     MOVE *BLANK    @ERR
     C                     GOTO ZDSP04
     C                     END
      *=== CMD3 ===*
     C           *IN03     IFEQ '1'
     C                     SETOF                     202122
     C                     SETOF                     232425
     C                     SETOF                     99
     C                     MOVE *BLANK    @TKRA
     C                     Z-ADD0         @BANGO
     C                     MOVE *BLANK    @KBN
     C                     Z-ADD0         @STNO
     C                     Z-ADD0         @EDNO
     C                     Z-ADD0         @TMAI
     C                     MOVE *BLANK    @ERR
     C                     GOTO ZDSP02
     C                     END
      *----------------------------------------------------*
      *   INPU CHECK                                       *
      *----------------------------------------------------*
     C   31      @TMAI     IFEQ 0
     C                     SETON                     2599
     C                     MOVELZMSG,10   @ERR
     C                     GOTO ZDSP05
     C                     ENDIF
      *
     C   31N99   @TMAI     IFGE 501
     C                     SETON                     2599
     C                     MOVELZMSG,13   @ERR
     C                     GOTO ZDSP05
     C                     ENDIF
      *-------------------------------
     C           *IN05     CABEQ'0'       ZDSP05
      *----------------------------------------------------*
      *   ﾌｮﾃc ﾆｭﾒ                          (*IN05='1')    *
      *----------------------------------------------------*
     C                     SETOF                     81
      *
     C                     MOVE *BLANK    DUMY    4
     C           @MSTY     IFGE 80
     C                     MOVE @MSTY     DUMY
     C                     MOVEL'19'      DUMY
     C                     MOVELDUMY      #KUKYY
     C                     ELSE
     C                     MOVE @MSTY     DUMY
     C                     MOVEL'20'      DUMY
     C                     MOVELDUMY      #KUKYY
     C                     END
      *
     C                     Z-ADD@MSTM     #KUKMM
     C                     Z-ADD@MSTD     #KUKDD
     C                     Z-ADD@MSTB     #KUBIN
      *
     C           PARM1     CASEQ'C'       ZSB110           * xｮg f]ﾌﾞ]
     C           PARM1     CASEQ'B'       ZSB210           * ﾔｷｲﾚ ｶﾝﾊﾞﾝ
     C           PARM1     CASEQ'6'       ZSB310           * ﾊﾝｾｲﾋﾝ
     C                     END
      *
     C                     ADD  1         WKKENS
      *-------------------------*
      *   ﾈﾞ]fbﾎﾞ] ﾈｮn          *
      *-------------------------*
      *=== nﾃﾜ ﾌﾞ]k ===*
     C                     MOVE *BLANK    WKTKR
     C                     MOVE @TKR1     WKTKR1
     C                     MOVE @TKR2     WKTKR2
     C                     MOVE @TKR3     WKTKR3
     C                     MOVE @TKR4     WKTKR4
     C           WKTKR2    IFNE *BLANK
     C                     MOVE '-'       WKT2
     C                     END
     C           WKTKR3    IFNE *BLANK
     C                     MOVE '-'       WKT3
     C                     END
     C           WKTKR4    IFNE *BLANK
     C                     MOVE '-'       WKT4
     C                     END
     C                     MOVE WKTKR     @ZTKR
      *=== i]ﾇc ===*
     C                     Z-ADDWKKENS    @ZKEN
      *
     C                     SETOF                     202122
     C                     SETOF                     232425
     C                     SETOF                     99
     C                     MOVE *BLANK    @TKRA
     C                     Z-ADD0         @BANGO
     C                     MOVE *BLANK    @KBN
     C                     Z-ADD0         @STNO
     C                     Z-ADD0         @EDNO
     C                     Z-ADD0         @TMAI
     C                     MOVE *BLANK    @ERR
     C                     GOTO ZDSP02
      *----------------------------------------------------*
      *   ﾅﾎﾞﾎｦbﾓ ﾃcyh ﾈｮmb ﾆｭﾒ  <NO.01>                   *
      *       --       xｮg ﾎｦbﾓ ﾑﾒ ﾈｮn --        (ZSB100)  *
      *----------------------------------------------------*
     CSR         ZSB100    BEGSR
      *
     C                     SETOF                     6081
     C                     Z-ADD0         CTR     40
      *
     C                     DO   *HIVAL
     C           #KEY01    READEAAFPL031                 81
     C           *IN81     IFEQ '0'
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE@DATE
     C                     ELSE
     C                     ADD  1         CTR
     C                     ADD  1         RRN
      *=== NO ===*
     C                     Z-ADDRRN       @NO
      *=== ﾍ]ﾌﾞ] ===*
     C                     MOVE *BLANK    WKHINB
     C                     MOVE A31HB5    WKHIN1
     C                     MOVE A32HB5    WKHIN2
     C                     MOVE A33HB2    WKHIN3
     C           WKHIN2    IFNE *BLANK
     C                     MOVE '-'       WKH2
     C                     END
     C           WKHIN3    IFNE *BLANK
     C                     MOVE '-'       WKH3
     C                     END
     C                     MOVE WKHINB    @HINB
      *=== ﾆﾞﾃcmb ===*
     C                     MOVE *BLANK    WKKTE
     C                     MOVE A3ATOK    WKKTE1
     C                     Z-ADDA3ATOB    WKKTE2
     C           WKKTE2    IFNE *ZERO
     C                     MOVE '-'       WKK2
     C                     END
     C                     MOVE WKKTE     @KTE1
      *=== udﾃcmb ===*
     C                     MOVE *BLANK    WKKTE
     C                     MOVE A3MAEK    WKKTE1
     C                     Z-ADDA3MAKB    WKKTE2
     C           WKKTE2    IFNE *ZERO
     C                     MOVE '-'       WKK2
     C                     END
     C                     MOVE WKKTE     @KTE2
      *=== udﾃcmb nﾃﾜ ﾌﾞ]k ===*
     C                     MOVE *BLANK    WWTKR
     C                     MOVE A3MTK1    WWTKR1
     C                     MOVE A3MTK2    WWTKR2
     C                     MOVE A3MTK3    WWTKR3
     C                     MOVE A3MTK4    WWTKR4
     C           WWTKR2    IFNE *BLANK
     C                     MOVE '-'       WWT2
     C                     END
     C           WWTKR3    IFNE *BLANK
     C                     MOVE '-'       WWT3
     C                     END
     C           WWTKR4    IFNE *BLANK
     C                     MOVE '-'       WWT4
     C                     END
     C                     MOVE WWTKR     @BANC
      *=== ﾏcﾃcﾍﾞ ﾍﾞ] ===*
     C                     MOVE *BLANK    WKHZ
     C                     Z-ADDA3UKYY    WKYY
     C                     Z-ADDA3UKMM    WKMM
     C                     Z-ADDA3UKDD    WKDD
     C                     Z-ADDA3UBIN    WKBIN
     C           WKBIN     IFNE *ZERO
     C                     MOVE '-'       WKHZ1
     C                     END
     C                     MOVE WKHZ      @STBI
      *=== ﾆｮﾃcﾍﾞ ﾍﾞ] ===*
     C                     MOVE *BLANK    WKHZ
     C                     Z-ADDA3STYY    WKYY
     C                     Z-ADDA3STMM    WKMM
     C                     Z-ADDA3STDD    WKDD
     C                     Z-ADDA3SBIN    WKBIN
     C           WKBIN     IFNE *ZERO
     C                     MOVE '-'       WKHZ1
     C                     END
     C                     MOVE WKHZ      @EDBI
      *=== f]ﾌﾞ] ubﾇc (MAX) ===*
     C                     Z-ADDA3KMAX    @MAIS
     C                     WRITESFL01
      *
     C           CTR       IFEQ 1
     C                     Z-ADDRRN       WKNO1
     C                     END
      *
     C           CTR       IFEQ 11
     C                     SETON                     60
     C                     END
      *
     C                     Z-ADDRRN       WKNO2
     C                     Z-ADDA3UKYY    WKKEY1
     C                     Z-ADDA3UKMM    WKKEY2
     C                     Z-ADDA3UKDD    WKKEY3
     C                     Z-ADDA3UBIN    WKKEY4
      *
     C                     END
     C                     END
     C  N81N60             END
      *
     CSR         ZSB10E    ENDSR
      *----------------------------------------------------*
      *   f]ﾌﾞ] ﾌｮﾃc ﾑc ﾎｦbﾓ ﾅhﾈb ﾆｭﾒ  <NO.01>             *
      *       --       xｮg f]ﾌﾞ] ﾝｰhﾎｦbﾓ --      (ZSB110)  *
      *----------------------------------------------------*
     CSR         ZSB110    BEGSR
      *
     C                     SETOF                     81
     C           #KEY02    CHAINAAFPL031             81
     C           *IN81     IFEQ '0'
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE@DATE
     C                     ELSE
      *
      *=== ﾌｮﾃctｰtｰ = 'A' (ALL ﾌｮﾃc) ===*
     C           @KBN      IFEQ 'A'
     C                     EXSR ZSB120
     C                     END
      *=== ﾌｮﾃctｰtｰ = 'B' (fbﾆﾌｮﾃcNO f[ ﾆｬcﾒｭc ﾌｮﾃcNO umﾞ ﾌｮﾃc) ===*
     C           @KBN      IFEQ 'B'
     C                     EXSR ZSB120
     C                     END
%0003 *=== ﾌｮﾃctｰtｰ = 'C' (TEMPORARY KANBAN) ===*
     C           @KBN      IFEQ 'C'
     C                     EXSR ZSB120
     C                     END
      *
      *
     C                     END
     C                     END
     CSR         ZSB11E    ENDSR
      *----------------------------------------------------*
      *   f]ﾌﾞ] ﾌｮﾃc ﾑc ﾎｦbﾓ ﾆｬlﾒｭh ﾆｭﾒ    <NO.01>         *
      *       --       xｮg f]ﾌﾞ] ﾝｰhﾎｦbﾓ --      (ZSB120)  *
      *----------------------------------------------------*
     CSR         ZSB120    BEGSR
      *-------------------------*
      *   ﾌｮﾃctｰtｰsﾞl ﾃcyh ﾈｮn  *
      *-------------------------*
      *--- ﾌｮﾃc hﾎﾞ] / ﾌｮﾃc NO ﾆｭgk / ﾌｮﾃc ubﾇc / b]ﾆﾞ ubﾇc ･ ﾈｮn---*
%06  C                     MOVE ' '       WKBN    1
     C                     MOVEL'0'       WMSGKB  1
     C                     MOVEL*BLANK    WMSGTX 32
      *=== ﾌｮﾃctｰtｰ = 'A' =========*
     C           @KBN      IFEQ 'A'
     C                     Z-ADD0         @KALL   40
     C                     Z-ADD0         @KMIN   40
     C                     Z-ADDA3KMAX    @KMAX   50
     C                     Z-ADDA3SRMS    @SRMS   40
     C                     MOVEL'A'       WKBN
     C                     END
      *=== ﾌｮﾃctｰtｰ = 'B' =========*
     C           @KBN      IFEQ 'B'
     C                     SUB  1         @STNO
     C                     Z-ADD@STNO     @KALL
     C                     Z-ADD@STNO     @KMIN
     C                     Z-ADD@EDNO     @KMAX
     C                     MOVEL'A'       WKBN
     C                     END
      *=== ﾌｮﾃctｰtｰ = 'C' =========*
%06   *
 |   C           #KEY11    KLIST
 |   C                     KFLD           A31HB5
 |   C                     KFLD           A32HB5
 |   C                     KFLD           A33HB2
 |   C                     KFLD           A3ATOK
 |   C                     KFLD           WRENO
%06   *
     C           @KBN      IFEQ 'C'
%06  C                     MOVE 'R'       WKBN    1
%06  C                     MOVEL*BLANK    OVR800  1
     C                     MOVE 'MK'      WRENO   2        かんばん識別
     C                     MOVEL'1'       WMSGKB  1
     C                     EXSR #PAGE
     C                     ENDIF
      *
     C                     MOVE 'MK'      WRENO   2        かんばん識別
     C                     MOVE *BLANK    @HKBN   1        ﾌｮﾃchﾎﾞ]
     C                     Z-ADD0         @SYOK   30       ﾌｮﾃcNOﾆｭgk
     C                     Z-ADD0         @MAIS            ﾌｮﾃcubﾇc
     C                     Z-ADD0         @INZI   30       b]ﾆﾞubﾇc
      *
     C                     MOVE A3KALL    #PARM1
     C                     MOVE A3KMIN    #PARM2
     C                     MOVE A3KMAX    #PARM3
     C                     MOVE A3SRMS    #PARM4
     C                     MOVE *BLANK    #PARM5
     C                     MOVE *BLANK    #PARM6
     C                     MOVE *BLANK    #PARM7
     C                     MOVE *BLANK    #PARM8
     C                     CALL 'AAOR04'  #ENTRY           ﾌｮﾃcubﾇc計算
     C                     MOVE #PARM5    @HKBN            ﾌｮﾃchﾎﾞ]
     C                     MOVE #PARM6    @SYOK            ﾌｮﾃcNOﾆｭgk
     C                     MOVE #PARM7    @MAIS            ﾌｮﾃcubﾇc
     C                     MOVE #PARM8    @INZI            b]ﾆﾞubﾇc
     C                     MOVE 'MK'      WRENO   2        かんばん識別
      * 絶対番号 *
     C                     MOVE *BLANK    WZETI   4
     C                     SETOF                     11
     C           #KEY04    CHAINFCEPL011             11
     C           *IN11     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVE A2ZETI    WZETI
     C                     END
     C                     END
      * ページ番号 *
     C                     MOVE @SYOK     WPAGE   20
     C                     MOVE @SYOK     WPAGE3  30
      * 二次加工区分 *
     C                     MOVE 'A'       WNIJI   1
     C                     MOVE A3JK      W3JK
      * ﾎﾞ[]h kｩｮh
     C                     Z-ADD1         E       20
     C                     SETOF                     11
     C                     DO   6         E
     C           W3JK,E    IFNE *BLANK
     C                     SETON                     11
     C                     END
     C                     END
     C  N11                MOVE '0'       WNIJI
      *
     C                     Z-ADD1         E
     C                     DO   22        E
     C                     SETOF                     11
     C           #CHK,E    LOKUPW3JK                     11
     C           *IN11     IFEQ '1'
     C                     MOVE '0'       WNIJI
     C                     END
     C  N11                END
      * 対象区分・出庫有効区分 *
     C                     MOVE '5'       WTAIKB  1
     C                     MOVE '0'       WYUKO   1
     C                     SETOF                     11
     C           #KEY04    CHAINOABPL011             11
     C           *IN11     IFEQ '0'
     C           OBSKJY    IFEQ 'D'
     C           OBSKHZ    ANDLE*DATE
     C                     ELSE
     C           OBJKBN    IFEQ 'C'
      *
     C                     MOVE '0'       WTAIKB
     C           OBKBHZ    IFLE *DATE
     C                     MOVE OBSKBN    WYUKO
     C                     ELSE
     C                     MOVE OBKKBN    WYUKO
     C                     END
     C                     END
     C                     END
     C                     END
      * 前工程工場名
     C                     MOVE *BLANK    WMKJNM
     C                     SETOF                     11
     C           #KEY05    CHAINAATPL011             11
     C           *IN11     IFEQ '0'
     C           DCSKJY    IFEQ 'D'
     C           DCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELDCNAMN    WMKJNM
     C                     END
     C                     END
      * 自工程部門名
     C                     MOVE *BLANK    WJBUNM
     C                     SETOF                     11
     C           #KEY06    CHAINAATPL011             11
     C           *IN11     IFEQ '0'
     C           DCSKJY    IFEQ 'D'
     C           DCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELDCNAMN    WJBUNM
     C                     END
     C                     END
      * Ｃ箱比率
     C                     MOVE *BLANK    WCBKO   2
     C           A3CBKO    IFNE 0
     C                     MOVE A3CBKO    WCBKO
     C                     END
     C           WCBKO1    IFEQ '0'
     C                     MOVE *BLANK    WCBKO1
     C                     END
      * 表面処理
     C           A3KCD1    IFEQ 'C'
     C           A3KCD2    ANDEQ'Z'
     C                     MOVE *BLANK    W3MEKI  7
     C*
     C                     ELSE
     C                     MOVE A3MEKI    W3MEKI
     C                     END
      * メッキ条件名
     C                     Z-ADD1         E
     C                     MOVE *BLANK    WMNM
     C                     DO   2         E
     C                     MOVE '  '      WMNM,E
     C                     MOVE A3JOK,E   WJOKEN  2
     C                     SETOF                     11
     C           #KEY07    CHAINAAAPL011             11
     C           *IN11     IFEQ '0'
     C           A5SKJY    IFEQ 'D'
     C           A5SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELA5JOKM    WMNM,E
     C                     END
     C                     END
     C                     END
      * 荷姿条件名
     C                     Z-ADD1         E
     C                     Z-ADD0         Z       20
     C                     MOVE *BLANK    WNNM
     C           3         DO   6         E
     C                     ADD  1         Z
     C                     MOVE A3JOK,E   WJOKEN  2
     C                     SETOF                     11
     C           #KEY07    CHAINAAAPL011             11
     C           *IN11     IFEQ '0'
     C           A5SKJY    IFEQ 'D'
     C           A5SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELA5JOKM    WNNM,Z
     C                     END
     C                     END
     C                     END
      ** TMMKWV
     C           K#MBD1    CHAINMBDPL01              91
     C           *IN91     IFEQ *OFF
     C                     MOVE '*****'   WNNM4
     C                     ENDIF
      *
%06  C           @KBN      IFNE 'C'
     C           #MAIS     IFNE 0
     C                     Z-ADD#MAIS     @KMAX
     C                     ENDIF
%06  C                     ENDIF
     C*
     C                     MOVELA3YOSI    W1YOSI  20
      *
      * ...PLATING KANBAN ISSUE HISTORY       *
     C                     EXSR #AFP30
      *
     C                     Z-ADD@KMAX     #@KMAX  40
     C                     Z-ADDA3KMAX    @3KMAX  30
     C                     EXCPTFILE11
      *
%06  C           OVR800    IFEQ '*'
     C                     Z-ADD300       @KALL
     C                     Z-ADD300       @KMIN
     C                     Z-ADDWPAG2     @KMAX
      *
      * ...PLATING KANBAN ISSUE HISTORY       *
     C                     EXSR #AFP30
      *
     C                     Z-ADD@KMAX     #@KMAX  40
     C                     Z-ADDA3KMAX    @3KMAX
     C                     EXCPTFILE11
%06  C                     ENDIF
      *
     C                     SETON                       U1U2
      *
     CSR         ZSB12E    ENDSR
      *================================================================
      *     2019/02/05めっきかんばん　臨時追加
      *================================================================
     C           #PAGE     BEGSR
      *  PAGE #  301-800
     C           #KEY11    CHAINABHPPC1              32
S1   C           *IN32     IFEQ '0'
     C* UPDATE
     C                     Z-ADDWTIHZ     ACKODT
     C                     Z-ADDWJFB      ACKOTM
     C           ACPAGN    ADD  @TMAI     WPAG1   40
     C* GREATER THAN 800
 S2  C           WPAG1     IFGT 800
     C           WPAG1     SUB  800       WPAG2   40
     C           WPAG2     ADD  300       WPAG2
     C*
  S3 C           ACPAGN    IFEQ 800
     C                     Z-ADD300       @KALL
     C                     Z-ADD300       @KMIN
     C                     Z-ADDWPAG2     @KMAX
  X3 C                     ELSE
     C                     MOVEL'*'       OVR800
     C                     Z-ADDACPAGN    @KALL
     C                     Z-ADDACPAGN    @KMIN
     C                     Z-ADD800       @KMAX
  E3 C                     ENDIF
     C                     Z-ADDWPAG2     ACPAGN
     C* LESS EQUAL 800
 X2  C                     ELSE
     C                     Z-ADDACPAGN    @KALL
     C                     Z-ADDACPAGN    @KMIN
     C                     Z-ADDWPAG1     @KMAX
     C                     Z-ADDWPAG1     ACPAGN
 E2  C                     ENDIF
     C*
     C                     UPDATABHPPC11
X1   C                     ELSE
     C* WRITE
     C                     CLEARABHPPC11
     C                     Z-ADDWTIHZ     ACKODT
     C                     Z-ADDWJFB      ACKOTM
     C                     MOVELWRENO     ACKAID
     C                     MOVELA3ATOK    ACPROC
     C                     MOVELA31HB5    ACHIN1
     C                     MOVELA32HB5    ACHIN2
     C                     MOVELA33HB2    ACHIN3
     C           @TMAI     ADD  300       WPAG1   40
     C* GREATER THAN 800
 S2  C           WPAG1     IFGT 800
     C           WPAG1     SUB  800       WPAG2
     C           WPAG2     ADD  300       WPAG2
     C                     MOVEL'*'       OVR800
     C                     Z-ADDACPAGN    @KALL
     C                     Z-ADDACPAGN    @KMIN
     C                     Z-ADD800       @KMAX
     C                     Z-ADDWPAG2     ACPAGN
     C* LESS EQUAL 800
 X2  C                     ELSE
     C                     Z-ADD300       @KALL
     C                     Z-ADD300       @KMIN
     C                     Z-ADDWPAG1     @KMAX
     C                     Z-ADDWPAG1     ACPAGN
 E2  C                     ENDIF
     C*
     C                     WRITEABHPPC11
E1   C                     ENDIF
      *
     C                     ENDSR
      *================================================================
      *----------------------------------------------------*
      *   ﾅﾎﾞﾎｦbﾓ ﾃcyh ﾈｮmb ﾆｭﾒ  <NO.02>                   *
      *       --      ﾔｷｲﾚ ﾎｦbﾓ ﾑﾒ ﾈｮn --        (ZSB200)  *
      *----------------------------------------------------*
     CSR         ZSB200    BEGSR
      *
     C                     SETOF                     6081
     C                     Z-ADD0         CTR     40
      *
     C                     DO   *HIVAL
     C           #KEY01    READEADHPL031                 81
     C           *IN81     IFEQ '0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    ANDLE@DATE
     C                     ELSE
     C                     ADD  1         CTR
     C                     ADD  1         RRN
      *=== NO ===*
     C                     Z-ADDRRN       @NO
      *=== ﾍ]ﾌﾞ] ===*
     C                     MOVE *BLANK    WKHINB
     C                     MOVE J6SHN1    WKHIN1
     C                     MOVE J6SHN2    WKHIN2
     C                     MOVE J6SHN3    WKHIN3
     C           WKHIN2    IFNE *BLANK
     C                     MOVE '-'       WKH2
     C                     END
     C           WKHIN3    IFNE *BLANK
     C                     MOVE '-'       WKH3
     C                     END
     C                     MOVE WKHINB    @HINB
      *=== ﾆﾞﾃcmb ===*
     C                     MOVE *BLANK    WKKTE
     C                     MOVE J6ATOK    WKKTE1
     C                     Z-ADDJ6ATOB    WKKTE2
     C           WKKTE2    IFNE *ZERO
     C                     MOVE '-'       WKK2
     C                     END
     C                     MOVE WKKTE     @KTE1
      *=== udﾃcmb ===*
     C                     MOVE *BLANK    WKKTE
     C                     MOVE J6MAEK    WKKTE1
     C                     Z-ADDJ6MAKB    WKKTE2
     C           WKKTE2    IFNE *ZERO
     C                     MOVE '-'       WKK2
     C                     END
     C                     MOVE WKKTE     @KTE2
      *=== udﾃcmb nﾃﾜ ﾌﾞ]k ===*
     C                     MOVE *BLANK    WWTKR
     C                     MOVE J6MTK1    WWTKR1
     C                     MOVE J6MTK2    WWTKR2
     C                     MOVE J6MTK3    WWTKR3
     C                     MOVE J6MTK4    WWTKR4
     C           WWTKR2    IFNE *BLANK
     C                     MOVE '-'       WWT2
     C                     END
     C           WWTKR3    IFNE *BLANK
     C                     MOVE '-'       WWT3
     C                     END
     C           WWTKR4    IFNE *BLANK
     C                     MOVE '-'       WWT4
     C                     END
     C                     MOVE WWTKR     @BANC
      *=== ﾏcﾃcﾍﾞ ﾍﾞ] ===*
     C                     MOVE *BLANK    WKHZ
     C                     Z-ADDJ6UKYY    WKYY
     C                     Z-ADDJ6UKMM    WKMM
     C                     Z-ADDJ6UKDD    WKDD
     C                     Z-ADDJ6UBIN    WKBIN
     C           WKBIN     IFNE *ZERO
     C                     MOVE '-'       WKHZ1
     C                     END
     C                     MOVE WKHZ      @STBI
      *=== ﾆｮﾃcﾍﾞ ﾍﾞ] ===*
     C                     MOVE *BLANK    WKHZ
     C                     Z-ADDJ6STYY    WKYY
     C                     Z-ADDJ6STMM    WKMM
     C                     Z-ADDJ6STDD    WKDD
     C                     Z-ADDJ6SBIN    WKBIN
     C           WKBIN     IFNE *ZERO
     C                     MOVE '-'       WKHZ1
     C                     END
     C                     MOVE WKHZ      @EDBI
      *=== f]ﾌﾞ] ubﾇc (MAX) ===*
     C                     Z-ADDJ6KMAX    @MAIS
     C                     WRITESFL01
      *
     C           CTR       IFEQ 1
     C                     Z-ADDRRN       WKNO1
     C                     END
      *
     C           CTR       IFEQ 11
     C                     SETON                     60
     C                     END
      *
     C                     Z-ADDRRN       WKNO2
     C                     Z-ADDJ6UKYY    WKKEY1
     C                     Z-ADDJ6UKMM    WKKEY2
     C                     Z-ADDJ6UKDD    WKKEY3
     C                     Z-ADDJ6UBIN    WKKEY4
      *
     C                     END
     C                     END
     C  N81N60             END
      *
     CSR         ZSB20E    ENDSR
      *----------------------------------------------------*
      *   f]ﾌﾞ] ﾌｮﾃc ﾑc ﾎｦbﾓ ﾅhﾈb ﾆｭﾒ  <NO.02>             *
      *       --      ﾔｷｲﾚ f]ﾌﾞ] ﾝｰhﾎｦbﾓ --      (ZSB210)  *
      *----------------------------------------------------*
     CSR         ZSB210    BEGSR
      *
     C                     SETOF                     81
     C           #KEY02    CHAINADHPL031             81
     C           *IN81     IFEQ '0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    ANDLE@DATE
     C                     ELSE
      *
      *=== ﾌｮﾃctｰtｰ = 'A' (ALL ﾌｮﾃc) ===*
     C           @KBN      IFEQ 'A'
     C                     EXSR ZSB220
     C                     END
      *=== ﾌｮﾃctｰtｰ = 'B' (fbﾆﾌｮﾃcNO f[ ﾆｬcﾒｭc ﾌｮﾃcNO umﾞ ﾌｮﾃc) ===*
     C           @KBN      IFEQ 'B'
     C                     EXSR ZSB220
     C                     END
%0003 *=== ﾌｮﾃctｰtｰ = 'C' (TEMPORARY KANBAN) ===*
     C           @KBN      IFEQ 'C'
     C                     EXSR ZSB220
     C                     END
      *
     C                     END
     C                     END
     CSR         ZSB21E    ENDSR
      *----------------------------------------------------*
      *   f]ﾌﾞ] ﾌｮﾃc ﾑc ﾎｦbﾓ ﾆｬlﾒｭh ﾆｭﾒ    <NO.02>         *
      *       --       xｮg f]ﾌﾞ] ﾝｰhﾎｦbﾓ --      (ZSB220)  *
      *----------------------------------------------------*
     CSR         ZSB220    BEGSR
      *-------------------------*
      *   ﾌｮﾃctｰtｰsﾞl ﾃcyh ﾈｮn  *
      *-------------------------*
      *--- ﾌｮﾃc hﾎﾞ] / ﾌｮﾃc NO ﾆｭgk / ﾌｮﾃc ubﾇc / b]ﾆﾞ ubﾇc ･ ﾈｮn---*
     C                     Z-ADDJ6SRMS    @SRMS   40
      *=== ﾌｮﾃctｰtｰ = 'A' =========*
     C           @KBN      IFEQ 'A'
     C                     Z-ADD0         @KALL   40
     C                     Z-ADD0         @KMIN   40
     C                     Z-ADDJ6KMAX    @KMAX
     C                     MOVE 'A'       WKBN    1
     C                     END
      *=== ﾌｮﾃctｰtｰ = 'B' =========*
     C           @KBN      IFEQ 'B'
     C                     SUB  1         @STNO
     C                     Z-ADD@STNO     @KALL
     C                     Z-ADD@STNO     @KMIN
     C                     Z-ADD@EDNO     @KMAX
     C                     MOVE 'A'       WKBN    1
     C                     END
      *=== ﾌｮﾃctｰtｰ = 'C' =========*
%0003C           @KBN      IFEQ 'C'
      *
     C                     MOVE 'R'       WKBN    1
     C                     MOVEL*BLANK    OVR800  1
     C                     MOVEL'YK'      WRENO   2
     C                     MOVEL'1'       WMSGKB  1
      *  PAGE #  301-800
     C           #KEY10    CHAINABHPPC1              32
     C           *IN32     IFEQ '0'
     C* UPDATE
     C                     Z-ADDWTIHZ     ACKODT
     C                     Z-ADDWJFB      ACKOTM
     C           ACPAGN    ADD  @TMAI     WPAG1   40
     C* GREATER THAN 800
     C           WPAG1     IFGT 800
     C           WPAG1     SUB  800       WPAG2   40
     C           WPAG2     ADD  300       WPAG2
     C*
     C           ACPAGN    IFEQ 800
     C                     Z-ADD300       @KALL
     C                     Z-ADD300       @KMIN
     C                     Z-ADDWPAG2     @KMAX
     C                     ELSE
     C                     MOVEL'*'       OVR800
     C                     Z-ADDACPAGN    @KALL
     C                     Z-ADDACPAGN    @KMIN
     C                     Z-ADD800       @KMAX
     C                     ENDIF
     C                     Z-ADDWPAG2     ACPAGN
     C* LESS EQUAL 800
     C                     ELSE
     C                     Z-ADDACPAGN    @KALL
     C                     Z-ADDACPAGN    @KMIN
     C                     Z-ADDWPAG1     @KMAX
     C                     Z-ADDWPAG1     ACPAGN
     C                     ENDIF
     C*
     C                     UPDATABHPPC11
     C                     ELSE
     C* WRITE
     C                     CLEARABHPPC11
     C                     Z-ADDWTIHZ     ACKODT
     C                     Z-ADDWJFB      ACKOTM
     C                     MOVELWRENO     ACKAID
     C                     MOVELJ6ATOK    ACPROC
     C                     MOVELJ6SHN1    ACHIN1
     C                     MOVELJ6SHN2    ACHIN2
     C                     MOVELJ6SHN3    ACHIN3
     C           @TMAI     ADD  300       WPAG1   40
     C* GREATER THAN 800
     C           WPAG1     IFGT 800
     C           WPAG1     SUB  800       WPAG2
     C           WPAG2     ADD  300       WPAG2
     C                     MOVEL'*'       OVR800
     C                     Z-ADDACPAGN    @KALL
     C                     Z-ADDACPAGN    @KMIN
     C                     Z-ADD800       @KMAX
     C                     Z-ADDWPAG2     ACPAGN
     C* LESS EQUAL 800
     C                     ELSE
     C                     Z-ADD300       @KALL
     C                     Z-ADD300       @KMIN
     C                     Z-ADDWPAG1     @KMAX
     C                     Z-ADDWPAG1     ACPAGN
     C                     ENDIF
     C*
     C                     WRITEABHPPC11
     C                     ENDIF
      *
     C                     ENDIF
      *最終工程*
     C                     MOVELJ6ATOK    STOK    3
      *前工程部門名*
     C                     MOVE *BLANK    WMMEI  16
     C                     SETOF                     33
     C           J6MAKB    CHAINFGBPL011             33
     C           *IN33     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C                     SETON                     33
     C                     END
     C           *IN33     IFEQ '0'
     C                     MOVELB2SMEI    WMMEI
     C                     END
      *材料名*
     C                     MOVEL*BLANK    ZINM   15
     C                     MOVEL*BLANK    ZINM2  20
     C                     SETOF                     30
     C           J6ZACD    CHAINFCETL061             30
     C           *IN30     IFEQ '0'
     C                     MOVELA2ZANM    ZINM
     C                     MOVELA2ZANM    ZINM2
     C                     END
      *箱色*
     C                     Z-ADD1         BB      20
     C                     MOVE *BLANK    WIR
     C           1         DO   2         BB
     C           HIR,BB    IFNE *BLANK
     C                     Z-ADD1         CC      20
     C                     SETOF                     33
     C           HIR,BB    CHAINABHPP401             33
     C           *IN33     IFEQ '0'
     C                     MOVELA4NAME    WIR,BB
     C                     END
     C                     END
     C                     END
      *条件名*
     C                     MOVE *BLANK    KJOK    2
     C                     MOVE 'B'       KSYU    1
      *
     C                     Z-ADD1         BB
     C                     MOVE *BLANK    WJK
     C           1         DO   5         BB
     C           JOK,BB    IFNE *BLANK
     C                     Z-ADD1         CC      20
     C                     MOVELJOK,BB    KJOK
      *
     C                     SETOF                     33
     C           #KEY08    CHAINAAAPL011             33
     C           *IN33     IFEQ '0'
     C           A5SKJY    ANDEQ'D'
     C                     SETON                     33
     C                     END
     C           *IN33     IFEQ '0'
     C                     MOVELA5JOKM    WJK,BB
     C                     END
     C                     END
     C                     END
      *収容数*
     C                     Z-ADD*ZERO     SYOS    50
     C                     Z-ADDJ6SYOS    SYOS
      *自工程　工程コード*
     C                     MOVEL*BLANK    ATOK    3
     C                     MOVELJ6ATOK    ATOK
      *
     C                     MOVEL*BLANK    AKT
     C                     Z-ADD*ZERO     ABM
     C                     MOVEL*BLANK    AKB
     C                     MOVEL*BLANK    ATOK
     C                     MOVEL*BLANK    ALC
      *
     C                     SETOF                     30
     C           #KEY09    CHAINAAMPL111             30
      *
     C           *IN30     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     Z-ADD1         X       20
     C                     Z-ADD0         L       20
     C           1         DO   15        X
     C                     MOVELNUKH,X    WUKH    80
     C           WUKH      IFGT J6UKHZ
     C                     ADD  1         L
     C                     MOVE OKOT,X    AKT,L
     C                     Z-ADDOBMN,X    ABM,L
     C                     MOVE OKBN,X    AKB,L
     C                     MOVELOLC,X     ALC,L
     C                     ELSE
     C                     ADD  1         L
     C                     MOVE NKOT,X    AKT,L
     C                     Z-ADDNBMN,X    ABM,L
     C                     MOVE NKBN,X    AKB,L
     C                     MOVELNLC,X     ALC,L
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDIF
      *
     C                     SETOF                     30
     C                     Z-ADD1         X       20
     C           J6RONO    LOKUPAKB,X                    30
     C           *IN30     IFEQ '1'
     C           ABM,X     ANDEQJ6ATOB
     C                     MOVE AKT,X     ATOK
     C                     ENDIF
      *
%08   *  CKECK PROCESS CODE FOR PRINTING BARCODE
     C                     MOVEL*BLANK    C@OQ    1
     C                     MOVEL*BLANK    C@LOQ   1
      *
     C                     Z-ADD1         X       20
     C           J6ATK     LOKUPALC,X                    30
      *
     C           *IN30     IFEQ *ON
     C           'OQ'      IFEQ AKT,X
     C                     MOVEL'1'       C@OQ
     C                     ENDIF
     C           'LOQ'     IFEQ AKT,X
     C                     MOVEL'1'       C@LOQ
     C                     ENDIF
     C                     ENDIF
      * X-1
     C                     SUB  1         X
      *
     C           X         DOWGE1
      *
     C           ALC,X     IFEQ '------'
      *                                                 C
     C           'OQ'      IFEQ AKT,X
     C                     MOVEL'1'       C@OQ
     C                     ENDIF
     C           'LOQ'     IFEQ AKT,X
     C                     MOVEL'1'       C@LOQ
     C                     ENDIF
      *                                                 C
     C                     ELSE
      *                                                 C
     C           J6ATK     IFNE ALC,X
     C                     LEAVE
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     SUB  1         X
     C*
     C                     ENDDO
      *
      *
      ** TMMKWV
     C                     MOVE *BLANK    W@MRK   5
     C           K#MBD2    CHAINMBDPL01              91
     C           *IN91     IFEQ *OFF
     C                     MOVEL'*****'   W@MRK
     C                     ENDIF
      *
      *箱種がＧの時、１箱重量に焼入れロット箱数をかける。
      * J6HKJR 3(1)が桁数不足なので、N@HKJR 4(1)を追加
     C                     Z-ADDJ6HKJR    N@HKJR  41
     C                     Z-ADD0         W@HKJR  72
      *
S1   C           J6SYOT    IFEQ 'G'
      *
 S2  C           J6SOZI    IFNE 0
     C           J6SOZI    MULT J6SYOS    W1HK    71H
     C           W1HK      DIV  1000      W@HKJR
     C           W@HKJR    ADD  .09       N@HKJR
 E2  C                     END
      *
E1   C                     END
      *
%0003C           @KBN      IFNE 'C'
     C           #MAIS     IFNE 0
     C                     Z-ADD#MAIS     J6KMAX
     C                     Z-ADD#MAIS     @KMAX
     C                     ENDIF
     C                     ENDIF
      *
%05   *↓
      *
     C                     Z-ADDJ6LOTO    $$LOTO  30
     C                     Z-ADDJ6SETO    $$SETO  30
     C                     Z-ADDJ6HOJI    $$HOJI  30
     C                     Z-ADD0         $$TUSZ  31
     C                     Z-ADD0         $$KUBI  52
     C           #KEY09    CHAINFCEPL01              30
     C           *IN30     IFEQ *OFF
     C           A2GSKD    ANDEQ' '
     C                     Z-ADDA2TUSZ    $$TUSZ           サイズ
     C                     Z-ADDA2KUBI    $$KUBI           首下
     C                     ENDIF
      */////////////////////////
      **前工程絶対№・前工程社内品番
     C           AAMRS3    PLIST
     C                     PARM           J6SHN1
     C                     PARM           J6SHN2
     C                     PARM           J6SHN3
     C                     PARM           J6ATK   6
     C                     PARM '   '     P@AKT1  3
     C                     PARM '   '     P@AKT2  3
     C                     PARM '   '     P@AKT3  3
     C                     PARM '   '     P@AKT4  3
     C                     PARM           P@OPCL  1
     C                     PARM           P@MHIN 12
     C                     PARM           P@MZET  4
     C                     PARM           P@KBY1  6        機番予備１
     C                     PARM           P@KBY2  6        機番予備２
     C                     PARM           P@KBY3  6        機番予備３
     C                     PARM           P@FLG   1
     C*
     C                     MOVE ' '       P@OPCL  1
     C           @AAMRS    IFEQ ' '
     C                     MOVE '1'       P@OPCL
     C                     MOVE '*'       @AAMRS  1
     C                     ENDIF
     C                     CALL 'AAMRS3'  AAMRS3
     C                     MOVELP@MHIN    WMSHN  12
     C                     MOVELP@MZET    WMZET   4
      *
      *バーコード作成
     C                     EXSR #BARCD
      *
      * QUENCHING (OQ)KANBAN ISSUE HISTORY
     C           @KMAX     SUB  @KMIN     @KMAX2  50
     C                     EXSR #ADH30
%05   * WRITE KANBAN DATA
     C                     Z-ADDJ6KMAX    #6KMAX  30
     C                     Z-ADD@KMAX     #@KMAX  40
     C                     EXCPTFILE22
      *
      * %0004  WRITE LOG (OLD VERSION)
     C                     EXSR #WRTC2                     * WRITE
      *---------
      * %0003 IF # OF TEMPORARY KANBAN EXCEEDS 800,
      *       THEN KANBAN PAGE # STARTS FROM 301 AGAIN.
     C           OVR800    IFEQ '*'
     C                     Z-ADD300       @KALL
     C                     Z-ADD300       @KMIN
     C                     Z-ADDWPAG2     @KMAX
      *
      * QUENCHING (OQ)KANBAN ISSUE HISTORY
     C           @KMAX     SUB  @KMIN     @KMAX2
     C                     EXSR #ADH30
      * WRITE KANBAN DATA
     C                     Z-ADDJ6KMAX    #6KMAX  30
     C                     Z-ADD@KMAX     #@KMAX  40
     C                     EXCPTFILE22
      *
      * %0004  WRITE LOG (OLD VERSION)
     C                     EXSR #WRTC2                     * WRITE
     C                     ENDIF
      *-------
     C                     SETON                       U1U3
      *
     CSR         ZSB22E    ENDSR
%0002 *----------------------------------------------------*
      *   ｻﾌﾞﾌｧｲﾙ ｺｳﾓｸ ｾｯﾃｲ ｼｮﾘ  <NO.03>                   *
      *       --      ﾊﾝｾｲﾋﾝ ｶﾝﾊﾞﾝ ﾏｽﾀｰ          (ZSB300)  *
      *----------------------------------------------------*
     CSR         ZSB300    BEGSR
      *
     C                     SETOF                     6081
     C                     Z-ADD0         CTR
      *
     C                     DO   *HIVAL
     C           #KEY01    READEAANPL031                 81
     C           *IN81     IFEQ '0'
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    ANDLE@DATE
     C                     ELSE
     C                     ADD  1         CTR
     C                     ADD  1         RRN
      *=== NO ===*
     C                     Z-ADDRRN       @NO
      *=== ﾋﾝﾊﾞﾝ ===*
     C                     MOVE *BLANK    WKHINB
     C                     MOVE L7SHN1    WKHIN1
     C                     MOVE L7SHN2    WKHIN2
     C                     MOVE L7SHN3    WKHIN3
     C           WKHIN2    IFNE *BLANK
     C                     MOVE '-'       WKH2
     C                     END
     C           WKHIN3    IFNE *BLANK
     C                     MOVE '-'       WKH3
     C                     END
     C                     MOVE WKHINB    @HINB
      *=== ｼﾞｺｳﾃｲ ===*
     C                     MOVE *BLANK    WKKTE
     C                     MOVE 'HN '     WKKTE1
     C                     Z-ADDL7UKOJ    WKKTE2
     C           WKKTE2    IFNE *ZERO
     C                     MOVE '-'       WKK2
     C                     END
     C                     MOVE WKKTE     @KTE1
      *=== ﾏｴｺｳﾃｲ ===*
     C                     MOVE *BLANK    WKKTE
     C                     MOVE L7KTEI    WKKTE1
     C                     Z-ADDL7BMON    WKKTE2
     C           WKKTE2    IFNE *ZERO
     C                     MOVE '-'       WKK2
     C                     END
     C                     MOVE WKKTE     @KTE2
      *=== ﾏｴｺｳﾃｲ ﾄｺﾛ ﾊﾞﾝﾁ ===*
     C                     MOVE *BLANK    WWTKR
     C                     MOVE L7KTR1    WWTKR1
     C                     MOVE L7KTR2    WWTKR2
     C                     MOVE L7KTR3    WWTKR3
     C                     MOVE L7KTR4    WWTKR4
     C           WWTKR2    IFNE *BLANK
     C                     MOVE '-'       WWT2
     C                     END
     C           WWTKR3    IFNE *BLANK
     C                     MOVE '-'       WWT3
     C                     END
     C           WWTKR4    IFNE *BLANK
     C                     MOVE '-'       WWT4
     C                     END
     C                     MOVE WWTKR     @BANC
      *=== ﾕｳｺｳﾋﾞ ﾋﾞﾝ ===*
     C                     MOVE *BLANK    WKHZ
     C                     Z-ADDL7UKYY    WKYY
     C                     Z-ADDL7UKMM    WKMM
     C                     Z-ADDL7UKDD    WKDD
     C                     Z-ADDL7UBIN    WKBIN
     C           WKBIN     IFNE *ZERO
     C                     MOVE '-'       WKHZ1
     C                     END
     C                     MOVE WKHZ      @STBI
      *=== ｼｯｺｳﾋﾞ ﾋﾞﾝ ===*
     C                     MOVE *BLANK    WKHZ
     C                     Z-ADDL7STYY    WKYY
     C                     Z-ADDL7STMM    WKMM
     C                     Z-ADDL7STDD    WKDD
     C                     Z-ADDL7SBIN    WKBIN
     C           WKBIN     IFNE *ZERO
     C                     MOVE '-'       WKHZ1
     C                     END
     C                     MOVE WKHZ      @EDBI
      *=== ｶﾝﾊﾞﾝ ﾏｲｽｳ (MAX) ===*
     C                     Z-ADDL7KMAX    @MAIS
     C                     WRITESFL01
      *
     C           CTR       IFEQ 1
     C                     Z-ADDRRN       WKNO1
     C                     END
      *
     C           CTR       IFEQ 11
     C                     SETON                     60
     C                     END
      *
     C                     Z-ADDRRN       WKNO2
     C                     Z-ADDL7UKYY    WKKEY1
     C                     Z-ADDL7UKMM    WKKEY2
     C                     Z-ADDL7UKDD    WKKEY3
     C                     Z-ADDL7UBIN    WKKEY4
      *
     C                     END
     C                     END
     C  N81N60             END
      *
     CSR         ZSB30E    ENDSR
      *----------------------------------------------------*
      *   ｶﾝﾊﾞﾝ ﾊｯｺｳ ﾖｳ ﾌｧｲﾙ ｻｸｾｲ ｼｮﾘ  <NO.03>             *
      *       --      ﾊﾝｾｲﾋﾝ ｶﾝﾊﾞﾝ ﾉ ﾜｰｸ ｻｸｾｲ -- (ZSB310)  *
      *----------------------------------------------------*
     CSR         ZSB310    BEGSR
      *
     C                     SETOF                     81
     C           #KEY02    CHAINAANPL031             81
     C           *IN81     IFEQ '0'
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    ANDLE@DATE
     C                     ELSE
      *
      *=== ﾊｯｺｳﾎｳﾎｳ = 'A' (ALL ﾊｯｺｳ) ===*
     C           @KBN      IFEQ 'A'
     C                     EXSR ZSB320
     C                     END
      *=== ﾊｯｺｳﾎｳﾎｳ = 'B' (ｶｲｼﾊｯｺｳNO ｶﾗ ｼｭｳﾘｮｳ ﾊｯｺｳNO ﾏﾃﾞ ﾊｯｺｳ) ===*
     C           @KBN      IFEQ 'B'
     C                     EXSR ZSB320
     C                     END
      *
     C                     END
     C                     END
     CSR         ZSB31E    ENDSR
      *----------------------------------------------------*
      *   ｶﾝﾊﾞﾝ ﾊｯｺｳ ﾖｳ ﾌｧｲﾙ ｼｭﾂﾘｮｸ ｼｮﾘ    <NO.03>         *
      *       --       ﾊﾝｾｲﾋﾝ ｶﾝﾊﾞﾝ ﾜｰｸﾌｧｲﾙ --   (ZSB320)  *
      *----------------------------------------------------*
     CSR         ZSB320    BEGSR
      *-------------------------*
      *   ﾊｯｺｳﾎｳﾎｳﾍﾞﾂ ｺｳﾓｸ ｾｯﾄ  *
      *-------------------------*
      *--- ﾊｯｺｳｸﾌﾞﾝ  / ﾊｯｺｳ NO ｼｮｷﾁ / ﾊｯｺｳ ﾏｲｽｳ / ｲﾝｼﾞ ﾏｲｽｳ ｦ ｾｯﾄ---*
      *=== ﾊｯｺｳﾎｳﾎｳ = 'A' =========*
%0002 *
     C                     MOVE *BLANK    @HKBN            ﾌｮﾃchﾎﾞ]
     C                     Z-ADD0         @SYOK            ﾌｮﾃcNOﾆｭgk
     C                     Z-ADD0         @MAIS            ﾌｮﾃcubﾇc
     C                     Z-ADD0         @INZI            b]ﾆﾞubﾇc
      *
     C                     MOVE L7KALL    #PARM1
     C                     MOVE L7KMIN    #PARM2
     C                     MOVE L7KMAX    #PARM3
     C                     MOVE L7SRMS    #PARM4
     C                     MOVE *BLANK    #PARM5
     C                     MOVE *BLANK    #PARM6
     C                     MOVE *BLANK    #PARM7
     C                     MOVE *BLANK    #PARM8
     C                     CALL 'AAOR04'  #ENTRY           ﾌｮﾃcubﾇc計算
     C                     MOVE #PARM5    @HKBN            ﾌｮﾃchﾎﾞ]
     C                     MOVE #PARM6    @SYOK            ﾌｮﾃcNOﾆｭgk
     C                     MOVE #PARM7    @MAIS            ﾌｮﾃcubﾇc
     C                     MOVE #PARM8    @INZI            b]ﾆﾞubﾇc
      *
     C                     EXSR #SB100
     C           @KBN      IFEQ 'B'
     C                     Z-ADD@STNO     @SYOK
     C           @EDNO     SUB  @STNO     @MAIS
     C                     ADD  1         @MAIS
     C                     END
      *
     C                     Z-ADD0         WPNO    30
     C                     Z-ADD@SYOK     WPNO
     C                     DO   @MAIS
     C                     Z-ADDL7KALL    #7KALL
     C                     Z-ADDL7MAIS    #7MAIS
     C                     Z-ADDL7KMIN    #7KMIN
     C                     Z-ADDL7KMAX    #7KMAX
     C                     Z-ADDL7SRMS    #7SRMS
     C                     Z-ADDL7ALHK    #7ALHK
     C                     Z-ADDL7MXHK    #7MXHK
     C                     Z-ADDL7JDMS    #7JDMS
     C                     EXCPTFILE33
TCHK1C                     WRITEAANWP211
     C                     ADD  1         WPNO
     C                     ENDDO
      *
     C                     SETON                       U1U4
      *
     CSR         ZSB32E    ENDSR
      *-----------------------------------------------------*
     C           #SB100    BEGSR
     C                     MOVE *BLANK    HHIN1   5
     C                     MOVE *BLANK    HHIN2   5
     C                     MOVE *BLANK    HHIN3   2
     C           KEY1      KLIST
     C                     KFLD           L7SHN1
     C                     KFLD           L7SHN2
     C                     KFLD           L7SHN3
     C                     SETOF                     11
     C           KEY1      CHAINFCEPL41              11
     C           *IN11     IFEQ '0'
     C                     MOVE F4PRT1    HHIN1
     C                     MOVE F4PRT2    HHIN2
     C                     MOVE F4PRT3    HHIN3
     C                     END
      *
     C                     MOVE *BLANK    WHIRO   6
     C                     Z-ADD1         @Z      20
     C                     SETOF                     11
     C           L7HAK2    LOKUPCMT1,@Z                  11
     C           *IN11     IFEQ '1'
     C                     MOVE CMT2,@Z   WHIRO
     C                     END
      *
     C           KEY2      KLIST
     C                     KFLD           L7BMON
     C                     KFLD           L7TAIP
     C                     MOVE *BLANK    WKNAME 14
     C                     SETOF                     11
     C           KEY2      CHAINGCKPL211             11
     C           *IN11     IFEQ '0'
     C           T2SKJY    IFEQ 'D'
     C           T2SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELT2NAMN    WKNAME
     C                     END
     C                     END
     C           ESB100    ENDSR
      *-------------------------------------------------------------------------
      * %0004    #WRTC2    WRITE ISSUE LOG
      *-------------------------------------------------------------------------
     C           #WRTC2    BEGSR
      *
     C                     CLEARABHPPC21
     C                     Z-ADDWTIHZ     A2KODT
     C                     Z-ADDWJFB      A2KOTM
     C                     MOVELS@USID    A2USER
     C                     MOVEL'YK'      A2KAID
     C                     MOVELJ6SHN1    A2HIN1
     C                     MOVELJ6SHN2    A2HIN2
     C                     MOVELJ6SHN3    A2HIN3
     C                     MOVELJ6ATK1    A2LOC1
     C                     MOVELJ6ATK2    A2LOC2
     C                     MOVELJ6ATK3    A2LOC3
     C                     MOVELJ6ATK4    A2LOC4
     C                     MOVELJ6KSNK    A2KSNK
     C                     MOVELJ6ZETI    A2ZETI
     C                     MOVELJ6BCOD    A2ATOH
     C                     MOVELJ6KCD1    A2HKBN
     C                     MOVELJ6ATOK    A2PROC
      *
     C                     Z-ADD0         WMIN2   30
     C           @KMIN     ADD  1         WMIN2
     C                     Z-ADDWMIN2     A2PAGF
      *
     C                     Z-ADD@KMAX     A2PAGT
      *
     C                     MOVELWKBN      A2WKBN
      *
     C                     WRITEABHPPC21
      *
     C                     ENDSR
      *-----------------------------------------------------*
      *================================================================
      * ...PLATING KANBAN ISSUE HISTORY       *
      *================================================================
     C           #AFP30    BEGSR
      *         *
     C           KEY30     KLIST
     C                     KFLD           A3ATK1
     C                     KFLD           A3ATK2
     C                     KFLD           A3ATK3
     C                     KFLD           A3ATK4
     C                     KFLD           A3SHN
      *--------------------
      *かんばん色
      *--------------------
     C                     MOVEL*BLANK    $$KCOL  1
     C                     Z-ADD0         $$HKDT  80       KANBAN ISSUE DATE
      *
     C           KEY30     SETGTAAFPL30
      *         *
     C                     DO   *HIVAL
     C           KEY30     REDPEAAFPL30                  92
     C   92                LEAVE
     C           A0SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C                     MOVELA0KCOL    $$KCOL  1
     C                     Z-ADDA0HKDT    $$HKDT           KANBAN ISSUE DATE
     C                     LEAVE
     C                     ENDDO
      *         *
S1   C           $$KCOL    IFNE *BLANK
     C           $$HKDT    ANDNEWTIHZ                      KANBAN ISSUE DATE
     C                     Z-ADD1         Z       20     93
     C           $$KCOL    LOKUPIRO,Z                    93
 S2  C           *IN93     IFEQ *ON
     C                     ADD  1         Z
  S3 C*******    Z         IFGT 5
  S3 C           Z         IFGT 2
     C                     Z-ADD1         Z
  E3 C                     ENDIF
     C                     MOVELIRO,Z     $$KCOL
 X2  C                     ELSE
     C                     MOVEL*BLANK    $$KCOL
 E2  C                     ENDIF
E1   C                     ENDIF
      *         *
S1   C           $$KCOL    IFEQ *BLANK
     C                     MOVEL'1'       $$KCOL
E1   C                     ENDIF
      *--------------------
      * ...PLATING KANBAN ISSUE HISTORY       *
      *--------------------
     C                     TIME           WTIME
     C                     CLEARAAFPL301
     C                     MOVEL*BLANK    A0SKJY           DELETE CODE
     C                     Z-ADD0         A0SKYY
     C                     Z-ADD0         A0SKMM
     C                     Z-ADD0         A0SKDD
     C                     Z-ADDWTIHZ     A0KOHZ
     C                     Z-ADDWJFB      A0KOTM
     C                     MOVELS@USID    A0KOME
      *
     C                     MOVE WRENO     A0RECD           RECORD NUMBER
      * 1:NORMAL  2:RE-ISSUE
     C                     MOVEL'2'       A0HKKB           ISSUE TYPE
     C                     MOVELA3SHN     A0SHIN
     C                     MOVELA3ATK1    A0ATK1           CURRENT LOC 1
     C                     MOVELA3ATK2    A0ATK2           CURRENT LOC 2
     C                     MOVELA3ATK3    A0ATK3           CURRENT LOC 3
     C                     MOVELA3ATK4    A0ATK4           CURRENT LOC 4
     C                     Z-ADDA3KSNK    A0KSNK           UPDATE INSTRUCTI  ON
     C                     MOVELWZETI     A0ZETI           ID  NUMBER
     C                     MOVEL'999'     A0TEHI           ORDER NUMBER
     C                     MOVELWPAGE     A0PAGE           PAGE NUMBER
     C                     MOVELWNIJI     A0NIJI           NIJI
     C                     MOVELWTAIKB    A0TAIS           TAISYO
     C                     MOVELWYUKO     A0SYKO           YUKO
     C                     MOVELA3SSYT    A0HKSY           BOX TYPE
      *
     C                     MOVELA3MTK1    A0MTK1           PRV LOCATION1
     C                     MOVELA3MTK2    A0MTK2           PRV LOCATION2
     C                     MOVELA3MTK3    A0MTK3           PRV LOCATION3
     C                     MOVELA3MTK4    A0MTK4           PRV LOCATION4
     C                     MOVELWMKJNM    A0MTNM           PRV FACTRY NAME
     C                     MOVELA3ATK1    A0BTK1           CURRENT LOC 1
     C                     MOVELA3ATK2    A0BTK2           CURRENT LOC 2
     C                     MOVELA3ATK3    A0BTK3           CURRENT LOC 3
     C                     MOVELA3ATK4    A0BTK4           CURRENT LOC 4
     C                     MOVELWJBUNM    A0ATNM           SECTION NAME
     C                     MOVELW3MEKI    A0MEKI           SURFACE TREATMENT
      *
     C                     MOVELA3RAIN    A0RAIN           LINE
     C                     Z-ADDA3BARA    A0BARA           PLATING BARRELA
     C                     Z-ADDA3BARB    A0BARB           B')
     C                     MOVELWCBKO     A0CBKO           C BOX RATIO
     C                     Z-ADDA3SSYS    A0SSYS           ACCOMMODATED QUANTITY
     C                     MOVELA3SSYT    A0SSYT           UNIT
     C                     MOVELWMNM1     A0JOK1           CONDITION 11
     C                     MOVELWMNM2     A0JOK2           21
     C                     MOVELWNNM1     A0NIK1           PACKING CONDITION1
     C                     MOVELWNNM2     A0NIK2           PACKING CONDITION2
     C                     MOVELWNNM3     A0NIK3           PACKING CONDITION3
     C                     MOVELWNNM4     A0NIK4           PACKING CONDITION4
      *
     C                     Z-ADD@KALL     A0KALL           ALL
     C                     Z-ADD@KMIN     A0KMIN           MIN
     C                     Z-ADD@KMAX     A0KMAX           MAX
     C                     Z-ADD@SRMS     A0SRMS           NUMBER OF HANDLING
     C                     Z-ADD01        A0YOSI           PAPER
     C                     MOVELA3ATOK    A0ATOK           CURRENT PROCESS
     C                     MOVEL*BLANK    A0COLN           BOX COLOR NAME
     C                     MOVELA3HSYU    A0BCOL           BOX COLOR CODE
     C                     MOVEL$$KCOL    A0KCOL           KANBAN HISTRY COLOR
     C                     MOVEL*BLANK    A0KANL           KANBAN COLOR TYPE
     C                     MOVELWKBN      A0HKB2           KANBAN ISSUE TYPE
     C                     Z-ADDWTIHZ     A0HKDT           KANBAN ISSUE DATE
 %07 C                     Z-ADDWJFB      A0HKTM           KANBAN ISSUE TIME
      *
      * ＱＲレイアウト
      *
     C                     MOVEL'B01'     Q1KBN
     C                     MOVELWKBN      Q1HKKB
     C                     MOVELA3KCD1    Q1HNDI
     C                     MOVELA3KCD2    Q1HNSY
     C                     MOVELA3ZETI    Q1HNZT
     C                     MOVELA3KCD1    Q1KCD1
     C                     MOVELA3KCD2    Q1KCD2
     C                     MOVEL'00000'   Q1KMAX
     C                     MOVE A3KMAX    Q1KMAX
     C                     MOVELA31HB5    Q11HB5
     C                     MOVELA32HB5    Q12HB5
     C                     MOVELA33HB2    Q13HB2
     C                     MOVELA3ATK1    Q1ATK1
     C                     MOVELA3ATK2    Q1ATK2
     C                     MOVELA3ATK3    Q1ATK3
     C                     MOVELA3ATK4    Q1ATK4
     C                     MOVELWKBN      Q1KANR           管理区分
     C                     MOVELA3ZETI    Q1ZETI
     C                     MOVEL'999'     Q1999
     C                     MOVEL'00000'   Q10000
     C                     MOVELA3SSYT    Q1SSYT
     C                     MOVELA3MTK1    Q1MTK1
     C                     MOVELA3MTK2    Q1MTK2
     C                     MOVELA3MTK3    Q1MTK3
     C                     MOVELA3MTK4    Q1MTK4
     C                     MOVELA3MAKB    Q1MAKB
     C                     MOVELA3ATOB    Q1ATOB
     C                     MOVELA3MEKI    Q1MEKI
     C                     MOVELA3RAIN    Q1RAIN
     C                     MOVELA3BARA    Q1BARA
     C                     MOVELA3BARB    Q1BARB
     C                     MOVELA3CBKO    Q1CBKO
     C                     MOVELA3SSYS    Q1SSYS
     C                     MOVELA3SSYT    Q1SSY2
     C                     MOVELA3JOK1    Q1JOK1
     C                     MOVELA3JOK2    Q1JOK2
     C                     MOVELA3JOK3    Q1JOK3
     C                     MOVELA3JOK4    Q1JOK4
     C                     MOVELA3JOK5    Q1JOK5
     C                     MOVELA3JOK6    Q1JOK6
     C                     MOVELA3ATOK    Q1ATOK
     C                     MOVELA3UKYD    Q1UKYD
     C                     MOVELA3UBIN    Q1UBIN
     C                     MOVELA3STYD    Q1STYD
     C                     MOVELA3SBIN    Q1SBIN
%07  C                     MOVE WTIHZ     Q1KHDT
     C                     MOVE WJFB      Q1KHTM
%07  C                     MOVE WTIHZ     Q1HKHZ
     C                     MOVEL'00'      Q1HKBB
      *
     C                     MOVEL'*'       Q1AST
     C                     MOVELQRDAT1    A0QR             QR DATA
      *
     C                     WRITEAAFPL301
      *         *
     C                     ENDSR
      *================================================================
      * QUENCHING (OQ)KANBAN ISSUE HISTORY
      *================================================================
     C           #ADH30    BEGSR
     C           KEY31     KLIST
     C                     KFLD           J6ATK1
     C                     KFLD           J6ATK2
     C                     KFLD           J6ATK3
     C                     KFLD           J6ATK4
     C                     KFLD           J6SHN
      *--------------------
      *履歴色コード     ( HISTORY COLOR TYPE )
      *--------------------
     C                     MOVEL*BLANK    $$HISC  1        HISTORY COLOR TYPE
     C                     Z-ADD0         $$HKDT  80       KANBAN ISSUE DATE
      *
     C           KEY31     SETGTADHPL30
      *         *
     C                     DO   *HIVAL
     C           KEY31     REDPEADHPL30                  92
     C   92                LEAVE
     C           J3SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C                     MOVELJ3HISC    $$HISC  1
     C                     Z-ADDJ3HKDT    $$HKDT           KANBAN ISSUE DATE
     C                     LEAVE
     C                     ENDDO
      *         *
S1   C           $$HISC    IFNE *BLANK
     C           $$HKDT    ANDNEWTIHZ                      KANBAN ISSUE DATE
     C                     Z-ADD1         Z       20     93
     C           $$HISC    LOKUPIRO,Z                    93
 S2  C           *IN93     IFEQ *ON
     C                     ADD  1         Z
  S3 C           Z         IFGT 2
     C                     Z-ADD1         Z
  E3 C                     ENDIF
     C                     MOVELIRO,Z     $$HISC
 X2  C                     ELSE
     C                     MOVEL*BLANK    $$HISC
 E2  C                     ENDIF
E1   C                     ENDIF
      *         *
      *         *
S1   C           $$HISC    IFEQ *BLANK
     C                     MOVEL'1'       $$HISC
E1   C                     ENDIF
      *--------------------
      * QUENCHING (OQ)KANBAN ISSUE HISTORY
      *--------------------
     C                     TIME           WTIME
     C                     CLEARADHPL301
     C                     MOVEL*BLANK    J3SKJY           DELETE CODE
     C                     Z-ADD0         J3SKYY
     C                     Z-ADD0         J3SKMM
     C                     Z-ADD0         J3SKDD
     C                     Z-ADDWTIHZ     J3KOHZ
     C                     Z-ADDWJFB      J3KOTM
     C                     MOVELS@USID    J3KMEI
      *
     C                     MOVE 'YK'      J3RECD           RECORD NUMBER
     C                     MOVE '2'       J3HKKB           ISSUE TYPE 1
     C                     MOVELJ6SHN     J3SHIN           REPRESENTATIVE PART
     C                     MOVELJ6ATK1    J3ATK1           CURRENT LOC 1
     C                     MOVELJ6ATK2    J3ATK2           CURRENT LOC 2
     C                     MOVELJ6ATK3    J3ATK3           CURRENT LOC 3
     C                     MOVELJ6ATK4    J3ATK4           CURRENT LOC 4
     C                     Z-ADDJ6KSNK    J3KSNK           UPDATE INSTRUCTION
     C                     MOVELJ6ZETI    J3ZETI           ID  NUMBER
     C                     MOVELJ6BCOD    J3MTOH           BAR CODE
     C                     MOVELJ6KCD1    J3KBNK           KANBAN TYPE
     C                     MOVELSTOK      J3BTOK           BCD PROCESS
     C                     Z-ADD@KMAX2    J3KMAI           KANBAN COUNT
     C                     MOVELJ6MTK1    J3MTK1           PRV LOCATION1
     C                     MOVELJ6MTK2    J3MTK2           PRV LOCATION2
     C                     MOVELJ6MTK3    J3MTK3           PRV LOCATION3
     C                     MOVELJ6MTK4    J3MTK4           PRV LOCATION4
     C                     MOVEL*BLANK    J3YOBI           BLANK
     C                     MOVELZINM      J3ZANM           MATERIALS NAME
     C                     MOVELJ6KIK1    J3KIK1           HARDNESS STANDARD 1
     C                     MOVELJ6KIK2    J3KIK2           HARDNESS STANDARD 2
     C                     MOVELJ6KIK3    J3KIK3           INSTRUCTION
     C                     Z-ADDJ6BASA    J3BASA           BASKET PLUG
     C                     Z-ADDJ6BAHA    J3BAHA           ACCOMMODATION NUMBER
     C                     Z-ADDJ6LOTO    J3LOTO           QUENCHING LOT NUMBER
     C                     Z-ADDJ6SETO    J3SETO           SET NUMBER
     C                     Z-ADDJ6HKJR    J3HKJR           WEIGHT FOR A BOX
     C                     MOVELJ6SYOT    J3SYOT           CONTAINER TYPE 2
     C                     MOVELJ6SYT2    J3SYT2           CONTAINER TYPE1
     C                     MOVELWIR,1     J3BNM1           BOX COLOR NAME1
     C                     MOVELWIR,2     J3BNM2           BOX COLOR NAME2
     C                     MOVELJ6RONO    J3RONO           FURNACE TURN
     C                     Z-ADDJ6HOJI    J3HOJI           QUENCHING
     C                     Z-ADDJ6ONDO    J3ONDO           TEMPERING HARDENING
     C                     Z-ADDJ6CO2P    J3CO2P           CO 2
     C                     MOVELWJK,1     J3CON1           CONDITION NAME1
     C                     MOVELJ6KBN1    J3KBN1           MACHINE NO 1
     C                     MOVELWJK,2     J3CON2           CONDITION NAME2
     C                     MOVELJ6KBN2    J3KBN2           MACHINE NO 2
     C                     MOVELWJK,3     J3CON3           CONDITION NAME3
     C                     MOVELJ6KBN3    J3KBN3           MACHINE NO 3
     C                     MOVELWJK,4     J3CON4           CONDITION NAME4
     C                     MOVELJ6KBN4    J3KBN4           MACHINE NO 4
     C                     MOVELWJK,5     J3CON5           CONDITION NAME5
     C                     MOVELJ6KBN5    J3KBN5           MACHINE NO 5
     C                     Z-ADDSYOS      J3SYOS           ACCOMMODATED
     C                     Z-ADDJ6KAKE    J3KAKE           SIGNAL KANBAN
     C                     Z-ADDJ6ONCH    J3ONCH           1 CHARGE WEIGHT
     C                     MOVELW@MRK     J3HTK1           FRACTIONS LOCATION
     C                     Z-ADD@KALL     J3KALL           ALL KANBAN NUMBER OF
     C                     Z-ADD@KMIN     J3KMIN           MIN
     C                     Z-ADD@KMAX     J3KMAX           MAX
     C                     Z-ADD@SRMS     J3SRMS           HANDLING NUMBER OF
     C                     MOVELATOK      J3ATOK           PRESENT PROCESS CODE
     C                     MOVELN@HKJR    J3YOB2           BLANK
     C                     MOVELWKBN      J3HKB2           ISSUE TYPE 2
     C                     MOVELHIR,1     J3BCO1           BOX COLOR TYPE 1
     C                     MOVELHIR,2     J3BCO2           BOX COLOR TYPE 2
     C                     MOVEL$$HISC    J3HISC           HISTORY COLOR TYPE
     C                     MOVELJ6SSKB    J3SSKB           KANBAN COLOR TYPE
     C                     MOVEL$$OQBR    J3OQBR           OQ BARCODE
     C                     MOVEL$$LOQB    J3LOQB           LOQ BARCODE
     C                     Z-ADDWTIHZ     J3HKDT           KANBAN ISSUE DATE
     C                     Z-ADDWJFB      J3HKTM           KANBAN ISSUE TIME
      *
      * ＱＲレイアウト
      *
     C                     MOVEL'B01'     Q2KBN
     C                     MOVELWKBN      Q2HKKB
     C                     MOVELJ6KCD1    Q2HNDI
     C                     MOVELJ6KCD2    Q2HNSY
     C                     MOVELJ6ZETI    Q2HNZT
     C                     MOVELJ6KCD1    Q2KCD1
     C                     MOVELJ6KCD2    Q2KCD2
     C                     MOVELJ6ZETI    Q2ZETI
     C                     MOVEL'00000'   Q2KMAX
     C                     MOVE J6KMAX    Q2KMAX
     C                     MOVELJ6SHN1    Q2SHN1
     C                     MOVELJ6SHN2    Q2SHN2
     C                     MOVELJ6SHN3    Q2SHN3
     C                     MOVELJ6ATOK    Q2ATOK
     C                     MOVELJ6ATOB    Q2ATOB
     C                     MOVELJ6ATK1    Q2ATK1
     C                     MOVELJ6ATK2    Q2ATK2
     C                     MOVELJ6ATK3    Q2ATK3
     C                     MOVELJ6ATK4    Q2ATK4
     C                     MOVELJ6MAKB    Q2MAKB
     C                     MOVELJ6MTK1    Q2MTK1
     C                     MOVELJ6MTK2    Q2MTK2
     C                     MOVELJ6MTK3    Q2MTK3
     C                     MOVELJ6MTK4    Q2MTK4
     C                     MOVELJ6KSNK    Q2KSNK
     C                     MOVELJ6BCOD    Q2BCOD
     C                     MOVEL'00000'   Q2PAGE
     C                     MOVELJ6SYOT    Q2SYOT
     C                     MOVELJ6SYOS    Q2SYOS
     C                     MOVELJ6SOZI    Q2SOZI
     C                     MOVELJ6RONO    Q2RONO
     C                     MOVELJ6ONDO    Q2ONDO
     C                     MOVELJ6CO2P    Q2CO2P
     C                     MOVELJ6KIK1    Q2KIK1
     C                     MOVELJ6KIK2    Q2KIK2
     C                     MOVELJ6UKYY    Q2UKYY
     C                     MOVELJ6UKMM    Q2UKMM
     C                     MOVELJ6UKDD    Q2UKDD
     C                     MOVELJ6UBIN    Q2UBIN
     C                     MOVELJ6ATOK    Q2ATO2
     C                     MOVELJ6STYY    Q2STYY
     C                     MOVELJ6STMM    Q2STMM
     C                     MOVELJ6STDD    Q2STDD
     C                     MOVELJ6SBIN    Q2SBIN
     C                     MOVE WTIHZ     Q2KHDT
     C                     MOVE WJFB      Q2KHTM
     C                     MOVE WTIHZ     Q2HKHZ
     C                     MOVEL'00'      Q2HKBB
     C                     MOVEL'*'       Q2AST
      *
     C                     MOVELQRDAT2    J3QR             QR DATA
      *
     C                     WRITEADHPL301
      *
      *--------------------
     C                     ENDSR
      *================================================================
      * バーコード作成
      *================================================================
     C           #BARCD    BEGSR
      *
      * ＯＱバーコード   11
      *
     C                     MOVEL*BLANK    $$OQBR 11
%08  C***        J6ATOK    IFEQ 'OQ '
     C           C@OQ      IFEQ '1'
     C                     MOVEL*BLANK    B$BAR
     C                     MOVELJ6ONDO    B$ONDO
     C                     MOVELJ6CO2P    B$CO2P
     C                     MOVELJ6ZETI    B$ZETI
     C                     MOVELB$BAR     PMAREA           *フィールド
     C                     CALL 'CHKR01'
     C                     PARM           PMAREA100        *フィールド
     C                     PARM '010'     PMBYTE  3        *有効桁数
     C                     PARM           PMCHK   1        * kｩｮhmﾞﾆﾞｮn
     C                     PARM           PMRTCD  1        * ﾒjｰ]ﾃｰnﾞ
     C                     MOVELPMCHK     B$CD11
     C                     MOVELB$BAR     $$OQBR
     C                     ENDIF
      *
      * ＬＯＱバーコード  7
      *
     C                     MOVEL*BLANK    $$LOQB  7
%08  C***        J6ATOK    IFEQ 'LOQ'
     C           C@LOQ     IFEQ '1'
     C                     MOVEL*BLANK    C$BAR
     C                     MOVELJ6ONDO    C$ONDO
     C                     MOVEL'0'       C$YOBI
     C                     MOVELJ6HOJI    C$HOJI
     C                     MOVELC$BAR     PMAREA           *フィールド
     C                     CALL 'CHKR01'
     C                     PARM           PMAREA100        *フィールド
     C                     PARM '006'     PMBYTE  3        *有効桁数
     C                     PARM           PMCHK   1        * kｩｮhmﾞﾆﾞｮn
     C                     PARM           PMRTCD  1        * ﾒjｰ]ﾃｰnﾞ
     C                     MOVELPMCHK     C$CD7
     C                     MOVELC$BAR     $$LOQB
     C                     ENDIF
      *                                                                ' -
     C                     ENDSR
      ****************************************************
     C*--- xｮg --- PLATING
      ****************************************************
     ODATA1   EADD             FILE11
     O                         WRENO      8
     O                                    9 '1'
     O                         A31HB5    14
     O                         A32HB5    19
     O                         A33HB2    21
     O                         A3ATK1    22
     O                         A3ATK2    24
     O                         A3ATK3    26
     O                         A3ATK4    27
     O******                             28 'A'
     O                         WKBN      28
     O                         WZETI     32
     O                                   35 '999'
     O                         WPAGE     37
     O                         WNIJI     38
     O                         WTAIKB    39
     O                         WYUKO     40
     O                         A3SSYT    41
     O                         A3MTK1    42
     O                         A3MTK2    44
     O                         A3MTK3    46
     O                         A3MTK4    47
     O                         WMKJNM    63
     O                         A3ATK1    64
     O                         A3ATK2    66
     O                         A3ATK3    68
     O                         A3ATK4    69
     O                         WJBUNM    85
     O                         W3MEKI    92
     O                         A3RAIN    93
     O                         A3BARA    95
     O                         A3BARB    97
     O                         WCBKO     99
     O                         A3SSYS   104
     O                         A3SSYT   105
     O                         WMNM1    117
     O                         WMNM2    129
     O                         WNNM1    149
     O                         WNNM2    169
     O                         WNNM3    189
     O                         WNNM4    209
%05   *↓
     O                         @KALL    213
     O                         @KMIN    217
     O*****                    @KMAX    221
     O                         #@KMAX   221
     O                         @SRMS    225
     O                         W1YOSI   227
     O                         A3KCD1   228
     O                         A3ATOK   231
      *     箱色   C   5              236
      *
      *     箱色コード   C   1
     O                         A3HSYU   237
      *かんばん履歴
     O                         $$KCOL   238
      *     かんばん色   C   1        239
     O***   発行区分1                 240*
%06  O                         WKBN     240
     O                         WTIHZ    248
     O                         WMSGKB   249
     O                         WMSGTX   281
      *     予備         C 231        512
      *
      *//////////////////////////////////////////
     O* ＱＲ区分
     O                                  515 'B01'
     O*****                             516 'A'
     O                         WKBN     516
     O                         A3KCD1   517
     O                         A3KCD2   518
     O                         A3ZETI   522
     O                                  524 '00'
     O*****                    A3KMAX   527
     O                         @3KMAX   527
     O*     かんばんキー  12
     O                                  539 '            '
     O                         A3KCD1   540
     O                         A3KCD2   541
     O                         A31HB5   546
     O                         A32HB5   551
     O                         A33HB2   553
     O                         A3ATK1   554
     O                         A3ATK2   556
     O                         A3ATK3   558
     O                         A3ATK4   559
     O*     管理区分       1
     O                         WKBN     560
     O                         A3ZETI   564
     O                                  567 '999'
     O                                  572 '00000'
     O                         WNIJI    573
     O                         WTAIKB   574
     O                         WYUKO    575
     O                         A3SSYT   576
     O                         A3MTK1   577
     O                         A3MTK2   579
     O                         A3MTK3   581
     O                         A3MTK4   582
     O                         A3MAKB   586
     O                         A3ATOB   590
     O                         A3MEKI   597
     O                         A3RAIN   598
     O                         A3BARA   600
     O                         A3BARB   602
     O                         A3CBKO   604
     O                         A3SSYS   609
     O                         A3SSYT   610
     O                         A3JOK1   612
     O                         A3JOK2   614
     O                         A3JOK3   616
     O                         A3JOK4   618
     O                         A3JOK5   620
     O                         A3JOK6   622
     O*     引取条件二次加工１ 2      624
     O*     引取条件二次加工２ 2      626
     O*     引取条件二次加工３ 2      628
     O                         A3ATOK   631
     O                         A3UKYD   639
     O                         A3UBIN   641
     O                         A3STYD   649
     O                         A3SBIN   651
 %02 O                         WTIHZ    659
 %02 O                         WJFB     665
 %02 O                         WTIHZ    673
 %02 O                                  675 '00'
     O****  予備            676 ---   711
     O                                  712 '*'
      ****************************************************
     C*--- ﾔｷｲﾚ --- HEAT TREATMENT
      ****************************************************
     ODATA2   EADD             FILE22
     O                                    8 'YK'
     O                                    9 '1'
     O                         J6SHN1    14
     O                         J6SHN2    19
     O                         J6SHN3    21
     O*                        J6ATK1    22
     O                         J6ATK2    24
     O                         J6ATK3    26
     O*                        J6ATK4    27
     O                         J6KSNK    28
     O                         J6ZETI    32
     O                         J6BCOD    34
     O                         J6KCD1    35
     O                         STOK      38
%05   *↓
     O*****                    @KMAX     42
     O                         #@KMAX    42
     O*                     *  J6MTK1    43
     O                         J6MTK2    45
     O                         J6MTK3    47
     O*                     *  J6MTK4    48
      *余白      19                    67*
     O                         ZINM      82
     O                         J6KIK1    85
     O                         J6KIK2    88
     O                         J6KIK3    89
     O                         J6BASA    91
     O                         J6BAHA    95
     O                         J6LOTO    97
     O                         J6SETO    99
     O                         J6HKJR   102
     O                         J6SYOT   103
     O                         J6SYT2   104
     O                         WIR,1    109
     O                         WIR,2    114
     O                         J6RONO   117
     O                         J6HOJI   119
     O                         J6ONDO   122
     O                         J6CO2P   125
     O                         WJK,1    130
     O                         J6KBN1   133
     O                         WJK,2    138
     O                         J6KBN2   141
     O                         WJK,3    146
     O                         J6KBN3   149
     O                         WJK,4    154
     O                         J6KBN4   157
     O*                        WJK,5    162
     O                         W@MRK    162
     O                         J6KBN5   165
     O                         SYOS     170
      *++
     O                         J6KAKE   172
     O                         J6ONCH   176
     O******                   W@MRK    182
      * かんばんALL     4             186*
     O                         @KALL    186
      * かんばんMIN     4             190*
     O                         @KMIN    190
      * かんばんMAX     4             194*
     O*****                    @KMAX    194
     O                         #@KMAX   194
      * かんばん処理枚数4             198*
     O                         @SRMS    198
      *************************
      * 自工程コード    3             201*
     O                         ATOK     201
     O                         N@HKJR   205
%0001O                         WKBN     206
      *                                    *
      * 材料コード      1             207*
      * 箱色１コード    1
     O                         HIR,1    208
      * 箱色２コード    1
     O                         HIR,2    209
      *履歴色コード     ( HISTORY COLOR TYPE )
     O                         $$HISC   210
      * かんばん色コード1
     O                         J6SSKB   211
      * ＯＱバーコード   11
     O                         $$OQBR   222
      * ＬＯＱバーコード  6
     O                         $$LOQB   229
      *発行日
     O                         WTIHZ    237
     O                         WMSGKB   238
     O                         WMSGTX   270
      *
      * 予備          242             512*
      *//////////////////////////////////////////
     O* ＱＲ区分
     O                                  515 'B01'
     O*****                             516 'A'
     O                         WKBN     516
     O                         J6KCD1   517
     O                         J6KCD2   518
     O                         J6ZETI   522
     O                                  524 '00'
     O*****                    J6KMAX   527
     O                         #6KMAX   527
      * かんばんキー   12             539*
     O                         J6KCD1   540
     O                         J6KCD2   541
     O                         J6ZETI   545
     O                         J6SHN1   550
     O                         J6SHN2   555
     O                         J6SHN3   557
     O                         J6ATOK   560
     O                         J6ATOB   564
     O                         J6ATK1   565
     O                         J6ATK2   567
     O                         J6ATK3   569
     O                         J6ATK4   570
      * 前工程絶対番号  4             574*
      * 前工程品番     12             586*
     O                         WMZET    574
     O                         WMSHN    586
     O                         J6MAKB   590
     O                         J6MTK1   591
     O                         J6MTK2   593
     O                         J6MTK3   595
     O                         J6MTK4   596
      * ロット          3             599*
     O                         $$LOTO   599
     O                         J6KSNK   600
      * バーコード      2
     O                         J6BCOD   602
      * ページ№        5             607*
      *PC採番
     O                                  607 '00000'
      * 箱種            1             608*
     O                         J6SYOT   608
     O                         J6SYOS   615
      * 一箱重量        4             619*
     O                         N@HKJR   619
     O                         J6SOZI   626
      * ねじサイズ      3             629*
     O                         $$TUSZ   629
      * 首下長さ        5             634*
     O                         $$KUBI   634
      * セット数        3             637*
     O                         $$SETO   637
     O                         J6RONO   640
      * 区分            1             641
      * 焼き入れ時間    3             644*
     O                         $$HOJI   644
     O                         J6ONDO   647
     O                         J6CO2P   650
      * 材料名         20             670*
     O                         ZINM2    670
     O                         J6KIK1   673
     O                         J6KIK2   676
     O                         J6UKYY   680
     O                         J6UKMM   682
     O                         J6UKDD   684
     O                         J6UBIN   686
     O                         J6ATOK   689
     O                         J6STYY   693
     O                         J6STMM   695
     O                         J6STDD   697
     O                         J6SBIN   699
%0003O                         WTIHZ    707
     O                         WJFB     713
     O                         WTIHZ    721
     O                                  723 '00'
      *** FILLER   FROM 724 ---- 751
     O                                  752 '*'
      ****************************************************
%0002 *--- ﾊﾝｾｲﾋﾝ ｶﾝﾊﾞﾝ
      ****************************************************
     OOUTPUT6 EADD             FILE33
     O                         L7SHN1
     O                                      ','
     O                         L7SHN2
     O                                      ','
     O                         L7SHN3
     O                                      ','
     O                         L7TKYY
     O                                      ','
     O                         L7TKMM
     O                                      ','
     O                         L7TKDD
     O                                      ','
     O                         L7TBIN
     O                                      ','
     O                         L7UKYY
     O                                      ','
     O                         L7UKMM
     O                                      ','
     O                         L7UKDD
     O                                      ','
     O                         L7UBIN
     O                                      ','
     O                         L7STYY
     O                                      ','
     O                         L7STMM
     O                                      ','
     O                         L7STDD
     O                                      ','
     O                         L7SBIN
     O                                      ','
     O                         L7AKI1
     O                                      ','
     O                         L7AKI2
     O                                      ','
     O                         L7AKI3
     O                                      ','
     O                         L7AKI4
     O                                      ','
     O                         L7TKR1
     O                                      ','
     O                         L7TKR2
     O                                      ','
     O                         L7TKR3
     O                                      ','
     O                         L7TKR4
     O                                      ','
     O                         L7KTEI
     O                                      ','
     O                         L7BMON
     O                                      ','
     O                         L7TAIP
     O                                      ','
     O                         L7MBCD
     O                                      ','
     O                         L7KTR1
     O                                      ','
     O                         L7KTR2
     O                                      ','
     O                         L7KTR3
     O                                      ','
     O                         L7KTR4
     O                                      ','
     O                         L7KCD1
     O                                      ','
     O                         L7KCD2
     O                                      ','
     O                         L7STI1
     O                                      ','
     O                         L7JOK1
     O                                      ','
     O                         L7JOK2
     O                                      ','
     O                         L7JOK3
     O                                      ','
     O                         L7JOK4
     O                                      ','
     O                         L7JOK5
     O                                      ','
     O                         L7JOK6
     O                                      ','
     O                         L7AKI5
     O                                      ','
     O                         L7BIK1
     O                                      ','
     O                         L7YOUS
     O                                      ','
     O                         L7HKSU
     O                                      ','
     O                         L7HITO
     O                                      ','
     O                         L7UZAR
     O                                      ','
     O                         L7HAK1
     O                                      ','
     O                         L7HAK2
     O                                      ','
     O                         L7SYOS
     O                                      ','
     O                         L7SYOT
     O                                      ','
     O***                      L7KALL
     O                         #7KALL
     O                                      ','
     O***                      L7MAIS
     O                         #7MAIS
     O                                      ','
     O***                      L7KMIN
     O                         #7KMIN
     O                                      ','
     O***                      L7KMAX
     O                         #7KMAX
     O                                      ','
     O***                      L7SRMS
     O                         #7SRMS
     O                                      ','
     O***                      L7ALHK
     O                         #7ALHK
     O                                      ','
     O***                      L7MXHK
     O                         #7MXHK
     O                                      ','
     O                         L7KSHK
     O                                      ','
     O                         L7KTSU
     O                                      ','
     O                         L7KSSU
     O                                      ','
     O                         L7KOUT
     O                                      ','
     O                         L7DOUT
     O                                      ','
     O                         L7DTKO
     O                                      ','
     O                         L7DTHE
     O                                      ','
     O                         L7SKT1
     O                                      ','
     O                         L7SKT2
     O                                      ','
     O                         L7SKT3
     O                                      ','
     O                         L7SKT4
     O                                      ','
     O***                      L7JDMS
     O                         #7JDMS
     O                                      ','
     O                         L7KAIS
     O                                      ','
     O                         L7ZETI
     O                                      ','
     O                         L7SKCD
     O                                      ','
     O                         L7LTIM
     O                                      ','
     O                         L7KSKB
     O                                      ','
     O                         L7KH11
     O                                      ','
     O                         L7KH12
     O                                      ','
     O                         L7KH13
     O                                      ','
     O                         L7SIY1
     O                                      ','
     O                         L7KH21
     O                                      ','
     O                         L7KH22
     O                                      ','
     O                         L7KH23
     O                                      ','
     O                         L7SIY2
     O                                      ','
     O                         L7KH31
     O                                      ','
     O                         L7KH32
     O                                      ','
     O                         L7KH33
     O                                      ','
     O                         L7SIY3
     O                                      ','
     O                         L7KH41
     O                                      ','
     O                         L7KH42
     O                                      ','
     O                         L7KH43
     O                                      ','
     O                         L7SIY4
     O                                      ','
     O                         L7SPEN
     O                                      ','
     O                         L7UKOJ
     O                                      ','
     O                         L7UKER
     O                                      ','
      ***** KANBAN INFO.
     O                         @HKBN
     O                                      ','
     O                         @SYOK
     O                                      ','
     O                         WPNO
     O                                      ','
     O                         @INZI
     O                                      ','
     O                         HHIN1
     O                                      ','
     O                         HHIN2
     O                                      ','
     O                         HHIN3
     O                                      ','
     O                         WHIRO
     O                                      ','
     O                         WKNAME
%0002 *
**   ZMSG
ERR-1 ENTER PRESENT PROCESS LOCATION
ERR-2 NO AVAILABLE PRESENT PROCESS DATA
ERR-3 NO AVAILABLE DATA
ERR-4 WRONG CHOICE NO. ENTERED
ERR-5 ENTER ISSUE METHOD
ERR-6 WRONG ISSUE METHOD ENTER
ERR-7 ENTER STARTING ISSUE NO.
ERR-8 LARGER STARTING ISSUE NO. THAN MAX.
ERR-9 LARGER CLOSING ISSUE NO. THAN MAX.
ERR-10 ENTER ISSUE NO.
ERR-11 LARGER ISSUE NO. THAN MAX. ENTERED
ERR-12 ALL DISPLAYED
ERR-13 CANNOT INPUT GREATER THAN 500 SHEETS
**  ZCMT
PLATING KANBAN
QUENCHING KANBAN
HALF-FINISHED KANBAN
**  #CHK
AR
GJ
NV
00
01
02
03
04
05
06
07
08
09
10
11
12
S1
L1
L2
L3
L4
L5
** CMT1/CMT2 ( BOX COLOR NAME)
PPINK
YYELLOW
GY-GREN
AR-BRWN
KBLACK
MGREEN
RRED
CBROWN
BBLUE
WWHITE
OORANGE
HGRAY
XBR-PNK
** IRO かんばん色
1白
2黒
