     H            Y.
     F** BAAR43 ****************************************
     F* ..ORDER RECEIPT DATA UNIT PRICE UISUAL CHECKING UNMATCHED FILE CREATE ..
     F*        M-OKUDA 1984.07.19                      *
     F**************************************** BAAR43 **
     FMAAWP43 UP  F     200            DISK
     FMAAWP44 O   F     200            DISK                      A
     IMAAWP43 AA  01
     I                                        3   60TOKUM
     I                                        7   7 TKOJM
     I                                        8  11 TUKEM
     I                                       12  150NONYM
     I                                       16  16 NKOJM
     I                                       17  20 NUKEM
     I                                       21  32 HBANM
     I                                       33  47 MHINM
     I                                       33  37 MHN1
     I                                       38  42 MHN2
     I                                       43  47 MHN3
     I                                       48  57 KANRM
     I                                    P  58  622TANKM
     I                                       63  630TKBNM
     I                                       64  64 TTAIM
     I                                       65  71 NBAN
     I                                       77  77 NSYOM
     I                                       96 1010NOKIM
     I                                      102 102 JTYU
     I                                      182 186 CMHN3
     I                                        1 159 JREC
     I            DS
     I                                        1   80K9SKHZ
     I                                        1   40K9SKYY
     I                                        5   60K9SKMM
     I                                        7   80K9SKDD
     I            DS
     I                                        1   80K9STHZ
     I                                        1   40K9STYY
     I                                        5   60K9STMM
     I                                        7   80K9STDD
     I            DS
     I                                        1   80K9ENHZ
     I                                        1   40K9ENYY
     I                                        5   60K9ENMM
     I                                        7   80K9ENDD
     I            DS
     I                                        1  20 @MHIN
     I                                        1   5 @MHN1
     I                                        6  10 @MHN2
     I                                       11  15 @MHN3
     I                                       16  20 @MHN4
     I            DS
     I                                        1   80WNYMD
     I                                        1   40WNYY
     I                                        3   40WNYY1
      *
     C           TKBNM     IFEQ 9
     C                     GOTO END
     C                     END
      *
     C                     Z-ADDNOKIM     WNYMD
     C                     MOVEL'19'      WNYY
     C           WNYY1     IFLT 97
     C                     MOVEL'20'      WNYY
     C                     END
      *
     C                     MOVE '*'       @KOJO   1
     C                     MOVELMHINM     @MHIN
     C                     MOVEL*BLANK    @KANR  10
     C                     Z-ADD0         @TANK   72
     C                     Z-ADDWNYMD     @JRHZ   80
     C                     Z-ADD0         @SRYO   70
     C                     MOVE *BLANK    @CHK    1
     C                     MOVE *BLANK    @LOT    1
      *
     C                     CALL 'BBHR10'
     C                     PARM           TOKUM
     C                     PARM           @KOJO
     C                     PARM           @MHIN
     C                     PARM           @KANR
     C                     PARM           @TANK
     C                     PARM           @JRHZ
     C                     PARM           @SRYO
     C                     PARM           @CHK
     C                     PARM           @LOT
      *
     C           @TANK     IFNE 0
     C                     EXCPTDATA
     C                     GOTO END
     C                     END
      *
     C                     SETON                     U1
     C                     EXCPTDATA
     C                     EXCPTUN
      *
     C           END       TAG
     OMAAWP43 E                DATA
     O                         @TANK     62P
     OMAAWP44 EADD             UN
     O                         JREC     159
     O                         @TANK     62P
