     H            Y.
     F** BADR02 **********************************
     F*PRODUCT ORDERING AGAIN AND OVER MADE  DATA SITUATION LIST
     F* PROGRAM ID. : BADR02. <RPG> *
     F* CREATE DATE. : MAR.08,'90.               *
     F* AUTHOR.         : E.KAWASHIMA            *
     F********************************** BADR02 **
     FBADWP04 IP  F     100            DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TAB1    1   2  1   TAB2   10   ﾆﾞｭcgｭc
     E                    TAB3    1   3  1   TAB4   10   ﾆﾞｭcgｭc(fﾞx])
     E                    TY      1   1 40
     IBADWP04 NS  01
     I                                        1   40KOJO
     I                                        5   9 ADHIN1L1
     I                                       10  14 ADHIN2L1
     I                                       15  16 ADHIN3L1
     I                                       17  19 ADKBN1
     I                                       20  20 ADKBN2
     I                                       21  230ADMAIS
     I                                       24  280ADKAIS
     I                                       29  330ADSYOS
     I                                       34  34 ADSYOT
     I                                       35  380ADMBMN
     I                                       39  420ADZBMNL2
     I                                       43  440ADCHAK
     I                                       45  45 ADLAIN
     I                                       46  46 ADDTKBL2
     I                                       47  540ADKOHZ
     I                                       55  55 KUBUN
     I            DS
     I                                        1  14 #HIN
     I                                        1   5 #HIN1
     I                                        6   6 #HINA
     I                                        7  11 #HIN2
     I                                       12  12 #HINB
     I                                       13  14 #HIN3
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     C******************************************************
     C*  START PROGRAM  <BADR02>                           *
     C******************************************************
     C  N01                GOTO @END
     C*
     C           *ENTRY    PLIST
     C                     PARM           @KBN    1
     C                     PARM           @KOJO   4
     C                     PARM           @STHZ   8
     C                     PARM           @ENHZ   8
     C                     MOVE @STHZ     STHZ    60
     C                     MOVE @ENHZ     ENHZ    60
     C*
B001 C           *IN90     IFEQ '0'
     C                     MOVEL'1'       *INOF
     C                     MOVEA'1'       *IN,90
     C                     Z-ADD0         CNT     40
     C*                    Z-ADD0         MAIS    50
     C                     Z-ADD0         KEI     50
E001 C                     END
     C*
     C*                    ADD  ADMAIS    MAIS
     C                     ADD  ADMAIS    KEI
     C*
     C           @END      TAG
     C*
     CL1                   EXSR #L1
     CL2                   EXCPTTOT
     CL2                   MOVEL'1'       *INOF
     C*
     C*
     C*
     C******************************************************
     C           #L1       BEGSR                           *
     C******************************************************
B001 C           *INOF     IFEQ '1'
     C                     TIME           TIME    60
     C                     Z-ADD*DATE     DAY     60
     C                     MOVELTY,1      MID    40
     C                     ADD  1         CNT
     C*
     C                     MOVE *BLANK    KJNM   16
     C           ADZBMN    CHAINFGBPL011             10
     C           *IN,10    IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,10
     C                     END
     C*
     C  N10                MOVELB2SMEI    KJNM
     C*
     C                     MOVE *BLANK    @NAME  10
     C           KUBUN     LOKUPTAB3      TAB4           20
     C   20                MOVELTAB4      @NAME
     C*
     C                     EXCPTHED
     C                     MOVEL'0'       *INOF
E001 C                     END
     C*
     C                     MOVE *BLANK    NAME   10
     C           ADDTKB    LOKUPTAB1      TAB2           20
     C   20                MOVELTAB2      NAME
     C*
     C                     MOVE *BLANK    #HIN
     C                     MOVELADHIN1    #HIN1
     C                     MOVELADHIN2    #HIN2
     C                     MOVELADHIN3    #HIN3
     C           #HIN2     IFNE *BLANK
     C                     MOVEL'-'       #HINA
     C                     END
     C*
     C           #HIN3     IFNE *BLANK
     C                     MOVEL'-'       #HINB
     C                     END
     C*
     C           ADKBN2    COMP *BLANK                   30
     C           ADSYOT    COMP *BLANK                   40
     C*
     C                     MOVE *BLANK    ZZNAM  16
     C           ADMBMN    CHAINFGBPL011             60
     C           *IN,60    IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,60
     C                     END
     C*
     C  N60                MOVELB2SMEI    ZZNAM
     C*
     C                     EXCPTDET
     C*
     C                     ENDSR
     C*
     C*
     C*
     C*
     C*
     OQPRINT  E   02           HED
     O                                    7 'DATE'
     O                         STHZ  Y   17
     O                                   19 '-'
     O                         ENHZ  Y   28
     O        E   03           HED
     O                                   24 'DATA INST APPOINTMENT'
     O                         @NAME     36
     O        E   04           HED
     O                                   89 'TIME'
     O                         TIME      98 '  :  :  '
     O        E   05           HED
     O                                   12 'PGM-BADR02'
     O                         MID       74
     O                                   89 'DATE'
     O                         DAY   Y   98
     O                                  104 'PAGE'
     O                         CNT   Z  108
     O        E   07           HED
     O                                   10 'PRE PROC'
     O                         ADZBMN    17
     O                         KJNM      36
     O        E   0911         HED
     O                                   22 'INT CO. P/N'
     O                                   36 'DATA INST'
     O                                   45 'MCH NO'
     O                                   52 'SHEET'
     O                                   69 'ACCOM QTY-UNIT'
     O                                   87 'PLATING MAKER '
     O                                  106 'C BOX RATIO'
     O                                  113 'LINE '
     O        E  1             DET
     O                         #HIN      25
     O                         NAME      37
     O                         ADKBN1    43
     O                N30                44 '-'
     O                         ADKBN2    45
     O*                        MAIS  KB  52
     O                         ADMAISKB  52
     O                         ADSYOS2   63
     O                N40                65 '-'
     O                         ADSYOT    67
     O                         ADMBMN    77
     O                         ZZNAM     96
     O                         ADCHAK2  103
     O                         ADLAIN   110
     O        E  2             TOT
     O                                   44 '** TOTAL'
     O                         KEI   2B  52
**  <TAB1/TAB2>
S ODR AGAIN
T OVER MADE
**  <TAB3/TAB4>
1 ODR AGAIN
2 OVER MADE
3 ALL
**  <MID>
PROD REORDER & OVER MADE DATA STATE LIST
