     H            Y.
     F** BAHR03 ************************
     F* INTRAL PROCESS L/T M/F *
     F* A.IDOTA 1994.11.15 *
     F************************ BAHR03 **
     FBAHPL02 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER                        UC
      * PARM *
     C           *ENTRY    PLIST
     C                     PARM           BMN     4
     C                     MOVELBMN       BMON    40
      *
     C                     TIME           WTIME   60
     C           BMON      IFEQ 9999
     C           *LOVAL    SETLLBAHPL021
     C                     ELSE
     C           BMON      SETLLBAHPL021
     C                     END
     C                     SETOF                     30
      *
     C                     DO   *HIVAL
     C           STP01     TAG
     C           BMON      IFEQ 9999
     C                     READ BAHPL021                 30
     C                     ELSE
     C           BMON      READEBAHPL021                 30
     C                     END
      *
     C           *IN30     IFEQ '0'
     C           BBSKJY    IFEQ 'D'
     C                     GOTO STP01
     C                     END
     C           SW        IFEQ *BLANK
     C                     OPEN QPRINT
     C                     MOVE '*'       SW      1
     C                     END
     C           BBBMON    IFNE CBMN
     C                     SETOF                     31
     C                     MOVE *BLANK    BMONM  18
     C           BBBMON    CHAINFGBPL011             31
     C           *IN31     IFEQ '0'
     C                     MOVELB2SMEI    BMONM
     C                     END
     C                     EXCPTMI
     C                     Z-ADDBBBMON    CBMN    40
     C                     SETOF                     70
     C                     END
      *
     C   OF                EXCPTMI
     C   OF                SETOF                     OF70
     C                     EXCPTME
     C                     SETON                     70
     C                     END
     C  N30                END
     C                     SETON                     LR
     C                     RETRN
      * 出力フォーマット *
     OQPRINT  E   02           MI
     O                                  131 '+-------------------+'
     O        E   03           MI
     O                                  131 '|         |         |'
     O        E   04           MI
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '|         |         |'
     O        E   05           MI
     O                                   12 'PGM:BAHC03'
     O                                   60 '* INTRAL PROCESS L/T M/F'
     O                                   75 'ACCOUNT BOOK *'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        E   0709         MI
     O                                   11 'SECTION'
     O                                   41 'PROCESS'
     O                                   51 'L/T'
     O        E  2             ME
     O                N70      BBBMON    10
     O                N70                12 '-'
     O                N70      BMONM     31
     O                         BBKOTI    39
     O                         BBLITM    51 '  .  '
