     H            Y.
     I            DS
     I*Ａ－ＰＩＣＳかんばん形式
     I                                        1  20 W@BARC
     I                                        1   1 W@KRKB
     I                                        2   5 W@ZETI
     I                                        6   8 W@TEHI
     I                                        9  10 W@PAGN
     I                                       11  11 W@BCKA
     I                                       12  12 W@BCTK
     I                                       13  13 W@BCYK
     I                                       14  14 W@BCHK
     I                                       15  15 W@BCKD
      *
     C           *ENTRY    PLIST
     C                     PARM           P@BARC 20
     C                     PARM           P@KRKB  1
     C                     PARM           P@ZETI  4
     C                     PARM           P@TEHI  3
     C                     PARM           P@PAGN  2
     C                     PARM           P@BCKA  1
     C                     PARM           P@BCTK  1
     C                     PARM           P@BCYK  1
     C                     PARM           P@BCHK  1
     C                     PARM           P@BCKD  1
      *
     C                     MOVE *BLANK    P@KRKB
     C                     MOVE *BLANK    P@ZETI
     C                     MOVE *BLANK    P@TEHI
     C                     MOVE *BLANK    P@PAGN
     C                     MOVE *BLANK    P@BCKA
     C                     MOVE *BLANK    P@BCTK
     C                     MOVE *BLANK    P@BCYK
     C                     MOVE *BLANK    P@BCHK
     C                     MOVE *BLANK    P@BCKD
      *
     C                     MOVE *BLANK    W@KRKB  1
     C                     MOVE *BLANK    W@ZETI  4
     C                     MOVE *BLANK    W@TEHI  3
     C                     MOVE *BLANK    W@PAGN  2
     C                     MOVE *BLANK    W@BCKA  1
     C                     MOVE *BLANK    W@BCTK  1
     C                     MOVE *BLANK    W@BCYK  1
     C                     MOVE *BLANK    W@BCHK  1
     C                     MOVE *BLANK    W@BCKD  1
      *
     C                     MOVELP@BARC    W@BARC 20
      *
     C                     MOVE W@KRKB    P@KRKB
     C                     MOVE W@ZETI    P@ZETI
     C                     MOVE W@TEHI    P@TEHI
     C                     MOVE W@PAGN    P@PAGN
     C                     MOVE W@BCKA    P@BCKA
     C                     MOVE W@BCTK    P@BCTK
     C                     MOVE W@BCYK    P@BCYK
     C                     MOVE W@BCHK    P@BCHK
     C                     MOVE W@BCKD    P@BCKD
      *
     C                     SETON                     LR
     C                     RETRN
      *
