     H            Y.
     F** BB#R01 ************************************
     F* TOYOTA SYSTEM SALES DATA MANAGEMENT NO. NO DATA LIST *
     F* PROGRAM ID. : BB#R01. <RPG> *
     F* CREATE DATE. : JAN.18,'90.                 *
     F* AUTHOR.         : K.NAKAMURA               *
     F************************************ BB#R01 **
     FBB#PL01 IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    M       1   1 50
     IBB#PL011    01
     I                                              B#TOKUL1
     I                                              B#NONYL1
     I                                              B#NKOJL1
     I                                              B#NUKEL1
     I                                              B#MHN1L1
     I                                              B#MHN2L1
     I                                              B#MHN3L1
      *
      *
      *
     C           *IN99     IFEQ '0'
     C                     TIME           WTIME   60
     C                     SETON                     99
     C                     END
      *
     OQPRINT  H   02   OF
     O                                  131 '+-------------------+'
     O        H   03   OF
     O                                  131 '|         |         |'
     O        H   04   OF
     O                                   89 'TIME'
     O                         WTIME Y   98
     O                                  131 '|         |         |'
     O        H   05   OF
     O                         M         83
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        H  208   OF
     O                                   17 'CUSTOMER'
     O                                   33 'RECEIVING CO.'
     O                                   47 'FACTORY'
     O                                   61 'RECEIVING'
     O                                   83 'USER PART NO'
     O                                  100 'MANAGEMENT NO.'
     O        D 1      L1
     O                         B#TOKU    16
     O                         B#NONY    32
     O                         B#NKOJ    44
     O                         B#NUKE    60
     O                         B#MHN1    73
     O                                   74 '-'
     O                         B#MHN2    79
     O                                   80 '-'
     O                         B#MHN3    85
**
* TOYOTA SYS. SALES DATA MNG.NO. NO DATA LIST *
