     H            Y.
     F** BBAR32 **********************************
     F*...INQUIRY OF TOYOTA SYSTEM SUPPLY PART UNIT PRICE M/F    *.
     F* PROGRAM ID. : BBAR32. <RPG> *
     F* CREATE DATE. : MAR.07,'91.               *
     F* AUTHOR.         : M...                   *
     F********************************** BBAR23 **
     FBBAPW32 CF  E                    WORKSTN
     F                                        RRN2  KSFILE DSP2R
     F                                        RRN3  KSFILE DSP3R
     FBBBPL07 IF  E           K        DISK
     FBBBPL05 IF  E           K        DISK
     FBBEPL11 IF  E           K        DISK
     E                    MSG     1   4 60               d[ｰxｮﾈｰﾆﾞ
     I            DS
     I                                        1  17 HINU
     I                                        1   5 HINU1
     I                                        6   6 HINUA
     I                                        7  11 HINU2
     I                                       12  12 HINUB
     I                                       13  17 HINU3
     I            DS
     I                                        1  17 UHIN
     I                                        1   5 UHIN1
     I                                        6   6 UHINA
     I                                        7  11 UHIN2
     I                                       12  12 UHINB
     I                                       13  17 UHIN3
     I            DS
     I                                        1   80BBSKHZ
     I                                        1   40BBSKYY
     I                                        5   60BBSKMM
     I                                        7   80BBSKDD
     I            DS
     I                                        1  15 BBHIN
     I                                        1   5 BBHIN1
     I                                        6  10 BBHIN2
     I                                       11  15 BBHIN3
     I            DS
     I                                        1  15 $$HIN
     I                                        1   5 $$HIN1
     I                                        6  10 $$HIN2
     I                                       11  15 $$HIN3
     I            DS
     I                                        1  15 WKHIN
     I                                        1   5 WKHIN1
     I                                        6  10 WKHIN2
     I                                       11  15 WKHIN3
     I            DS
     I                                        1   80BBKSHZ
     I                                        1   40BBKSYY
     I                                        5   60BBKSMM
     I                                        7   80BBKSDD
     I            DS
     I                                        1   80BBKEHZ
     I                                        1   40BBKEYY
     I                                        5   60BBKEMM
     I                                        7   80BBKEDD
     I            DS
     I                                        1   80BBZSHZ
     I                                        1   40BBZSYY
     I                                        5   60BBZSMM
     I                                        7   80BBZSDD
     I            DS
     I                                        1   80BBZEHZ
     I                                        1   40BBZEYY
     I                                        5   60BBZEMM
     I                                        7   80BBZEDD
     I            DS
     I                                        1   80B@SKHZ
     I                                        1   40B@SKYY
     I                                        5   60B@SKMM
     I                                        7   80B@SKDD
     I            DS
     I                                        1  17 PUHIN
     I                                        1   5 PUHIN1
     I                                        7  11 PUHIN2
     I                                       13  17 PUHIN3
     I            DS
     I                                        1   60KAHZ
     I                                        1   20PKAYY
     I                                        3   40PKAMM
     I                                        5   60PKADD
     C           KEY1      KLIST
     C                     KFLD           TKCD
      *
     C           KEY2      KLIST
     C                     KFLD           TKCD
     C                     KFLD           HIN1
      *
     C           KEY3      KLIST
     C                     KFLD           TKCD
     C                     KFLD           HIN1
     C                     KFLD           HIN2
      *
     C           KEY4      KLIST
     C                     KFLD           TKCD
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
      *
     C           KEY5      KLIST
     C                     KFLD           TKCD
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
     C                     KFLD           GNKYX
      *
     C           KEY6      KLIST
     C                     KFLD           PUHIN1
     C                     KFLD           PUHIN2
     C                     KFLD           PKNNO
     C                     KFLD           PGNKY
     C                     KFLD           PTOKU
      *
     C           KEY7      KLIST
     C                     KFLD           PUHIN1
     C                     KFLD           PUHIN2
     C                     KFLD           PKNNO
     C                     KFLD           PGNKY
     C                     KFLD           PTOKU
      *
     C           *ENTRY    PLIST
     C                     PARM           #KBN    1
      *
     C           STP0      TAG
     C                     MOVE *BLANK    WWKBN   1
     C                     Z-ADD0         TKCD
     C                     MOVE *BLANK    HIN1
     C                     MOVE *BLANK    HIN2
     C                     MOVE *BLANK    HIN3
     C                     MOVE *BLANK    GNKYX
      *
     C******************************************************
     C*  EXFMT  <fﾞx] 1>                                   *
     C******************************************************
     C           STP1      TAG
     C                     Z-ADD0         RRN2    50
     C                     Z-ADD0         RRN3    50
     C                     EXFMTBBAPW321
     C                     MOVEA'000'     *IN,01
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
      *
     C*  ﾅﾎﾞﾎｦbﾓ ﾃ]nﾜｰﾓ
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
      *
     C*  CMD-1
     C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
      *
     C*  CMD-3
     C           *INKC     IFEQ '1'
     C                     MOVEL'3'       #KBN
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
      *
     C******************************************************
     C*  <fﾞx] 1 ﾉ kｩｮh>                                   *
     C******************************************************
     C           TKCD      CHAINBBEPL111             10
     C           *IN,10    IFEQ '0'
     C           B@SKJY    ANDEQ'D'
     C           B@SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,10
     C                     END
      *
     C           *IN,10    IFEQ '1'
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,1     ERR
     C                     GOTO STP1
     C                     END
      *
     C                     MOVE *BLANK    HINU
     C                     MOVELHIN1      HINU1
     C                     MOVELHIN2      HINU2
     C                     MOVELHIN3      HINU3
      *
     C           HINU2     IFNE *BLANK
     C                     MOVEL'-'       HINUA
     C                     END
      *
     C           HINU3     IFNE *BLANK
     C                     MOVEL'-'       HINUB
     C                     END
      *
     C                     MOVEA'00000'   *IN,20
     C           GNKYX     IFNE *BLANK
     C                     MOVEA'10000'   *IN,20
     C                     GOTO @LOOP
     C                     END
      *
     C           HIN3      IFNE *BLANK
     C                     MOVEA'01000'   *IN,20
     C                     GOTO @LOOP
     C                     END
      *
     C           HIN2      IFNE *BLANK
     C                     MOVEA'00100'   *IN,20
     C                     GOTO @LOOP
     C                     END
      *
     C           HIN1      IFNE *BLANK
     C                     MOVEA'00010'   *IN,20
     C                     GOTO @LOOP
     C                     END
      *
     C           TKCD      IFNE 0
     C                     MOVEA'00001'   *IN,20
     C                     GOTO @LOOP
     C                     END
      *
     C*  ﾅﾎﾞﾎｦbﾓ ﾈｮn
     C           @LOOP     TAG
     C                     Z-ADD0         CNTR2   50
     C                     EXSR #SET2
      *
     C*  fﾞbnc mﾞｰj oﾆ
     C           ERR       IFNE *BLANK
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
      *
     C*  ﾅﾎﾞﾎｦbﾓ ﾛﾃｰnﾞ NO ﾈｮn
     C                     Z-ADD1         RCDNBR
      *
     C******************************************************
     C*  EXFMT  (fﾞx] 2)                                   *
     C******************************************************
     C           STP2      TAG
     C                     MOVE *BLANK    WWKBN
     C                     WRITEDSP2X
     C                     MOVEA'1'       *IN,91
     C                     EXFMTDSP2C
     C                     MOVEA'0'       *IN,91
      *
     C                     MOVEA'0'       *IN,44
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
      *
     C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
      *
     C           *INKC     IFEQ '1'
     C                     GOTO STP0
     C                     END
      *
     C*  ﾜｰﾓ aｮﾎﾟ
     C           *IN,81    IFEQ '1'
     C                     Z-ADD0         CNTR2
     C                     EXSR ROLUP2
     C                     Z-ADDRRN2      RCDNBR
      *
     C           *IN,44    IFEQ '1'
     C                     MOVEA'1'       *IN,99
     C                     END
     C                     GOTO STP2
     C                     END
      *
     C*  ﾅﾎﾞﾎｦbﾓ ﾛﾃｰnﾞ NO ﾈｮn
     C                     Z-ADD1         RCDNBR
     C                     Z-ADDRRN2      XXRRN2  50
      *
     C                     DO   *HIVAL    RRN@@2  50
     C           RRN@@2    CHAINDSP2R                42
     C           *IN,42    IFEQ '0'
     C           OP        IFEQ 'M'
      *
     C                     MOVELPUHIN     QUHIN
     C                     MOVELPKNNO     QKNNO
     C                     MOVELPGNKY     QGNKY
     C                     Z-ADDPTOKU     QTOKU
      *
     C                     EXSR #SET3
      *
     C           RRN@@2    CHAINDSP2R                43
     C  N43                MOVE *BLANK    OP
     C  N43                UPDATDSP2R
      *
     C                     END
     C                     END
     C  N42                END
      *
     C                     Z-ADDXXRRN2    RRN2
     C                     MOVEA'1'       *IN,44
     C           WWKBN     IFEQ *BLANK
     C                     GOTO STP0
     C                     ELSE
     C                     Z-ADD0         RRN2
     C                     GOTO @LOOP
     C                     END
      *
     C******************************************************
     C           #SET2     BEGSR                           *
     C******************************************************
     C*  ﾅﾎﾞﾎｦbﾓ ﾈｮn
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
      *
     C   20      KEY5      SETLLBBBPL071
     C   21      KEY4      SETLLBBBPL071
     C   22      KEY3      SETLLBBBPL071
     C   23      KEY2      SETLLBBBPL071
     C   24      KEY1      SETLLBBBPL071
      *
     C                     MOVE *BLANK    OP
     C                     Z-ADD0         TOKU
     C                     MOVE *BLANK    GNKY
     C                     MOVE *BLANK    KNNO
     C                     MOVE *BLANK    UHIN
     C                     Z-ADD0         TANK
     C                     Z-ADD0         KAHZ
     C                     MOVE *BLANK    PUHIN
     C                     MOVE *BLANK    PGNKY
     C                     MOVE *BLANK    PKNNO
     C                     Z-ADD0         PTOKU
     C                     MOVE *BLANK    ZSW2    1
     C                     Z-ADD0         WKTOKU  40
     C                     MOVE *BLANK    WKGNKY  1
     C                     MOVE *BLANK    WKKNNO 10
     C                     MOVE *BLANK    WKHIN  15
     C                     Z-ADD0         WKTANK  92
     C                     Z-ADD0         WKKAHZ  80
     C                     MOVE *BLANK    W@UHIN 17
     C                     MOVE *BLANK    W@GNKY  1
     C                     MOVE *BLANK    W@KNNO 10
     C                     Z-ADD0         W@TOKU  40
     C                     Z-ADD0         $$TOKU  40
     C                     MOVE *BLANK    $$GNKY  1
     C                     MOVE *BLANK    $$KNNO 10
     C                     MOVE *BLANK    $$HIN  15
     C                     Z-ADD0         $$TANK  92
     C                     Z-ADD0         $$KAHZ  80
     C                     Z-ADD0         CNTR$   40
      *
     C                     DO   *HIVAL
     C                     SETOF                     40
     C   20      KEY5      READEBBBPL071                 40
     C   21      KEY4      READEBBBPL071                 40
     C   22      KEY3      READEBBBPL071                 40
     C   23      KEY2      READEBBBPL071                 40
     C   24      KEY1      READEBBBPL071                 40
      *
     C           *IN,40    IFEQ '1'
     C           ZSW2      IFEQ *BLANK
     C                     GOTO @@@2
     C                     ELSE
     C                     GOTO ###2
     C                     END
     C                     END
      *
     C           *IN,40    IFEQ '0'
     C           BBSKJY    IFEQ 'D'
     C           BBSKHZ    ANDLE*DATE
     C                     GOTO @END2
     C                     END
      *
     C                     ADD  1         CNTR$
      *
     C           ZSW2      IFEQ *BLANK
     C                     Z-ADDBBTKCD    WKTOKU
     C                     MOVELBBKGKB    WKGNKY
     C                     MOVELBBKANO    WKKNNO
     C                     MOVELBBHIN     WKHIN
     C                     Z-ADDBBKTNK    WKTANK
     C                     Z-ADDBBKSHZ    WKKAHZ
     C                     MOVEL'*'       ZSW2
     C                     END
      *
     C           BBTKCD    IFEQ WKTOKU
     C           BBKGKB    ANDEQWKGNKY
     C           BBKANO    ANDEQWKKNNO
     C           BBHIN     ANDEQWKHIN
     C                     Z-ADDBBTKCD    $$TOKU
     C                     MOVELBBKGKB    $$GNKY
     C                     MOVELBBKANO    $$KNNO
     C                     MOVELBBHIN     $$HIN
     C                     Z-ADDBBKTNK    $$TANK
     C                     Z-ADDBBKSHZ    $$KAHZ
     C                     GOTO @END2
     C                     END
     C           ###2      TAG
      *
     C                     Z-ADD$$TOKU    TOKU
     C                     MOVEL$$GNKY    GNKY
     C                     MOVEL$$KNNO    KNNO
     C                     MOVE *BLANK    UHIN
     C                     MOVEL$$HIN1    UHIN1
     C                     MOVEL$$HIN2    UHIN2
     C                     MOVEL$$HIN3    UHIN3
      *
     C           UHIN2     IFNE *BLANK
     C                     MOVEL'-'       UHINA
     C                     END
      *
     C           UHIN3     IFNE *BLANK
     C                     MOVEL'-'       UHINB
     C                     END
      *
     C                     Z-ADD$$TANK    TANK
     C                     Z-ADD$$KAHZ    KAHZ
      *
     C                     MOVELUHIN      W@UHIN
     C                     MOVEL$$GNKY    W@GNKY
     C                     MOVEL$$KNNO    W@KNNO
     C                     Z-ADD$$TOKU    W@TOKU
      *
     C                     Z-ADDBBTKCD    WKTOKU
     C                     MOVELBBKGKB    WKGNKY
     C                     MOVELBBKANO    WKKNNO
     C                     MOVELBBHIN     WKHIN
     C                     Z-ADDBBKTNK    WKTANK
     C                     Z-ADDBBKSHZ    WKKAHZ
     C                     MOVELW@UHIN    PUHIN
     C                     MOVELW@GNKY    PGNKY
     C                     MOVELW@KNNO    PKNNO
     C                     Z-ADDW@TOKU    PTOKU
     C                     Z-ADDBBTKCD    $$TOKU
     C                     MOVELBBKGKB    $$GNKY
     C                     MOVELBBKANO    $$KNNO
     C                     MOVELBBHIN     $$HIN
     C                     Z-ADDBBKTNK    $$TANK
     C                     Z-ADDBBKSHZ    $$KAHZ
      *
     C                     ADD  1         RRN2
     C                     ADD  1         CNTR2
     C                     WRITEDSP2R
     C                     Z-ADD0         CNTR$
      *
     C* MAX mﾞｰj <14>
     C           CNTR2     IFEQ 14
     C                     SETOF                     50
     C   20      KEY5      REDPEBBBPL071                 50
     C   21      KEY4      REDPEBBBPL071                 50
     C   22      KEY3      REDPEBBBPL071                 50
     C   23      KEY2      REDPEBBBPL071                 50
     C   24      KEY1      REDPEBBBPL071                 50
     C                     GOTO @@@2
     C                     END
     C                     END
     C           @END2     TAG
     C  N40                END
      *
     C           @@@2      TAG
      *
     C*  fﾞbnc mﾞｰj oﾆ
     C           RRN2      IFEQ 0
     C                     MOVEA'111'     *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,2     ERR
     C                     END
      *
     C                     ENDSR
      *
     C******************************************************
     C           ROLUP2    BEGSR                           *
     C******************************************************
     C                     MOVE *BLANK    SW2     1
     C                     MOVE *BLANK    XSW2    1
     C                     Z-ADD0         WKTOKU
     C                     MOVE *BLANK    WKGNKY
     C                     MOVE *BLANK    WKKNNO
     C                     MOVE *BLANK    WKHIN
     C                     Z-ADD0         WKTANK
     C                     Z-ADD0         WKKAHZ
     C                     MOVE *BLANK    W@UHIN
     C                     MOVE *BLANK    W@GNKY
     C                     MOVE *BLANK    W@KNNO
     C                     Z-ADD0         W@TOKU
     C                     Z-ADD0         $$TOKU  40
     C                     MOVE *BLANK    $$GNKY  1
     C                     MOVE *BLANK    $$KNNO 10
     C                     MOVE *BLANK    $$HIN  15
     C                     Z-ADD0         $$TANK  92
     C                     Z-ADD0         $$KAHZ
     C                     Z-ADD0         CNTR$   40
      *
     C                     DO   *HIVAL
     C                     SETOF                     40
     C   20      KEY5      READEBBBPL071                 40
     C   21      KEY4      READEBBBPL071                 40
     C   22      KEY3      READEBBBPL071                 40
     C   23      KEY2      READEBBBPL071                 40
     C   24      KEY1      READEBBBPL071                 40
      *
     C           *IN,40    IFEQ '1'
     C           XSW2      IFEQ *BLANK
     C                     GOTO @ROLE2
     C                     ELSE
     C                     GOTO ###X2
     C                     END
     C                     END
      *
     C           *IN,40    IFEQ '0'
     C           BBSKJY    IFEQ 'D'
     C           BBSKHZ    ANDLE*DATE
     C                     GOTO @EXIT2
     C                     END
      *
     C                     ADD  1         CNTR$
      *
     C           XSW2      IFEQ *BLANK
     C                     Z-ADDBBTKCD    WKTOKU
     C                     MOVELBBKGKB    WKGNKY
     C                     MOVELBBKANO    WKKNNO
     C                     MOVELBBHIN     WKHIN
     C                     Z-ADDBBKTNK    WKTANK
     C                     Z-ADDBBKSHZ    WKKAHZ
     C                     MOVEL'*'       XSW2
     C                     END
      *
     C           BBTKCD    IFEQ WKTOKU
     C           BBKGKB    ANDEQWKGNKY
     C           BBKANO    ANDEQWKKNNO
     C           BBHIN     ANDEQWKHIN
     C                     Z-ADDBBTKCD    $$TOKU
     C                     MOVELBBKGKB    $$GNKY
     C                     MOVELBBKANO    $$KNNO
     C                     MOVELBBHIN     $$HIN
     C                     Z-ADDBBKTNK    $$TANK
     C                     Z-ADDBBKSHZ    $$KAHZ
     C                     GOTO @EXIT2
     C                     END
     C           ###X2     TAG
      *
     C                     Z-ADD$$TOKU    TOKU
     C                     MOVEL$$GNKY    GNKY
     C                     MOVEL$$KNNO    KNNO
     C                     MOVE *BLANK    UHIN
     C                     MOVEL$$HIN1    UHIN1
     C                     MOVEL$$HIN2    UHIN2
     C                     MOVEL$$HIN3    UHIN3
      *
     C           UHIN2     IFNE *BLANK
     C                     MOVEL'-'       UHINA
     C                     END
      *
     C           UHIN3     IFNE *BLANK
     C                     MOVEL'-'       UHINB
     C                     END
      *
     C                     Z-ADD$$TANK    TANK
     C                     Z-ADD$$KAHZ    KAHZ
      *
     C                     MOVELUHIN      W@UHIN
     C                     MOVEL$$GNKY    W@GNKY
     C                     MOVEL$$KNNO    W@KNNO
     C                     Z-ADD$$TOKU    W@TOKU
      *
     C                     Z-ADDBBTKCD    WKTOKU
     C                     MOVELBBKGKB    WKGNKY
     C                     MOVELBBKANO    WKKNNO
     C                     MOVELBBHIN     WKHIN
     C                     Z-ADDBBKTNK    WKTANK
     C                     Z-ADDBBKSHZ    WKKAHZ
     C                     MOVELW@UHIN    PUHIN
     C                     MOVELW@GNKY    PGNKY
     C                     MOVELW@KNNO    PKNNO
     C                     Z-ADDW@TOKU    PTOKU
     C                     Z-ADDBBTKCD    $$TOKU
     C                     MOVELBBKGKB    $$GNKY
     C                     MOVELBBKANO    $$KNNO
     C                     MOVELBBHIN     $$HIN
     C                     Z-ADDBBKTNK    $$TANK
     C                     Z-ADDBBKSHZ    $$KAHZ
      *
     C                     ADD  1         RRN2
     C                     ADD  1         CNTR2
     C                     MOVEL'*'       SW2
     C                     WRITEDSP2R
     C                     Z-ADD0         CNTR$
      *
     C* MAX mﾞｰj <14>
     C           CNTR2     IFEQ 14
     C                     SETOF                     50
     C   20      KEY5      REDPEBBBPL071                 50
     C   21      KEY4      REDPEBBBPL071                 50
     C   22      KEY3      REDPEBBBPL071                 50
     C   23      KEY2      REDPEBBBPL071                 50
     C   24      KEY1      REDPEBBBPL071                 50
     C                     GOTO @ROLE2
     C                     END
     C                     END
     C           @EXIT2    TAG
     C  N40                END
      *
     C           @ROLE2    TAG
      *
     C*  ﾃﾛbﾆﾞｭc mﾞｰj oﾆ
     C           SW2       IFEQ *BLANK
     C                     MOVEA'1'       *IN,44
     C                     END
      *
     C                     ENDSR
      *
     C******************************************************
     C           #SET3     BEGSR                           *
     C******************************************************
     C*  ﾅﾎﾞﾎｦbﾓ ﾈｮn
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP3C
     C                     MOVEA'0'       *IN,92
      *
     C           KEY6      SETLLBBBPL051
      *
     C                     Z-ADD0         RRN3
     C                     Z-ADD0         NO
     C                     MOVE *BLANK    XKMKM
     C                     MOVE *BLANK    XHOSO
     C                     Z-ADD0         XTANK
     C                     Z-ADD0         XKSHZ
     C                     Z-ADD0         XKEHZ
     C                     MOVE *BLANK    XKOTI
     C                     MOVE *BLANK    @KMKM
     C                     MOVE *BLANK    @KKNP
     C                     Z-ADD0         @KTNK
     C                     Z-ADD0         @KSHZ
     C                     Z-ADD0         @KEHZ
     C                     MOVE *BLANK    @KOTI
     C                     MOVE *BLANK    @KKBI
     C                     Z-ADD0         @BTNK
     C                     Z-ADD0         @KEIS
     C                     Z-ADD0         @KOYU
     C                     Z-ADD0         @ZTNK
     C                     Z-ADD0         @ZSHZ
     C                     Z-ADD0         @ZEHZ
     C                     MOVE *BLANK    @ZGNK
     C                     MOVE *BLANK    @ZOTI
     C                     MOVE *BLANK    ZSW3    1
     C                     Z-ADD0         CNTR3   50
      *
     C                     DO   *HIVAL
     C           KEY7      READEBBBPL051                 40
     C   40                GOTO STP3
      *
     C           *IN,40    IFEQ '0'
     C           BBSKJY    IFEQ 'D'
     C           BBSKHZ    ANDLE*DATE
     C                     GOTO @END3
     C                     END
      *
     C                     ADD  1         NO
     C                     MOVELBBMHKB    XKMKM
     C                     MOVELBBHSKB    XHOSO
     C                     Z-ADDBBKTNK    XTANK
     C                     Z-ADDBBKSHZ    XKSHZ
     C                     Z-ADDBBKEHZ    XKEHZ
     C                     MOVELBBKKKB    XKOTI
      *
     C*  ﾍﾍｭcﾆﾞ
     C                     MOVELBBMHKB    @KMKM
     C                     MOVELBBHSKB    @KKNP
     C                     Z-ADDBBKTNK    @KTNK
     C                     Z-ADDBBKSHZ    @KSHZ
     C                     Z-ADDBBKEHZ    @KEHZ
     C                     MOVELBBKKKB    @KOTI
     C                     MOVELBBKBKK    @KKBI
     C                     Z-ADDBBUBTN    @BTNK
     C                     Z-ADDBBKEIS    @KEIS
     C                     Z-ADDBBKKST    @KOYU
     C                     Z-ADDBBZTNK    @ZTNK
     C                     Z-ADDBBZSHZ    @ZSHZ
     C                     Z-ADDBBZEHZ    @ZEHZ
     C                     MOVELBBZGKB    @ZGNK
     C                     MOVELBBZKKB    @ZOTI
     C                     ADD  1         RRN3
     C                     ADD  1         CNTR3
     C                     MOVEL'*'       ZSW3
     C                     WRITEDSP3R
      *
     C* MAX mﾞｰj <11>
     C           CNTR3     CABEQ11        STP3
     C                     END
     C           @END3     TAG
     C  N40                END
      *
     C           STP3      TAG
     C                     Z-ADD0         XNO
     C           STP3X     TAG
      *
     C*  ﾅﾎﾞﾎｦbﾓ ﾛﾃｰnﾞ NO ﾈｮn
     C                     Z-ADD1         RCDNBX
     C                     MOVEA'1'       *IN,91
     C                     WRITEDSP3C
     C                     MOVEA'0'       *IN,91
     C                     EXFMTDSP3X
      *
     C                     MOVEA'0'       *IN,01
     C                     MOVEA'0'       *IN,44
     C                     MOVEA'0'       *IN,88
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
      *
     C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
      *
     C           *INKC     IFEQ '1'
     C                     MOVEL'*'       WWKBN
     C                     GOTO @OWARI
     C                     END
      *
     C*  ﾜｰﾓ aｮﾎﾟ
     C           *IN,77    IFEQ '1'
     C                     Z-ADD0         CNTR3
     C                     EXSR ROLUP3
     C                     Z-ADDRRN3      RCDNBX
     C           *IN,44    IFEQ '1'
     C                     MOVEA'1'       *IN,99
     C                     END
     C                     GOTO STP3
     C                     END
      *
     C           XNO       IFEQ 0
     C                     MOVEL'*'       WWKBN
     C                     GOTO @OWARI
     C                     END
      *
     C*  ﾅﾎﾞﾎｦbﾓ ﾛﾃｰnﾞ NO ﾈｮn
     C                     Z-ADD1         RCDNBX
      *
     C           XNO       IFNE 0
     C                     MOVE *BLANK    FLG     1
     C                     Z-ADDRRN3      XXRRN3  50
      *
     C                     DO   *HIVAL    RRN@@3  50
     C           RRN@@3    CHAINDSP3R                42
     C           *IN,42    IFEQ '0'
     C           XNO       IFEQ RRN@@3
      *
     C                     MOVEL@KMKM     KMKM
     C                     MOVEL@KKNP     KKNP
     C                     Z-ADD@KTNK     KTNK
     C                     Z-ADD@KSHZ     KSHZ
     C                     Z-ADD@KEHZ     KEHZ
     C                     MOVEL@KOTI     KOTI
     C                     MOVEL@KKBI     KKBI
     C                     Z-ADD@BTNK     BTNK
     C                     Z-ADD@KEIS     KEIS
     C                     Z-ADD@KOYU     KOYU
     C                     Z-ADD@ZTNK     ZTNK
     C                     Z-ADD@ZSHZ     ZSHZ
     C                     Z-ADD@ZEHZ     ZEHZ
     C                     MOVEL@ZGNK     ZGNK
     C                     MOVEL@ZOTI     ZOTI
      *
     C                     EXSR #SET4
     C                     UPDATDSP3R
     C                     MOVEL'*'       FLG
      *
     C                     END
     C                     END
     C  N42                END
      *
     C           FLG       IFEQ *BLANK
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,88
     C                     MOVELMSG,4     ERR
     C                     GOTO STP3X
     C                     END
     C                     END
      *
     C                     Z-ADDXXRRN3    RRN3
     C                     MOVEA'1'       *IN,44
     C                     GOTO STP3
      *
     C           @OWARI    ENDSR
      *
     C******************************************************
     C           ROLUP3    BEGSR                           *
     C******************************************************
     C                     MOVE *BLANK    ZSW3
     C                     MOVE *BLANK    XKMKM
     C                     MOVE *BLANK    XHOSO
     C                     Z-ADD0         XTANK
     C                     Z-ADD0         XKSHZ
     C                     Z-ADD0         XKEHZ
     C                     MOVE *BLANK    XKOTI
      *
     C                     DO   *HIVAL
     C           KEY7      READEBBBPL051                 40
     C   40                GOTO @ROLE3
      *
     C           *IN,40    IFEQ '0'
     C           BBSKJY    IFEQ 'D'
     C           BBSKHZ    ANDLE*DATE
     C                     GOTO @EXIT3
     C                     END
      *
     C                     ADD  1         NO
     C                     MOVELBBMHKB    XKMKM
     C                     MOVELBBHSKB    XHOSO
     C                     Z-ADDBBKTNK    XTANK
     C                     Z-ADDBBKSHZ    XKSHZ
     C                     Z-ADDBBKEHZ    XKEHZ
     C                     MOVELBBKKKB    XKOTI
      *
     C*  ﾍﾍｭcﾆﾞ
     C                     MOVELBBMHKB    @KMKM
     C                     MOVELBBHSKB    @KKNP
     C                     Z-ADDBBKTNK    @KTNK
     C                     Z-ADDBBKSHZ    @KSHZ
     C                     Z-ADDBBKEHZ    @KEHZ
     C                     MOVELBBKKKB    @KOTI
     C                     MOVELBBKBKK    @KKBI
     C                     Z-ADDBBUBTN    @BTNK
     C                     Z-ADDBBKEIS    @KEIS
     C                     Z-ADDBBKKST    @KOYU
     C                     Z-ADDBBZTNK    @ZTNK
     C                     Z-ADDBBZSHZ    @ZSHZ
     C                     Z-ADDBBZEHZ    @ZEHZ
     C                     MOVELBBZGKB    @ZGNK
     C                     MOVELBBZKKB    @ZOTI
     C                     ADD  1         RRN3
     C                     ADD  1         CNTR3
     C                     MOVEL'*'       ZSW3
     C                     WRITEDSP3R
      *
     C           CNTR3     CABEQ11        @ROLE3
     C                     END
     C           @EXIT3    TAG
     C  N40                END
      *
     C           @ROLE3    TAG
      *
     C*  ﾃﾛbﾆﾞｭc mﾞｰj oﾆ
     C           ZSW3      IFEQ *BLANK
     C                     MOVEA'1'       *IN,44
     C                     END
      *
     C                     ENDSR
      *
     C******************************************************
     C           #SET4     BEGSR                           *
     C******************************************************
     C           STP4      TAG
     C                     EXFMTBBAPW322
      *
     C           *INKC     IFEQ '1'
     C                     MOVEA'1'       *IN,42
     C                     Z-ADD0         XNO
     C                     GOTO #SET4E
     C                     END
      *
     C           #SET4E    ENDSR
      *
**  MSG (ERROR MESSAGE )
E-01 NO DATA IN TOYOTA SYSTEM SUPPLY PART UNIT PRICE M/F
E-02 THERE ISN'T APPLICABLE DATA
E-03 INPUT NO.
E-04 NO. ISN'T RIGHT
