     H            Y.
     F**BBBR1A******************************************
     F* SALES UNIT PRICE TERM OF A CONTRACT UPDATE TABLE HANDLING *
     F*            CHANGE ONLY TERM OF A CONTRACT.   *
     F*             LIST                             *
     F*         PROGRAM ID. : BBBR1A                   *
     F*         CREATE DATE. : OCT.05,'90.             *
     F*         AUTHOR.        : K.NAKAMURA            *
     F******************************************BBBR1A**
     FFGBPL01 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TAB1    1   3  1   TAB2   16
     I            DS
     I                                        1   80WWSTHZ
     I                                        3   80WWSYMD
     I            DS
     I                                        1   80WWENHZ
     I                                        3   80WWEYMD
     C           *ENTRY    PLIST
     C                     PARM           @@US   10
     C                     PARM           @@KUBN  1
     C                     PARM           @@TOKU  4
     C                     PARM           @@KOJO  1
     C                     PARM           @@STHZ  8
     C                     PARM           @@ENHZ  8
     C                     PARM           @@GALL  60
     C                     PARM           @@GDLT  60
     C                     PARM           @@GUPD  60
     C                     PARM           @@RALL  60
     C                     PARM           @@RDLT  60
     C                     PARM           @@RUPD  60
      *
     C                     TIME           WTIME   60
      *
     C                     SETOF                     10
     C                     MOVE *BLANK    WUSNM  10
     C           @@US      CHAINRGAPL111             10
     C           *IN10     IFEQ '0'
     C           J8SKJY    IFEQ *BLANK
     C                     MOVELJ8NAME    WUSNM
     C                     END
     C                     END
      *
     C                     SETOF                     10
     C           @@KUBN    LOKUPTAB1      TAB2           10
     C   10                MOVE TAB2      WWKUNM 16
      *
     C                     MOVEL*BLANK    WWTONM 16
      *
     C                     SETOF                     20
     C                     MOVE @@TOKU    WWTOKU  40
     C           WWTOKU    CHAINFGBPL011             20
     C  N20                MOVELB2SMEI    WWTONM
      *
     C                     MOVE @@STHZ    WWSTHZ  80
     C                     MOVE @@ENHZ    WWENHZ  80
      *
     C                     EXCPTHED
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *
      *--------------------*
      * 出力フォーマット *
      *--------------------*
     OQPRINT  E  102           HED
     O                                  131 '+-------------------+'
     O        E  1             HED
     O                                  131 '|         |         |'
     O        E  1             HED
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '|         |         |'
     O                         WUSNM    130
     O        E  2             HED
     O                                   11 'BBBR1A-1'
     O                                   36 '* TERM OF A CONTRACT FOR'
     O                                   53 'SALES UNIT PRICE'
     O                                   75 'UPDATE TABLE HANDLING'
     O                                   82 'LIST *'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        E  2             HED
     O                         WWKUNM    25
     O        E  2             HED
     O                                   28 'UPD TABLE HANDLING CODE'
     O                                   32 '-->'
     O                                   49 'CHANGE ONLY TERM'
     O                                   63 'OF A CONTRACT'
     O        E  1             HED
     O                                   18 'CUSTOMER'
     O                                   40 'FACTORY'
     O                                   52 'START DATE'
     O                                   64 'EXIT DATE'
     O        E  3             HED
     O                         WWTOKU    14
     O                         WWTONM    31
     O                         @@KOJO    37
     O                         WWSYMDY   51
     O                         WWEYMDY   63
     O        E  2             HED
     O                                   29 '(VOLUME PRODUCT)'
     O                                   47 'ALL DATA COUNT'
     O                                   66 'DELETE DATA COUNT'
     O                                   85 'UPDATE DATA COUNT'
     O        E  3             HED
     O                         @@GALL2   44
     O                         @@GDLT2   61
     O                         @@GUPD2   80
     O        E  2             HED
     O                                   29 '(EXCEPTION)'
     O                                   47 'ALL DATA COUNT'
     O                                   66 'DELETE DATA COUNT'
     O                                   85 'UPDATE DATA COUNT'
     O        E  2             HED
     O                         @@RALL2   44
     O                         @@RDLT2   61
     O                         @@RUPD2   80
**  (TAB1/TAB2)
GG->VOL PROD
RR->EXCEPTION
SS->VOL PROD/EXCP
