     H            Y.
      ** BBHR50 ***********************************************************
      *  GET IAF PART# FROM COMMON (USER) PART
      *          FOR SALES UNIT PRICE MASTER
      *
      * TCHK1 03/20/09 RE-MAKE
      * TCHK2 05/11/09 CHG HMIN 0390 ---> 3135
      * TCHK3 03/26/10 ADD PISTON
      * TCHK4 02/20/13 ADD TMMMS,TEMA
JW1   * JW    03/03/16 ADD TOH, HONDA TRADING(1602)
JW2   * JW    07/16/16 ADD HURON(3334), BORGWARNER(4390), PIERBURG(1111)
JW3   * JW    05/02/22 CHG NAPCK(0323)
      *  CALLING SEQ.===========================================*
      *                    CALL 'BBHR50'                        *
     C*                    PARM           $TOKU   4
     C*                    PARM           $NONY   4
     C*                    PARM           $NKOJ   1
     C*                    PARM           $NUKE   4
     C*                    PARM           $MHIN  20
     C*                    PARM           @SHIN  12
     C*                    PARM           @FLG    1
      *   IN  $TOKU   4A CUST#                                  *
      *       $NONY   4A DELIV#                                 *
      *       $NKOJ   1A FACTORY                                *
      *       $NUKE   4A DOCK                                   *
      *       $MHIN  20A CUST PART#                             *
      *   OUT @SHIN  12A IAF  PART#                             *
      *       @FLG    1A RETURN FLAG (BLANK=OK, *=ERROR)        *
      ************************************************* BBHR50 **
     FFAAPL02 IF  E           K        DISK
     FFAAPL06 IF  E           K        DISK
     FFAAPL05 IF  E           K        DISK
     FFAAPL09 IF  E           K        DISK
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     I            DS
     I                                        1   80B7SKHZ
     I                                        1   40B7SKYY
     I                                        5   60B7SKMM
     I                                        7   80B7SKDD
     I            DS
     I                                        1   80FBTKDT
     I                                        1   40FBTKYY
     I                                        5   60FBTKMM
     I                                        7   80FBTKDD
     I            DS
     I                                        1   80FBTSDT
     I                                        1   40FBTSYY
     I                                        5   60FBTSMM
     I                                        7   80FBTSDD
     I            DS
     I                                        1  20 PMHIN
     I                                        1   5 PMHN1
     I                                        6  10 PMHN2
     I                                       11  15 PMHN3
     I                                       11  11 PMHN4
     I                                       16  20 PMHN5
     I            DS
     I                                        1  12 PSHIN
     I                                        1   5 PSHN1
     I                                        6  10 PSHN2
     I                                       11  12 PSHN3
     C           KEY       KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
      *
     C           KEY1      KLIST
     C                     KFLD           JTOKU
     C                     KFLD           JNONY
     C                     KFLD           JNKOJ
     C                     KFLD           JNUKE
     C                     KFLD           JMHN1
     C                     KFLD           JMHN2
     C                     KFLD           JMHN3
     C                     KFLD           JMHN4
     C           KEY2      KLIST
     C                     KFLD           @TOKU
     C                     KFLD           @NONY
     C                     KFLD           PMHN1
     C                     KFLD           PMHN2
     C                     KFLD           PMHN3
     C                     KFLD           PMHN5
      *
     C                     TIME           WSDT
     C*
     C           *ENTRY    PLIST
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           @MHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @FLG    1
      *
     C                     MOVE PTOKU     @TOKU   40
     C                     MOVE PNONY     @NONY   40
     C                     MOVEL@MHIN     PMHIN
TCHK2C                     MOVEL*BLANK    @SHIN
     C                     MOVEL@SHIN     PSHIN
     C                     MOVEL*BLANK    @FLG
     C*
     C                     MOVELPMHN1     IMHN1   5
     C                     MOVELPMHN2     IMHN2   5
     C                     Z-ADD@TOKU     ITOKU   40
     C                     Z-ADD@NONY     INONY   40
     C           KEY       SETLLFAAPL061
     C                     DO   *HIVAL
     C           KEY       READEFAAPL061                 10
     C   10                LEAVE
     C           B7SKBN    IFNE *BLANK
     C                     ITER
     C                     END
     C                     LEAVE
     C                     ENDDO
     C  N10                GOTO STP1
     C*
     C                     Z-ADD0111      ITOKU
     C                     Z-ADD0111      INONY
     C           KEY       SETLLFAAPL061
     C                     DO   *HIVAL
     C           KEY       READEFAAPL061                 10
     C   10                LEAVE
     C           B7SKBN    IFNE *BLANK
     C                     ITER
     C                     END
     C                     LEAVE
     C                     ENDDO
     C  N10                GOTO STP1
      *
     C                     GOTO STP2
      *
     C           STP1      TAG
      *
     C           1         DO   2         B       10
      *
     C                     Z-ADD@TOKU     JTOKU   40
     C                     Z-ADD@NONY     JNONY   40
     C                     MOVELPNKOJ     JNKOJ   1
     C                     MOVELPNUKE     JNUKE   4
     C                     MOVELPMHN1     JMHN1   5
     C                     MOVELPMHN2     JMHN2   5
     C                     MOVE *BLANK    JMHN3   5
     C                     MOVE *BLANK    JMHN4   5
      *
     C           B         IFEQ 1
     C                     MOVELPMHN3     JMHN3
     C                     MOVELPMHN5     JMHN4
     C                     END
      *
     C* TOYOTA
     C           @NONY     IFEQ 0541
     C           @NONY     OREQ 0542
     C           @NONY     OREQ 3764
     C           @NONY     OREQ 3765
     C           @NONY     OREQ 3481
     C           @NONY     OREQ 3482
     C           @NONY     OREQ 3503
     C           @NONY     OREQ 3504
     C           @NONY     OREQ 3804
     C           @NONY     OREQ 3805
     C           @NONY     OREQ 3347
     C           @NONY     OREQ 3348
     C           @NONY     OREQ 3220
     C           @NONY     OREQ 3421
     C           @NONY     OREQ 3851
     C           @NONY     OREQ 3852
     C           @NONY     OREQ 3931
     C           @NONY     OREQ 3932
     C           @NONY     OREQ 0323                       NAPCK
TCHK4C           @NONY     OREQ 3428
TCHK4C           @NONY     OREQ 3429
TCHK4C           @NONY     OREQ 3411
     C           B         IFEQ 1
     C           PMHN3     IFEQ *BLANK
     C                     MOVEL'00   '   JMHN3
     C                     END
     C                     END
     C                     END
      *
     C                     SETOF                     10
     C           KEY1      CHAINFAAPL021             10
     C           *IN10     IFEQ '0'
     C           B7SKBN    CABNE'D'       STP3
     C           B7SKHZ    CABGTWSSDAT    STP3
     C                     ENDIF
      *
     C                     SETOF                     10
     C                     MOVE *BLANK    JNKOJ
     C           KEY1      CHAINFAAPL021             10
     C           *IN10     IFEQ '0'
     C           B7SKBN    CABNE'D'       STP3
     C           B7SKHZ    CABGTWSSDAT    STP3
     C                     END
      *
     C                     SETOF                     10
     C                     MOVELPNKOJ     JNKOJ
     C                     MOVEL*BLANK    JNUKE
     C           KEY1      CHAINFAAPL021             10
     C           *IN10     IFEQ '0'
     C           B7SKBN    CABNE'D'       STP3
     C           B7SKHZ    CABGTWSSDAT    STP3
     C                     END
      *
     C                     SETOF                     10
     C                     MOVE *BLANK    JNKOJ
     C           KEY1      CHAINFAAPL021             10
     C           *IN10     IFEQ '0'
     C           B7SKBN    CABNE'D'       STP3
     C           B7SKHZ    CABGTWSSDAT    STP3
     C                     END
      *
     C                     SETOF                     10
     C                     Z-ADD0111      JTOKU
     C                     Z-ADD0111      JNONY
     C           KEY1      CHAINFAAPL021             10
     C           *IN10     IFEQ '0'
     C           B7SKBN    CABNE'D'       STP3
     C           B7SKHZ    CABGTWSSDAT    STP3
     C                     END
     C*
     C                     ENDDO
      * FORD/ANDROID/PISTON
     C           @TOKU     IFEQ 5149
     C           @TOKU     OREQ 2855
     C           @TOKU     OREQ 2856
TCHK3C           @TOKU     OREQ 7448
JW2  C           @TOKU     OREQ 3334
JW2  C           @TOKU     OREQ 4390
JW2  C           @TOKU     OREQ 1111
     C           KEY2      SETLLFAAPL09
     C           *IN10     DOUEQ*ON
     C           KEY2      READEFAAPL09                  10
     C           *IN10     IFEQ *OFF
     C           B7SKBN    ANDEQ*BLANK
     C                     GOTO STP3
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      * HONDA
     C           @TOKU     IFEQ 0294
     C           @TOKU     OREQ 0295
     C           @TOKU     OREQ 0296
     C           @TOKU     OREQ 0390
     C           @TOKU     OREQ 0391
     C           @TOKU     OREQ 5382
     C           @TOKU     OREQ 5379
     C           @TOKU     OREQ 0400
TCHK2C           @TOKU     OREQ 3135
JW1  C           @TOKU     OREQ 1602
     C                     MOVEL*BLANK    PSHIN
     C           K#L05     KLIST
     C                     KFLD           PMHN1
     C                     KFLD           PMHN2
     C                     KFLD           PMHN3
     C                     KFLD           PMHN5
     C                     KFLD           @TOKU
     C                     KFLD           @NONY
     C           K#L05     SETLLFAAPL05
     C                     DO   *HIVAL
     C           K#L05     READEFAAPL05                  10
     C   10                LEAVE
     C           B7SKBN    IFEQ *BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           *IN10     IFEQ *ON
     C           K#L05@    KLIST
     C                     KFLD           PMHN1
     C                     KFLD           PMHN2
     C                     KFLD           PMHN3
     C                     KFLD           PMHN5
     C                     KFLD           @TOKU
     C           K#L05@    SETLLFAAPL05
     C                     DO   *HIVAL
     C           K#L05@    READEFAAPL05                  10
     C   10                LEAVE
     C           B7SKBN    IFEQ *BLANK
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     END
     C  N10                GOTO STP3
     C                     END
     C* NOT FOUND IN COMMON PART MASTER
     C           STP2      TAG
     C                     MOVEL'*'       @FLG
     C                     MOVE PMHN1     PSHN1
     C                     MOVE PMHN2     PSHN2
     C                     MOVE *BLANK    PSHN3
     C           @TOKU     IFEQ 5149
     C           @TOKU     OREQ 2855
     C           @TOKU     OREQ 2856
TCHK3C           @TOKU     OREQ 7448
JW   C           @TOKU     OREQ 5211
     C                     MOVELPMHN3     PSHN3
     C                     ENDIF
     C                     GOTO END
      * FOUND IN COMMON MASTER
     C           STP3      TAG
     C                     MOVE B7SHN1    PSHN1
     C                     MOVE B7SHN2    PSHN2
     C                     MOVE B7SHN3    PSHN3
      *
     C           END       TAG
     C                     MOVELPSHIN     @SHIN
     C*
     C                     MOVE *ON       *INLR
     C                     RETRN
