     H            Y.
     E                    TB      1   1 20
     C                     MOVE '0390'    PTOKU   4
     C                     MOVE '3130'    PNONY   4
     C                     MOVE '0'       PNKOJ   1
     C                     MOVE '00  '    PNUKE   4
     C                     MOVE TB,01     @MHIN  20
     C                     MOVE *BLANK    @SHIN  12
     C                     MOVE *BLANK    @FLG    1
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           @MHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @FLG    1
      *
     C                     SETON                     LR
     C                     RETRN
      *
** TB1
90104T0AA010M1
