     H            Y
     F*** BCER42 *************************************
     F*   所番地＆収容数　変更リスト  PRINT OUTPUT *
     F*  PROGRAM ID.    :  BCER42.      <RPG>        *
     F*  CREATE DATE.   :  APRIL,25,1994             *
     F*  AUTHOR.        :  SHINICHIRO.OHTAKE         *
     F*  USER SECTION.  :  PRODUCTION CONTROL        *
     F************************************* BCER42 ***
     F** ワークファイル
     FHEN2    IP  F     128            DISK
     I****************************************
     F** プリンターファイル
     FBCEPR42 O   E             95     PRINTER
     F********************************************
     IHEN2    AA
     I                                        1   5 HIN1
     I                                        6  10 HIN2
     I                                       11  12 HIN3
     I                                       13  18 KTK
     I                                       19  24 STK
     I                                       35  42 SYSDAT
     I********                               43  48 KIRIBI
     I            DS
     I                                        1  12 HIN
     I                                        1   5 HIN1
     I                                        6  10 HIN2
     I                                        6   6 HIN21
     I                                        7   7 HIN22
     I                                        8   8 HIN23
     I                                        9   9 HIN24
     I                                       10  10 HIN25
     I                                       11  12 HIN3
     I            DS
     I                                        1  14 WHIN
     I                                        1   5 WHIN1
     I                                        6   6 HIFN1
     I                                        7  11 WHIN2
     I                                       12  12 HIFN2
     I                                       13  14 WHIN3
     I            DS
     I                                        1   6 KTK
     I                                        1   1 KTK1
     I                                        2   3 KTK2
     I                                        2   2 KTK21
     I                                        3   3 KTK22
     I                                        4   5 KTK3
     I                                        4   4 KTK31
     I                                        5   5 KTK32
     I                                        6   6 KTK4
     C*
     I            DS
     I                                        1   6 STK
     I                                        1   1 STK1
     I                                        2   3 STK2
     I                                        2   2 STK21
     I                                        3   3 STK22
     I                                        4   5 STK3
     I                                        4   4 STK31
     I                                        5   5 STK32
     I                                        6   6 STK4
     C*
     I            DS
     I                                        1   9 WKTK
     I                                        1   1 WKTK1
     I                                        2   2 WHIF1
     I                                        3   4 WKTK2
     I                                        5   5 WHIF2
     I                                        6   7 WKTK3
     I                                        8   8 WHIF3
     I                                        9   9 WKTK4
     C*
     I            DS
     I                                        1   2 WSTK11
     I                                        1   1 WSTK1
     I                                        2   2 WHIF5
     C*
     I            DS
     I                                        1   7 WSTK22
     I                                        1   2 WSTK2
     I                                        3   3 WHIF6
     I                                        4   5 WSTK3
     I                                        6   6 WHIF7
     I                                        7   7 WSTK4
     C*
     I            DS
     I                                        1   80KIRIBI
     I                                        1   40KIRIYY
     I                                        5   60KIRIMM
     I                                        5   50KIRIM1
     I                                        7   80KIRIDD
     I                                        7   70KIRID1
     C*
     I            DS
     I                                        1   8 TKIRI
     I                                        1   4 TKIRIY
     I                                        3   6 TKIRIM
     I                                        5   5 TKIRM1
     I                                        7   8 TKIRID
     I                                        7   7 TKIRD1
     C*
     I            DS
     I                                        1  10 WKIRI
     I                                        1   4 WKIRIY
     I                                        5   5 WCOM1
     I                                        6   7 WKIRIM
     I                                        8   8 WCOM2
     I                                        9  10 WKIRID
     C*
     I            DS
     I                                        1   8 SYSDAT
     I                                        1   4 SYSYY
     I                                        5   6 SYSMM
     I                                        5   5 SYSM1
     I                                        7   8 SYSDD
     I                                        7   7 SYSD1
     C*
     I            DS
     I                                        1  10 WUDATE
     I                                        1   4 WUDAYY
     I                                        5   5 WCOM3
     I                                        6   7 WUDAYM
     I                                        8   8 WCOM4
     I                                        9  10 WUDAYD
     C*****************************************
     C***     プログラム　スタート        ***
     C*****************************************
     C*
     C                     MOVE SYSYY     KIRIYY  40
     C                     MOVE SYSMM     KIRIMM  20
     C                     MOVE SYSDD     KIRIDD  20
     C*
     C           SYSM1     IFEQ '0'
     C                     MOVE ' '       SYSM1
     C                     END
     C*
     C           SYSD1     IFEQ '0'
     C                     MOVE ' '       SYSD1
     C                     END
     C*
     C           HIN21     IFEQ *BLANK
     C                     MOVE ' '       HIN21
     C                     END
     C           HIN22     IFEQ *BLANK
     C                     MOVE ' '       HIN22
     C                     END
     C           HIN23     IFEQ *BLANK
     C                     MOVE ' '       HIN23
     C                     END
     C           HIN24     IFEQ *BLANK
     C                     MOVE ' '       HIN24
     C                     END
     C           HIN25     IFEQ *BLANK
     C                     MOVE ' '       HIN25
     C                     END
     C                     MOVE '-'       HIFN1
     C           HIN3      IFEQ *BLANK
     C                     MOVE ' '       HIFN2
     C                     ELSE
     C                     MOVE '-'       HIFN2
     C                     END
     C*
     C                     MOVE '-'       WHIF1
     C                     MOVE '-'       WHIF2
     C                     MOVE '-'       WHIF3
     C                     MOVE '-'       WHIF5
     C                     MOVE '-'       WHIF6
     C                     MOVE '-'       WHIF7
     C                     MOVE '.'       WCOM1
     C                     MOVE '.'       WCOM2
     C                     MOVE '.'       WCOM3
     C                     MOVE '.'       WCOM4
     C                     MOVE SYSYY     WUDAYY
     C                     MOVE SYSMM     WUDAYM
     C                     MOVE SYSDD     WUDAYD
     C                     MOVE KTK1      WKTK1
     C                     MOVE KTK2      WKTK2
     C                     MOVE KTK3      WKTK3
     C                     MOVE KTK4      WKTK4
     C                     MOVE STK1      WSTK1
     C                     MOVE STK2      WSTK2
     C                     MOVE STK3      WSTK3
     C                     MOVE STK4      WSTK4
     C                     MOVE HIN1      WHIN1
     C                     MOVE HIN2      WHIN2
     C                     MOVE HIN3      WHIN3
      *
     C           KIRIMM    IFEQ 11
     C                     ADD  1         KIRIYY
     C                     Z-ADD1         KIRIMM
     C                     GOTO SKIP
     C                     END
      *
     C           KIRIMM    IFEQ 12
     C                     ADD  1         KIRIYY
     C                     Z-ADD2         KIRIMM
     C           KIRIDD    IFGT 28
     C                     Z-ADD28        KIRIDD
     C                     END
     C                     GOTO SKIP
     C                     END
     C                     ADD  2         KIRIMM
      *
     C           KIRIMM    IFEQ 4
     C           KIRIMM    OREQ 6
     C           KIRIMM    OREQ 9
     C           KIRIMM    OREQ 11
     C           KIRIDD    IFGT 30
     C                     Z-ADD30        KIRIDD
     C                     END
     C                     END
      *
     C           SKIP      TAG
     C                     MOVE KIRIYY    TKIRIY
     C                     MOVE KIRIMM    TKIRIM
     C                     MOVE KIRIDD    TKIRID
      *
     C           TKIRM1    IFEQ '0'
     C                     MOVE ' '       TKIRM1
     C                     END
     C*
     C           TKIRD1    IFEQ '0'
     C                     MOVE ' '       TKIRD1
     C                     END
     C                     MOVE WUDATE    ODATE
     C                     MOVE TKIRIY    WKIRIY
     C                     MOVE TKIRIM    WKIRIM
     C                     MOVE TKIRID    WKIRID
     C                     MOVE WKIRI     OKIRI
     C                     MOVE WKTK      OKBAN
     C                     MOVE WSTK22    OSBAN
     C                     MOVE WSTK11    OSBAN1
     C                     MOVE WHIN      OHIN
     C*
     C                     WRITEBCEPR421
     CLR                   RETRN
