     H            Y
     F*** BCER41 *************************************
     F*   所番地＆収容数　変更リスト  PRINT OUTPUT *
     F*  PROGRAM ID.    :  BCER41.      <RPG>        *
     F*  CREATE DATE.   :  APRIL,15,1994             *
     F*  AUTHOR.        :  SHINICHIRO.OHTAKE         *
     F*  USER SECTION.  :  PRODUCTION CONTROL        *
     F************************************* BCER41 ***
     F** ワークファイル
     FHEN2    IP  F     128            DISK
     I****************************************
     F** プリンターファイル
     FBCEPR41 O   E             95     PRINTER
     F********************************************
     IHEN2    AA
     I                                        1   5 HIN1
     I                                        6  10 HIN2
     I                                       11  12 HIN3
     I                                       13  18 KTK
     I                                       19  24 STK
     I            DS
     I                                        1  12 HIN
     I                                        1   5 HIN1
     I                                        6  10 HIN2
     I                                        6   6 HIN21
     I                                        7   7 HIN22
     I                                        8   8 HIN23
     I                                        9   9 HIN24
     I                                       10  10 HIN25
     I                                       11  12 HIN3
     I            DS
     I                                        1  14 WHIN
     I                                        1   5 WHIN1
     I                                        6   6 HIFN1
     I                                        7  11 WHIN2
     I                                       12  12 HIFN2
     I                                       13  14 WHIN3
     I            DS
     I                                        1   6 KTK
     I                                        1   1 KTK1
     I                                        2   3 KTK2
     I                                        2   2 KTK21
     I                                        3   3 KTK22
     I                                        4   5 KTK3
     I                                        4   4 KTK31
     I                                        5   5 KTK32
     I                                        6   6 KTK4
     C*
     I            DS
     I                                        1   6 STK
     I                                        1   1 STK1
     I                                        2   3 STK2
     I                                        2   2 STK21
     I                                        3   3 STK22
     I                                        4   5 STK3
     I                                        4   4 STK31
     I                                        5   5 STK32
     I                                        6   6 STK4
     C*
     I            DS
     I                                        1   2 WKTK11
     I                                        1   1 WKTK1
     I                                        2   2 WHIF1
     C*
     I            DS
     I                                        1   7 WKTK22
     I                                        1   2 WKTK2
     I                                        3   3 WHIF2
     I                                        4   5 WKTK3
     I                                        6   6 WHIF3
     I                                        7   7 WKTK4
     C*
     I            DS
     I                                        1   2 WSTK11
     I                                        1   1 WSTK1
     I                                        2   2 WHIF5
     C*
     I            DS
     I                                        1   7 WSTK22
     I                                        1   2 WSTK2
     I                                        3   3 WHIF6
     I                                        4   5 WSTK3
     I                                        6   6 WHIF7
     I                                        7   7 WSTK4
     C*****************************************
     C***     プログラム　スタート        ***
     C*****************************************
     C*
     C           HIN21     IFEQ *BLANK
     C                     MOVE ' '       HIN21
     C                     END
     C           HIN22     IFEQ *BLANK
     C                     MOVE ' '       HIN22
     C                     END
     C           HIN23     IFEQ *BLANK
     C                     MOVE ' '       HIN23
     C                     END
     C           HIN24     IFEQ *BLANK
     C                     MOVE ' '       HIN24
     C                     END
     C           HIN25     IFEQ *BLANK
     C                     MOVE ' '       HIN25
     C                     END
     C                     MOVE '-'       HIFN1
     C           HIN3      IFEQ *BLANK
     C                     MOVE ' '       HIFN2
     C                     ELSE
     C                     MOVE '-'       HIFN2
     C                     END
     C                     MOVE '-'       WHIF1
     C                     MOVE '-'       WHIF2
     C                     MOVE '-'       WHIF3
     C                     MOVE '-'       WHIF5
     C                     MOVE '-'       WHIF6
     C                     MOVE '-'       WHIF7
     C                     MOVE KTK1      WKTK1
     C                     MOVE KTK2      WKTK2
     C                     MOVE KTK3      WKTK3
     C                     MOVE KTK4      WKTK4
     C                     MOVE STK1      WSTK1
     C                     MOVE STK2      WSTK2
     C                     MOVE STK3      WSTK3
     C                     MOVE STK4      WSTK4
     C                     MOVE HIN1      WHIN1
     C                     MOVE HIN2      WHIN2
     C                     MOVE HIN3      WHIN3
     C                     MOVE WKTK22    OKBAN
     C                     MOVE WKTK11    OKBAN1
     C                     MOVE WSTK22    OSBAN
     C                     MOVE WSTK11    OSBAN1
     C                     MOVE WHIN      OHIN
     C*
     C           *IN50     IFEQ '0'
     C                     WRITEBCEPR411
     C                     SETON                     1050
     C                     WRITEBCEPR412
     C                     GOTO STEP
     C                     END
     C           *IN95     IFEQ '1'
     C                     SETON                     10
     C                     WRITEBCEPR411
     C                     SETOF                     95
     C                     END
     C                     WRITEBCEPR412
     C           STEP      TAG
     CLR                   RETRN
