     H            Y.
     F** BSCR56 *********************************************
     F* FINAL STORAGE IN HISTORY                            *
     F*     TRANCOM ITS.           2014.09.22               *
     F*******************************************************
     FBSCPP25 IF  E                    DISK
     FBSCWP55 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60WTIME
     I                                        7  140WDATE
      *
     I            DS
     I                                        1   6 B3TBN
     I                                        1   1 B3TBN1
     I                                        2   3 B3TBN2
     I                                        4   5 B3TBN3
     I                                        6   6 B3TBN4
      *
     I            DS
     I                                        1   6 WKMTK
     I                                        1   1 WKMTK1
     I                                        2   3 WKMTK2
     I                                        4   5 WKMTK3
     I                                        6   6 WKMTK4
      *
     I            DS
     I                                        1   6 WKMT2
     I                                        1   1 WKMT21
     I                                        2   3 WKMT22
     I                                        4   5 WKMT23
     I                                        6   6 WKMT24
      *
     C           *ENTRY    PLIST
     C                     PARM           P1MTK1  1
     C                     PARM           P1MTK2  2
     C                     PARM           P1MTK3  2
     C                     PARM           P1MTK4  1
     C                     PARM           P1MT21  1
     C                     PARM           P1MT22  2
     C                     PARM           P1MT23  2
     C                     PARM           P1MT24  1
     C                     PARM           P1COH1  8
     C                     PARM           P1COH2  8
     C                     PARM           P1COUS 10
     C                     PARM           P1HNTE  1
     C                     PARM           PCMD    2
      *
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
     C                     TIME           SDATE
     C                     Z-ADD0         WKSEQ   80
     C                     MOVELP1MTK1    WKMTK1
     C                     MOVELP1MTK2    WKMTK2
     C                     MOVELP1MTK3    WKMTK3
     C                     MOVELP1MTK4    WKMTK4
     C                     MOVELP1MT21    WKMT21
     C                     MOVELP1MT22    WKMT22
     C                     MOVELP1MT23    WKMT23
     C                     MOVELP1MT24    WKMT24
     C           WKMT21    IFEQ *BLANK
     C                     MOVEL*HIVAL    WKMT21
     C                     ENDIF
     C           WKMT22    IFEQ *BLANK
     C                     MOVEL*HIVAL    WKMT22
     C                     ENDIF
     C           WKMT23    IFEQ *BLANK
     C                     MOVEL*HIVAL    WKMT23
     C                     ENDIF
     C           WKMT24    IFEQ *BLANK
     C                     MOVEL*HIVAL    WKMT24
     C                     ENDIF
     C                     MOVELP1COH1    WKCOH1  80
     C                     MOVELP1COH2    WKCOH2  80
     C           WKCOH2    IFEQ 0
     C                     Z-ADD99999999  WKCOH2
     C                     ENDIF
      *
     C           1         SETLLBSCPP251
     C                     READ BSCPP251                 80
     C           *IN80     DOWEQ'0'
     C                     MOVEL'0'       GET     1
     C           B3SKJY    IFEQ 'D'
     C           B3SKDT    ANDLE*DATE
     C                     ELSE
     C                     EXSR #SB400
     C                     ENDIF
     C           GET       IFEQ '1'
     C                     EXSR #SB500
     C                     ENDIF
     C                     READ BSCPP251                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C           B3TBN     IFLT WKMTK
     C                     GOTO ESB400
     C                     ENDIF
      *
     C           B3TBN     IFGT WKMT2
     C                     GOTO ESB400
     C                     ENDIF
      *
     C           B3CODT    IFLT WKCOH1
     C                     GOTO ESB400
     C                     ENDIF
      *
     C           B3CODT    IFGT WKCOH2
     C                     GOTO ESB400
     C                     ENDIF
      *
     C           P1COUS    IFEQ *BLANK
     C                     ELSE
     C           B3WOKR    IFNE P1COUS
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C                     SELEC
     C           P1HNTE    WHEQ ' '
     C           P1HNTE    WHEQ '1'
     C           B3OKNG    IFNE 'OK'
     C                     GOTO ESB400
     C                     ENDIF
     C           P1HNTE    WHEQ '2'
     C           B3OKNG    IFNE 'NG'
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDSL
      *
     C                     MOVEL'1'       GET
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      * OUTPUT                                             *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARBSCWP551
     C                     MOVELB3WOKR    W5WOKR
     C                     Z-ADDB3CODT    W5CODT
     C                     Z-ADDB3COTM    W5COTM
     C                     MOVELB3LBAR    W5LBAR
     C                     MOVELB3LZET    W5LZET
     C                     MOVELB3LHN1    W5LHN1
     C                     MOVELB3LHN2    W5LHN2
     C                     MOVELB3LHN3    W5LHN3
     C                     MOVELB3TBN1    W5TBN1
     C                     MOVELB3TBN2    W5TBN2
     C                     MOVELB3TBN3    W5TBN3
     C                     MOVELB3TBN4    W5TBN4
     C                     MOVELB3ABAR    W5ABAR
     C                     MOVELB3AHN1    W5AHN1
     C                     MOVELB3AHN2    W5AHN2
     C                     MOVELB3AHN3    W5AHN3
     C                     MOVELB3AZET    W5AZET
     C                     MOVELB3TEHA    W5TEHA
     C                     MOVELB3PAGE    W5PAGE
     C                     MOVELB3ABN1    W5ABN1
     C                     MOVELB3ABN2    W5ABN2
     C                     MOVELB3ABN3    W5ABN3
     C                     MOVELB3ABN4    W5ABN4
     C                     MOVELB3OKNG    W5OKNG
     C                     WRITEBSCWP551
      *
     CSR         ESB500    ENDSR
