     H            Y.
      ** BTAR12 ****************************************
      *A-PICS PLAN PUBLICATION MANAGEMENT M/F LIST<RPG>*
      *                          K.YASUDA   94.06.15   *
      **************************************** BTAR12 **
     FBTAPL11 IP  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TLS     1   1 48               ﾒﾇnxb
     I            DS
     I                                        1  14 HINBAN
     I                                        1   5 BUHIN1
     I                                        6   6 HINA
     I                                        7  11 BUHIN2
     I                                       12  12 HINB
     I                                       13  14 BUHIN3
     I*
     I            DS
     I                                        1  10 YYYYYY
     I                                        1   40BUSTYY
     I                                        5   5 Y1
     I                                        6   70BUSTMM
     I                                        8   8 Y2
     I                                        9  100BUSTDD
     I*
     I            DS
     I                                        1  10 ZZZZZZ
     I                                        1   40BUENYY
     I                                        5   5 Z1
     I                                        6   70BUENMM
     I                                        8   8 Z2
     I                                        9  100BUENDD
     I*
     I            DS
     I                                        1   80BUSKHZ
     I                                        1   40BUSKYY
     I                                        5   60BUSKMM
     I                                        7   80BUSKDD
     I*
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     C           KEY1      KLIST
     C                     KFLD           BUTOKU
     C                     KFLD           BUNONY
     C                     KFLD           BUNKOJ
     C                     KFLD           BUNUKE
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
      *
     C                     SETOF                     0102
     C                     TIME           WTIME   60
      *
     C           *IN03     IFEQ '0'
     C                     SETON                     0203
      *
     C                     MOVE *BLANK    PUSNM  15
     C                     CALL 'APLR00'
     C                     PARM           PUS
     C                     PARM           PUSNM
     C                     MOVELPUSNM     WUSNM   9
      *
     C                     END
      *
     C           BUSKJY    IFEQ 'D'
     C           BUSKHZ    ANDLE*DATE
     C                     GOTO STEP99
     C                     END
      *
     C                     MOVEL'-'       HINA
     C                     MOVEL'-'       HINB
     C                     MOVEL'.'       Y1
     C                     MOVEL'.'       Y2
     C                     MOVEL'.'       Z1
     C                     MOVEL'.'       Z2
      *
     C                     SETOF                     10
     C                     MOVEL*BLANK    AAAAAA 16
     C           BUTOKU    CHAINFGBPL011             10
     C           *IN10     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVELB2SMEI    AAAAAA
     C                     END
      *
     C                     SETOF                     11
     C                     MOVEL*BLANK    BBBBBB 16
     C           BUNONY    CHAINFGBPL011             11
     C           *IN11     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     11
     C                     END
     C           *IN11     IFEQ '0'
     C                     MOVELB2SMEI    BBBBBB
     C                     END
      *
     C                     SETOF                     12
     C                     MOVE *BLANK    CCCCCC 24
     C           KEY1      CHAINGADPL111             12
     C           *IN12     IFEQ '0'
     C           B5SKJY    ANDEQ'D'
     C           B5SKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     END
     C           *IN12     IFEQ '0'
     C                     MOVELB5KMEI    CCCCCC
     C                     END
      *
     C                     SETON                     01
      *
     C           STEP99    TAG
      *
     OQPRINT  H  102   02
     O       OR        OF
     O                                  131 '+-------------------+'
     O        H  1     02
     O       OR        OF
     O                                  131 '|         |         |'
     O        H  1     02
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '|         |         |'
     O                         WUSNM    130
     O        H  2     02
     O       OR        OF
     O                                   12 'BTAR12-1 '
     O                         TLS,1     81
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        H  2     02
     O       OR        OF
     O                                   18 ' INT CO. P/N    '
     O                                   34 ' CUSTOMER   '
     O                                   62 ' RECEIVING CO.'
     O                                   80 ' FACTORY'
     O                                  110 'RECEIVING'
     O                                  131 'START DATE EXIT DATE'
     O        D  1     01
     O                         HINBAN    17
     O                         BUTOKU    27
     O                                   29 '-'
     O                         AAAAAA    45
     O                         BUNONY    53
     O                                   55 '-'
     O                         BBBBBB    71
     O                         BUNKOJ    74
     O                                   76 '-'
     O***                      CCCCCC   100
     O                         BUNUKE   108
     O                         YYYYYY   121
     O                         ZZZZZZ   132
      *
**  TLS
* A-PICS PLAN PUBLICATION MANAGEMENT M/F LIST *
