     H            Y.
     F*** BTAR06 ************************************************
     F* PT PLAN PUBLICATION SYSTEM OF ADMINISTRATION FOR KANBAN *
     F*                                                         *
     F*          I-HASADA   2000.07.24                          *
     F*          N-HYOTO    2001.06.14                          *
     F*          H-AMANO    2002.03.29                          *
     F*              PROTECT FIELDS EXCPT WEDNESDAY
     F*          HAYA       2004.02.02   %001                   *
     F*          H.AMANO    2004.03.25                          *
     F*               ACCM QTY = FROM AAPPP01
     F***********************************************************
     FBTAPW06 CF  E                    WORKSTN
     FFCEPL01 IF  E           K        DISK
     FAKCPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FAAPTL01 IF  E           K        DISK
     FBTAPL05 IF  E           K        DISK
     E                    ER      1  10 60
     E                    #PH        31  3 0             +箱数BTAPL05
     E                    #MH        31  3 0             -箱数BTAPL05
     E                    #ZM        31  1               割振BTAPL05
     E                    @HOL       31  4               休日
     E                    WDY        31  1 0             DAY OF THE WEEK
     E                    EXC        31  1               DAY OF THE WEEK
     IS#KBFR      DS
     I                                        1   1 X2F
     I                                        2   2 KBFR
     I*BTAPL05(マイナス分箱数)
     I            DS
     I                                        1  93 #PH
     I                                        1   30BTPH01
     I                                        4   60BTPH02
     I                                        7   90BTPH03
     I                                       10  120BTPH04
     I                                       13  150BTPH05
     I                                       16  180BTPH06
     I                                       19  210BTPH07
     I                                       22  240BTPH08
     I                                       25  270BTPH09
     I                                       28  300BTPH10
     I                                       31  330BTPH11
     I                                       34  360BTPH12
     I                                       37  390BTPH13
     I                                       40  420BTPH14
     I                                       43  450BTPH15
     I                                       46  480BTPH16
     I                                       49  510BTPH17
     I                                       52  540BTPH18
     I                                       55  570BTPH19
     I                                       58  600BTPH20
     I                                       61  630BTPH21
     I                                       64  660BTPH22
     I                                       67  690BTPH23
     I                                       70  720BTPH24
     I                                       73  750BTPH25
     I                                       76  780BTPH26
     I                                       79  810BTPH27
     I                                       82  840BTPH28
     I                                       85  870BTPH29
     I                                       88  900BTPH30
     I                                       91  930BTPH31
     I            DS
     I                                        1  93 #MH
     I                                        1   30BTMH01
     I                                        4   60BTMH02
     I                                        7   90BTMH03
     I                                       10  120BTMH04
     I                                       13  150BTMH05
     I                                       16  180BTMH06
     I                                       19  210BTMH07
     I                                       22  240BTMH08
     I                                       25  270BTMH09
     I                                       28  300BTMH10
     I                                       31  330BTMH11
     I                                       34  360BTMH12
     I                                       37  390BTMH13
     I                                       40  420BTMH14
     I                                       43  450BTMH15
     I                                       46  480BTMH16
     I                                       49  510BTMH17
     I                                       52  540BTMH18
     I                                       55  570BTMH19
     I                                       58  600BTMH20
     I                                       61  630BTMH21
     I                                       64  660BTMH22
     I                                       67  690BTMH23
     I                                       70  720BTMH24
     I                                       73  750BTMH25
     I                                       76  780BTMH26
     I                                       79  810BTMH27
     I                                       82  840BTMH28
     I                                       85  870BTMH29
     I                                       88  900BTMH30
     I                                       91  930BTMH31
     I*BTAPL05(割振済区分)
     I            DS
     I                                        1  31 #ZM
     I                                        1   1 BTZM01
     I                                        2   2 BTZM02
     I                                        3   3 BTZM03
     I                                        4   4 BTZM04
     I                                        5   5 BTZM05
     I                                        6   6 BTZM06
     I                                        7   7 BTZM07
     I                                        8   8 BTZM08
     I                                        9   9 BTZM09
     I                                       10  10 BTZM10
     I                                       11  11 BTZM11
     I                                       12  12 BTZM12
     I                                       13  13 BTZM13
     I                                       14  14 BTZM14
     I                                       15  15 BTZM15
     I                                       16  16 BTZM16
     I                                       17  17 BTZM17
     I                                       18  18 BTZM18
     I                                       19  19 BTZM19
     I                                       20  20 BTZM20
     I                                       21  21 BTZM21
     I                                       22  22 BTZM22
     I                                       23  23 BTZM23
     I                                       24  24 BTZM24
     I                                       25  25 BTZM25
     I                                       26  26 BTZM26
     I                                       27  27 BTZM27
     I                                       28  28 BTZM28
     I                                       29  29 BTZM29
     I                                       30  30 BTZM30
     I                                       31  31 BTZM31
     I            DS
     I                                        1 124 @HOL
     I                                        1   4 @HOL1
     I                                        5   8 @HOL2
     I                                        9  12 @HOL3
     I                                       13  16 @HOL4
     I                                       17  20 @HOL5
     I                                       21  24 @HOL6
     I                                       25  28 @HOL7
     I                                       29  32 @HOL8
     I                                       33  36 @HOL9
     I                                       37  40 @HOL10
     I                                       41  44 @HOL11
     I                                       45  48 @HOL12
     I                                       49  52 @HOL13
     I                                       53  56 @HOL14
     I                                       57  60 @HOL15
     I                                       61  64 @HOL16
     I                                       65  68 @HOL17
     I                                       69  72 @HOL18
     I                                       73  76 @HOL19
     I                                       77  80 @HOL20
     I                                       81  84 @HOL21
     I                                       85  88 @HOL22
     I                                       89  92 @HOL23
     I                                       93  96 @HOL24
     I                                       97 100 @HOL25
     I                                      101 104 @HOL26
     I                                      105 108 @HOL27
     I                                      109 112 @HOL28
     I                                      113 116 @HOL29
     I                                      117 120 @HOL30
     I                                      121 124 @HOL31
     I*
     I            DS
     I                                        1   4 WHOL
     I                                        1   1 WHH1
     I                                        2   2 WHH2
     I                                        2   3 WHH23
     I                                        4   4 WHH4
     I            DS
     I                                        1  14 @HIN
     I                                        1   5 @HIN1
     I                                        6   6 WH1
     I                                        7  11 @HIN2
     I                                       12  12 WH2
     I                                       13  14 @HIN3
     I            DS
     I                                        1   60WTIME
     I                                        1   20JI
     I                                        3   40FU
     I            DS
     I                                        1   80BTSKHZ
     I                                        1   40BTSKYY
     I                                        5   60BTSKMM
     I                                        7   80BTSKDD
     I            DS
     I                                        1   80BTKOHZ
     I                                        1   40BTKOYY
     I                                        5   60BTKOMM
     I                                        7   80BTKODD
     I            DS
     I                                        1  12 BTSHIN
     I                                        1   5 BTSHN1
     I                                        6  10 BTSHN2
     I                                       11  12 BTSHN3
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   40@KYY
     I                                        3   40@KYYX
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   80M1SYHZ
     I                                        1   40M1SYYY
     I                                        5   60M1SYMM
     I                                        7   80M1SYDD
     I            DS
     I                                        1   80F8YMD
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
      *
     C           KEY1      KLIST
     C                     KFLD           @HIN1
     C                     KFLD           @HIN2
     C                     KFLD           @HIN3
      *
     C           KEY2      KLIST
     C                     KFLD           @HIN1
     C                     KFLD           @HIN2
     C                     KFLD           @HIN3
     C                     KFLD           WKYM
      *
     C           KEY3      KLIST
     C                     KFLD           @KYY
     C                     KFLD           @KMM
      *
     C*----------------------------------------------------*
     C*                   １画面                         *
     C*----------------------------------------------------*
      *
     C           STP1      TAG
     C                     MOVE *BLANK    @KYY
     C                     MOVE *BLANK    @KMM
     C                     MOVE *BLANK    @HIN
      *
     C           STP2      TAG
     C                     Z-ADD0         #PH
     C                     Z-ADD0         #MH
     C                     MOVE *BLANK    #ZM
     C                     MOVE *BLANK    @HOL
     C                     EXFMTBTAPW061
     C                     SETOF                     010203
     C                     SETOF                     04
     C                     SETOF                     99
      *-------*
      * CMD-1 *
      *-------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *------------*
      *計画予定日*
      *------------*
     C           @KYY      IFLT 1994
     C           @KMM      ORLT 1
     C           @KMM      ORGT 12
     C                     SETON                     0299
     C                     MOVELER,2      MSG
     C                     GOTO STP2
     C                     END
      *
     C                     MOVEL@KYY      WKYM    60
     C                     MOVE @KMM      WKYM
     C                     MOVEL*YEAR     WUKYM   60
     C                     MOVE UMONTH    WUKYM
      *------*
      *品番*
      *------*
     C           @HIN1     IFEQ *BLANK
     C           @HIN2     ANDEQ*BLANK
     C           @HIN3     ANDEQ*BLANK
     C                     SETON                     0399
     C                     MOVELER,4      MSG
     C                     GOTO STP2
     C                     END
      *-------------------------------*
      *平準化ファイルにあればエラー *
      *-------------------------------*
     C           KEY1      CHAINAGAPL311             90
     C           *IN90     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C                     SETON                     90
     C                     END
     C           *IN90     IFEQ '0'
     C                     SETON                     0399
     C                     MOVELER,10     MSG
     C                     GOTO STP2
     C                     END
      *----------------------------*
      *部品マスター／品番チェック*
      *----------------------------*
     C                     Z-ADD0         WSYOS   60
      *
     C                     SETOF                     03
     C           KEY1      CHAINFCEPL011             03
     C           *IN03     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     03
     C                     END
     C           *IN03     IFEQ '0'
      *収容数
     C           A2SYHZ    IFGT *DATE
     C                     Z-ADDA2KSYS    WSYOS
     C                     ELSE
     C                     Z-ADDA2SSYS    WSYOS
     C                     END
     C                     ELSE
      *
     C                     SETOF                     03
     C           KEY1      CHAINAKCPL011             03
     C           *IN03     IFEQ '0'
     C           M1SKJY    ANDEQ'D'
     C           M1SKHZ    ANDLE*DATE
     C                     SETON                     03
     C                     END
      *
     C           *IN03     IFEQ '0'
      *収容数
     C           M1SYHZ    IFGT *DATE
     C                     Z-ADDM1KSYS    WSYOS
     C                     ELSE
     C                     Z-ADDM1SSYS    WSYOS
     C                     END
     C                     ELSE
      *
     C                     SETON                     99
     C                     MOVELER,5      MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           KEY1      SETLLAAPTL01
     C           *IN90     DOUEQ*ON
     C           KEY1      READEAAPTL01                  90
     C           *IN90     IFEQ *OFF
     C           L5SKJY    ANDEQ*BLANK
     C           L5STHZ    ANDEQ99999999
     C                     Z-ADDL5SYOS    WSYOS
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *----------------------------------*
      *ＰＴ計画発行受注ファイル*
      *----------------------------------*
     C                     SETOF                     98
     C           KEY2      CHAINBTAPL051             98
      *
     C           *IN98     IFEQ '1'
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVELER,6      MSG
     C                     GOTO STP2
     C                     END
      *
     C           BTSKJY    IFEQ 'D'
     C           BTSKHZ    ANDLE*DATE
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVELER,7      MSG
     C                     GOTO STP2
     C                     END
      *
      *計画予定日
     C                     MOVE '  .  '   @KYM
     C                     MOVEL@KYYX     @KYM
     C                     MOVE @KMM      @KYM
      *品番
     C                     MOVE '-'       WH1
     C                     MOVE '-'       WH2
     C           @HIN3     IFEQ *BLANK
     C                     MOVE *BLANK    WH2
     C                     END
      *収容数
     C                     Z-ADDWSYOS     @SYUSU
     C*青山カレンダーチェック
     C                     EXSR $HOLI
      *
     C*----------------------------------------------------*
     C*                   ２画面                         *
     C*----------------------------------------------------*
     C*画面罫線
     C                     BITOF'01234567'X00     1
     C                     MOVE X00       X2F     1
     C                     BITON'24567'   X2F
     C                     MOVE 'F'       KBFR
      *
     C                     WRITEBTAPW064
     C                     WRITEBTAPW063
      *
     C           STP4      TAG
     C                     EXFMTBTAPW062
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     070809
     C                     SETOF                     101112
     C                     SETOF                     131415
     C                     SETOF                     161718
     C                     SETOF                     192021
     C                     SETOF                     222324
     C                     SETOF                     252627
     C                     SETOF                     282930
     C                     SETOF                     3199
      *
     C           *INKC     IFEQ '1'
     C                     GOTO STP1
     C                     END
      *
     C                     GOTO STP4
     C*****************************************************************
     C*         青山カレンダーチェック
     C*****************************************************************
     C           $HOLI     BEGSR                                      $
      *
     C*休日'*XX*'
     C                     MOVEA'00000000'*IN,41
     C                     MOVEA'00000000'*IN,49
     C                     MOVEA'00000000'*IN,57
     C                     MOVEA'0000000' *IN,65
     C                     MOVE *BLANK    @HOL
     C                     Z-ADD*ZERO     WDY
     C                     MOVE *BLANK    EXC
      *
     C                     Z-ADD0         N       20
     C                     Z-ADD1         A       20
     C           KEY3      SETLLAGDPL121
     C           1         DO   31        A
     C                     SETOF                     80
     C           KEY3      READEAGDPL121                 80
     C           *IN80     IFEQ '0'
     C                     Z-ADDF8YOBI    WDY,A
     C           F8YMD     IFEQ 20031223
     C                     MOVE '1'       EXC,A
     C                     ENDIF
      *
     C                     MOVE *BLANK    WHOL
     C                     MOVELA         WHH23
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     MOVE '*'       WHH1
     C                     MOVE '*'       WHH4
     C                     END
     C           WHH2      IFEQ '0'
     C                     MOVE *BLANK    WHH2
     C                     END
     C                     MOVE WHOL      @HOL,A
     C                     END
     C                     END
      *
     C* 今日以前は入力禁止
     C                     Z-ADD1         A
     C                     Z-ADD0         N
     C           1         DO   31        A
     C           A         ADD  40        N
      *
 %001C***        WDY,A     IFNE 3
     C***        EXC,A     ANDEQ*BLANK
     C***                  MOVE '1'       *IN,N
 %001C***                  ENDIF
      *
     C           WKYM      IFEQ WUKYM
     C           A         IFLE UDAY
     C                     MOVE '1'       *IN,N
     C                     END
     C                     END
      *
     C                     MOVE @HOL,A    WHOL
     C           WHH1      IFEQ '*'
     C                     MOVE '1'       *IN,N
     C                     END
     C           WHH23     IFEQ *BLANK
     C                     MOVE '1'       *IN,N
     C                     END
     C                     END
      *
     C           WKYM      IFLT WUKYM
     C                     Z-ADD1         A
     C                     Z-ADD0         N
     C           1         DO   31        A
     C           A         ADD  40        N
     C                     MOVE '1'       *IN,N
     C                     END
     C                     END
      *
     C                     ENDSR
      *
      *
**  ERR-MSG
E-01
E-02 PLAN PUBLICATION DATE IS LOGICAL ERROR
E-03
E-04 INPUT PART NO
E-05 THERE IS NOT PART NO INPUT INTO IN PART INFORMATION M/F
E-06 THERE ISN'T IT IN PT PLAN PUBLIC MANAGEMENT M/F
E-07 IT IS CANCELLED ALREADY
E-08 THERE IS DATA
E-09
E-10 THIS PART IS NOT ASJ PART
