     H            Y.
     F** BTAR31 *******************************
     F* APICS PRODUCTION SCHEDULE CHANGE      *
     F*                                       *
     F******************************* BTAR30 **
     FBTAPW31 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                        RRN2  KSFILE SFL02
     F                                              KINFDS @INFDS
     FBTAWP31 UF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FBTAPL04 UF  E           K        DISK                      A
     FBTAWP32 O   E           K        DISK                      A
     FQPRINT  O   F     132     OF     PRINTER
      *------------------------------------------------------------
     E                    CMD     1   4 78
     E                    HDR     1   1 12
     E                    TTL     1   1 40
     E                    ER      1   5 78
     E                    STL     1   1 15
      *------------------------------------------------------------
     E                    DAT         5  8 0
     E                    NW          5  3 0
     E                    QT          5  3 0
     E                    D@D         5  4 0
     E                    #PH        31  3 0             +BTAPL05
     E                    #MH        31  3 0             -BTAPL05
     E                    PRT       100 12
     E                    HZM        31  1                COMPLETE
     E                    LOC        50  6
     E                    WQT         5  5 0
     E                    WDT         5  8 0
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I            DS
     I                                        1  20 D@D
     I                                        1   40D@DAT1
     I                                        5   80D@DAT2
     I                                        9  120D@DAT3
     I                                       13  160D@DAT4
     I                                       17  200D@DAT5
     I            DS
     I                                        1  15 NW
     I                                        1   30S@NW1
     I                                        4   60S@NW2
     I                                        7   90S@NW3
     I                                       10  120S@NW4
     I                                       13  150S@NW5
     I            DS
     I                                        1  15 QT
     I                                        1   30S@QT1
     I                                        4   60S@QT2
     I                                        7   90S@QT3
     I                                       10  120S@QT4
     I                                       13  150S@QT5
     I            DS
     I                                        1  93 #PH
     I                                        1   30BTPH01
     I                                        4   60BTPH02
     I                                        7   90BTPH03
     I                                       10  120BTPH04
     I                                       13  150BTPH05
     I                                       16  180BTPH06
     I                                       19  210BTPH07
     I                                       22  240BTPH08
     I                                       25  270BTPH09
     I                                       28  300BTPH10
     I                                       31  330BTPH11
     I                                       34  360BTPH12
     I                                       37  390BTPH13
     I                                       40  420BTPH14
     I                                       43  450BTPH15
     I                                       46  480BTPH16
     I                                       49  510BTPH17
     I                                       52  540BTPH18
     I                                       55  570BTPH19
     I                                       58  600BTPH20
     I                                       61  630BTPH21
     I                                       64  660BTPH22
     I                                       67  690BTPH23
     I                                       70  720BTPH24
     I                                       73  750BTPH25
     I                                       76  780BTPH26
     I                                       79  810BTPH27
     I                                       82  840BTPH28
     I                                       85  870BTPH29
     I                                       88  900BTPH30
     I                                       91  930BTPH31
     I* BTAPL05(MINUS)
     I            DS
     I                                        1  93 #MH
     I                                        1   30BTMH01
     I                                        4   60BTMH02
     I                                        7   90BTMH03
     I                                       10  120BTMH04
     I                                       13  150BTMH05
     I                                       16  180BTMH06
     I                                       19  210BTMH07
     I                                       22  240BTMH08
     I                                       25  270BTMH09
     I                                       28  300BTMH10
     I                                       31  330BTMH11
     I                                       34  360BTMH12
     I                                       37  390BTMH13
     I                                       40  420BTMH14
     I                                       43  450BTMH15
     I                                       46  480BTMH16
     I                                       49  510BTMH17
     I                                       52  540BTMH18
     I                                       55  570BTMH19
     I                                       58  600BTMH20
     I                                       61  630BTMH21
     I                                       64  660BTMH22
     I                                       67  690BTMH23
     I                                       70  720BTMH24
     I                                       73  750BTMH25
     I                                       76  780BTMH26
     I                                       79  810BTMH27
     I                                       82  840BTMH28
     I                                       85  870BTMH29
     I                                       88  900BTMH30
     I                                       91  930BTMH31
     I            DS
     I                                        1  31 HZM
     I                                        1   1 BTZM01
     I                                        2   2 BTZM02
     I                                        3   3 BTZM03
     I                                        4   4 BTZM04
     I                                        5   5 BTZM05
     I                                        6   6 BTZM06
     I                                        7   7 BTZM07
     I                                        8   8 BTZM08
     I                                        9   9 BTZM09
     I                                       10  10 BTZM10
     I                                       11  11 BTZM11
     I                                       12  12 BTZM12
     I                                       13  13 BTZM13
     I                                       14  14 BTZM14
     I                                       15  15 BTZM15
     I                                       16  16 BTZM16
     I                                       17  17 BTZM17
     I                                       18  18 BTZM18
     I                                       19  19 BTZM19
     I                                       20  20 BTZM20
     I                                       21  21 BTZM21
     I                                       22  22 BTZM22
     I                                       23  23 BTZM23
     I                                       24  24 BTZM24
     I                                       25  25 BTZM25
     I                                       26  26 BTZM26
     I                                       27  27 BTZM27
     I                                       28  28 BTZM28
     I                                       29  29 BTZM29
     I                                       30  30 BTZM30
     I                                       31  31 BTZM31
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I                                        1   60K@YM
     I            DS
     I                                        1   80W@YMD
     I                                        1   60W@YM
     I                                        1   40W@YY
     I                                        5   60W@MM
     I                                        7   80W@DD
     I            DS
     I                                        1   80F8YMD
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1  12 A2PRT
     I                                        1   5 A2BHB1
     I                                        6  10 A2BHB2
     I                                       11  12 A2BHB3
     I            DS
     I                                        1  12 S@PRT
     I                                        1   5 S@PRT1
     I                                        6  10 S@PRT2
     I                                       11  12 S@PRT3
     I            DS
     I                                        1   6 S@LOC
     I                                        1   1 S@LOC1
     I                                        2   3 S@LOC2
     I                                        4   5 S@LOC3
     I                                        6   6 S@LOC4
     I            DS
     I                                        1  25 WQT
     I                                        1   50WPQTY1
     I                                        6  100WPQTY2
     I                                       11  150WPQTY3
     I                                       16  200WPQTY4
     I                                       21  250WPQTY5
     I            DS
     I                                        1  40 WDT
     I                                        1   80WPDAT1
     I                                        9  160WPDAT2
     I                                       17  240WPDAT3
     I                                       25  320WPDAT4
     I                                       33  400WPDAT5
     I            DS
     I                                        1  140@TIM
     I                                        1   20@HR
     I                                        3   40@MN
     I                                        1   40@HM
     I                                        5   60@SC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C           W@ID      CASEQ'02'      #SCRN2
     C           W@ID      CASEQ'03'      #SCRN3
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIAL SET
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#AGDX    KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
      *
     C           K#KEY     KLIST
     C                     KFLD           #USER
     C                     KFLD           S@LOC1
     C                     KFLD           S@LOC2
     C                     KFLD           S@LOC3
     C                     KFLD           S@LOC4
      *
     C           K#KEYX    KLIST
     C                     KFLD           #USER
     C                     KFLD           S@LOC1
     C                     KFLD           S@LOC2
      *
     C           K#BTA     KLIST
     C                     KFLD           S@PRT1
     C                     KFLD           S@PRT2
     C                     KFLD           S@PRT3
     C           K#31      KLIST
     C                     KFLD           #USER
     C                     KFLD           H@LOC1
     C                     KFLD           S@LC02
     C                     KFLD           S@LC03
     C                     KFLD           H@LOC4
     C                     KFLD           S@PRT1
     C                     KFLD           S@PRT2
     C                     KFLD           S@PRT3
     C           K#BTAX    KLIST
     C                     KFLD           S@PRT1
     C                     KFLD           S@PRT2
     C                     KFLD           S@PRT3
     C                     KFLD           K@YM
      *
     C                     Z-ADD*DATE     W@YMD
     C                     Z-ADD*ZERO     RRN1    40
     C                     Z-ADD*ZERO     RRN2    40
     C                     Z-ADD*ZERO     D@D
     C                     MOVE '01'      W@ID    2
     C                     MOVE *ALL'-'   LIN   132
      *
     C                     Z-ADD*ZERO     W@DY    30
     C                     Z-ADD*DATE     K@YMD
     C           K#AGDX    SETLLAGDPL12
     C           *IN90     DOUEQ*ON
     C           K#AGDX    READEAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     ADD  1         W@DY
     C                     ENDIF
     C                     ENDDO
      *
     C                     EXSR #SET0
      *
     C                     ENDSR
      *------------------------------------------------------
      *  SET 1ST SCREEN
      *------------------------------------------------------
     C           #SET0     BEGSR
      *
     C                     Z-ADD*ZERO     RRN1
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
      *
     C                     DO   50
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     MOVE '0'       S@LOC1
     C                     MOVE '0'       S@LOC4
     C                     MOVE '**'      S@LOC3
     C                     WRITESFL01
     C                     ENDDO
      *
     C                     Z-ADD1         #RCNO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     Z-ADD@@REC     #RCNO
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     EXSR #SET1
     C           RRN2      IFNE *ZERO
     C                     MOVE '02'      W@ID
     C                     ELSE
     C                     MOVE ER,1      D@MSG
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
     C                     MOVE *BLANK    LOC
     C                     Z-ADD*ZERO     X
      *
      * DATE CHECK
     C                     Z-ADDD@DATE    K@YMD
     C           K#AGD     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C           *IN90     OREQ *OFF
     C           D@DATE    ANDLE*DATE
     C  N99                MOVE ER,3      D@MSG
     C                     SETON                     6299
     C                     ENDIF
      *
     C                     MOVE *OFF      *IN91
     C                     Z-ADD*ZERO     @@RRN   40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C                     MOVE *OFF      *IN63
     C           S@LOC2    IFNE *BLANK
      *
     C           S@LOC1    IFEQ *BLANK
     C  N99                MOVE ER,4      D@MSG
     C                     SETON                     9963
     C                     ENDIF
     C           S@LOC4    IFEQ *BLANK
     C  N99                MOVE ER,4      D@MSG
     C                     SETON                     9963
     C                     ENDIF
     C           S@LOC3    IFEQ *BLANK
     C  N99                MOVE ER,4      D@MSG
     C                     SETON                     9963
     C                     ENDIF
      * DUPLICATE CHECK
     C           S@LOC     LOKUPLOC                      10
     C           *IN10     IFEQ *ON
     C  N99                MOVE ER,5      D@MSG
     C                     SETON                     9963
     C                     ELSE
     C                     ADD  1         X
     C                     MOVE S@LOC     LOC,X
     C                     ENDIF
      *
     C           *IN63     IFEQ *OFF
     C                     MOVE *ON       *IN91
     C                     ENDIF
     C                     ENDIF
      *
     C                     UPDATSFL01
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN91     IFEQ *OFF
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           *IN99     IFEQ *OFF
     C                     MOVE HDR,1     D@TTL
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CLEAR
      *------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    D@MSG
     C                     MOVEA'00000000'*IN,61
      *
     C                     ENDSR
      *------------------------------------------------------
      *  SET DATA FOR 2ND SCREEN
      *------------------------------------------------------
     C           #SET1     BEGSR
      *
     C                     Z-ADD*ZERO     RRN2
     C                     MOVE *ON       *IN54
     C                     WRITECTL02
     C                     MOVE *OFF      *IN54
      * SET CALENDAR
     C                     EXSR #DAT2
      *
     C                     Z-ADD1         #RCNO2
      *
     C                     MOVE *BLANK    PRT
     C                     Z-ADD*ZERO     Z       30
     C                     Z-ADD*ZERO     @@RRN
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@LOC2    ANDNE*BLANK
      *
     C                     MOVE *OFF      *IN34
     C                     Z-ADD*ZERO     D@SAVD
      *
     C                     EXSR #SET12
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  SET DATE
      *------------------------------------------------------
     C           #DAT2     BEGSR
      *
     C                     Z-ADD*ZERO     DAT
     C                     Z-ADD*ZERO     X       30
     C           K#AGD     SETLLAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READ AGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     ADD  1         X
     C                     Z-ADDF8YMD     DAT,X
     C           X         IFEQ 5
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADDDAT       D@D
      *
     C                     ENDSR
      *------------------------------------------------------
      *  ASJ PRODUCT
      *------------------------------------------------------
     C           #SET12    BEGSR
      *
     C           S@LOC3    IFEQ '**'
     C           K#KEYX    SETLLBTAWP31
     C                     ELSE
     C           K#KEY     SETLLBTAWP31
     C                     ENDIF
      *
     C           *IN95     DOUEQ*ON
      *
     C           S@LOC3    IFEQ '**'
     C           K#KEYX    READEBTAWP31             N    95
     C                     ELSE
     C           K#KEY     READEBTAWP31             N    95
     C                     ENDIF
      *
     C           *IN95     IFEQ *OFF
     C           UPID      ANDEQ*BLANK
      *
     C                     CLEARSFL02
     C                     ADD  1         RRN2
     C                     MOVE PART1     S@PRT1
     C                     MOVE PART2     S@PRT2
     C                     MOVE PART3     S@PRT3
      *
     C                     MOVE LOC1      H@LOC1
     C                     MOVE LOC2      S@LC02
     C                     MOVE LOC3      S@LC03
     C                     MOVE LOC4      H@LOC4
      *
     C                     Z-ADD*ZERO     @@B
     C           K#BTA     CHAINFCEPL01              91
     C           W@DY      IFNE *ZERO
     C           A2GEKN    DIV  W@DY      @@QTY   70H
     C           @@QTY     DIV  A2SSYS    S@BDAY    H
     C                     Z-ADDS@BDAY    @@B     50
     C                     MOVE S@BDAY    @@2     2
     C           @@2       IFNE '00'
     C                     ADD  1         @@B
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDAA        H@AA
     C                     Z-ADDBB        H@BB
     C                     Z-ADDCC        H@CC
     C                     Z-ADDDD        H@DD
     C                     Z-ADDEE        H@EE
     C                     Z-ADDFF        H@FF
     C                     Z-ADDGG        H@GG
     C                     Z-ADDHH        H@HH
     C                     Z-ADDJJ        H@JJ
     C                     Z-ADDBB        S@B
     C                     Z-ADDDD        S@D
      * SCHEDULE
     C                     EXSR #BTA2
      *
     C                     EXSR #CALX2
      *
     C                     WRITESFL02
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CALCULATE SCHEDULE QTY
      *------------------------------------------------------
     C           #CALX2    BEGSR
      *
     C           H@AA      ADD  H@FF      W@ANS   72
     C                     SUB  H@JJ      W@ANS
     C                     SUB  S@B       W@ANS
     C                     SUB  S@D       W@ANS
     C                     SUB  H@EE      W@ANS
     C                     SUB  H@GG      W@ANS
     C                     Z-ADDW@ANS     S@ANS
     C           W@ANS     IFGT *ZERO
     C                     MOVE W@ANS     @@2     2
     C           @@2       IFNE '00'
     C                     ADD  1         S@ANS
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDS@ANS     @@BOX   30
     C                     Z-ADD*ZERO     QT
      *
     C           @@BOX     IFLE *ZERO
     C                     Z-ADD@@BOX     QT,1
     C                     ELSE
      *
     C           @AGAIN    TAG
     C           1         DO   5         X
     C                     ADD  1         QT,X
     C                     SUB  1         @@BOX
     C           @@BOX     IFEQ *ZERO
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           @@BOX     CABGT*ZERO     @AGAIN
      *
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CURRENT SCHEDULE
      *------------------------------------------------------
     C           #BTA2     BEGSR
      *
     C           1         DO   5         X
     C                     Z-ADDDAT,X     K@YMD
     C                     Z-ADDK@DD      Z
     C           K#BTAX    CHAINBTAPL04             N93
     C           *IN93     IFEQ *OFF
     C           BTSKJY    ANDEQ*BLANK
     C           #PH,Z     SUB  #MH,Z     NW,X
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  2ND SCREEN
      *------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVE CMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN53
     C                     EXFMTCTL02
     C                     MOVE *OFF      *IN53
      *
     C                     Z-ADD@@REC     #RCNO2
      *
     C                     SELEC
      * END
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
      * GO BACK
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      W@ID
      * DETAIL
     C           *INKJ     WHEQ *ON
     C                     EXSR #CHK2
     C                     EXSR #CUR
      * SAVE
     C           *INKD     WHEQ *ON
     C                     EXSR #CHK2
     C                     EXSR #SAV
     C                     MOVE '01'      W@ID
      * LIST
     C           *INKK     WHEQ *ON
     C                     EXSR #CHK2
     C                     EXSR #SAV
     C                     MOVE *BLANK    @@STL  15
     C                     EXSR #PRT
     C                     MOVE '01'      W@ID
      *
     C                     OTHER
     C                     EXSR #CHK2
      * UPDATE
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD
     C                     MOVELSTL,1     @@STL  15
     C                     EXSR #PRT
     C                     MOVE '01'      W@ID
     C                     MOVE *OFF      *IN34
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CHECK
      *------------------------------------------------------
     C           #CHK2     BEGSR
      *
     C                     EXSR #CLR
      *
     C                     Z-ADD*ZERO     @@RRN   40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL02                90
     C           *IN90     IFEQ *OFF
      *
     C           H@BB      IFNE S@B
     C           H@DD      ORNE S@D
     C                     EXSR #CALX2
      *
     C                     Z-ADDS@B       H@BB
     C                     Z-ADDS@D       H@DD
     C                     ENDIF
      *
     C                     UPDATSFL02
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  DETAIL SCREEN
      *------------------------------------------------------
     C           #CUR      BEGSR
      *
     C           @@LIN     DIV  256       WLINE   50
     C                     MVR            WPOS    50
      *
     C           WLINE     SUB  4         WLINE
     C           WLINE     DIV  2         WLINE
     C           #RCNO2    ADD  WLINE     WREC    40
     C           WREC      CHAINSFL02                90
     C           *IN90     IFEQ *OFF
      *
     C                     Z-ADDH@AA      D@AA
     C                     Z-ADDS@B       D@BB
     C                     Z-ADDS@D       D@DD
     C                     Z-ADDH@EE      D@EE
     C                     Z-ADDH@FF      D@FF
     C                     Z-ADDH@GG      D@GG
     C                     Z-ADDH@JJ      D@JJ
      *
     C                     Z-ADDS@ANS     D@ANS
      *
     C                     MOVE S@PRT1    D@PRT1
     C                     MOVE S@PRT2    D@PRT2
     C                     MOVE S@PRT3    D@PRT3
     C                     MOVE H@LOC1    D@LOC1
     C                     MOVE S@LC02    D@LOC2
     C                     MOVE S@LC03    D@LOC3
     C                     MOVE H@LOC4    D@LOC4
     C                     MOVE '03'      W@ID
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  SAVE
      *------------------------------------------------------
     C           #SAV      BEGSR
      *
     C                     Z-ADD*ZERO     @@RRN
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL02                90
     C           *IN90     IFEQ *OFF
     C           S@NO      ANDEQ*BLANK
     C           K#31      CHAINBTAWP31              91
     C           *IN91     IFEQ *OFF
     C                     Z-ADDS@B       BB
     C                     Z-ADDS@D       DD
     C                     Z-ADD*DATE     UPDATE
     C                     UPDATBTAWP311
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  UPDATE
      *------------------------------------------------------
     C           #UPD      BEGSR
      *
     C                     Z-ADD*ZERO     @@RRN
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL02                90
     C           *IN90     IFEQ *OFF
     C           S@NO      ANDEQ*BLANK
      *
     C                     EXSR #UPD2
      *
     C           K#31      CHAINBTAWP31              91
     C           *IN91     IFEQ *OFF
     C                     Z-ADDS@B       BB
     C                     Z-ADDS@D       DD
     C                     MOVE '1'       UPID
     C                     Z-ADD*DATE     UPDATE
     C                     UPDATBTAWP311
     C                     ENDIF
      * BTAWP32
     C*          K#31      CHAINBTAWP32              91
     C*          *IN91     IFEQ *OFF
     C*                    Z-ADDDAT       WDT
     C*                    Z-ADDQT        WQT
     C*                    Z-ADD*DATE     WPUPDT
     C*                    UPDATBTAWP321
     C*********            ELSE
     C                     CLEARBTAWP321
     C                     MOVEL#USER     WPUPPS
     C                     MOVELH@LOC1    WPLOC1
     C                     MOVELS@LC02    WPLOC2
     C                     MOVELS@LC03    WPLOC3
     C                     MOVELH@LOC4    WPLOC4
     C                     MOVELS@PRT1    WPPRT1
     C                     MOVELS@PRT2    WPPRT2
     C                     MOVELS@PRT3    WPPRT3
     C                     Z-ADDH@AA      WPAA
     C                     Z-ADDS@B       WPBB
     C                     Z-ADDS@D       WPDD
     C                     Z-ADDH@EE      WPEE
     C                     Z-ADDH@FF      WPFF
     C                     Z-ADDH@GG      WPGG
     C                     Z-ADDH@JJ      WPJJ
     C                     Z-ADDDAT       WDT
     C                     Z-ADDQT        WQT
     C                     Z-ADD*DATE     WPUPDT
     C                     TIME           WPUPTM
     C                     WRITEBTAWP321
     C**********           ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  UPDATE
      *------------------------------------------------------
     C           #UPD2     BEGSR
      *
     C           1         DO   5         X
     C******     QT,X      IFNE *ZERO
     C                     Z-ADDDAT,X     K@YMD
     C                     Z-ADDK@DD      Z
     C           K#BTAX    CHAINBTAPL04              93
     C           *IN93     IFEQ *OFF
     C           QT,X      IFGT *ZERO
     C                     Z-ADDQT,X      #PH,Z
     C                     Z-ADD*ZERO     #MH,Z
     C                     ELSE
     C                     Z-ADDQT,X      #MH,Z
     C                     Z-ADD*ZERO     #PH,Z
     C                     ENDIF
     C                     MOVE *BLANK    BTSKJY
     C                     MOVEL#USER     BTKOME
     C                     Z-ADD*YEAR     BTKOYY
     C                     Z-ADD*MONTH    BTKOMM
     C                     Z-ADD*DAY      BTKODD
     C                     TIME           @TIM
     C                     Z-ADD@HR       BTKOHH
     C                     Z-ADD@MN       BTKOSS
     C                     Z-ADD*ZERO     BTSKYY
     C                     Z-ADD*ZERO     BTSKMM
     C                     Z-ADD*ZERO     BTSKDD
     C                     UPDATBTAPL041
     C                     ELSE
     C           QT,X      IFNE *ZERO
     C                     CLEARBTAPL041
     C                     MOVEL#USER     BTKOME
     C                     Z-ADD*YEAR     BTKOYY
     C                     Z-ADD*MONTH    BTKOMM
     C                     Z-ADD*DAY      BTKODD
     C                     TIME           @TIM
     C                     Z-ADD@HR       BTKOHH
     C                     Z-ADD@MN       BTKOSS
     C                     MOVELS@PRT1    BTSHN1
     C                     MOVELS@PRT2    BTSHN2
     C                     MOVELS@PRT3    BTSHN3
     C                     Z-ADDK@YM      BTKEYM
     C           QT,X      IFGT *ZERO
     C                     ADD  QT,X      #PH,Z
     C                     ELSE
     C                     ADD  QT,X      #MH,Z
     C                     ENDIF
     C                     WRITEBTAPL041
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  PRINT CHECK LIST
      *------------------------------------------------------
     C           #PRT      BEGSR
      *
     C                     TIME           @TIM
      *
     C                     MOVE *OFF      *IN98
     C                     Z-ADD*ZERO     @@RRN
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL02                90
     C           *IN90     IFEQ *OFF
     C           S@NO      ANDEQ*BLANK
      *
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
      *
     C  N98                MOVE *ON       *IN98
      *
     C                     EXCPT@DTL2
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  3RD SCREEN
      *------------------------------------------------------
     C           #SCRN3    BEGSR
      *
     C                     MOVELCMD,4     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     MOVE '02'      W@ID
      *
     C                     ENDSR
      *------------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         UDATE    110 '  /  /  '
     O                         @HR      113
     O                                  114 ':'
     O                         @MN      116
     O                                  117 ':'
     O                         @SC      119
     O                                  124 'P'
     O                         PAGE  Z  128
     O        E   02           @HED
     O                         @@STL     15
     O                         TTL,1     80
     O        E   03           @HED
     O                         D@TTL     12
     O                                   91 'BOX'
     O        E   04           @HED
     O                                    5 'PART#'
     O                                   18 'LOC'
     O                                   27 '(A)'
     O                                   29 '+'
     O                                   34 '(F)'
     O                                   36 '-'
     O                                   42 '(J)'
     O                                   46 '- ('
     O                                   50 '(B)'
     O                                   52 '+'
     O                                   58 '(D)'
     O                                   60 '+'
     O                                   66 '(E)'
     O                                   68 '+'
     O                                   76 '(G) )'
     O                                   82 'RSLT'
     O                                   91 '/DAY'
     O                         D@D      127 '&  /  '
     O        E 1              @DTL2
     O                         LIN      132
     O        E 1              @DTL2
     O                         S@PRT1     5
     O                         S@PRT2    11
     O                         S@PRT3    14
     O                         S@LC02    17
     O                         S@LC03    20
     O                         H@AA  4   27
     O                         H@FF  M   35
     O                         H@JJ  M   43
     O                         S@B   M   51
     O                         S@D   M   59
     O                         H@EE  M   67
     O                         H@GG  M   75
     O                         S@ANS M   83
     O                         S@BDAY4   91
     O                                   95 'ADD'
     O                         QT       127 '&&   -'
     O        E 1              @DTL2
     O                                   95 'CUR'
     O                         NW       127 '&&   -'
** CMD
F1:END
F1:END   F4:SAVE   F5:UPDATE   CURSR+F10:DETAIL   F11:LIST   F12:BACK
F1:END   F12:GO BACK   F5:UPDATE   CURSOR+F10:DETAIL  F4:SAVE
ENTER: GO BACK
** HDR
APICS PARTS
** TTL
APICS PRODUCTION SCHEDULE CHECK LIST
** ER
 NO DATA.
 OPTION ERROR.
 DATE ERROR.
 LOCATION ERROR.
 DUPLICATE ERROR.
** STL
<< UPDATED >>
