     H            Y.
     FBTAT60  UP  E                    DISK
     I            DS
     I                                        1  80 SRCDTA
     I                                       16  21 WPGMNM
     I                                       30  39 WFILE
     I                                       43  45 WSYS
     IINFDSP     SDS
     I                                        1  10 PGMNM
     I                                      244 253 WSID
     I                                      254 263 USID
      *---------------------------------------------------------------*
      *ＰＡＲＭ                                                     *
      *---------------------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PFILE  10
     C                     PARM           PSYS    3
      *
     C           WPGMNM    IFEQ 'BTAC70'
     C           WPGMNM    OREQ 'BTAC71'
     C                     MOVELPFILE     WFILE
     C                     MOVELPSYS      WSYS
     C                     UPDATACLSRC
     C                     END
      *
