     H            Y.
     F*** BTAR80 ************************************************
     F* PT PLAN PUBLICATION M/F UPDATE DATA CREATE              *
     F*          T.SAKASHITA 2004.09.24                         *
JW1  F* J.WATANABE 2021.04.06 CHG BTAWP85 RECORD LENGTH TO 255  *
     F***********************************************************
     F**BTAWP85 IP  F    9999            DISK
JW1  FBTAWP85 IP  F     255            DISK
     FBTAPP85 O   E                    DISK
     FBTAPP8Y UF  E           K        DISK                      A
     E                    I@D       255  1
     E                    PHZ       255  8 0
     E                    MHZ       255  8 0
     E                    HZ          8  1 0
     E                    SU          8  1
     E                    HIN        12  1
     E                    O@S         8  1 0
     IBTAWP85 AA  01
     I                                        1   8 I@HIN
     I***                                     19999 I@D
JW1  I                                        1 255 I@D
     I            DS
     I                                        1   80HZ
     I                                        1   80WHZ
     I            DS
     I                                        1   8 SU
     I                                        1   8 WSU
     I            DS
     I                                        1  12 HIN
     I                                        1  12 WHIN
     I            DS
     I                                        1   80O@S
     I                                        1   8 O@A
     I            DS
     I                                        1  12 OHIN
     I                                        1   5 OHIN1
     I                                        6  10 OHIN2
     I                                       11  12 OHIN3
      *
     I            DS
     I                                        1   80W@HIZ
     I                                        1   60W@YM
     I                                        7   80W@DD
      * BTAPP85
     I            DS
     I                                        1  12 BAHINA
     I                                        1   5 BAHIN1
     I                                        6  10 BAHIN2
     I                                       11  12 BAHIN3
      *
     C           KEYHIN    KLIST
     C                     KFLD           K#CGYM  60
     C                     KFLD           #KHIN1  5
     C                     KFLD           #KHIN2  5
     C                     KFLD           #KHIN3  2
     C                     KFLD           K#CGDD  20
      *
     C           I@HIN     IFEQ 'CA010-21'
     C                     Z-ADD1         SAKA   100
     C                     END
      *
     C                     ADD  1         @CNT    40
     C           @CNT      IFEQ 1
     C                     EXSR #CUTH
     C                     ELSE
     C                     EXSR #CUTD
     C                     END
     C*----------------------------------------------------------------
     C           #CUTH     BEGSR
     C*初期化
     C                     Z-ADD0         @A      50       READ fc]n
     C                     Z-ADD0         @N      50       ﾎﾞ[]h fc]n
     C                     Z-ADD0         @B      50       f]u fc]n
     C                     Z-ADD0         @P      50       ﾎﾟ[ﾇ fc]n
     C                     Z-ADD0         @M      50       uboﾇ fc]n
     C                     Z-ADD0         @I      50       ﾍlﾞibnﾞcfc]n
     C                     Z-ADD0         WHZ
     C                     SETOF                     55    uboﾇ ﾎ[hﾞ
      *
     C**         1         DO   2048      @A
JW1  C           1         DO   255       @A
      * f]u検知
S1   C           I@D,@A    IFEQ ','
     C                     Z-ADD0         @N
     C                     ADD  1         @B
 S2  C           @B        IFGE 2
  S3 C           WHZ       IFNE 0
   S4C           *IN55     IFEQ '0'
     C                     ADD  1         @P
     C                     Z-ADDWHZ       PHZ,@P
   X4C                     ELSE
     C                     ADD  1         @M
     C                     Z-ADDWHZ       MHZ,@M
   E4C                     END
  E3 C                     END
     C                     Z-ADD0         @I
     C                     Z-ADD0         HZ
 E2  C                     END
     C                     ITER
E1   C                     END
      * uboﾇ検知
S1   C           I@D,@A    IFEQ '@'
     C                     SETON                     55
     C                     ITER
E1   C                     END
      * ﾎﾞ[]h検知ﾎﾞ[]h 10個でライン処理終了
S1   C           I@D,@A    IFEQ ' '
     C                     ADD  1         @N
 S2  C           @N        IFGE 10
     C                     LEAVE
 E3  C                     END
X1   C                     ELSE
      *日付格納
     C           @B        IFGE 1
     C                     ADD  1         @I
     C                     MOVE I@D,@A    HZ,@I
     C                     END
E1   C                     END
      *
     C                     ENDDO
      *最後がf]uでなかった時の強制出力
     C           WHZ       IFNE 0
  S3 C           *IN55     IFEQ '0'
     C                     ADD  1         @P
     C                     Z-ADDWHZ       PHZ,@P
  X3 C                     ELSE
     C                     ADD  1         @M
     C                     Z-ADDWHZ       MHZ,@M
  E3 C                     END
     C                     END
      *
     C           ECUTH     ENDSR
      *----------------------------------------------------------------
     C           #CUTD     BEGSR
      *初期化
     C                     Z-ADD0         @A      50       READ fc]n
     C                     Z-ADD0         @N      50       ﾎﾞ[]h fc]n
     C                     Z-ADD0         @B      50       f]u fc]n
     C                     Z-ADD0         @P      50       ﾎﾟ[ﾇ fc]n
      * '@'の次もfc]nしてしまう為-1を格納
     C                     Z-ADD-1        @M      50       uboﾇ fc]n
     C                     Z-ADD0         @I      50       ﾍ]ﾌﾞ]bnﾞcfc]n
     C                     SETOF                     55
     C                     MOVE *BLANK    HIN
     C                     MOVE *BLANK    OHIN   12
     C                     MOVE *BLANK    WSU
     C*
     C***        1         DO   2048      @A
JW1  C           1         DO   255       @A
      * f]u検知
S1   C           I@D,@A    IFEQ ','
     C                     Z-ADD0         @N
     C                     ADD  1         @B
 S2  C           @B        IFEQ 1                          品番取得
     C                     MOVE WHIN      OHIN
     C                     Z-ADD0         @I
 E2  C                     END
 S2  C           @B        IFGE 2                          数量取得
  S3 C           *IN55     IFEQ '0'
     C                     ADD  1         @P
  X3 C                     ELSE
     C                     ADD  1         @M
  E3 C                     END
  S  C           WSU       IFNE *BLANK
     C                     EXSR #OUT
  E  C                     END
     C                     Z-ADD0         @I
     C                     MOVE *BLANK    WSU
 E2  C                     END
     C                     ITER
E1   C                     END
      * uboﾇ検知
S1   C           I@D,@A    IFEQ '@'
     C                     SETON                     55
     C                     ITER
E1   C                     END
      * ﾎﾞ[]h検知ﾎﾞ[]h 10個でライン処理終了
S1   C           I@D,@A    IFEQ ' '
     C                     ADD  1         @N
 S2  C           @N        IFGE 10
     C                     LEAVE
 E3  C                     END
X1   C                     ELSE
      *数のセット
     C           @B        IFGE 1
     C                     ADD  1         @I
     C                     MOVE I@D,@A    SU,@I
     C                     ELSE
     C*品番のセット
     C           I@D,@A    IFNE '-'
     C                     ADD  1         @I
     C                     MOVE I@D,@A    HIN,@I
     C                     END
     C                     END
E1   C                     END
     C*
     C                     ENDDO
      *最後がf]uでなかった時の強制出力
     C           WSU       IFNE *BLANK
  S3 C           *IN55     IFEQ '0'
     C                     ADD  1         @P
     C                     EXSR #OUT
  X3 C                     ELSE
     C                     ADD  1         @M
     C                     EXSR #OUT
  E3 C                     END
     C                     END
     C*
     C           ECUTD     ENDSR
      *
     C           #OUT      BEGSR
      *品番
     C                     MOVE *BLANK    BAHINA
     C                     MOVE OHIN      BAHINA
      *数量
     C                     MOVE *BLANK    O@A
     C                     Z-ADD8         @Z      20
     C                     Z-ADD8         @X      20
     C           1         DO   8
     C           SU,@Z     IFNE *BLANK
     C                     MOVE SU,@Z     O@S,@X
     C                     SUB  1         @X
     C                     END
     C                     SUB  1         @Z
     C                     ENDDO
     C                     MOVE O@A       O@SU    80
      *日付
     C                     Z-ADD0         BACGYM
     C                     Z-ADD0         BACGDD
     C                     Z-ADD0         BACASU
     C                     Z-ADD0         BACMSU
     C           *IN55     IFEQ '0'
     C                     Z-ADDPHZ,@P    W@HIZ
     C                     Z-ADDW@YM      BACGYM
     C                     Z-ADDW@DD      BACGDD
     C                     Z-ADDO@SU      BACASU
     C                     ELSE
     C                     Z-ADDMHZ,@M    W@HIZ
     C                     Z-ADDW@YM      BACGYM
     C                     Z-ADDW@DD      BACGDD
     C                     Z-ADDO@SU      BACMSU
     C                     END
     C                     Z-ADD0         SAKA1   10
     C*
     C                     WRITEBTAPP851
      *品番累計
     C                     MOVE BAHIN1    #KHIN1  5
     C                     MOVE BAHIN2    #KHIN2  5
     C                     MOVE BAHIN3    #KHIN3  2
     C                     MOVE BACGYM    K#CGYM  60
     C                     MOVE BACGDD    K#CGDD  20
     C                     SETOF                     29
     C           KEYHIN    CHAINBTAPP8Y1             29
     C           *IN29     IFEQ '1'
     C                     MOVE BAHIN1    B@HIN1
     C                     MOVE BAHIN2    B@HIN2
     C                     MOVE BAHIN3    B@HIN3
     C                     Z-ADDBACASU    B@CASU
     C                     Z-ADDBACMSU    B@CMSU
     C                     MOVE BACGYM    B@CGYM
     C                     MOVE BACGDD    B@CGDD
     C                     WRITEBTAPP8Y1
     C                     ELSE
     C                     ADD  BACASU    B@CASU
     C                     ADD  BACMSU    B@CMSU
     C                     UPDATBTAPP8Y1
     C                     END
     C           EOUT      ENDSR
