     H            Y.
     F** BTAR08 *******************************************
     F*  ..A-PICS PLAN PUBLICATION MANAGEMENT M/F LIST..  *
     F*    COPY FROM BTAR09                 2000.10.16    *
     F******************************************* BTAR08 **
     FBTAPW08 CF  E                    WORKSTN
     FBTAPP05 IF  E                    DISK
     FBTAWP08 O   F     300            DISK
     E                    #PH        31  3 0
     E                    #MH        31  3 0
     E                    #ZM        31  1
     E                    ER      1   2 60
     I            DS
     I                                        1  93 #PH
     I                                        1   30BTPH01
     I                                        4   60BTPH02
     I                                        7   90BTPH03
     I                                       10  120BTPH04
     I                                       13  150BTPH05
     I                                       16  180BTPH06
     I                                       19  210BTPH07
     I                                       22  240BTPH08
     I                                       25  270BTPH09
     I                                       28  300BTPH10
     I                                       31  330BTPH11
     I                                       34  360BTPH12
     I                                       37  390BTPH13
     I                                       40  420BTPH14
     I                                       43  450BTPH15
     I                                       46  480BTPH16
     I                                       49  510BTPH17
     I                                       52  540BTPH18
     I                                       55  570BTPH19
     I                                       58  600BTPH20
     I                                       61  630BTPH21
     I                                       64  660BTPH22
     I                                       67  690BTPH23
     I                                       70  720BTPH24
     I                                       73  750BTPH25
     I                                       76  780BTPH26
     I                                       79  810BTPH27
     I                                       82  840BTPH28
     I                                       85  870BTPH29
     I                                       88  900BTPH30
     I                                       91  930BTPH31
     I            DS
     I                                        1  93 #MH
     I                                        1   30BTMH01
     I                                        4   60BTMH02
     I                                        7   90BTMH03
     I                                       10  120BTMH04
     I                                       13  150BTMH05
     I                                       16  180BTMH06
     I                                       19  210BTMH07
     I                                       22  240BTMH08
     I                                       25  270BTMH09
     I                                       28  300BTMH10
     I                                       31  330BTMH11
     I                                       34  360BTMH12
     I                                       37  390BTMH13
     I                                       40  420BTMH14
     I                                       43  450BTMH15
     I                                       46  480BTMH16
     I                                       49  510BTMH17
     I                                       52  540BTMH18
     I                                       55  570BTMH19
     I                                       58  600BTMH20
     I                                       61  630BTMH21
     I                                       64  660BTMH22
     I                                       67  690BTMH23
     I                                       70  720BTMH24
     I                                       73  750BTMH25
     I                                       76  780BTMH26
     I                                       79  810BTMH27
     I                                       82  840BTMH28
     I                                       85  870BTMH29
     I                                       88  900BTMH30
     I                                       91  930BTMH31
     I            DS
     I                                        1  31 #ZM
     I                                        1   1 BTZM01
     I                                        2   2 BTZM02
     I                                        3   3 BTZM03
     I                                        4   4 BTZM04
     I                                        5   5 BTZM05
     I                                        6   6 BTZM06
     I                                        7   7 BTZM07
     I                                        8   8 BTZM08
     I                                        9   9 BTZM09
     I                                       10  10 BTZM10
     I                                       11  11 BTZM11
     I                                       12  12 BTZM12
     I                                       13  13 BTZM13
     I                                       14  14 BTZM14
     I                                       15  15 BTZM15
     I                                       16  16 BTZM16
     I                                       17  17 BTZM17
     I                                       18  18 BTZM18
     I                                       19  19 BTZM19
     I                                       20  20 BTZM20
     I                                       21  21 BTZM21
     I                                       22  22 BTZM22
     I                                       23  23 BTZM23
     I                                       24  24 BTZM24
     I                                       25  25 BTZM25
     I                                       26  26 BTZM26
     I                                       27  27 BTZM27
     I                                       28  28 BTZM28
     I                                       29  29 BTZM29
     I                                       30  30 BTZM30
     I                                       31  31 BTZM31
     I            DS
     I                                        1   80BTSKHZ
     I                                        1   40BTSKYY
     I                                        5   60BTSKMM
     I                                        7   80BTSKDD
     I            DS
     I                                        1   60IKEYM
     I                                        1   40IKEYY
     I                                        5   60IKEMM
      *
     C           *ENTRY    PLIST
     C                     PARM           PKEYM   6
      *
     C                     Z-ADD0         IKEYM
      *
     C           STP1      TAG
     C                     EXFMTBTAPW081
     C                     SETOF                     0199
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           IKEYM     IFEQ 0
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C           IKEYY     IFGE 1997
     C           IKEMM     ANDGE01
     C           IKEMM     ANDLE12
     C                     ELSE
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STP1
     C                     END
      *
     C                     MOVE IKEYM     PKEYM
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C                     READ BTAPP051                 10
     C           *IN10     IFEQ '0'
     C           BTSKJY    IFEQ 'D'
     C           BTSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           IKEYM     IFEQ BTKEYM
     C                     SETON                     U1
     C                     EXCPTDT
     C                     END
      *
     C                     END
     C                     END
     C  N10                END
      *
     C                     SETON                     LR
     C                     RETRN
      *
     OBTAWP08 E                DT
     O                         BTSHN1     5
     O                         BTSHN2    10
     O                         BTSHN3    12
     O                         #PH      105
     O                         #MH      198
     O                         #ZM      229
      *
** ER
E-01 INPUT PLAN DUE COMPANY DATE
E-02 PLAN DUE COMPANY DATE (YYMM) IS NOT RIGHT
