     H            Y.
     F** BTAR20 ******************************************
     F* .. A-PICS PLAN PUBLICATION PRODUCTION INSTRUCTION DATA CREATE || *.
     F* I-HASADA                          94.06.14       *
     F****************************************** BTAR20 **
     FBTAPP01 UP  E                    DISK
     FAGAPL31 UF  E           K        DISK
     FAUDPPNO UF  E                    DISK                      A
     FFCEPL01 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FAGDPL11 IF  E           K        DISK
     FACAPL11 IF  E           K        DISK
     FAAIPL11 IF  E           K        DISK
     FAU#PP21 O   E                    DISK                      A
     FBTAWP20 O   F     100            DISK
     E                    BTM        31  3 0             発行予定枚数
     E                    BTB        31  1 0             便分割回数
     E                    CTR        24  2 0             転送指定便
     E                    CHK        24  3 0             発注割当箱数
     E                    WBN        24  2 0             箱数割振る便
     I            DS
     I                                        1  930BTM
     I                                        1   30BTMA01
     I                                        4   60BTMA02
     I                                        7   90BTMA03
     I                                       10  120BTMA04
     I                                       13  150BTMA05
     I                                       16  180BTMA06
     I                                       19  210BTMA07
     I                                       22  240BTMA08
     I                                       25  270BTMA09
     I                                       28  300BTMA10
     I                                       31  330BTMA11
     I                                       34  360BTMA12
     I                                       37  390BTMA13
     I                                       40  420BTMA14
     I                                       43  450BTMA15
     I                                       46  480BTMA16
     I                                       49  510BTMA17
     I                                       52  540BTMA18
     I                                       55  570BTMA19
     I                                       58  600BTMA20
     I                                       61  630BTMA21
     I                                       64  660BTMA22
     I                                       67  690BTMA23
     I                                       70  720BTMA24
     I                                       73  750BTMA25
     I                                       76  780BTMA26
     I                                       79  810BTMA27
     I                                       82  840BTMA28
     I                                       85  870BTMA29
     I                                       88  900BTMA30
     I                                       91  930BTMA31
     I            DS
     I                                        1  310BTB
     I                                        1   10BTBU01
     I                                        2   20BTBU02
     I                                        3   30BTBU03
     I                                        4   40BTBU04
     I                                        5   50BTBU05
     I                                        6   60BTBU06
     I                                        7   70BTBU07
     I                                        8   80BTBU08
     I                                        9   90BTBU09
     I                                       10  100BTBU10
     I                                       11  110BTBU11
     I                                       12  120BTBU12
     I                                       13  130BTBU13
     I                                       14  140BTBU14
     I                                       15  150BTBU15
     I                                       16  160BTBU16
     I                                       17  170BTBU17
     I                                       18  180BTBU18
     I                                       19  190BTBU19
     I                                       20  200BTBU20
     I                                       21  210BTBU21
     I                                       22  220BTBU22
     I                                       23  230BTBU23
     I                                       24  240BTBU24
     I                                       25  250BTBU25
     I                                       26  260BTBU26
     I                                       27  270BTBU27
     I                                       28  280BTBU28
     I                                       29  290BTBU29
     I                                       30  300BTBU30
     I                                       31  310BTBU31
     I            DS
     I                                        1  480CTR
     I                                        1   20CBTR01
     I                                        3   40CBTR02
     I                                        5   60CBTR03
     I                                        7   80CBTR04
     I                                        9  100CBTR05
     I                                       11  120CBTR06
     I                                       13  140CBTR07
     I                                       15  160CBTR08
     I                                       17  180CBTR09
     I                                       19  200CBTR10
     I                                       21  220CBTR11
     I                                       23  240CBTR12
     I                                       25  260CBTR13
     I                                       27  280CBTR14
     I                                       29  300CBTR15
     I                                       31  320CBTR16
     I                                       33  340CBTR17
     I                                       35  360CBTR18
     I                                       37  380CBTR19
     I                                       39  400CBTR20
     I                                       41  420CBTR21
     I                                       43  440CBTR22
     I                                       45  460CBTR23
     I                                       47  480CBTR24
     I            DS
     I                                        1  720CHK
     I                                        1   30CBHK01
     I                                        4   60CBHK02
     I                                        7   90CBHK03
     I                                       10  120CBHK04
     I                                       13  150CBHK05
     I                                       16  180CBHK06
     I                                       19  210CBHK07
     I                                       22  240CBHK08
     I                                       25  270CBHK09
     I                                       28  300CBHK10
     I                                       31  330CBHK11
     I                                       34  360CBHK12
     I                                       37  390CBHK13
     I                                       40  420CBHK14
     I                                       43  450CBHK15
     I                                       46  480CBHK16
     I                                       49  510CBHK17
     I                                       52  540CBHK18
     I                                       55  570CBHK19
     I                                       58  600CBHK20
     I                                       61  630CBHK21
     I                                       64  660CBHK22
     I                                       67  690CBHK23
     I                                       70  720CBHK24
     I            DS
     I                                        1   80BTSKHZ
     I                                        1   40BTSKYY
     I                                        5   60BTSKMM
     I                                        7   80BTSKDD
     I            DS
     I                                        1  12 BTSHIN
     I                                        1   5 BTSHN1
     I                                        6  10 BTSHN2
     I                                       11  12 BTSHN3
     I            DS
     I                                        1   80BTNOHZ
     I                                        1   40BTNOYY
     I                                        5   60BTNOMM
     I                                        7   80BTNODD
     I            DS
     I                                        1   80BTSYHZ
     I                                        1   40BTSYYY
     I                                        5   60BTSYMM
     I                                        7   80BTSYDD
     I            DS
     I                                        1   80CQSKHZ
     I                                        1   40CQSKYY
     I                                        5   60CQSKMM
     I                                        7   80CQSKDD
     I            DS
     I                                        1   60CQSKTM
     I                                        1   20CQSKHH
     I                                        3   40CQSKSS
     I            DS
     I                                        1   80CQKOHZ
     I                                        1   40CQKOYY
     I                                        5   60CQKOMM
     I                                        7   80CQKODD
     I            DS
     I                                        1   60CQKOTM
     I                                        1   20CQKOHH
     I                                        3   40CQKOSS
     I            DS
     I                                        1  12 CQSHIN
     I                                        1   5 CQSHN1
     I                                        6  10 CQSHN2
     I                                       11  12 CQSHN3
     I            DS
     I                                        1   80CQTHHZ
     I                                        1   40CQTHYY
     I                                        5   60CQTHMM
     I                                        7   80CQTHDD
     I            DS
     I                                        1   60CQTHTM
     I                                        1   20CQTHJI
     I                                        3   40CQTHPN
     I            DS
     I                                        1   6 CQSTKR
     I                                        1   1 CQSBKJ
     I                                        2   3 CQSBRO
     I                                        4   5 CQSBRT
     I                                        6   6 CQSBDN
     I            DS
     I                                        1   80CQNOHZ
     I                                        1   40CQNOYY
     I                                        5   60CQNOMM
     I                                        7   80CQNODD
     I            DS
     I                                        1   80CQURHZ
     I                                        1   40CQURYY
     I                                        5   60CQURMM
     I                                        7   80CQURDD
     I            DS
     I                                        1   60CQURTM
     I                                        1   20CQURJI
     I                                        3   40CQURPN
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   6 A2STKR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
     I            DS
     I                                        1   6 A2KTKR
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
     I            DS
     I                                        1   80WUYMD
     I                                        1   60WUYM
     I                                        1   40WUY
     I                                        5   60WUM
     I                                        7   80WUD
     I                                        7   80D
      *
     C           KEY       KLIST
     C                     KFLD           BTSHN1
     C                     KFLD           BTSHN2
     C                     KFLD           BTSHN3
      *
     C           KEY1      KLIST
     C                     KFLD           BTTOKU
     C                     KFLD           BTNONY
     C                     KFLD           BTNKOJ
     C                     KFLD           BTNUKE
      *
     C           KEY2      KLIST
     C                     KFLD           WUY
     C                     KFLD           WUM
     C                     KFLD           WUD
      *
     C           KEY3      KLIST
     C                     KFLD           CBMBMN
     C                     KFLD           CBKDAI
      *
     C           KEY4      KLIST
     C                     KFLD           CBMBMN
     C                     KFLD           CBKDAI
     C                     KFLD           CBSHN1
     C                     KFLD           CBSHN2
     C                     KFLD           CBSHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PLIST   1
      *
     C           *IN50     IFEQ '0'
     C                     SETON                     50
     C                     Z-ADD*DATE     WUYMD
      *
     C                     SETOF                     2021
     C           KEY2      CHAINAGDPL111             20
     C           *IN20     IFEQ '0'
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ'*'
     C                     SETON                     21
     C                     END
     C                     END
     C                     END
      *
     C           BTKEYM    IFEQ WUYM
      *
     C           BTSKJY    IFEQ 'D'
     C           BTSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C*------------------*
     C*  ..当日箱数..  *
     C*------------------*
     C           BTM,D     IFEQ 0
     C                     GOTO END
     C                     END
      *
     C*------------------------*
     C*  ..当日便分割回数..  *
     C*------------------------*
     C           BTB,D     IFNE 0
     C                     GOTO END
     C                     END
      *
     C*------------------------------------*
     C*  ..平準化確定発注累積ファイル..  *
     C*------------------------------------*
     C                     SETOF                     10
     C           KEY       CHAINAGAPL311             10
     C           *IN10     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
      *
     C           *IN10     IFEQ '1'
     C                     MOVE '*'       PLIST
     C                     MOVE '1'       WKUBN   1
     C                     Z-ADDBTM,D     WHKZS
     C                     EXCPTDT
     C                     GOTO END
     C                     END
      *
     C*------------------------------------------*
     C*  ..Ａ－ＰＩＣＳ　転送先判断マスター..  *
     C*------------------------------------------*
     C                     Z-ADD0         WBMON   40
     C                     MOVE *BLANK    WKCD1   1
     C                     MOVE *BLANK    WSW1    1
      *
     C           CBKDAI    IFEQ '0'
     C                     Z-ADD0111      WBMON
     C                     ELSE
      *
     C           KEY3      SETLLACAPL111
      *
     C                     DO   *HIVAL
     C                     SETOF                     11
     C           KEY3      READEACAPL111                 11
     C           *IN11     IFEQ '0'
     C           I1SKJY    IFEQ 'D'
     C           I1SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     11
     C                     MOVE '*'       WSW1
     C                     Z-ADDI1BMON    WBMON
     C                     MOVE I1KCD1    WKCD1
      *
     C                     END
     C                     END
     C  N11                END
      *
     C           WSW1      IFEQ *BLANK
     C                     Z-ADD0111      WBMON
     C                     ELSE
      *
     C                     SETOF                     11
     C           KEY4      CHAINACAPL111             11
     C           *IN11     IFEQ '0'
     C           I1SKJY    ANDEQ'D'
     C           I1SKHZ    ANDLE*DATE
     C                     SETON                     11
     C                     END
     C           *IN11     IFEQ '0'
     C                     Z-ADDI1BMON    WBMON
     C                     ELSE
      *
     C           WBMON     IFEQ 8907
     C           WKCD1     IFNE '0'
     C                     Z-ADD8990      WBMON
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*------------------------------*
     C*  ..時刻別計算便マスター..  *
     C*------------------------------*
     C                     SETOF                     11
     C                     Z-ADD01        WCIBI   20
     C           WBMON     CHAINAAIPL111             11
     C           *IN11     IFEQ '0'
     C                     Z-ADDCDCIBI    WCIBI
     C                     END
      *
     C*----------------------------*
     C*  ..バレル箱数チェック..  *
     C*----------------------------*
     C           BTM,D     IFLT CBBARL
     C                     MOVE '*'       PLIST
     C                     MOVE '2'       WKUBN
     C                     Z-ADDBTM,D     WHKZS
     C                     EXCPTDT
     C                     GOTO END
     C                     END
      *
     C           BTM,D     DIV  CBBARL    WHKS1   30
     C           CBBARL    MULT WHKS1     WHKMS   30
     C           BTM,D     SUB  WHKMS     WHKZS   30
      *
     C           WHKZS     IFNE 0
     C                     MOVE '*'       PLIST
     C                     MOVE '3'       WKUBN
     C                     EXCPTDT
     C                     END
      *
     C                     Z-ADDWHKMS     @HKMS   30
      *
     C*------------------*
     C*  ..割振り便..  *
     C*------------------*
     C                     SETOF                     1114
     C                     Z-ADD1         A       20
     C                     Z-ADD0         B       20
     C                     Z-ADD0         WBN
     C           1         DO   24        A
      *
     C*------------------*
     C*  ..臨出出勤..  *
     C*------------------*
     C           *IN21     IFEQ '1'
      *
     C           WCIBI     DIV  2         WMSA2   20
     C                     MVR            WMSA3   20
     C           WMSA3     IFNE 0
     C                     ADD  1         WMSA2
     C                     END
     C           WMSA2     IFEQ 0
     C                     Z-ADD1         WMSA2
     C                     END
      *
     C           CTR,A     IFNE 0
     C                     SETON                     14
      *
     C           CTR,A     IFLE WMSA2
     C                     SETON                     11
     C                     ADD  1         B
     C                     Z-ADDCTR,A     WBN,B
     C                     END
     C                     END
     C                     ELSE
      *
     C*------------------*
     C*  ..通常出勤..  *
     C*------------------*
     C           CTR,A     IFNE 0
     C                     SETON                     11
     C                     ADD  1         B
     C                     Z-ADDCTR,A     WBN,B
     C                     END
     C                     END
     C                     END
      *
     C           *IN11     IFEQ '0'
      *
     C           *IN14     IFEQ '1'
     C                     Z-ADD1         C
     C                     ELSE
      *
     C           *IN21     IFEQ '1'
      *
     C           WCIBI     DIV  2         C       20
     C                     MVR            WMSA3
     C           WMSA3     IFNE 0
     C                     ADD  1         C
     C                     END
     C           C         IFEQ 0
     C                     Z-ADD1         C
     C                     END
     C                     ELSE
      *
     C                     Z-ADDWCIBI     C
     C                     END
     C                     END
      *
     C                     Z-ADD1         A
     C           1         DO   C         A
     C                     Z-ADDA         WBN,A
     C                     END
     C                     END
      *
     C*----------------------*
     C*  ..発注割当箱数..  *
     C*----------------------*
     C                     SETOF                     13
     C                     Z-ADD0         WRECD   10
      *
     C           STP1      TAG
      *
     C                     SETOF                     12
     C                     Z-ADD1         A
     C           1         DO   24        A
      *
     C           WBN,A     IFNE 0
     C                     Z-ADDWBN,A     B
     C                     ADD  CBBARL    CHK,B
     C                     SUB  CBBARL    @HKMS
      *
     C           *IN13     IFEQ '0'
     C                     ADD  1         WRECD
     C                     END
      *
     C           @HKMS     IFEQ 0
     C                     SETON                     12
     C                     END
      *
     C                     END
     C  N12                END
      *
     C           *IN12     IFEQ '0'
     C                     SETON                     13
     C                     GOTO STP1
     C                     END
      *
     C                     Z-ADDWRECD     BTB,D
     C                     UPDATBTAPP011
      *
     C                     UPDATAGAPL311
      *
     C*----------------------*
     C*  ..部品マスター..  *
     C*----------------------*
     C                     SETOF                     11
     C                     MOVE *BLANK    WTKRO   6
     C                     MOVE *BLANK    WTEHI   1
     C           KEY       CHAINFCEPL011             11
     C           *IN11     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     11
     C                     END
      *
     C           *IN11     IFEQ '0'
     C                     MOVE A2TEHI    WTEHI
      *
     C           A2TRHZ    IFGT *DATE
     C                     MOVE A2KTKR    WTKRO
     C                     ELSE
     C                     MOVE A2STKR    WTKRO
     C                     END
     C                     END
      *
     C*----------------------*
     C*  ..出荷マスター..  *
     C*----------------------*
     C                     SETOF                     11
     C                     Z-ADD0         WHIZK   20
     C                     Z-ADD0         WKAIS   10
     C                     Z-ADD0         WNBIN   10
     C           KEY1      CHAINGADPL111             11
     C           *IN11     IFEQ '0'
     C           B5SKJY    ANDEQ'D'
     C           B5SKHZ    ANDLE*DATE
     C                     SETON                     11
     C                     END
      *
     C           *IN11     IFEQ '0'
     C                     Z-ADDB5HIZK    WHIZK
     C                     Z-ADDB5KAIS    WKAIS
     C                     Z-ADDB5NBIN    WNBIN
     C                     END
      *
     C                     Z-ADD*DATE     CQSKHZ
     C                     TIME           CQSKTM
     C                     Z-ADD*DATE     CQKOHZ
     C                     TIME           CQKOTM
     C                     Z-ADDBTTOKU    CQTOKU
     C                     MOVE BTNKOJ    CQTKOJ
     C                     MOVE BTNUKE    CQTUKE
     C                     Z-ADDBTNONY    CQNONY
     C                     MOVE BTNKOJ    CQNKOJ
     C                     MOVE BTNUKE    CQNUKE
     C                     MOVELBTSHIN    CQSHIN
     C           WHKMS     MULT CBSYUY    CQSRYO
     C                     Z-ADD*DATE     CQTHHZ
     C                     TIME           CQTHTM
     C                     MOVE WTKRO     CQSTKR
     C                     Z-ADDWHIZK     CQCIC1
     C                     Z-ADDWKAIS     CQCIC2
     C                     Z-ADDWNBIN     CQCIC3
     C                     Z-ADDBTNOHZ    CQNOHZ
     C                     Z-ADD01        CQNOBB
     C                     MOVE WTEHI     CQTHAI
     C                     Z-ADDWHKMS     CQHAKO
     C                     Z-ADDCBSYUY    CQSYUY
     C                     MOVE 'T'       CQDTSY
     C                     MOVE '27'      CQGYOM
     C                     Z-ADD*DATE     CQURHZ
     C                     TIME           CQURTM
     C                     MOVE 'B'       CQBNKA
      *
     C*------------------------------------*
     C*        売上・受注№入力。        *
     C*------------------------------------*
     C                     SETOF                     30
     C           1         CHAINAUDPPNO1             30
      *
     C*===読めない時===*
     C           *IN30     IFEQ '1'
     C                     Z-ADDUMONTH    ACTUKI
     C                     Z-ADD8500001   ACRENO
     C                     Z-ADD8500001   CQJTNO
     C                     WRITEAUDPPNO1
     C                     ELSE
      *
     C*===読めた時===*
     C           ACTUKI    IFNE UMONTH
     C                     Z-ADDUMONTH    ACTUKI
     C                     Z-ADD8500001   ACRENO
     C                     Z-ADD8500001   CQJTNO
     C                     UPDATAUDPPNO1
     C                     ELSE
     C           ACRENO    ADD  1         ACRENO
     C                     Z-ADDACRENO    CQJTNO
     C                     UPDATAUDPPNO1
     C                     END
     C                     END
      *
     C                     WRITEAU#PP211
      *
     C           END       TAG
     C                     END
     C                     END
      *
     OBTAWP20 E                DT
     O                         WKUBN      1
     O                         BTSHIN    13
     O                         BTTOKU    17
     O                         BTNONY    21
     O                         BTNKOJ    22
     O                         BTNUKE    26
     O                         BTM,D     29
     O                         WHKZS     32
     O                         BTBARL    34
     O                         CBBARL    36
     O                         BTSYHZ    44
     O                         BTNOHZ    52
