     H            Y.
     F*** BTAR03 **********************************
     F* A-PICS KANBAN PLAN PUBLICATION ADJUSTMENT LIST *
     F*            S.YAMAGAMI 1994.03.03 *
     F*********************************************
     FBTAWP03 IP  F     100            DISK
     FAAMPL11 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAGDPL22 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FBTAPL31 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FBTAPR03 O   E             90     PRINTER
     E                    #SK        15  3               新工程
     E                    #SB        15  4 0             新部門
     E                    #KK        15  3               旧工程
     E                    #KB        15  4 0             旧部門
     E                    #KI        15  8 0             切換日
     E                    KT         15 10               現工程・部門
     E                    NM         15 10               部門名
     E                    H@         31  2               青山カレンダ-*
     E                    H@@        31  2 0             青山カレンダﾍpk
     E                    H@@@       31  4               かんばん発行日
     E                    TBL         7  1 0             曜日
     E                    HNM        10  1               細目名
     E                    KB1     1   3  1   KB2    16
     IBTAWP03 AA  70
     I                                        1   1 IKUBN L1
     I                                        2   6 IHIN1
     I                                        7  11 IHIN2
     I                                       12  13 IHIN3
     I                                       14  170ITOKU
     I                                       18  210INONY
     I                                       22  22 IKOJO
     I                                       23  26 IUKEI
     I                                       27  330IKJYSU
     I                                       34  380IKSYUY
     I                                       39  460IKTEHZ
     I                                       39  440IKTEYM
     I                                       47  540IKNOHZ
     I                                       55  610IINSU
     I                                       62  680ITHSU
     I            DS
     I                                        1  45 #SK
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  60 #SB
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  45 #KK
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  60 #KB
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1 120 #KI
     I                                        1   80CKHZ01
     I                                        9  160CKHZ02
     I                                       17  240CKHZ03
     I                                       25  320CKHZ04
     I                                       33  400CKHZ05
     I                                       41  480CKHZ06
     I                                       49  560CKHZ07
     I                                       57  640CKHZ08
     I                                       65  720CKHZ09
     I                                       73  800CKHZ10
     I                                       81  880CKHZ11
     I                                       89  960CKHZ12
     I                                       97 1040CKHZ13
     I                                      105 1120CKHZ14
     I                                      113 1200CKHZ15
     I            DS
     I                                        1 150 KT
     I                                        1  10 KT01
     I                                       11  20 KT02
     I                                       21  30 KT03
     I                                       31  40 KT04
     I                                       41  50 KT05
     I                                       51  60 KT06
     I                                       61  70 KT07
     I                                       71  80 KT08
     I                                       81  90 KT09
     I                                       91 100 KT10
     I                                      101 110 KT11
     I                                      111 120 KT12
     I                                      121 130 KT13
     I                                      131 140 KT14
     I                                      141 150 KT15
     I            DS
     I                                        1 150 NM
     I                                        1  10 NM01
     I                                       11  20 NM02
     I                                       21  30 NM03
     I                                       31  40 NM04
     I                                       41  50 NM05
     I                                       51  60 NM06
     I                                       61  70 NM07
     I                                       71  80 NM08
     I                                       81  90 NM09
     I                                       91 100 NM10
     I                                      101 110 NM11
     I                                      111 120 NM12
     I                                      121 130 NM13
     I                                      131 140 NM14
     I                                      141 150 NM15
     I            DS
     I                                        1  62 H@
     I                                        1   2 @1
     I                                        3   4 @2
     I                                        5   6 @3
     I                                        7   8 @4
     I                                        9  10 @5
     I                                       11  12 @6
     I                                       13  14 @7
     I                                       15  16 @8
     I                                       17  18 @9
     I                                       19  20 @10
     I                                       21  22 @11
     I                                       23  24 @12
     I                                       25  26 @13
     I                                       27  28 @14
     I                                       29  30 @15
     I                                       31  32 @16
     I                                       33  34 @17
     I                                       35  36 @18
     I                                       37  38 @19
     I                                       39  40 @20
     I                                       41  42 @21
     I                                       43  44 @22
     I                                       45  46 @23
     I                                       47  48 @24
     I                                       49  50 @25
     I                                       51  52 @26
     I                                       53  54 @27
     I                                       55  56 @28
     I                                       57  58 @29
     I                                       59  60 @30
     I                                       61  62 @31
     I            DS
     I                                        1  620H@@
     I                                        1   20@@1
     I                                        3   40@@2
     I                                        5   60@@3
     I                                        7   80@@4
     I                                        9  100@@5
     I                                       11  120@@6
     I                                       13  140@@7
     I                                       15  160@@8
     I                                       17  180@@9
     I                                       19  200@@10
     I                                       21  220@@11
     I                                       23  240@@12
     I                                       25  260@@13
     I                                       27  280@@14
     I                                       29  300@@15
     I                                       31  320@@16
     I                                       33  340@@17
     I                                       35  360@@18
     I                                       37  380@@19
     I                                       39  400@@20
     I                                       41  420@@21
     I                                       43  440@@22
     I                                       45  460@@23
     I                                       47  480@@24
     I                                       49  500@@25
     I                                       51  520@@26
     I                                       53  540@@27
     I                                       55  560@@28
     I                                       57  580@@29
     I                                       59  600@@30
     I                                       61  620@@31
      ***    かんばん発行日用    ***
      ***  S.OHTAKE   1994.OCT.17  ***
     I            DS
     I                                        1 124 H@@@
     I                                        1   4 @@@1
     I                                        5   8 @@@2
     I                                        9  12 @@@3
     I                                       13  16 @@@4
     I                                       17  20 @@@5
     I                                       21  24 @@@6
     I                                       25  28 @@@7
     I                                       29  32 @@@8
     I                                       33  36 @@@9
     I                                       37  40 @@@10
     I                                       41  44 @@@11
     I                                       45  48 @@@12
     I                                       49  52 @@@13
     I                                       53  56 @@@14
     I                                       57  60 @@@15
     I                                       61  64 @@@16
     I                                       65  68 @@@17
     I                                       69  72 @@@18
     I                                       73  76 @@@19
     I                                       77  80 @@@20
     I                                       81  84 @@@21
     I                                       85  88 @@@22
     I                                       89  92 @@@23
     I                                       93  96 @@@24
     I                                       97 100 @@@25
     I                                      101 104 @@@26
     I                                      105 108 @@@27
     I                                      109 112 @@@28
     I                                      113 116 @@@29
     I                                      117 120 @@@30
     I                                      121 124 @@@31
     I            DS
     I                                        1  10 WKB
     I                                        1   3 WKOTE
     I                                        5   5 WHI
     I                                        7  10 WBUMO
     I            DS
     I                                        1  10 HNM
     I                                        1  10 WNAME
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80WYMD
     I                                        1   60WYM
     I                                        1   40WYY
     I                                        5   60WMM
     I            DS
     I                                        1   2 W0E0F
     I                                        1   1 W0E
     I                                        2   2 W0F
     I            DS
     I                                        1  14 @HIN
     I                                        1   5 IHIN1
     I                                        6   6 IH1
     I                                        7  11 IHIN2
     I                                       12  12 IH2
     I                                       13  14 IHIN3
     I            DS
     I                                        1   80XYMD
     I                                        1   40XYY
     I                                        5   60XMM
      *
     C           KEY1      KLIST
     C                     KFLD           IHIN1
     C                     KFLD           IHIN2
     C                     KFLD           IHIN3
      *
     C           KEY2      KLIST
     C                     KFLD           WYY
     C                     KFLD           WMM
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
      *
     C                     TIME           @TIME   60
      *
     C           *IN75     IFEQ '0'
     C                     SETON                     75
     C                     MOVE *ALL'-'   WLAIN
      *
     C                     MOVE *BLANK    PUSNM  15
     C                     CALL 'APLR00'
     C                     PARM           PUS
     C                     PARM           PUSNM
     C                     MOVELPUSNM     WUSNM  11
      *
     C                     END
      *
     C*区分*
     C           *INL1     IFEQ '1'
     C                     Z-ADD0         WRECD
      *
     C                     SETOF                     01
     C                     Z-ADD1         A       20
     C           IKUBN     LOKUPKB1,A                    01
     C           *IN01     IFEQ '1'
     C                     MOVE KB2,A     @KUBN
     C                     END
     C                     END
      *
     C           *INL1     IFEQ '1'
     C           *IN90     OREQ '1'
     C   90                WRITEBTAPR036
     C                     SETOF                     90
     C                     WRITEBTAPR031
     C                     END
      *
     C                     ADD  1         WRECD
     C                     MOVE '-'       IH1
     C                     MOVE '-'       IH2
      *
     C*得意先*
     C                     SETOF                     01
     C                     MOVE *BLANK    @TKNM
     C           ITOKU     CHAINFGBPL011             01
     C           *IN01     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
     C           *IN01     IFEQ '0'
     C                     MOVE B2KEMI    @TKNM
     C                     END
      *
     C*納入先*
     C                     SETOF                     01
     C                     MOVE *BLANK    @NNNM
     C           INONY     CHAINFGBPL011             01
     C           *IN01     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
     C           *IN01     IFEQ '0'
     C                     MOVE B2KEMI    @NNNM
     C                     END
      *
     C*収容数
     C                     SETON                     01
     C                     Z-ADD0         WBARL
     C           KEY1      CHAINAGAPL311             01
     C           *IN01     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
     C           *IN01     IFEQ '0'
     C                     Z-ADDCBBARL    WBARL
     C                     Z-ADDCBSYUY    IKSYUY
     C                     END
      *
     C                     EXSR $KT
     C                     EXSR $DAY
      *
     CLR 30                WRITEBTAPR036
      *
     C*****************************************************************
     C*                   工程マスター
     C*****************************************************************
     C           $KT       BEGSR
      *
     C                     MOVE *BLANK    KT
     C                     MOVE *BLANK    NM
     C                     MOVE *BLANK    WKB
     C                     SETOF                     11
     C           KEY1      CHAINAAMPL111             11
     C           *IN11     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     11
     C                     END
     C           *IN11     IFEQ '0'
      *
     C                     Z-ADD1         A
     C           1         DO   15        A
     C                     MOVEL#KI,A     WKIRI   80
     C           WKIRI     IFNE 0
      *
     C           WKIRI     IFGT *DATE
     C                     MOVE #KK,A     WKOTE
     C                     MOVE '-'       WHI
     C                     MOVE #KB,A     WBUMO
     C                     ELSE
     C                     MOVE #SK,A     WKOTE
     C                     MOVE '-'       WHI
     C                     MOVE #SB,A     WBUMO
     C                     END
      *
     C           WKOTE     IFNE *BLANK
     C                     MOVE WKB       KT,A
      *
     C                     SETOF                     12
     C                     MOVE WBUMO     WWBUMO  40
     C           WWBUMO    CHAINFGBPL011             12
     C           *IN12     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     END
     C           *IN12     IFEQ '0'
     C                     MOVELB2KEMI    WSMNM  10
     C                     MOVEAWSMNM     HNM
      *
     C                     Z-ADD1         B       20
     C                     Z-ADD11        C       20
     C                     MOVE '  '      W0E0F
     C           1         DO   10        B
     C                     SETOF                     13
     C                     SUB  1         C
     C           HNM,C     IFEQ W0F
     C                     SETON                     13
     C                     ELSE
     C           HNM,C     IFEQ W0E
     C                     SETON                     13
     C                     MOVE W0F       WNAME
     C                     END
     C                     END
     C  N13                END
      *
     C                     MOVE WNAME     NM,A
      *
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     MOVE KT01      @KA1
     C                     MOVE KT02      @KA2
     C                     MOVE KT03      @KA3
     C                     MOVE KT04      @KA4
     C                     MOVE NM01      @KB1
     C                     MOVE NM02      @KB2
     C                     MOVE NM03      @KB3
     C                     MOVE NM04      @KB4
     C                     SETON                     30
      ******************************************
      *   部品マスターより月間設定数の印刷   *
      *          1995/02/24  A.IDOTA           *
      ******************************************
     C                     SETOF                     85
     C                     Z-ADD0         @GEKN   90
     C           KEY1      CHAINFCEPL011             85
     C           *IN85     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C                     SETON                     85
     C                     END
     C           *IN85     IFEQ '0'
     C                     Z-ADDA2GEKN    @GEKN
     C                     END
      *------------*
      *設定数計算*
      *------------*
     C           KEY3      KLIST
     C                     KFLD           XYY
     C                     KFLD           XMM
     C*                    Z-ADD0         XYMD
     C*                    Z-ADD*DATE     XYMD
      *
     C*                    EXSR $KAD
      *
     C                     WRITEBTAPR032
      *
     C           KT05      IFNE *BLANK
     C                     MOVE KT05      @KA1
     C                     MOVE KT06      @KA2
     C                     MOVE KT07      @KA3
     C                     MOVE KT08      @KA4
     C                     MOVE NM05      @KB1
     C                     MOVE NM06      @KB2
     C                     MOVE NM07      @KB3
     C                     MOVE NM08      @KB4
     C                     WRITEBTAPR033
     C                     END
      *
     C           KT09      IFNE *BLANK
     C                     MOVE KT09      @KA1
     C                     MOVE KT10      @KA2
     C                     MOVE KT11      @KA3
     C                     MOVE KT12      @KA4
     C                     MOVE NM09      @KB1
     C                     MOVE NM10      @KB2
     C                     MOVE NM11      @KB3
     C                     MOVE NM12      @KB4
     C                     WRITEBTAPR033
     C                     END
      *
     C           KT13      IFNE *BLANK
     C                     MOVE KT13      @KA1
     C                     MOVE KT14      @KA2
     C                     MOVE KT15      @KA3
     C                     MOVE *BLANK    @KA4
     C                     MOVE NM13      @KB1
     C                     MOVE NM14      @KB2
     C                     MOVE NM15      @KB3
     C                     MOVE *BLANK    @KB4
     C                     WRITEBTAPR033
     C                     END
      *
     C                     ENDSR
      *
      *
     C*****************************************************************
     C*                   青山カレンダー
     C*****************************************************************
     C           $DAY      BEGSR
      *
     C                     Z-ADD*DATE     WYMD
      *
     C                     Z-ADD1         A
     C           1         DO   3         A
      * N+1
     C           A         IFEQ 2
     C           WMM       IFEQ 12
     C                     ADD  1         WYY
     C                     Z-ADD01        WMM
     C                     ELSE
     C                     ADD  1         WMM
     C                     END
     C                     END
      * N+2
     C           A         IFEQ 3
     C           WMM       IFEQ 12
     C                     ADD  1         WYY
     C                     Z-ADD01        WMM
     C                     ELSE
     C                     ADD  1         WMM
     C                     END
     C                     END
      *
      ******************************************************
      ***  APICS f]ﾌﾞ] ibfh ﾌｮﾃcﾍﾞ kｭcﾈb uﾇjｰ ･ READ ﾇﾓ  ***
      ***       UPDATE:1994.OCT.17   S.OHTAKE            ***
      ***    生産管理課　より　改善シートの依頼の為    ***
      ******************************************************
      *
     C                     SETOF                     77
     C           KEY1      CHAINBTAPL31              77
      *
     C           *IN77     IFEQ '1'
     C                     GOTO EXIT
     C                     END
      *
     C           *IN77     IFEQ '0'
     C           BTSKJY    IFEQ 'D'
     C           BTSKHZ    ANDLE*DATE
     C                     GOTO EXIT
     C                     END
     C                     END
      *
     C                     Z-ADD0         TBL
     C                     EXSR CHKRTN
      *
     C           EXIT      TAG
     C                     Z-ADD1         B
     C                     MOVE *BLANK    H@
     C                     Z-ADD0         H@@
     C                     MOVE *BLANK    H@@@             S.OHTAKE UPDAT
     C                     Z-ADD0         DAT     31
     C           KEY2      SETLLAGDPL121
      *
     C           1         DO   31        B
     C                     SETOF                     80
     C           KEY2      READEAGDPL121                 80
     C           *IN80     IFEQ '0'
      *
     C                     Z-ADDB         H@@,B
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     MOVE '**'      H@,B
     C                     GOTO ESC
     C                     END
     C                     END
      *
      ***  ﾌｮﾃc ﾇﾓ ﾑcﾍﾞ f    94.10.17  S.OHTAKE  ***
     C           *IN80     IFEQ '1'
     C                     GOTO ESC
     C                     END
      *
     C                     SETOF                     75
     C           F8YOBI    LOKUPTBL                      75
      *
     C           *IN75     IFEQ '0'
     C                     GOTO ESC
     C                     END
      *
      ***  ﾌｮﾃcﾍﾞ p ○ ･ ehﾓ !!  94.10.17  S.OHTAKE  ***
     C                     MOVE 'OK  '    H@@@,B
      *
     C           ESC       TAG
     C  N80                END
      *
     C           *IN77     IFEQ '1'
     C                     MOVE *BLANK    H@@@             S.OHTAKE UPDAT
     C                     END
     C           *IN77     IFEQ '0'
     C           BTSKJY    IFEQ 'D'
     C           BTSKHZ    ANDLE*DATE
     C                     MOVE *BLANK    H@@@             S.OHTAKE UPDAT
     C                     END
     C                     END
     C                     WRITEBTAPR034
      *
     C                     MOVE *BLANK    H@@@             S.OHTAKE UPDAT
     C                     END
      *
     C                     WRITEBTAPR035
      *
     C                     ENDSR
      *
      *******************************
      *   ＣＨＫＲＴＮ   START    *
      *******************************
     C           CHKRTN    BEGSR
      *
     C                     Z-ADD1         Z       10
     C           BTMOND    IFEQ '1'
     C                     MOVE 1         TBL,Z
     C                     ADD  1         Z
     C                     END
      *
     C           BTTUES    IFEQ '1'
     C                     MOVE 2         TBL,Z
     C                     ADD  1         Z
     C                     END
      *
     C           BTWEND    IFEQ '1'
     C                     MOVE 3         TBL,Z
     C                     ADD  1         Z
     C                     END
      *
     C           BTTHER    IFEQ '1'
     C                     MOVE 4         TBL,Z
     C                     ADD  1         Z
     C                     END
      *
     C           BTFRID    IFEQ '1'
     C                     MOVE 5         TBL,Z
     C                     ADD  1         Z
     C                     END
      *
     C           BTSTUR    IFEQ '1'
     C                     MOVE 6         TBL,Z
     C                     ADD  1         Z
     C                     END
      *
     C           BTSUND    IFEQ '1'
     C                     MOVE 7         TBL,Z
     C                     END
      *
     C                     ENDSR
      *
     C*--------------------------*
     C*  ..設定月の稼動日数..  *
     C*--------------------------*
     C           $KAD      BEGSR
     C                     Z-ADD0         $KCD    31
     C           KEY3      SETLLAGDPL221
      *
     C                     DO   *HIVAL
     C                     SETOF                     30
     C           KEY3      READEAGDPL221                 30
     C           *IN30     IFEQ '0'
      *
     C           F8RIKB    IFEQ *BLANK
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         $KCD
     C                     ELSE
      *
     C                     ADD  0.5       $KCD
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C  N30                ENDDO
     C                     ENDSR
** HANDLING INSTRUCTION KB1/KB2
1 ORDER INPUT
2 ORDER CANCEL
3 ORDER CHANGE
