     H            Y.
     F*** BTAR61 ************************************************
     F* P/T    PLAN PUBLICATION M/F    LIST                     *
     F*      A.MAMIYA      2004.07.27                           *
     F************************************************* BTAR61 **
     FBTAWP60 IP  F     512            DISK
     FFCEPL01 IF  E           K        DISK
     FAKCPL01 IF  E           K        DISK
     FAKBPL04 IF  E           K        DISK
     FAAPTL01 IF  E           K        DISK
     FAANPL06 IF  E           K        DISK
     FFCEPL41 IF  E           K        DISK
     FFCEPL11 IF  E           K        DISK
     FBTAPL05 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FBTAWP61 O   F     512            DISK
     E                    TB1     1   4  8   TB2    21   SYSTEM NAME
     E                    #PH        31  3 0             +箱数BTAPL05
     E                    #MH        31  3 0             -箱数BTAPL05
     E                    WPH        31  3 0             +箱数
     E                    WMH        31  3 0             -箱数
     E                    WKA        31  1               稼働日
     IBTAWP60 AA  01
     I                                        1  12 ISHIN
     I                                        1   5 ISHN1
     I                                        6  10 ISHN2
     I                                       11  12 ISHN3
     I                                       13  160ISTYY
     I                                       17  180ISTMM
     I                                       13  180ISTYM
     I                                       19  200ISTDD
     I                                       21  240IEDYY
     I                                       25  260IEDMM
     I                                       21  260IEDYM
     I                                       27  280IEDDD
     I                                       29  29 IDATA
     I                                       30  30 ITOTL
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
     I            DS
     I                                        1   80L5SKHZ
     I                                        1   40L5SKYY
     I                                        5   60L5SKMM
     I                                        7   80L5SKDD
     I            DS
     I                                        1   80L5UKHZ
     I                                        1   40L5UKYY
     I                                        5   60L5UKMM
     I                                        7   80L5UKDD
     I            DS
     I                                        1   80L5STHZ
     I                                        1   40L5STYY
     I                                        5   60L5STMM
     I                                        7   80L5STDD
     I            DS
     I                                        1   80L7SKHZ
     I                                        1   40L7SKYY
     I                                        5   60L7SKMM
     I                                        7   80L7SKDD
     I            DS
     I                                        1   80L7UKHZ
     I                                        1   40L7UKYY
     I                                        5   60L7UKMM
     I                                        7   80L7UKDD
     I            DS
     I                                        1   80L7STHZ
     I                                        1   40L7STYY
     I                                        5   60L7STMM
     I                                        7   80L7STDD
     I            DS
     I                                        1   80L1SKHZ
     I                                        1   40L1SKYY
     I                                        5   60L1SKMM
     I                                        7   80L1SKDD
     I            DS
     I                                        1   80L1UKHZ
     I                                        1   40L1UKYY
     I                                        5   60L1UKMM
     I                                        7   80L1UKDD
     I            DS
     I                                        1   80L1STHZ
     I                                        1   40L1STYY
     I                                        5   60L1STMM
     I                                        7   80L1STDD
     I            DS
     I                                        1   80CKSKHZ
     I                                        1   40CKSKYY
     I                                        5   60CKSKMM
     I                                        7   80CKSKDD
     I            DS
     I                                        1   80BTSKHZ
     I                                        1   40BTSKYY
     I                                        5   60BTSKMM
     I                                        7   80BTSKDD
     I            DS
     I                                        1   80FCSKHZ
     I                                        1   40FCSKYY
     I                                        5   60FCSKMM
     I                                        7   80FCSKDD
     I            DS
     I                                        1   6 WTKRO
     I                                        1   1 WTKR1
     I                                        2   3 WTKR2
     I                                        4   5 WTKR3
     I                                        6   6 WTKR4
     I            DS
     I                                        1  18 WDT
     I                                        1   4 WTOKU
     I                                        5   5 WTKOJ
     I                                        6   9 WTUKE
     I                                       10  13 WNONY
     I                                       14  14 WNKOJ
     I                                       15  18 WNUKE
     I            DS
     I                                        1   60WSTYM
     I                                        1   40WSTYY
     I                                        5   60WSTMM
     I            DS
     I                                        1  93 #PH
     I                                        1   30BTPH01
     I                                        4   60BTPH02
     I                                        7   90BTPH03
     I                                       10  120BTPH04
     I                                       13  150BTPH05
     I                                       16  180BTPH06
     I                                       19  210BTPH07
     I                                       22  240BTPH08
     I                                       25  270BTPH09
     I                                       28  300BTPH10
     I                                       31  330BTPH11
     I                                       34  360BTPH12
     I                                       37  390BTPH13
     I                                       40  420BTPH14
     I                                       43  450BTPH15
     I                                       46  480BTPH16
     I                                       49  510BTPH17
     I                                       52  540BTPH18
     I                                       55  570BTPH19
     I                                       58  600BTPH20
     I                                       61  630BTPH21
     I                                       64  660BTPH22
     I                                       67  690BTPH23
     I                                       70  720BTPH24
     I                                       73  750BTPH25
     I                                       76  780BTPH26
     I                                       79  810BTPH27
     I                                       82  840BTPH28
     I                                       85  870BTPH29
     I                                       88  900BTPH30
     I                                       91  930BTPH31
     I            DS
     I                                        1  93 #MH
     I                                        1   30BTMH01
     I                                        4   60BTMH02
     I                                        7   90BTMH03
     I                                       10  120BTMH04
     I                                       13  150BTMH05
     I                                       16  180BTMH06
     I                                       19  210BTMH07
     I                                       22  240BTMH08
     I                                       25  270BTMH09
     I                                       28  300BTMH10
     I                                       31  330BTMH11
     I                                       34  360BTMH12
     I                                       37  390BTMH13
     I                                       40  420BTMH14
     I                                       43  450BTMH15
     I                                       46  480BTMH16
     I                                       49  510BTMH17
     I                                       52  540BTMH18
     I                                       55  570BTMH19
     I                                       58  600BTMH20
     I                                       61  630BTMH21
     I                                       64  660BTMH22
     I                                       67  690BTMH23
     I                                       70  720BTMH24
     I                                       73  750BTMH25
     I                                       76  780BTMH26
     I                                       79  810BTMH27
     I                                       82  840BTMH28
     I                                       85  870BTMH29
     I                                       88  900BTMH30
     I                                       91  930BTMH31
     IINFDSP     SDS
     I                                        1  10 PGMNM
     I                                      254 263 USID
     C*
     C           *ENTRY    PLIST
     C                     PARM           P@SYS   8
     C*
     C           KEY01     KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
     C*
     C           KEY02     KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
     C                     KFLD           ISTYM
      *
     C           KEY03     KLIST
     C                     KFLD           WKHN1
     C                     KFLD           WKHN2
     C                     KFLD           WKHN3
      *
     C           KEY04     KLIST
     C                     KFLD           WSTYY
     C                     KFLD           WSTMM
     C*
     C                     EXSR #SB000                     初期化
     C                     EXSR #SB100                     部品マスター
     C                     EXSR #SB200                     かんばんマスター
     C           P@SYS     IFEQ 'ATC     '
     C                     EXSR #SB300                     ＡＴＣ番地
     C                     END
     C                     EXSR #SB400                     ロット取得
     C                     EXSR #SB500                     計画発行
     C*-----------------------------------------------------------
     C*            初期化ルーチン
     C*-----------------------------------------------------------
     C           #SB000    BEGSR
     C                     Z-ADD0         WSSYS   70       収容数
     C                     MOVEL*BLANK    WTKRO   6        所番地
     C                     Z-ADD0         WSGEK   90       新月間設定数
     C                     Z-ADD0         WKGEK   90       旧月間設定数
     C                     Z-ADD0         WGEHZ   80       設定数切替日
     C                     Z-ADD0         WHIAT   90       日当設定数
     C                     Z-ADD0         @SGEK   90
     C                     Z-ADD0         @SKAD   31
     C                     Z-ADD0         @KGEK   90
     C                     Z-ADD0         @KKAD   31
     C                     MOVEL*BLANK    WSEIH   1        製品区分
     C                     Z-ADD0         WLOT    30       ロット
      *
     C                     Z-ADD1         #A      20
     C           P@SYS     LOKUPTB1,#A                   20
     C           *IN20     IFEQ *ON
     C                     MOVELTB2,#A    WDT    18
     C                     MOVE TB2,#A    WKADO   31
     C                     ELSE
     C                     MOVEL*BLANK    WDT
     C                     Z-ADD0         WKADO
     C                     ENDIF
      *
     C           ESB000    ENDSR
     C*-----------------------------------------------------------
     C*            部品マスターからデータ取得
     C*-----------------------------------------------------------
     C           #SB100    BEGSR
      *
     C                     SETOF                     20
     C           KEY01     CHAINFCEPL011             20
     C           *IN20     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     ELSE
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYS    WSSYS
     C                     ELSE
     C                     MOVE A2SSYS    WSSYS
     C                     END
     C           A2TRHZ    IFGT *DATE
     C                     MOVE A2KTRK    WTKR1
     C                     MOVE A2KTRT    WTKR2
     C                     MOVE A2KTRR    WTKR3
     C                     MOVE A2KTRD    WTKR4
     C                     ELSE
     C                     MOVE A2STRK    WTKR1
     C                     MOVE A2STRT    WTKR2
     C                     MOVE A2STRR    WTKR3
     C                     MOVE A2STRD    WTKR4
     C                     END
     C                     EXSR #SB600
     C           WKADO     IFNE 0
     C           WSGEK     DIV  WKADO     WHIAT
     C                     END
     C                     GOTO ESB100
     C                     END
     C                     END
      *
     C                     SETOF                     20
     C           KEY01     CHAINAKCPL011             20
     C           *IN20     IFEQ '0'
     C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     ELSE
     C           M1SYHZ    IFGT *DATE
     C                     Z-ADDM1KSYS    WSSYS
     C                     ELSE
     C                     Z-ADDM1SSYS    WSSYS
     C                     END
     C                     Z-ADDM1GEKN    WSGEK
     C           WKADO     IFNE 0
     C           WSGEK     DIV  WKADO     WHIAT
     C                     END
     C                     END
     C                     END
     C*
     C           ESB100    ENDSR
     C*-----------------------------------------------------------
     C*          かんばんマスターからデータ取得
     C*-----------------------------------------------------------
     C           #SB200    BEGSR
     C*完成品かんばんマスター
     C                     SETOF                     20
     C           KEY01     SETGTAAPTL011
     C                     DO   *HIVAL
     C           KEY01     REDPEAAPTL011                 20
     C           *IN20     IFEQ '0'
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
     C           L5UKHZ    IFGT *DATE
     C                     ITER
     C                     END
     C           L5STHZ    IFLE *DATE
     C                     ITER
     C                     END
     C                     Z-ADDL5SYOS    WSSYS
     C                     MOVE L5TKR1    WTKR1
     C                     MOVE L5TKR2    WTKR2
     C                     MOVE L5TKR3    WTKR3
     C                     MOVE L5TKR4    WTKR4
     C                     MOVE '0'       WSEIH
     C                     GOTO ESB200
     C                     END
     C  N20                ENDDO
      *構成品かんばんマスター
     C                     SETOF                     20
     C           KEY01     SETLLAKBPL041                 20
     C                     DO   *HIVAL
     C           KEY01     READEAKBPL041                 20
     C           *IN20     IFEQ '0'
     C           L1SKJY    IFEQ 'D'
     C           L1SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
     C           L1UKHZ    IFGT *DATE
     C                     ITER
     C                     END
     C           L1STHZ    IFLE *DATE
     C                     ITER
     C                     END
     C                     Z-ADDL1SYOS    WSSYS
     C                     MOVE L1TKR1    WTKR1
     C                     MOVE L1TKR2    WTKR2
     C                     MOVE L1TKR3    WTKR3
     C                     MOVE L1TKR4    WTKR4
     C                     MOVE '3'       WSEIH
     C                     GOTO ESB200
     C                     END
     C  N20                ENDDO
      *半製品かんばんマスター
     C                     SETOF                     20
     C           KEY01     SETLLAANPL061                 20
     C                     DO   *HIVAL
     C           KEY01     READEAANPL061                 20
     C           *IN20     IFEQ '0'
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
     C           L7UKHZ    IFGT *DATE
     C                     ITER
     C                     END
     C           L7STHZ    IFLE *DATE
     C                     ITER
     C                     END
     C                     Z-ADDL7SYOS    WSSYS
     C                     MOVE L7TKR1    WTKR1
     C                     MOVE L7TKR2    WTKR2
     C                     MOVE L7TKR3    WTKR3
     C                     MOVE L7TKR4    WTKR4
     C                     MOVE '6'       WSEIH
     C                     GOTO ESB200
     C                     END
     C  N20                ENDDO
     C*
     C           ESB200    ENDSR
     C*-----------------------------------------------------------
     C*          ＡＴＣ専用ルーチン
     C*-----------------------------------------------------------
     C           #SB300    BEGSR
     C*
     C                     MOVEL*BLANK    WKOTI   3
     C                     Z-ADD0         WKIHZ   80
     C                     SETOF                     20
     C           KEY01     CHAINAAMPL11              20
     C           *IN20     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELCKKO01    WKOTI
     C                     MOVELCKHZ01    WKIHZ
     C           WKOTI     IFEQ 'HN '
     C                     MOVEL'6'       WSEIH
     C                     END
     C           WSEIH     IFEQ '3'
     C           WKIHZ     IFGT *DATE
     C                     MOVE CKQT01    WTKRO
     C                     ELSE
     C                     MOVE CKNB01    WTKRO
     C                     END
     C                     END
     C                     END
     C                     END
     C*工場の設定
     C           WTKR1     IFEQ 'R'
     C                     MOVEL'2'       WNKOJ
     C                     END
     C*
     C           ESB300    ENDSR
     C*-----------------------------------------------------------
     C*          後工程ロット取得
     C*-----------------------------------------------------------
     C           #SB400    BEGSR
     C*
     C           WSEIH     IFEQ '6'
     C                     MOVELISHN1     WKHN1   5
     C                     MOVELISHN2     WKHN2   5
     C                     MOVELISHN3     WKHN3   2
      *
     C                     SETOF                     20
     C           KEY01     CHAINFCEPL41              20
     C           *IN20     IFEQ '0'
     C           F4GSKD    IFEQ 'D'
     C           F4GSDT    ANDLE*DATE
     C                     ELSE
     C                     MOVELF4PRT1    WKHN1
     C                     MOVELF4PRT2    WKHN2
     C                     MOVELF4PRT3    WKHN3
     C                     END
     C                     END
      *半製品かんばんマスター
     C                     SETOF                     20
     C           KEY03     SETLLAANPL061                 20
     C                     DO   *HIVAL
     C           KEY03     READEAANPL061                 20
     C           *IN20     IFEQ '0'
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
     C           L7UKHZ    IFGT *DATE
     C                     ITER
     C                     END
     C           L7STHZ    IFLE *DATE
     C                     ITER
     C                     END
     C                     Z-ADDL7HITO    WLOT
     C                     GOTO ESB400
     C                     END
     C  N20                ENDDO
     C*
     C                     END
     C*
     C           ESB400    ENDSR
     C*-----------------------------------------------------------
     C*          計画発行データ出力
     C*-----------------------------------------------------------
     C           #SB500    BEGSR
      *
     C           KEY02     SETLLBTAPL051
     C                     SETOF                     20
     C                     DO   *HIVAL
     C           KEY01     READEBTAPL051                 20
     C           *IN20     IFEQ '0'
     C           BTSKJY    IFEQ 'D'
     C           BTSKHZ    ANDLE*DATE
     C                     ELSE
     C           BTKEYM    IFGT IEDYM
     C                     LEAVE
     C                     END
      *
     C                     Z-ADD0         WPH
     C                     Z-ADD0         WMH
     C                     Z-ADD1         #A      20
     C                     Z-ADD31        #B      20
     C                     Z-ADD0         #C      20
     C                     Z-ADDBTKEYM    WSTYM
     C           BTKEYM    IFEQ ISTYM
     C                     Z-ADDISTDD     #A
     C                     END
     C           BTKEYM    IFEQ IEDYM
     C                     Z-ADDIEDDD     #B
     C                     END
     C           #A        DO   #B        #A
     C           #PH,#A    IFEQ 0
     C           #MH,#A    ANDEQ0
     C                     ELSE
     C                     Z-ADD#PH,#A    WPH,#A
     C                     Z-ADD#MH,#A    WMH,#A
     C                     END
     C                     ENDDO
      *
     C                     SETOF                     21
     C           KEY04     SETLLAGDPL12
     C                     DO   *HIVAL
     C           KEY04     READEAGDPL12                  21
     C           *IN21     IFEQ '0'
     C                     Z-ADDF8KADD    #C
     C                     MOVELF8HIRU    WKA,#C
     C                     END
     C  N21                ENDDO
      *
     C                     EXSR #RGA
      *
     C                     EXCPTDT
     C                     END
     C                     END
     C  N20                ENDDO
      *
     C           ESB500    ENDSR
     C*-----------------------------------------------------------
     C*
     C*-----------------------------------------------------------
     C           #RGA      BEGSR
     C           APLR00    PLIST
     C                     PARM           R@US   10
     C                     PARM           R@USNM 15
     C                     MOVELUSID      R@US
     C                     MOVEL*BLANK    R@USNM
     C                     CALL 'APLR00'  APLR00
     C           ERGA      ENDSR
     C*-----------------------------------------------------------
     C*          月間必要数取得
     C*-----------------------------------------------------------
     C           #SB600    BEGSR
      *
     C                     SETOF                     20
     C           KEY01     CHAINFCEPL111             20
     C           *IN20     IFEQ '0'
     C           FCSKJY    IFEQ 'D'
     C           FCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDFCGK01    @SGEK
     C                     Z-ADDFCCD01    @SKAD
     C           @SKAD     IFNE 0
     C           @SGEK     DIV  @SKAD     WSGEK
     C                     MULT 20        WSGEK
     C                     ELSE
     C                     Z-ADD@SGEK     WSGEK
     C                     END
     C                     Z-ADDFCGK02    @KGEK
     C                     Z-ADDFCCD02    @KKAD
     C           @KKAD     IFNE 0
     C           @KGEK     DIV  @KKAD     WKGEK
     C                     MULT 20        WKGEK
     C                     ELSE
     C                     Z-ADD@KGEK     WKGEK
     C                     END
     C                     Z-ADDFCGH01    WGEHZ
     C                     END
     C                     END
      *
     C           ESB600    ENDSR
     OBTAWP61 E                DT
     O                         WDT       18
     O                         ISHIN     30
     O                         WTKRO     36
     O                         WSGEK     45
     O                         WKGEK     54
     O                         WGEHZ     62
     O                         WHIAT     71
     O                         WSSYS     78
     O                         WLOT      81
     O                         IDATA     82
     O                         ITOTL     83
     O                         BTKEYM    89
     O                         WPH      182
     O                         WMH      275
     O                         WKA      306
     O                         R@USNM   321
**  TBL
IAF     0111     0111100  200
ATC     0002     0094100  250
ACZ     0170     0170100  200
IAFAYM  3174     3174G30  200
