     H            Y.
     F** BTBR41 *******************************
     F* INQUIRY OF IMPORT ADJUSTMENT FILE     *
     F*      A.MAMIYA        2000.10.13       *
     F* TCHK1 01/01/08 CHG 0002 TO 8990       *
     F* TCHK2 02/12/10 CHG 'D' --> DELET      *
     F******************************* BTBR41 **
     FBTBPW41 CF  E                    WORKSTN
     FBTBPP41 UF  E           K        DISK                      A
     FIZAPL01 IF  E           K        DISK
     FIZBPL01 IF  E           K        DISK
     E                    ER      1  20 60
     E                    #KOKB   1   3  1   #KONM  10
     I            DS
     I                                        1   80B4SKHZ
     I                                        1   40B4SKYY
     I                                        5   60B4SKMM
     I                                        7   80B4SKDD
     I            DS
     I                                        1   80B4KOHZ
     I                                        1   40B4KOYY
     I                                        5   60B4KOMM
     I                                        7   80B4KODD
     I            DS
     I                                        1   60B4KOTI
     I                                        1   20B4KOHH
     I                                        3   40B4KOSS
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
     I            DS
     I                                        1   80ZDSKHZ
     I                                        1   40ZDSKYY
     I                                        5   60ZDSKMM
     I                                        7   80ZDSKDD
     I            DS
     I                                        1   80ZCUKHZ
     I                                        1   40ZCUKYY
     I                                        5   60ZCUKMM
     I                                        7   80ZCUKDD
     I            DS
     I                                        1   80ZCSTHZ
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
     I            DS
     I                                        1   80ZDUKHZ
     I                                        1   40ZDUKYY
     I                                        5   60ZDUKMM
     I                                        7   80ZDUKDD
     I            DS
     I                                        1   80ZDSTHZ
     I                                        1   40ZDSTYY
     I                                        5   60ZDSTMM
     I                                        7   80ZDSTDD
      ****************
      *    PARM      *
      ****************
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *--------*
      *初期化*
      *--------*
     C           @STP0     TAG
     C                     MOVE *BLANK    @KOKB
     C                     MOVE *BLANK    @ZAIS
     C                     Z-ADD0         @ZAIK
     C                     MOVEL'W'       @PTCD
     C                     Z-ADD0111      @UKEI
TCHK1C*                    Z-ADD0002      @SIRE
TCHK1C                     Z-ADD8990      @SIRE
     C                     Z-ADD0         @MAIS
     C                     MOVE *BLANK    MSG
      *--------*
      *画面１*
      *--------*
     C           @STP1     TAG
     C                     EXFMTBTBPW411
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     3399
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      ****************
      *   d[ｰkｩｮh    *
      ****************
     C           @KOKB     IFEQ *BLANK
     C                     MOVELER,1      MSG
     C                     SETON                     0199
     C                     GOTO @STP1
     C                     END
      *
     C           @KOKB     IFNE '0'
     C           @KOKB     ANDNE'1'
     C           @KOKB     ANDNE'2'
     C                     MOVELER,2      MSG
     C                     SETON                     0199
     C                     GOTO @STP1
     C                     END
      *
     C           @ZAIS     IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVELER,5      MSG
     C                     GOTO @STP1
     C                     END
     C           @ZAIK     IFEQ 0
     C                     SETON                     0399
     C                     MOVELER,08     MSG
     C                     GOTO @STP1
     C                     END
     C           @PTCD     IFNE 'W'
     C           @PTCD     ANDNE'R'
     C                     SETON                     0499
     C                     MOVELER,12     MSG
     C                     GOTO @STP1
     C                     END
     C           @PTCD     IFEQ 'W'
     C                     MOVEL'WIRE'    @TYPE
     C                     END
     C           @PTCD     IFEQ 'R'
     C                     MOVEL'ROD '    @TYPE
     C                     END
     C           @SIRE     IFEQ 0
     C                     SETON                     0599
     C                     MOVELER,09     MSG
     C                     GOTO @STP1
     C                     END
     C           @UKEI     IFEQ 0
     C                     SETON                     0699
     C                     MOVELER,10     MSG
     C                     GOTO @STP1
     C                     END
      *
     C           KEY1      KLIST
     C                     KFLD           @SIRE
     C                     KFLD           @UKEI
     C                     KFLD           @PTCD
     C                     KFLD           @ZAIS
     C                     KFLD           @ZAIK
      *
     C           KEY1      CHAINBTBPP411             10
     C           @KOKB     IFEQ '0'
     C           @KOKB     OREQ '1'
     C           *IN10     IFEQ '1'
     C                     MOVELER,3      MSG
     C                     SETON                     020304
     C                     SETON                     050699
     C                     GOTO @STP1
     C                     END
     C                     END
      *
     C           @KOKB     IFEQ '0'
     C           @KOKB     OREQ '1'
     C           *IN10     IFEQ '0'
     C           B4SKJY    IFEQ 'D'
     C           B4SKHZ    ANDLE*DATE
     C                     MOVELER,3      MSG
     C                     SETON                     020304
     C                     SETON                     050699
     C                     GOTO @STP1
     C                     END
     C                     END
     C                     END
      *
     C           @KOKB     IFEQ '2'
      *
     C           *IN10     IFEQ '0'
     C           B4SKJY    IFEQ 'D'
     C           B4SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELER,4      MSG
     C                     SETON                     020304
     C                     SETON                     050699
     C                     GOTO @STP1
     C                     END
     C                     END
      *
     C           KEY2      KLIST
     C                     KFLD           @ZAIS
     C                     KFLD           @ZAIK
     C                     KFLD           @UKEI
     C                     KFLD           @SIRE
      *
     C                     MOVEL*BLANK    @DATA   1
      *-------------*
      * WIRE KANBAN *
      *-------------*
     C           @PTCD     IFEQ 'W'
     C                     SETOF                     50
     C           KEY2      SETGTIZAPL011
     C                     DO   *HIVAL
     C           KEY2      REDPEIZAPL011                 50
      *
     C           *IN50     IFEQ '0'
     C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZCUKHZ    IFLE *DATE
     C           ZCSTHZ    ANDGT*DATE
     C                     MOVEL'*'       @DATA
     C                     END
     C                     END
     C                     END
     C  N50                ENDDO
      *
     C           @DATA     IFEQ *BLANK
     C                     SETON                     020304
     C                     SETON                     050699
     C                     MOVELER,13     MSG
     C                     GOTO @STP1
     C                     END
     C                     END
      *------------*
      * ROD KANBAN *
      *------------*
     C           @PTCD     IFEQ 'R'
     C                     SETOF                     50
     C           KEY2      SETGTIZBPL011
     C                     DO   *HIVAL
     C           KEY2      REDPEIZBPL011                 50
      *
     C           *IN50     IFEQ '0'
     C           ZDSKJY    IFEQ 'D'
     C           ZDSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZDUKHZ    IFLE *DATE
     C           ZDSTHZ    ANDGT*DATE
     C                     MOVEL'*'       @DATA
     C                     END
     C                     END
     C                     END
     C  N50                ENDDO
      *
     C           @DATA     IFEQ *BLANK
     C                     SETON                     020304
     C                     SETON                     050699
     C                     MOVELER,14     MSG
     C                     GOTO @STP1
     C                     END
     C                     END
      *
     C                     END
      *--------*
      *画面２*
      *--------*
     C           @KOKB     IFEQ '0'
     C                     SETON                     33
     C                     END
     C           @KOKB     IFEQ '0'
     C           @KOKB     OREQ '1'
     C                     Z-ADDB4MAIS    @MAIS
     C                     END
      *
     C                     SETOF                     11
     C                     Z-ADD1         A       20
     C           @KOKB     LOKUP#KOKB,A                  11
     C           *IN11     IFEQ '1'
     C                     MOVE #KONM,A   @KONM
     C                     END
      *
     C           @STP2     TAG
     C                     EXFMTBTBPW412
     C                     SETOF                     010203
     C                     SETOF                     99
      *-------*
      * CMD-3 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO @STP0
     C                     END
      *
     C           @MAIS     IFEQ 0
     C                     MOVELER,6      MSG
     C                     SETON                     0399
     C                     GOTO @STP2
     C                     END
     C           @MAIS     IFLE 0
     C                     MOVELER,07     MSG
     C                     SETON                     0399
     C                     GOTO @STP2
     C                     END
      *-------*
      * CMD-5 *
      *-------*
     C           *INKE     IFEQ '0'
     C                     GOTO @STP2
     C                     END
      *------*
      *取消*
      *------*
     C           @KOKB     IFEQ '0'
TCHK2C*                    MOVEL'D'       B4SKJY
TCHK2C*                    Z-ADD*DATE     B4SKHZ
TCHK2C*                    TIME           B4KOTI
TCHK2C*                    MOVELUS        B4KOME
TCHK2C                     DELETBTBPP411
TCHK2C                     GOTO @STP0
     C                     END
      *------------*
      *変更・追加*
      *------------*
     C           @KOKB     IFEQ '1'
     C           @KOKB     OREQ '2'
     C                     MOVE *BLANK    B4SKJY
     C                     Z-ADD0         B4SKHZ
     C                     Z-ADD*DATE     B4KOHZ
     C                     TIME           B4KOTI
     C                     MOVELUS        B4KOME
     C                     MOVEL@MAIS     B4MAIS
     C                     END
      *------*
      *更新*
      *------*
     C           *IN10     IFEQ '1'
     C                     MOVE @ZAIS     B4ZAIS
     C                     Z-ADD@ZAIK     B4ZAIK
     C                     MOVE @PTCD     B4PTCD
     C                     Z-ADD@UKEI     B4UKEI
     C                     Z-ADD@SIRE     B4SIRE
     C                     WRITEBTBPP411
     C                     ELSE
     C                     UPDATBTBPP411
     C                     END
      *
     C                     GOTO @STP0
      *
**
E-01 INPUT UPDATE INSTRUCTION.
E-02 UPDATE INSTRUCTION IS WRONG.
E-03 THERE IS NOT DATA INPUT INTO IN ADJUSTMENT M/F.
E-04 THERE IS DATA.
E-05 INPUT WIRE.
E-06 INPUT KANBAN OF MINUS ADJUSTMEN.
E-07 ERROR
E-08 INPUT WIRE DIAMETER.
E-09 INPUT SUPPLIER CODE.
E-10 INPUT RECEIVING CODE.
E-11
E-12 INPUT PARTS CDOE IS DIFFERENT.
E-13 THIS DATA IS NOT IN WIRE KANBAN MASTER FILE.
E-14 THIS DATA IS NOT IN ROD KANBAN MASTER FILE.
**  #KOKB/#KONM
00-CANCEL
11-CHANGE
22-ADD
