     H            Y.
     F*** BTBR85 ************************************************
     F* WIRE ORDER ADJUST PLAN BATCH UPDATE                     *
     F*    SHIMAZU.          2015.04.24                         *
     F***********************************************************
     FBTBWP85 IP  F    9999            DISK
     FBTBPP85 O   E                    DISK
     FBTBPP8Y UF  E           K        DISK                      A
     E                    I@D      9999  1
     E                    PHZ      9999  8 0
     E                    MHZ      9999  8 0
     E                    HZ          8  1 0
     E                    SU          8  1
     E                    ZAS        15  1
     E                    ZAK         6  1
     E                    SIR         4  1
     E                    O@S         8  1 0
     IBTBWP85 AA  01
     I                                        19999 I@D
     I            DS
     I                                        1   80HZ
     I                                        1   80WHZ
     I            DS
     I                                        1   8 SU
     I                                        1   8 WSU
     I            DS
     I                                        1  15 ZAS
     I                                        1  15 WZAIS
     I            DS
     I                                        1   6 ZAK
     I                                        1   6 WZAIK
     I            DS
     I                                        1   4 SIR
     I                                        1   4 WSIRE
     I            DS
     I                                        1   80O@S
     I                                        1   8 O@A
     I            DS
     I                                        1  12 OHIN
     I                                        1   5 OHIN1
     I                                        6  10 OHIN2
     I                                       11  12 OHIN3
      *
     I            DS
     I                                        1   80W@HIZ
     I                                        1   60W@YM
     I                                        7   80W@DD
      *
     C           KEYHIN    KLIST
     C                     KFLD           K#CGYM  60
     C                     KFLD           #KZAIS 15
     C                     KFLD           #KZAIK  52
     C                     KFLD           #KSIRE  40
     C                     KFLD           K#CGDD  20
      *
     C                     ADD  1         @CNT    40
     C           @CNT      IFEQ 1
     C                     EXSR #CUTH
     C                     ELSE
     C                     EXSR #CUTD
     C                     END
     C*----------------------------------------------------------------
     C           #CUTH     BEGSR
     C*初期化
     C                     Z-ADD0         @A      50       READ fc]n
     C                     Z-ADD0         @N      50       ﾎﾞ[]h fc]n
     C                     Z-ADD0         @B      50       f]u fc]n
     C                     Z-ADD0         @P      50       ﾎﾟ[ﾇ fc]n
     C                     Z-ADD0         @M      50       uboﾇ fc]n
     C                     Z-ADD0         @I      50       ﾍlﾞibnﾞcfc]n
     C                     Z-ADD0         WHZ
     C                     SETOF                     55    uboﾇ ﾎ[hﾞ
      *
     C           1         DO   2048      @A
      * f]u検知
S1   C           I@D,@A    IFEQ ','
     C                     Z-ADD0         @N
     C                     ADD  1         @B
 S2  C           @B        IFGE 4
  S3 C           WHZ       IFNE 0
   S4C           *IN55     IFEQ '0'
     C                     ADD  1         @P
     C                     Z-ADDWHZ       PHZ,@P
   X4C                     ELSE
     C                     ADD  1         @M
     C                     Z-ADDWHZ       MHZ,@M
   E4C                     END
  E3 C                     END
     C                     Z-ADD0         @I
     C                     Z-ADD0         HZ
 E2  C                     END
     C                     ITER
E1   C                     END
      * uboﾇ検知
S1   C           I@D,@A    IFEQ '@'
     C                     SETON                     55
     C                     ITER
E1   C                     END
      * ﾎﾞ[]h検知ﾎﾞ[]h 10個でライン処理終了
S1   C           I@D,@A    IFEQ ' '
     C                     ADD  1         @N
 S2  C           @N        IFGE 10
     C                     LEAVE
 E3  C                     END
X1   C                     ELSE
      *日付格納
     C           @B        IFGE 3
     C                     ADD  1         @I
     C                     MOVE I@D,@A    HZ,@I
     C                     END
E1   C                     END
      *
     C                     ENDDO
      *最後がf]uでなかった時の強制出力
     C           WHZ       IFNE 0
  S3 C           *IN55     IFEQ '0'
     C                     ADD  1         @P
     C                     Z-ADDWHZ       PHZ,@P
  X3 C                     ELSE
     C                     ADD  1         @M
     C                     Z-ADDWHZ       MHZ,@M
  E3 C                     END
     C                     END
      *
     C           ECUTH     ENDSR
      *----------------------------------------------------------------
     C           #CUTD     BEGSR
      *初期化
     C                     Z-ADD0         @A      50       READ fc]n
     C                     Z-ADD0         @N      50       ﾎﾞ[]h fc]n
     C                     Z-ADD0         @B      50       f]u fc]n
     C                     Z-ADD0         @P      50       ﾎﾟ[ﾇ fc]n
      * '@'の次もfc]nしてしまう為-1を格納
     C                     Z-ADD-1        @M      50       uboﾇ fc]n
     C                     Z-ADD0         @I      50       ﾍ]ﾌﾞ]bnﾞcfc]n
     C                     SETOF                     55
     C                     MOVE *BLANK    ZAS
     C                     MOVE *BLANK    OZAIS  15
     C                     MOVE *BLANK    ZAK
     C                     MOVE *BLANK    OZAIK   6
     C                     MOVE *BLANK    SIR
     C                     MOVE *BLANK    OSIRE   4
     C                     MOVE *BLANK    WSU
     C*
     C           1         DO   2048      @A
      * f]u検知
S1   C           I@D,@A    IFEQ ','
     C                     Z-ADD0         @N
     C                     ADD  1         @B
 S2  C           @B        IFEQ 1                          材質取得
     C                     MOVE WZAIS     OZAIS
     C                     Z-ADD0         @I
 E2  C                     END
 S2  C           @B        IFEQ 2                          材径取得
     C                     MOVE WZAIK     OZAIK
     C                     Z-ADD0         @I
 E2  C                     END
 S2  C           @B        IFEQ 3                          仕入先取得
     C                     MOVE WSIRE     OSIRE
     C                     Z-ADD0         @I
 E2  C                     END
 S2  C           @B        IFGE 4                          数量取得
  S3 C           *IN55     IFEQ '0'
     C                     ADD  1         @P
  X3 C                     ELSE
     C                     ADD  1         @M
  E3 C                     END
  S  C           WSU       IFNE *BLANK
     C                     EXSR #OUT
  E  C                     END
     C                     Z-ADD0         @I
     C                     MOVE *BLANK    WSU
 E2  C                     END
     C                     ITER
E1   C                     END
      * uboﾇ検知
S1   C           I@D,@A    IFEQ '@'
     C                     SETON                     55
     C                     ITER
E1   C                     END
      * ﾎﾞ[]h検知ﾎﾞ[]h 10個でライン処理終了
S1   C           I@D,@A    IFEQ ' '
     C                     ADD  1         @N
 S2  C           @N        IFGE 10
     C                     LEAVE
 E3  C                     END
X1   C                     ELSE
      *数のセット
     C           @B        IFGE 3
     C                     ADD  1         @I
     C                     MOVE I@D,@A    SU,@I
     C                     ELSE
     C                     SELEC
     C           @B        WHEQ 0
     C*材質のセット
     C                     ADD  1         @I
     C                     MOVE I@D,@A    ZAS,@I
     C           @B        WHEQ 1
     C*材径のセット
     C**         I@D,@A    IFNE '.'
     C                     ADD  1         @I
     C                     MOVE I@D,@A    ZAK,@I
     C**                   ENDIF
     C           @B        WHEQ 2
     C*仕入先のセット
     C                     ADD  1         @I
     C                     MOVE I@D,@A    SIR,@I
     C                     ENDSL
      *
     C                     END
E1   C                     END
     C*
     C                     ENDDO
      *最後がf]uでなかった時の強制出力
     C           WSU       IFNE *BLANK
  S3 C           *IN55     IFEQ '0'
     C                     ADD  1         @P
     C                     EXSR #OUT
  X3 C                     ELSE
     C                     ADD  1         @M
     C                     EXSR #OUT
  E3 C                     END
     C                     END
     C*
     C           ECUTD     ENDSR
      *
     C           #OUT      BEGSR
      *材質
     C                     MOVE *BLANK    BAZAIS
     C                     MOVE OZAIS     BAZAIS
      *材径
     C                     MOVEL'000'     XSEIS   3
     C                     MOVEL'00'      XSYOS   2
     C                     Z-ADD0         BAZAIK
     C                     Z-ADD0         IX      20
     C           '.'       SCAN OZAIK     IX
     C                     SELEC
      *小数点なし 11
     C           IX        WHEQ 0
     C                     EXSR #SB700
      *１桁目が小数点 .04
     C           IX        WHEQ 1
     C           2         SUBSTOZAIK:2   XSU2    2
     C                     MOVE XSU2      XSYOS
      *２桁目が小数点 9.04
     C           IX        WHEQ 2
     C           1         SUBSTOZAIK:1   XSU1    1
     C                     MOVE XSU1      XSEIS
     C           2         SUBSTOZAIK:3   XSU2    2
     C                     MOVE XSU2      XSYOS
      *３桁目が小数点 11.04
     C           IX        WHEQ 3
     C           2         SUBSTOZAIK:1   XSU2    2
     C                     MOVE XSU2      XSEIS
     C           2         SUBSTOZAIK:4   XSU2    2
     C                     MOVE XSU2      XSYOS
      *４桁目が小数点 111.04
     C           IX        WHEQ 4
     C           3         SUBSTOZAIK:1   XSU3    3
     C                     MOVE XSU3      XSEIS
     C           2         SUBSTOZAIK:5   XSU2    2
     C                     MOVE XSU2      XSYOS
     C                     OTHER
     C                     Z-ADD0         BAZAIK
     C                     ENDSL
     C                     MOVELXSEIS     BAZAIK
     C                     MOVE XSYOS     BAZAIK
      *仕入先
     C                     Z-ADD0         BASIRE
     C                     MOVE OSIRE     BASIRE
      *数量
     C                     MOVE *BLANK    O@A
     C                     Z-ADD8         @Z      20
     C                     Z-ADD8         @X      20
     C           1         DO   8
     C           SU,@Z     IFNE *BLANK
     C                     MOVE SU,@Z     O@S,@X
     C                     SUB  1         @X
     C                     END
     C                     SUB  1         @Z
     C                     ENDDO
     C                     MOVE O@A       O@SU    80
      *日付
     C                     Z-ADD0         BACGYM
     C                     Z-ADD0         BACGDD
     C                     Z-ADD0         BACASU
     C                     Z-ADD0         BACMSU
     C           *IN55     IFEQ '0'
     C                     Z-ADDPHZ,@P    W@HIZ
     C                     Z-ADDW@YM      BACGYM
     C                     Z-ADDW@DD      BACGDD
     C                     Z-ADDO@SU      BACASU
     C                     ELSE
     C                     Z-ADDMHZ,@M    W@HIZ
     C                     Z-ADDW@YM      BACGYM
     C                     Z-ADDW@DD      BACGDD
     C                     Z-ADDO@SU      BACMSU
     C                     END
     C                     Z-ADD0         SAKA1   10
     C*
     C                     WRITEBTBPP851
      *品番累計
     C                     MOVE BAZAIS    #KZAIS 15
     C                     MOVE BAZAIK    #KZAIK  52
     C                     MOVE BASIRE    #KSIRE  40
     C                     MOVE BACGYM    K#CGYM  60
     C                     MOVE BACGDD    K#CGDD  20
     C                     SETOF                     29
     C           KEYHIN    CHAINBTBPP8Y1             29
     C           *IN29     IFEQ '1'
     C                     MOVE BAZAIS    B@ZAIS
     C                     MOVE BAZAIK    B@ZAIK
     C                     MOVE BASIRE    B@SIRE
     C                     Z-ADDBACASU    B@CASU
     C                     Z-ADDBACMSU    B@CMSU
     C                     MOVE BACGYM    B@CGYM
     C                     MOVE BACGDD    B@CGDD
     C                     WRITEBTBPP8Y1
     C                     ELSE
     C                     ADD  BACASU    B@CASU
     C                     ADD  BACMSU    B@CMSU
     C                     UPDATBTBPP8Y1
     C                     END
     C           EOUT      ENDSR
      *----------------------------------------------------------------
     C           #SB700    BEGSR
      *
     C                     MOVEL'00'      XSU2    2
     C                     MOVE XSU2      XSYOS
      *
     C                     Z-ADD0         IX      20
     C           ' '       CHEKROZAIK     IX
     C                     SELEC
     C           IX        WHEQ 1
     C           1         SUBSTOZAIK:1   XSU1    1
     C                     MOVE XSU1      XSEIS
     C           IX        WHEQ 2
     C           2         SUBSTOZAIK:1   XSU2    2
     C                     MOVE XSU2      XSEIS
     C           IX        WHEQ 3
     C           3         SUBSTOZAIK:1   XSU3    3
     C                     MOVE XSU3      XSEIS
     C                     ENDSL
      *
     C           ESB700    ENDSR
