     H            Y.
     F*** BTBR87 ************************************************
     F* WIRE ORDER ADJUST PLAN BATCH UPDATE(CHECK DATA)         *
     F*    MAEDA.            2018.03.26                         *
     F***********************************************************
     FBTBPP85 IF  E                    DISK
     FIZAPL01 IF  E           K        DISK
     FIZBPL01 IF  E           K        DISK
     FBTBWP87 O   F     512            DISK                      A
     E                    CMT     1   2 73
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
     I            DS
     I                                        1   80ZDSKHZ
     I                                        1   40ZDSKYY
     I                                        5   60ZDSKMM
     I                                        7   80ZDSKDD
     I            DS
     I                                        1   80ZCUKHZ
     I                                        1   40ZCUKYY
     I                                        5   60ZCUKMM
     I                                        7   80ZCUKDD
     I            DS
     I                                        1   80ZCSTHZ
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
     I            DS
     I                                        1   80ZDUKHZ
     I                                        1   40ZDUKYY
     I                                        5   60ZDUKMM
     I                                        7   80ZDUKDD
     I            DS
     I                                        1   80ZDSTHZ
     I                                        1   40ZDSTYY
     I                                        5   60ZDSTMM
     I                                        7   80ZDSTDD
      *
     C                     MOVEL*BLANK    HDFL    1
     C                     READ BTBPP851                 80
     C           *IN80     DOWEQ'0'
     C           BAZAIK    IFEQ 0
     C                     EXSR #SB000
     C                     MOVEL*BLANK    W@ERR  30
     C                     MOVELCMT,1     W@ERR
     C                     EXCPTDT
     C                     ELSE
     C                     EXSR #SB100
     C                     ENDIF
     C                     READ BTBPP851                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *------------------------------------*
      * HEADER                             *
      *------------------------------------*
     CSR         #SB000    BEGSR
      *
     C           HDFL      IFEQ *BLANK
     C                     MOVEL'1'       HDFL
     C                     EXCPTHD
     C                     ENDIF
      *
     CSR         ESB000    ENDSR
      *------------------------------------*
      * IZAPP01  IZBPP01                   *
      *------------------------------------*
     CSR         #SB100    BEGSR
      *
     C           KEY1      KLIST
     C                     KFLD           @ZAIS  15
     C                     KFLD           @ZAIK   52
     C                     KFLD           @UKEI   40
     C                     KFLD           @SIRE   40
      *
     C                     MOVELBAZAIS    @ZAIS
     C                     Z-ADDBAZAIK    @ZAIK
     C                     Z-ADD0111      @UKEI
     C                     Z-ADDBASIRE    @SIRE
      *
     C                     MOVEL*BLANK    @DATA1  1
     C           KEY1      SETGTIZAPL011
     C           KEY1      REDPEIZAPL011                 50
     C           *IN50     DOWEQ'0'
     C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZCUKHZ    IFLE *DATE
     C           ZCSTHZ    ANDGT*DATE
     C                     MOVEL'*'       @DATA1
     C                     ENDIF
     C                     ENDIF
     C           KEY1      REDPEIZAPL011                 50
     C                     ENDDO
      *
     C                     MOVEL*BLANK    @DATA2  1
     C           KEY1      SETGTIZBPL011
     C           KEY1      REDPEIZBPL011                 50
     C           *IN50     DOWEQ'0'
     C           ZDSKJY    IFEQ 'D'
     C           ZDSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZDUKHZ    IFLE *DATE
     C           ZDSTHZ    ANDGT*DATE
     C                     MOVEL'*'       @DATA2
     C                     ENDIF
     C                     ENDIF
     C           KEY1      REDPEIZBPL011                 50
     C                     ENDDO
      *
     C           @DATA1    IFEQ *BLANK
     C           @DATA2    ANDEQ*BLANK
     C                     EXSR #SB000
     C                     MOVEL*BLANK    W@ERR  30
     C                     MOVELCMT,2     W@ERR
     C                     EXCPTDT
     C                     ENDIF
      *
     CSR         ESB100    ENDSR
      *
     OBTBWP87 EADD             HD
     O                                      'WIRE'
     O                                      ','
     O                                      'WIRE DIAMETER'
     O                                      ','
     O                                      'SUPPLIER CODE'
     O                                      ','
     O                                      'PLAN DATE'
     O                                      ','
     O                                      '="+ BOXES"'
     O                                      ','
     O                                      '="- BOXES"'
     O                                      ','
     O                                      'ERR'
     O                                      ','
     O        EADD             DT
     O                                      '="'
     O                         BAZAIS
     O                                      '"'
     O                                      ','
     O                         BAZAIK       ' 0 .  '
     O                                      ','
     O                                      '="'
     O                         BASIRE
     O                                      '"'
     O                                      ','
     O                         BACGYM
     O                         BACGDD
     O                                      ','
     O                         BACASU
     O                                      ','
     O                         BACMSU
     O                                      ','
     O                         W@ERR
     O                                      ','
** CMT
 WIRE DIAMETER = 0.
 NO KANBAN M/F.
