     H            Y.
     F** BTCR12 *********************************************
     F* UPDATE PT PLAN PUBLICATION MANAGEMENT M/F           *
     F*    ITS.             2013.11.14                      *
     F*******************************************************
     FBTCPL05 UF  E           K        DISK
     FBTCPL01 UF  E           K        DISK
     FBTCWP10 IF  E           K        DISK                      A
     FBTCWP11 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
     I                                        7  100SDATEY
     I                                       11  120SDATEM
     I                                       12  140SDATED
     I                                        1   20STIMEH
     I                                        3   40STIMEM
     I                                        5   60STIMES
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C                     TIME           WTIME
     C                     Z-ADD0         KKTRHZ  80
     C           KKTRHZ    READEBTCPL051                 80
     C           *IN80     DOWEQ'0'
     C           TTSKJY    IFEQ 'D'
     C           TTSKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #SB510
     C                     EXSR #SB500
     C                     Z-ADD*DATE     TTTRHZ
     C                     MOVEL'1'       TTTRN
     C                     UPDATBTCPL051
     C                     ENDIF
     C           KKTRHZ    READEBTCPL051                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * OUTPUT                                             *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C           KEYST     KLIST
     C                     KFLD           TTGRP
     C                     KFLD           TTSEQ
     C                     KFLD           TTSHN1
     C                     KFLD           TTSHN2
     C                     KFLD           TTSHN3
      *
     C           KEYST     CHAINBTCPL011             20
     C           *IN20     IFEQ '0'
     C                     CLEARBTCWP111
     C                     Z-ADDTTKOHZ    W1KOHZ
     C                     Z-ADDTTKOTI    W1KOTI
     C                     MOVELTTGRP     W1GRP
     C                     MOVELTTSEQ     W1SEQ
     C                     MOVELTTSHN1    W1SHN1
     C                     MOVELTTSHN2    W1SHN2
     C                     MOVELTTSHN3    W1SHN3
     C                     Z-ADDSTYMD1    W1YMD1
     C                     MOVELSTSIGN    W1SIGN
     C                     Z-ADDSTBOX     W1BOX
     C                     Z-ADDSTTIMS    W1TIMS
     C                     Z-ADDSTBOX1    W1BOX1
     C                     MOVELSTMEM1    W1MEM1
     C                     MOVELSTMEM2    W1MEM2
     C                     Z-ADDTTKEHZ    W1KEHZ
     C                     Z-ADDTTMH      W1MH
     C                     Z-ADDTTPH      W1PH
     C                     WRITEBTCWP111
     C                     Z-ADD*DATE     STTRHZ
     C                     MOVEL'1'       STTRN
     C                     UPDATBTCPL011
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
      *----------------------------------------------------*
      * OUTPUT                                             *
      *----------------------------------------------------*
     CSR         #SB510    BEGSR
      *
     C           TTKEHZ    CHAINBTCWP101             20
     C           *IN20     IFEQ '1'
     C                     Z-ADDTTKEHZ    W0KEHZ
     C                     WRITEBTCWP101
     C                     ENDIF
      *
     CSR         ESB510    ENDSR
