     H            Y.
     F** BTCR16 *********************************************
     F* UPDATE PT PLAN PUBLICATION MANAGEMENT M/F           *
     F*    ITS.             2013.11.14                      *
     F*******************************************************
     FBTCPL03 UF  E           K        DISK
     FBTCPL06 UF  E           K        DISK
     FBTCWP10 IF  E           K        DISK                      A
     FBTCWP11 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
     I                                        7  100SDATEY
     I                                       11  120SDATEM
     I                                       12  140SDATED
     I                                        1   20STIMEH
     I                                        3   40STIMEM
     I                                        5   60STIMES
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C                     TIME           WTIME
     C                     MOVEL*BLANK    KKTRN   1
     C           KKTRN     READEBTCPL031                 80
     C           *IN80     DOWEQ'0'
     C           STSKJY    IFEQ 'D'
     C           STSKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #SB500
     C                     Z-ADD*DATE     STTRHZ
     C                     MOVEL'1'       STTRN
     C                     UPDATBTCPL031
     C                     ENDIF
     C           KKTRN     READEBTCPL031                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * OUTPUT                                             *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C           KEYST     KLIST
     C                     KFLD           STGRP
     C                     KFLD           STSEQ
     C                     KFLD           STSHN1
     C                     KFLD           STSHN2
     C                     KFLD           STSHN3
      *
     C           KEYST     SETLLBTCPL061
     C           KEYST     READEBTCPL061                 20
     C           *IN20     DOWEQ'0'
     C                     CLEARBTCWP111
     C                     Z-ADDTTKOHZ    W1KOHZ
     C                     Z-ADDTTKOTI    W1KOTI
     C                     MOVELTTGRP     W1GRP
     C                     MOVELTTSEQ     W1SEQ
     C                     MOVELTTSHN1    W1SHN1
     C                     MOVELTTSHN2    W1SHN2
     C                     MOVELTTSHN3    W1SHN3
     C                     Z-ADDSTYMD1    W1YMD1
     C                     MOVELSTSIGN    W1SIGN
     C                     Z-ADDSTBOX     W1BOX
     C                     Z-ADDSTTIMS    W1TIMS
     C                     Z-ADDSTBOX1    W1BOX1
     C                     MOVELSTMEM1    W1MEM1
     C                     MOVELSTMEM2    W1MEM2
     C                     Z-ADDTTKEHZ    W1KEHZ
     C                     Z-ADDTTMH      W1MH
     C                     Z-ADDTTPH      W1PH
     C                     WRITEBTCWP111
     C                     EXSR #SB510
     C                     Z-ADD*DATE     STTRHZ
     C                     MOVEL'1'       STTRN
     C                     UPDATBTCPL061
     C           KEYST     READEBTCPL061                 20
     C                     ENDDO
      *
     CSR         ESB500    ENDSR
      *----------------------------------------------------*
      * OUTPUT                                             *
      *----------------------------------------------------*
     CSR         #SB510    BEGSR
      *
     C           TTKEHZ    CHAINBTCWP101             23
     C           *IN23     IFEQ '1'
     C                     Z-ADDTTKEHZ    W0KEHZ
     C                     WRITEBTCWP101
     C                     ENDIF
      *
     CSR         ESB510    ENDSR
