     H            Y.
     F** BTDR13 *********************************************
     F* UPDATE PT PLAN PUBLICATION MANAGEMENT M/F           *
     F*    SAKAKI.         2019.09.11                       *
     F*******************************************************
     FBTDWP10 IF  E           K        DISK
     FBTDWP11 IF  E           K        DISK
     FFCEPL11 IF  E           K        DISK
     FAKBPL04 IF  E           K        DISK
     FBTDWP13 O   E                    DISK                      A
      *
     E                    HZ        300  9
     E                    SU        300  5
      *
     I            DS
     I                                        1   80FCSK
     I                                        1   40FCSKYY
     I                                        5   60FCSKMM
     I                                        7   80FCSKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
     I                                        7  100SDATEY
     I                                       11  120SDATEM
     I                                       12  140SDATED
     I                                        1   20STIMEH
     I                                        3   40STIMEM
     I                                        5   60STIMES
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C                     TIME           WTIME
      *
     C                     CLEARHZ
     C                     Z-ADD0         X       40
     C                     READ BTDWP101                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB400
     C                     READ BTDWP101                 80
     C                     ENDDO
     C                     MOVEAHZ        W3TXT
     C                     WRITEBTDWP131
      *
     C                     CLEARSU
     C                     Z-ADD0         X       40
     C                     READ BTDWP111                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB410
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * OUTPUT                                             *
      *----------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C                     MOVEL*BLANK    WKDATA  9
     C                     MOVELW0KEHZ    WKDATA
     C                     MOVE ','       WKDATA
     C                     ADD  1         X
     C                     MOVELWKDATA    HZ,X
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      * OUTPUT                                             *
      *----------------------------------------------------*
     CSR         #SB410    BEGSR
      *
     C                     Z-ADDW1KOHZ    W3KOHZ
     C                     Z-ADDW1KOTI    W3KOTI
     C                     MOVELW1SEQ     W3SEQ
     C                     MOVELW1SHN1    W3SHN1
     C                     MOVELW1SHN2    W3SHN2
     C                     MOVELW1SHN3    W3SHN3
     C                     Z-ADD0         W3OVOL
     C                     Z-ADD0         W3NVOL
     C           KEYFC     KLIST
     C                     KFLD           W1SHN1
     C                     KFLD           W1SHN2
     C                     KFLD           W1SHN3
     C           KEYFC     CHAINFCEPL111             20
     C**         *IN20     IFEQ '0'
     C**                   Z-ADDFCGK02    W3OVOL
     C**                   Z-ADDFCGK01    W3NVOL
     C**                   ELSE
     C**                   EXSR #SB420
     C**                   ENDIF
     C                     Z-ADDW1OVOL    W3OVOL
     C                     Z-ADDW1NVOL    W3NVOL
     C                     MOVELW1MEM1    W3MEM1
     C                     MOVELW1SIGN    W3SIGN
     C                     Z-ADDW1BOX     W3BOX
     C                     MOVELW1SHN1    SVSHN1  5
     C                     MOVELW1SHN2    SVSHN2  5
     C                     MOVELW1SHN3    SVSHN3  2
     C                     MOVELW1GRP     SVGRP  30
     C                     MOVELW1SEQ     SVSEQ   5
     C           *IN80     DOWEQ'0'
     C           W1SHN1    ANDEQSVSHN1
     C           W1SHN2    ANDEQSVSHN2
     C           W1SHN3    ANDEQSVSHN3
     C           W1GRP     ANDEQSVGRP
     C           W1SEQ     ANDEQSVSEQ
     C                     EXSR #SB411
     C                     READ BTDWP111                 80
     C                     ENDDO
      *
     C                     EXSR #SB412
     C                     CLEARSU
     C                     Z-ADD0         X       40
      *
     CSR         ESB410    ENDSR
      *----------------------------------------------------*
      * OUTPUT                                             *
      *----------------------------------------------------*
     CSR         #SB411    BEGSR
      *
     C                     MOVEL*BLANK    WKDATA  9
     C                     MOVELW1KEHZ    WKDATA
     C                     MOVE ','       WKDATA
     C                     Z-ADD1         X
     C           WKDATA    LOKUPHZ,X                     29
     C           *IN29     IFEQ '1'
     C                     MOVEL*BLANK    WKSU    4
     C                     MOVEL*BLANK    WKSU3   3
     C****                 MOVELW1BOX1    WKSU
     C           W1SIGN    IFEQ '-'
     C*****                MOVE W1MH      WKSU
     C                     MOVE W1MH      WKSU3
     C                     MOVELWKSU3     WKSU
     C                     ELSE
     C*****                MOVE W1PH      WKSU
     C                     MOVE W1PH      WKSU3
     C                     MOVELWKSU3     WKSU
     C                     ENDIF
     C                     MOVE ','       WKSU
     C                     MOVELW1SIGN    SU,X
     C                     MOVE WKSU      SU,X
     C                     ENDIF
      *
     CSR         ESB411    ENDSR
      *----------------------------------------------------*
      * OUTPUT                                             *
      *----------------------------------------------------*
     CSR         #SB412    BEGSR
      *
     C                     Z-ADD1         X
     C           X         DOWLE300
     C           SU,X      IFEQ *BLANK
     C                     MOVE ','       SU,X
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     C                     MOVEASU        W3TXT
     C                     WRITEBTDWP131
      *
     CSR         ESB412    ENDSR
      *----------------------------------------------------*
      * AKBPL04                                            *
      *----------------------------------------------------*
     CSR         #SB420    BEGSR
      *
     C                     Z-ADD1         CNT     20
     C           KEYFC     SETGTAKBPL041
     C           KEYFC     REDPEAKBPL041                 20
     C           *IN20     DOWEQ'0'
     C           CNT       ANDLE2
     C           L1SKJY    IFEQ 'D'
     C           L1SKHZ    ANDLE*DATE
     C                     ELSE
     C           CNT       IFEQ 1
     C           L1KSSU    MULT 20        W3NVOL
     C                     ELSE
     C           L1KSSU    MULT 20        W3OVOL
     C                     ENDIF
     C                     ADD  1         CNT
     C                     ENDIF
     C           KEYFC     REDPEAKBPL041                 20
     C                     ENDDO
      *
     CSR         ESB420    ENDSR
