     H            Y.
      ** BTMR21 *******************************************************
      *  DOWNLOAD OF WORK TIME M/F
      *  KIRI                                            2017.06.28
      *****************************************************************
      *
      *   WORK TIME M/F
     FBTMPL20 IF  E           K        DISK
      *
     FBTMWP21 O   F     512            DISK
      *===============================================================
      *===============================================================
     I****************************
      *プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
      *===============================================================
      *===============================================================
     C                     MOVEA*ALL'0'   *IN
     C                     TIME           @TIME
     C                     EXCPT$HED
      *----------------------*
     C                     DO   *HIVAL
     C                     READ BTMPL20                  90
     C   90                LEAVE
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE@SYSHZ
     C                     ITER
     C                     ENDIF
     C**
     C                     EXCPT$DATA
     C**
     C                     ENDDO
      *----------------------*
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      *===============================================================
      *================================================================
     OBTMWP21 E                $HED
     O                                      'UPDATE DATE,'
     O                                      'UPDATE TIME,'
     O                                      'UPDATE PERSON,'
     O                                      'SHIPPING#,'
     O                                      'OLD ISSUE START'
     O                                      'TIME,'
     O                                      'OLD DIST. START'
     O                                      'TIME,'
     O                                      'OLD PULLING START'
     O                                      'TIME,'
     O                                      'OLD BOXING START'
     O                                      'TIME,'
     O                                      'OLD PACKING START'
     O                                      'TIME,'
     O                                      'NEW ISSUE START'
     O                                      'TIME,'
     O                                      'NEW DIST. START'
     O                                      'TIME,'
     O                                      'NEW PULLING START'
     O                                      'TIME,'
     O                                      'NEW BOXING START'
     O                                      'TIME,'
     O                                      'NEW PACKING START'
     O                                      'TIME,'
     O                                      'CHANGE OVER DATE'
      *************************
     O        E                $DATA
     O                         B2KOHZ
     O                                      ','
     O                         B2KOTM       '0 :  :  '
     O                                      ','
     O                         B2KONM
     O                                      ',="'
     O                         B2SHP#
     O                                      '",'
     O                         B2OLIT       '0 :  '
     O                                      ','
     O                         B2OLDT       '0 :  '
     O                                      ','
     O                         B2OPLT       '0 :  '
     O                                      ','
     O                         B2OBXT       '0 :  '
     O                                      ','
     O                         B2OPCT       '0 :  '
     O                                      ','
     O                         B2NLIT       '0 :  '
     O                                      ','
     O                         B2NLDT       '0 :  '
     O                                      ','
     O                         B2NPLT       '0 :  '
     O                                      ','
     O                         B2NBXT       '0 :  '
     O                                      ','
     O                         B2NPCT       '0 :  '
     O                                      ','
     O                         B2CHDT
      *================================================================
