     H            Y.
     F** BUARF1 **********************************
     F* PUBLICATION  OF THE TOYOTA OCR SYSTEM DELIVERY / RECEIPT BOOK
     F*          PUBLISH IT AND TAG PUBLICATION ARE SAME TIME *
     F* C:N.HAYAKAWA                87/12/22 *
     F************************** COPY FROM BUARE1*
     F*** NEXT =>*IN19
     FDACWP12 UF  F     200            DISK
     FFCCTL14 IF  E           K        DISK
     FGADPL13 IF  E           K        DISK
     FGADTL17 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAUAPPNO UF  E           K        DISK                      A
     FDA#PL12 UF  E           K        DISK
     FAUAWPF1 O   F      80            DISK                      A
     FAUAPRE1 O   E             98     PRINTER                        UC
     FQPRINT  O   F     132     OF     PRINTER                        UC
     E                    DAT1       50  1               C/D1
     E                    ERR     1  20 40               ERR MSG
     E                    NAME    1   2 20               fbﾆｫ xb
     E                    EIJ     1  27  1   ESUU    2 0 dbﾆﾞ
     IDACWP12 AA  96
     I                                        1   1 RKBNM
     I                                        2   2 SKJYM
     I                                        3   60TOKUM
     I                                        7   7 TKOJM
     I                                        8  11 TUKEM
     I                                       12  32 KEYNUY
     I                                       12  150NONYM
     I                                       16  16 NKOJM
     I                                       17  20 NUKEM
     I                                       21  32 HBANM
     I                                       21  25 HBAN1
     I                                       26  30 HBAN2
     I                                       31  32 HBAN3
     I                                       33  47 MHINM
     I                                       33  37 MHN1
     I                                       38  42 MHN2
     I                                       43  47 MHN3
     I                                       48  57 KANRM
     I                                    P  58  622TANKM
     I                                       63  630TKBNM
     I                                       64  64 TTAIM
     I                                       65  71 NBANM
     I                                    P  72  750SRYOM
     I                                       76  76 TANIM
     I                                       77  77 NSYOM
     I                                       79  860UHIZM
     I                                       87  880KMM
     I                                    P  89  910RCDNM
     I                                       92  990SHIZM
     I                                       92  950SYEAR
     I                                       96  970SMONTH
     I                                       98  990SDAY
     I                                      100 1070NOKIM
     I                                      100 1030YEAR
     I                                      104 1050MONTH
     I                                      106 1070DAY
     I                                      108 108 JKBNM
     I                                      109 1090NKBNM
     I                                      110 110 HKBNM
     I                                      111 111 SIJIM
     I                                      112 112 SYHNM
     I                                      113 113 DKBNM
     I                                      114 114 KKBNM
     I                                      115 118 SKEIM
     I                                      119 120 SGATM
     I                                      121 140 HMEIM
     I                                      141 155 TKKIM
     I                                      156 165 STEIM
     I                                      166 169 FTHNO
     I                                      170 171 FRECD
     I                                      172 177 FTKRO
     I                                      172 172 FTKR1
     I                                      173 174 FTKR2
     I                                      175 176 FTKR3
     I                                      177 177 FTKR4
     I                                      178 181 FTANT
     I            DS
     I*****チェックデジットの入力用ＤＳ*****
     I                                        1  50 ADAT
     I                                        1   1 IGETA1
     I                                        2   5 SIIRE1
     I                                        6   6 KOUKU1
     I                                        7  12 KANRI1
     I                                       13  14 BUKAN1
     I                                       15  19 NOUBN1
     I                                       20  29 HINBN1
     I                                       30  31 HINRI1
     I                                       32  36 SYUYO1
     I                                       37  40 SIKYU1
     I                                       41  41 YOUMU1
     I                                       42  42 SIKBN1
     I                                       43  45 SEBAN1
     I                                       46  47 UKEIR1
     I                                       48  50 SYKKO1
     I            DS
     I                                        1  50 BDAT
     I                                        1   1 IGETA2
     I                                        2   5 SIIRE2
     I                                        6   6 KOUKU2
     I                                        7  12 KANRI2
     I                                       13  14 BUKAN2
     I                                       15  19 NOUBN2
     I                                       20  29 HINBN2
     I                                       30  31 HINRI2
     I                                       32  36 SYUYO2
     I                                       37  40 SIKYU2
     I                                       41  41 YOUMU2
     I                                       42  42 SIKBN2
     I                                       43  45 SEBAN2
     I                                       46  47 UKEIR2
     I                                       48  50 SYKKO2
     I*****チェックデジットの計算用ＤＳ*****
     I            DS
     I                                        1   80DAT2
     I                                        1   10DAT21
     I                                        2   20DAT22
     I                                        3   30DAT23
     I                                        4   40DAT24
     I                                        5   50DAT25
     I                                        6   60DAT26
     I                                        7   70DAT27
     I                                        8   80DAT28
     I            DS
     I                                        1   80NOU1
     I                                        1   30HKO1
     I                                        4   80KAZ1
     I            DS
     I                                        1   80NOU2
     I                                        1   30HKO2
     I                                        4   80KAZ2
     I*****納入箱数のＤＳ*****
     I            DS
     I                                        1   30NHKO1
     I                                        1   10NHKO11
     I                                        2   20NHKO21
     I                                        3   30NHKO31
     I            DS
     I                                        1   30NHKO2
     I                                        1   10NHKO12
     I                                        2   20NHKO22
     I                                        3   30NHKO32
     I*****納入数量の　ＤＳ*****
     I            DS
     I                                        1   50NSUU1
     I                                        1   10NSUU11
     I                                        2   20NSUU21
     I                                        3   30NSUU31
     I                                        4   40NSUU41
     I                                        5   50NSUU51
     I            DS
     I                                        1   50NSUU2
     I                                        1   10NSUU12
     I                                        2   20NSUU22
     I                                        3   30NSUU32
     I                                        4   40NSUU42
     I                                        5   50NSUU52
     I*****入力品番の　ＤＳ*****
     I            DS
     I                                        1   5 MHN1
     I                                        6  10 MHN2
     I                                       11  15 MHN3
     I                                        1  10 HIN10
     I                                        1  15 MHINM
     I                                       11  12 HIN2
     I            DS
     I                                        1   5 NBAN5
     I                                        1   1 NJYUN
     I                                        2   2 NTUKI
     I                                        3   5 NBAN3
     I            DS
     I                                        1  10 B4HN10
     I                                        1   5 B4MHN1
     I                                        6  10 B4MHN2
     I            DS
     I                                        1   7 XKANRI
     I                                        1   1 KAN1
     C           *ENTRY    PLIST
     C                     PARM           USRSW1  1
     C                     TIME           WTIME   60
      *
     C           STEP01    TAG
     C                     MOVE *BLANK    MSG
     C                     READ DACWP12                  15
     C           *IN15     IFEQ '1'
     C           *IN90     IFEQ '1'
     C                     CLOSEAUAPRE1
     C                     END
     C           *IN17     IFEQ '1'
     C                     CLOSEQPRINT
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C*************************************
     C*        入力内容チェック         *
     C*************************************
     C           TOKUM     CABNE3174      STEP01
     C           NONYM     CABEQ8481      STEP01           nﾑj tｮfbnﾞc
     C           NONYM     CABEQ8482      STEP01           nﾑj gｬcﾆｬc
     C           SKJYM     CABEQ'D'       STEP01
     C           NUKEM     CABEQ'30  '    STEP01
     C           NUKEM     CABEQ'D9  '    STEP01
     C           NBANM     CABNE*BLANK    STEP01
      *
     C           KANRM     IFNE *BLANK
     C                     MOVELKANRM     KTEST   6
     C           KANRM     CABNEKTEST     STEP01
     C                     END
      *
     C*********エラーリスト用のファイルＯＰＥＮ*********
     C           *IN17     IFEQ '0'
     C                     SETON                     17
     C                     OPEN QPRINT
     C                     EXCPTHD
     C                     END
      *
     C           TTAIM     IFNE 'A'
     C                     MOVELERR,12    MSG    40
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C           NONYM     IFEQ 0
     C                     MOVELERR,1     MSG    40
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C           NUKEM     IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C           MHN1      IFEQ *BLANK
     C           MHN2      OREQ *BLANK
     C                     MOVELERR,3     MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C           MONTH     IFEQ 0
     C                     MOVELERR,6     MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C           TOKUM     IFEQ 0
     C                     Z-ADDNONYM     TOKUM
     C                     END
      *
     C*****工場コードが無い時GADPL13で入力*****
     C           NKOJM     IFEQ *BLANK
     C           KEY1      KLIST
     C                     KFLD           NONYM
     C                     KFLD           NUKEM
     C           KEY1      CHAINGADPL131             01
     C           *IN01     IFEQ '1'
     C                     MOVE ' '       NKOJM
     C                     MOVELERR,4     MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     ELSE
     C           B5SKJY    IFEQ 'D'
     C                     MOVE ' '       NKOJM
     C                     MOVELERR,4     MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
     C                     MOVE B5NKOJ    NKOJM
     C                     END
     C                     END
      *
     C******************************************
     C*     かんばんマスターから読み込み     *
     C******************************************
     C                     MOVE *BLANK    SE
     C                     MOVE *BLANK    SKY
     C                     MOVEL*BLANK    RUI
     C                     MOVEL*BLANK    KN
     C                     Z-ADD0         SY
      *
     C           KEY2      KLIST
     C                     KFLD           KEYMM
     C                     KFLD           KNONY
     C                     KFLD           KKOJ
     C                     KFLD           KUKE
     C                     KFLD           MHN1
     C                     KFLD           MHN2
     C                     Z-ADDMONTH     KEYMM   20
     C*かんばんマスターのＫＥＹ決定*
     C           TOKUM     IFEQ NONYM
     C                     Z-ADDTOKUM     KNONY   40
     C                     MOVE TKOJM     KKOJ    1
     C                     MOVE TUKEM     KUKE    4
     C                     ELSE
     C                     Z-ADDNONYM     KNONY
     C                     MOVE NKOJM     KKOJ
     C                     MOVE NUKEM     KUKE
     C                     END
      *
     C           @TRAI     TAG
     C           KEY2      SETLLFCCTL141                 06
      *
     C           *IN06     IFEQ '0'
     C           MONTH     CABEQ7         @NASI
     C           MONTH     CABEQ1         @NASI
     C           MONTH     CABNEKEYMM     @NASI
     C           MONTH     SUB  1         KEYMM
     C                     GOTO @TRAI
     C                     END
      *
     C           @NASI     TAG
     C           *IN06     IFEQ '0'
     C                     MOVELERR,5     MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
     C                     READ FCCTL14                  02
     C           *IN02     IFEQ '1'
     C                     MOVELERR,5     MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     ELSE
     C           B4SKBN    IFEQ 'D'
     C                     GOTO @NASI
     C                     END
     C                     END
     C           HIN10     IFNE B4HN10
     C                     MOVELERR,5     MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C*****かんばんマスターから転送*****
     C*
     C                     MOVE B4SBAN    SE      3
     C                     MOVE B4UTAN    SKY     2
     C                     MOVELB4MHN3    RUI     2        5LEN=>2LEN
     C                     MOVELB4KANR    KN      7
     C           NOKIM     IFGE B4SRHZ
     C                     Z-ADDB4NSRO    SY      60
     C                     ELSE
     C                     Z-ADDB4OSRO    SY
     C                     END
      *
     C*****ユーザー担当（部管・支給係）のチェック*****
     C           SKY       IFEQ *BLANK
     C                     MOVELERR,10    MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C*****管理番号のチェック*****
     C           KANRM     IFNE *BLANK
     C                     MOVELKANRM     XKANRI  7
     C           XKANRI    IFNE KN
     C                     MOVELERR,13    MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
     C                     END
     C                     MOVELKN        XKANRI
      *
     C*管理番号の１桁目チェック*
     C           NONYM     IFEQ TOKUM
      *
     C*直納*
     C           KAN1      IFNE '1'
     C                     MOVELERR,20    MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
     C                     ELSE
      *
     C*直送*
     C           KAN1      IFNE '7'
     C                     MOVELERR,20    MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
     C                     END
      *
     C*****納入番号の決定*****
     C           KEY4      KLIST
     C                     KFLD           MHN1
     C                     KFLD           MHN2
     C                     KFLD           MHN3
     C           KEY4      CHAINAUAPPNO1             06
     C           *IN06     IFEQ '1'
     C                     Z-ADD1         XXNBAN
     C                     MOVE MHN1      XXUHN1
     C                     MOVE MHN2      XXUHN2
     C                     MOVE MHN3      XXUHN3
     C                     WRITEAUAPPNO1
     C           KEY4      CHAINAUAPPNO1             06
     C                     END
      *
     C                     MOVE XXNBAN    NBAN3
     C*****納入番号月の決定*****
     C           MONTH     IFEQ 6
     C           MONTH     OREQ 12
     C                     MOVE '0'       NTUKI
     C                     GOTO EXIT1
     C                     END
      *
     C           MONTH     IFEQ 7
     C           MONTH     OREQ 1
     C                     MOVE '1'       NTUKI
     C                     GOTO EXIT1
     C                     END
      *
     C           MONTH     IFEQ 8
     C           MONTH     OREQ 2
     C                     MOVE '2'       NTUKI
     C                     GOTO EXIT1
     C                     END
      *
     C           MONTH     IFEQ 9
     C           MONTH     OREQ 3
     C                     MOVE '3'       NTUKI
     C                     GOTO EXIT1
     C                     END
      *
     C           MONTH     IFEQ 10
     C           MONTH     OREQ 4
     C                     MOVE '4'       NTUKI
     C                     GOTO EXIT1
     C                     END
      *
     C           MONTH     IFEQ 11
     C           MONTH     OREQ 5
     C                     MOVE '5'       NTUKI
     C                     GOTO EXIT1
     C                     END
     C           EXIT1     TAG
      *
     C*****納入番号旬の決定*****
     C           DAY       IFLE 10
     C           DAY       ANDGE1
     C                     MOVE '1'       NJYUN
     C                     GOTO EXIT2
     C                     END
      *
     C           DAY       IFLE 20
     C           DAY       ANDGE11
     C                     MOVE '2'       NJYUN
     C                     GOTO EXIT2
     C                     END
      *
     C           DAY       IFLE 31
     C           DAY       ANDGE21
     C                     MOVE '3'       NJYUN
     C                     GOTO EXIT2
     C                     END
     C           EXIT2     TAG
      *
     C*********単価　チェック*********
     C           TANKM     IFEQ 0
     C                     MOVELERR,7     MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C*****納入（支給）先名を入力する*****
     C           NONYM     CHAINFGBPL011             09
     C           *IN09     IFEQ '1'
     C                     MOVELERR,14    MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C*****支給先コードを入力する*****
     C           KEY3      KLIST
     C                     KFLD           NONYM
     C                     KFLD           NKOJM
     C                     KFLD           NUKEM
     C                     KFLD           TOKUM
     C           KEY3      CHAINGADTL171             11
     C           *IN11     IFEQ '1'
     C                     MOVE *BLANK    B5SKYU
     C                     END
      *
     C           B5SKYU    IFEQ *BLANK
     C           B5SKYU    OREQ '9999'
     C           NONYM     IFEQ 0078
     C                     MOVE '1019'    B5SKYU
     C                     ELSE
     C           NONYM     IFEQ 0337
     C                     MOVE '1127'    B5SKYU
     C                     ELSE
     C           NONYM     IFEQ 4812
     C                     MOVE '1019'    B5SKYU
     C                     ELSE
     C           NONYM     IFEQ 0809
     C                     MOVE '4141'    B5SKYU
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*****セントラルの時、支給先コードの入れ変え*****
     C           NONYM     IFEQ 2240
     C                     MOVE '1613'    B5SKYU
     C                     END
      *
     C*****支給先コードのチェック*****
     C           B5SKYU    IFEQ *BLANK
     C                     MOVELERR,15    MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C           B5SKYU    IFEQ '9999'
     C                     MOVELERR,17    MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C           B5SKYU    IFNE B4SKYU
     C                     MOVELERR,19    MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C*****部管・支給係のチェック*****
     C           SKY       IFEQ *BLANK
     C           NONYM     IFEQ 0078                       abﾆ] ﾈbg
     C                     MOVE '26'      BUKAN1
     C                     MOVE '26'      BUKAN2
     C                     ELSE
     C           NONYM     IFEQ 0337                       aﾅﾍ mｮﾃc
     C                     MOVE '24'      BUKAN1
     C                     MOVE '24'      BUKAN2
     C                     ELSE
     C           NONYM     IFEQ 4812                       zuﾌ ﾌlnﾞcg
     C                     MOVE '27'      BUKAN1
     C                     MOVE '27'      BUKAN2
     C                     ELSE
     C           NONYM     IFEQ 2240                       ﾈ]n[ﾓ ﾆﾞnﾞcﾆ
     C                     MOVE '41'      BUKAN1
     C                     MOVE '41'      BUKAN2
     C                     ELSE
     C           NONYM     IFEQ 0809                       bﾉcd MTP
     C                     MOVE '42'      BUKAN1
     C                     MOVE '42'      BUKAN2
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*****納入数のチェック*****
     C           SRYOM     IFLE 0
     C                     MOVELERR,8     MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C           SRYOM     IFGT 99999
     C                     MOVELERR,16    MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     END
      *
     C*****端数の計算*****
     C                     Z-ADD0         MISUU
     C                     Z-ADD0         HASUU
     C           SRYOM     DIV  SY        MISUU   60
     C                     MVR            HASUU   50
     C           HASUU     IFGT 0
     C           MISUU     ADD  1         MISUU
     C                     END
      *
     C*****箱数のチェック*****
     C           MISUU     IFGT 999
     C                     MOVELERR,18    MSG
     C                     EXSR ERRPRT
     C                     GOTO STEP01
     C                     ELSE
     C                     Z-ADDMISUU     MI      30
     C                     END
      *
     C*******************************************
     C*        印刷ファイルへの書出し         *
     C*******************************************
     C                     MOVELERR,9     MSG
     C                     EXSR ERRPRT
      *
     C           *IN90     IFEQ '0'
     C                     SETON                     90
     C                     OPEN AUAPRE1
     C                     MOVE '*'       USRSW1
     C                     END
      *
     C*****納入番号の書き変え*****
     C           XXNBAN    IFEQ 999
     C                     Z-ADD1         XXNBAN
     C                     ELSE
     C           XXNBAN    ADD  1         XXNBAN
     C                     END
     C                     UPDATAUAPPNO1
      *
     C*****品番類別の空白チェック*****
     C           HIN2      IFEQ *BLANK
     C                     MOVE '00'      HIN2
     C                     END
      *
     C*****１枚目共通フィールドの転送*****
     C                     Z-ADDNOKIM     NDAY1
     C                     MOVE '1'       ID1
     C                     MOVE '1085'    SIIRE1
     C                     MOVE '0'       KOUKU1
     C                     MOVELKN        KANRI1
     C                     MOVE NBAN5     NOUBN1
     C                     MOVE HIN10     HINBN1
     C                     MOVE RUI       HINRI1
     C                     MOVE SY        SYUYO1
     C                     MOVE MI        NHKO1
     C                     MOVE SRYOM     NSUU1
     C                     MOVE SE        SEBAN1
     C                     MOVE *BLANK    YOUMU1
     C                     MOVE *BLANK    SIKBN1
     C                     Z-ADDHASUU     HASUU1
      *
     C*****２枚目共通フィールドの転送*****
     C                     Z-ADDNOKIM     NDAY2
     C                     MOVE '1'       ID2
     C                     MOVE '1085'    SIIRE2
     C                     MOVE '0'       KOUKU2
     C                     MOVELKN        KANRI2
     C                     MOVE NBAN5     NOUBN2
     C                     MOVE HIN10     HINBN2
     C                     MOVE RUI       HINRI2
     C                     MOVE SY        SYUYO2
     C                     MOVE MI        NHKO2
     C                     MOVE SRYOM     NSUU2
     C                     MOVE SE        SEBAN2
     C                     MOVE *BLANK    YOUMU2
     C                     MOVE *BLANK    SIKBN2
     C                     Z-ADDHASUU     HASUU2
      *
     C*****管理番号と納入番号をワークにＵＰＤＡＴ*****
     C                     MOVELNBAN5     NBANM
     C                     MOVELKN        KANRM
     C                     EXCPTUP
      *
     C********受注累積に納番・管理番号をＵＰＤＡＴ*******
     C           KEY5      KLIST
     C                     KFLD           KMM
     C                     KFLD           RCDNM
     C           KEY5      CHAINDA#PL121             18
     C           *IN18     IFEQ '0'
     C                     MOVELNBAN5     B8NBAN
     C                     MOVELKN        B8KANR
     C                     UPDATDA#PL121
     C                     END
      *
     C*****直納・直送の判定*****
     C           NONYM     IFEQ TOKUM
     C                     GOTO @CYKNO                     直納
     C                     ELSE
     C                     GOTO @CYKSO                     直送
     C                     END
      *
     C****************************
     C*****直納の場合の処理*****
     C****************************
     C           @CYKNO    TAG
      *
     C*****１枚目の処理*****
     C                     SETON                     7173
     C                     SETOF                     7072
     C                     MOVE SKY       BUKAN1
     C                     MOVE NAME,1    SIREN1
     C                     MOVE *BLANK    SKYUN1
     C                     MOVE '3'       IGETA1
     C                     MOVE '    '    SIKYU1
     C                     MOVELKUKE      UKEIR1
     C                     MOVE *BLANK    SYKKO1
     C                     Z-ADDNHKO1     HKO1
     C                     Z-ADDNSUU1     KAZ1
      *
     C*１枚目１段目Ｃ／Ｄ計算*
     C                     MOVEAADAT      DAT1
     C                     EXSR CHKDG1
     C                     MOVE CDANS1    CD1
      *
     C*１枚目２段目Ｃ／Ｄ計算*
     C                     Z-ADDNOU1      DAT2
     C                     EXSR CHKDG2
     C                     MOVE CDANS2    NCD1
      *
     C*****２枚目の処理*****
     C                     SETON                     757780
     C                     SETOF                     7476
     C                     MOVE SKY       BUKAN2
     C                     MOVE *BLANK    SIREN2
     C                     MOVE NAME,2    SKYUN2
     C                     MOVE '4'       IGETA2
     C                     MOVE '    '    SIKYU2
     C                     MOVELKUKE      UKEIR2
     C                     MOVE *BLANK    SYKKO2
     C                     Z-ADDNHKO2     HKO2
     C                     Z-ADDNSUU2     KAZ2
      *
     C*２枚目１段目Ｃ／Ｄ計算*
     C                     MOVEABDAT      DAT1
     C                     EXSR CHKDG1
     C                     MOVE CDANS1    CD2
      *
     C*２枚目２段目Ｃ／Ｄ計算*
     C                     Z-ADDNOU2      DAT2
     C                     EXSR CHKDG2
     C                     MOVE CDANS2    NCD2
      *
     C                     WRITEAUAPRE11
     C                     EXCPTUDAT
      *
     C                     GOTO STEP01
      *
     C****************************
     C*****直送の場合の処理*****
     C****************************
     C           @CYKSO    TAG
      *
     C*****１枚目の処理*****
     C                     SETON                     7072
     C                     SETOF                     7173
     C                     MOVE *BLANK    SIREN1
     C                     MOVE NAME,2    SIREN1
     C                     MOVE *BLANK    SKYUN1
     C                     MOVELB2SMEI    SKYUN1
     C                     MOVE 'A'       IGETA1
     C                     MOVE B5SKYU    SIKYU1
     C                     MOVELKUKE      UKEIR1
     C                     MOVE *BLANK    SYKKO1
     C                     Z-ADDNHKO1     HKO1
     C                     Z-ADDNSUU1     KAZ1
     C                     MOVE SKY       BUKAN1
      *
     C*１枚目１段目Ｃ／Ｄ計算*
     C                     MOVEAADAT      DAT1
     C                     EXSR CHKDG1
     C                     MOVE CDANS1    CD1
      *
     C*１枚目２段目Ｃ／Ｄ計算*
     C                     Z-ADDNOU1      DAT2
     C                     EXSR CHKDG2
     C                     MOVE CDANS2    NCD1
      *
     C*****２枚目の処理*****
     C                     SETON                     747680
     C                     SETOF                     7577
     C                     MOVE *BLANK    SIREN2
     C                     MOVE *BLANK    SKYUN2
     C                     MOVELB2SMEI    SKYUN2
     C                     MOVE 'B'       IGETA2
     C                     MOVE B5SKYU    SIKYU2
     C                     MOVELKUKE      UKEIR2
     C                     MOVE *BLANK    SYKKO2
     C                     Z-ADDNHKO2     HKO2
     C                     Z-ADDNSUU2     KAZ2
     C                     MOVE SKY       BUKAN2
      *
     C*２枚目１段目Ｃ／Ｄ計算*
     C                     MOVEABDAT      DAT1
     C                     EXSR CHKDG1
     C                     MOVE CDANS1    CD2
      *
     C*２枚目２段目Ｃ／Ｄ計算*
     C                     Z-ADDNOU2      DAT2
     C                     EXSR CHKDG2
     C                     MOVE CDANS2    NCD2
      *
     C                     WRITEAUAPRE11
      *
     C*****３枚目の処理*****
     C                     SETON                     707374
     C                     SETON                     757677
     C                     SETOF                     717280
     C                     MOVE NAME,1    SIREN1
     C                     MOVE *BLANK    SKYUN1
     C                     MOVELB2SMEI    SKYUN1
     C                     MOVE 'C'       IGETA1
     C                     MOVE B5SKYU    SIKYU1
     C                     MOVELKUKE      UKEIR1
     C                     MOVE *BLANK    SYKKO1
     C                     Z-ADDNHKO1     HKO1
     C                     Z-ADDNSUU1     KAZ1
      *
     C*３枚目１段目Ｃ／Ｄ計算*
     C                     MOVEAADAT      DAT1
     C                     EXSR CHKDG1
     C                     MOVE CDANS1    CD1
      *
     C*３枚目２段目Ｃ／Ｄ計算*
     C                     Z-ADDNOU1      DAT2
     C                     EXSR CHKDG2
     C                     MOVE CDANS2    NCD1
      *
     C                     WRITEAUAPRE11
     C                     EXCPTUDAT
      *
     C                     GOTO STEP01
      *
     C*** CHKDG1 ***********************************
     C*チェック・デジット計算処理のサブ・ルーチン*
     C*   INPUT=>DAT1(50 LENGTH)   OUTPUT=>CDANS1  *
     C**********************************************
     C           CHKDG1    BEGSR
     C                     Z-ADD1         J       20
     C                     Z-ADD7         OMOMI   10
     C                     Z-ADD0         WA
     C                     Z-ADD0         SEKI
      *
     C                     DO   50        J
      *
     C*****入力データが英字かチェック*****
     C                     Z-ADD1         E       20
     C                     SETOF                     07
     C           DAT1,J    LOKUPEIJ,E                    07
     C           *IN07     IFEQ '1'
      *
     C*****入力データが英字の時*****
     C           ESUU,E    MULT OMOMI     SEKI
     C           WA        ADD  SEKI      WA
     C                     ELSE
      *
     C*****入力データが数字の時*****
     C                     MOVEADAT1,J    SDAT1M  1
     C                     MOVE SDAT1M    SDAT1S  10
     C           SDAT1S    MULT OMOMI     SEKI    40
     C           WA        ADD  SEKI      WA      40
     C                     END
      *
     C           OMOMI     SUB  1         OMOMI
     C           OMOMI     IFEQ 0
     C                     Z-ADD7         OMOMI
     C                     END
      *
     C                     END
      *
     C           WA        DIV  11        SIYOU   50
     C                     MVR            AMARI   20
     C           11        SUB  AMARI     CDANS1  10
     C                     ENDSR
      *
     C*** CHKDG2 ***********************************
     C*チェック・デジット計算処理のサブ・ルーチン*
     C*   INPUT=>DAT2(8 LENGTH)    OUTPUT=>CDANS2  *
     C**********************************************
     C           CHKDG2    BEGSR
     C                     Z-ADD0         WA1
      *
     C           DAT21     MULT 7         SEKI1   20
     C           WA1       ADD  SEKI1     WA1     30
      *
     C           DAT22     MULT 5         SEKI1
     C           WA1       ADD  SEKI1     WA1
      *
     C           DAT23     MULT 3         SEKI1
     C           WA1       ADD  SEKI1     WA1
      *
     C           DAT24     MULT 1         SEKI1
     C           WA1       ADD  SEKI1     WA1
      *
     C           DAT25     MULT 6         SEKI1
     C           WA1       ADD  SEKI1     WA1
      *
     C           DAT26     MULT 4         SEKI1
     C           WA1       ADD  SEKI1     WA1
      *
     C           DAT27     MULT 2         SEKI1
     C           WA1       ADD  SEKI1     WA1
      *
     C           DAT28     MULT 7         SEKI1
     C           WA1       ADD  SEKI1     WA1
      *
     C           WA1       DIV  11        SYOU1   50
     C                     MVR            AMARI1  20
     C           11        SUB  AMARI1    CDANS2  10
     C                     ENDSR
      *
     C*** ERRPRT ***********************************
     C*発行データエラーリスト処理のサブ・ルーチン*
     C**********************************************
     C           ERRPRT    BEGSR
     C                     EXCPTME
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
     C                     ENDSR
     OQPRINT  E   02           HD
     O                                  131 '+-------------------+'
     O        E 1              HD
     O                                  131 '|         |         |'
     O        E 1              HD
     O                                   12 'BUARF1-1'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '|         |         |'
     O        E 1              HD
     O                                   39 'TOYOTA OCR STATEMENT OF '
     O                                   43 'DELV'
     O                                   69 'PUBLICATION DATA ERROR '
     O                                   73 'LIST'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE     108
     O                                  131 '+-------------------+'
     O        E 21             HD
     O                                    9 'CUSTOMER'
     O                                   18 'RCV CO. '
     O                                   24 'FACTORY'
     O                                   28 'RCV'
     O                                   38 'PART NO'
     O                                   61 'MANAGEMENT NO'
     O                                   69 'DELV NO'
     O                                   80 'DELV DATE'
     O                                   89 'QUANTITY'
     O                                  108 ' ERROR COMMENT  '
     O        E  1             ME
     O                         TOKUM      6
     O                         NONYM     15
     O                         NKOJM     21
     O                         NUKEM     29
     O                         MHINM     46
     O                         KN        61
     O                         NBAN5     69
     O                         NOKIM     79
     O                         SRYOM 2   88
     O                         MSG      130
     ODACWP12 E                UP
     O                         KANRM     57
     O                         NBANM     71
     OAUAWPF1 EADD             UDAT
     O                         NONYM      4
     O                         NKOJM      5
     O                         NUKEM      9
     O                         MHN1      14
     O                         MHN2      19
     O                         MHN3      24
     O                         TOKUM     28
     O                         TKOJM     29
     O                         TUKEM     33
     O                         KANRM     43
     O                         TANKM     52
     O                         TTAIM     53
     O                         NSYOM     54
     O                         SRYOM     61
     O                         NBANM     68
     O                         KMM       70
     O                         RCDNM     75
     O                         MONTH     77
     O                         DAY       79
**
ABNORMAL OR NO RCV CO. IN INPUT DATA     1
ABNORMAL OR NO RCV IN INPUT DATA         2
NO USER P/N IN INPUT DATA                3
FACTORY CODE CAN'T SUB FROM INPUT DATA   4
THERE IS NO DATA IN KANBAN M/F           5
ABNORMAL OR NO DELV DAY IN INPUT DATA    6
P/N OF INPUT DATA IS UNDECIDED UNP       7
ABNORMAL OR NO DELV NUMBER IN INPUT DATA 8
OCR STATEMENT OF DELIVERY WAS PUBLISHED  9
NO DEPT/PROVISION POINT NAME IN KANBAN M10
MANAGEMENT NBR DOESN'T FIT DATE OF DELV 11
IT IS DATA EXCEPT UNIT PRICE FORM "A"   12
DATA MANAGEMENT NO DIFFERS FROM KANBAN M13
NO DELV/PROVISION POINT IN DETAILS M    14
NO PROVISION POINT CODE IN SHIPMENT M   15
CAN'T PUBLISH DELV NBR IS OVER 6 COLUMNS16
PROVISION POINT CODE IS 9999            17
CAN'T PUBLISH DELV BOXES IS OVER 3 COLM 18
PROVISION POINT DIFFER KANBAN M & SHIP M19
OCR DELV STATEMENT NO PUBLISHED NO.     20
**
AOYAMA CO., LTD.
TOYOTA CAR K.K
**
 00
A01
B02
C03
D04
E05
F06
G07
H08
I09
J10
K11
L12
M13
N14
O15
P00
Q01
R02
S03
T04
U05
V06
W07
X08
Y09
Z10
