     H            Y.
     F** CA#R01 ****************************************
     F*  .INSTRUCTION KANBAN STATUS INQUIRY            *
     F*           T.SAKAKI             2020.08.19      *
     F**************************************** CA#R01 **
     FCA#PW01 CF  E                    WORKSTN
     FCA#PL01 IF  E           K        DISK
     FMRHPP71 IF  E           K        DISK
     FCA#PL05 IF  E           K        DISK
     FCA#PL04 UF  E           K        DISK
     F* RE-PRINT DATA
     FCAAPP08 UF  E           K        DISK                      A
     FCA#PP91 UF  E           K        DISK                      A
     F**AAAPL01 IF  E           K        DISK
     E                    ER      1  22 72               d[ｰ､xｮﾈｰﾆﾞ
      *
     E                    NO         12  4 0             NO
     E                    HK         12 10 0             ﾌｮﾃcﾍﾞ ﾍﾞ]
     E                    SG         12  8               ﾅgﾞｭcﾍｭcNO
     E                    MI         12  3 0             ubﾇc
     E                    NU         12  8 0             pｬcﾃﾍﾞ
     E                    FRH        12  8 0             ﾎﾒｭcﾌｮﾈbﾍﾞ
     E                    FRS        12  3 0             ﾎﾒｭcﾌﾃﾇc
     E                    NC         12  1
      *
     E                    KT         10  3               ﾃcmb
     E                    KJ         10 10               ﾃcﾆﾞｭc
     E                    KB         10  3               gﾌﾞ]
     E                    NK         10  8 0             ﾉcg
     E                    $NK        10  8 0             ﾉcg(WORK)
     E                    $NK1       10  8 0             ﾉcg(WORK)
     E                    NB         10  8 0             COMP DATE
     E                    NT         10  4 0             COMP TIME
     E                    NTM        10 15               TM NAME
      *
     E                    $$NK       10  8 0             ﾉcg8(WORK)
     E                    $$NK1      10  8 0             ﾉcg8(WORK)
     E                    $NB        10  8 0             ﾉcpｬcﾍﾞ8
      *
     E                    CKT        10  3               ﾃcmb
     E***                 CKJ        12  4 0             ﾃcﾆﾞｭc
     E                    CKJ        10 16               ﾃcﾆﾞｭc
     E                    CKB        10  3               gﾌﾞ]
     E                    CNK        10  8 0             ﾉcg
     E                    CNB        10  8 0             COMPDATE
     E                    CNT        10  6 0             COMPTIME
     E                    CNTM       10 10               TM NAME
      *
     E                    @NO        10  2 0             ﾃcmbNO
     E                    #NK        10  8 0             ﾉcg(CHK)
     I            DS
     I                                        1  480NO
     I                                        1   40ANO01
     I                                        5   80ANO02
     I                                        9  120ANO03
     I                                       13  160ANO04
     I                                       17  200ANO05
     I                                       21  240ANO06
     I                                       25  280ANO07
     I                                       29  320ANO08
     I                                       33  360ANO09
     I                                       37  400ANO10
     I                                       41  440ANO11
     I                                       45  480ANO12
     I            DS
     I                                        1 1200HK
     I                                        1  100AHK01
     I                                       11  200AHK02
     I                                       21  300AHK03
     I                                       31  400AHK04
     I                                       41  500AHK05
     I                                       51  600AHK06
     I                                       61  700AHK07
     I                                       71  800AHK08
     I                                       81  900AHK09
     I                                       91 1000AHK10
     I                                      101 1100AHK11
     I                                      111 1200AHK12
     I            DS
     I                                        1  96 SG
     I                                        1   8 ASG01
     I                                        9  16 ASG02
     I                                       17  24 ASG03
     I                                       25  32 ASG04
     I                                       33  40 ASG05
     I                                       41  48 ASG06
     I                                       49  56 ASG07
     I                                       57  64 ASG08
     I                                       65  72 ASG09
     I                                       73  80 ASG10
     I                                       81  88 ASG11
     I                                       89  96 ASG12
     I            DS
     I                                        1  360MI
     I                                        1   30AMI01
     I                                        4   60AMI02
     I                                        7   90AMI03
     I                                       10  120AMI04
     I                                       13  150AMI05
     I                                       16  180AMI06
     I                                       19  210AMI07
     I                                       22  240AMI08
     I                                       25  270AMI09
     I                                       28  300AMI10
     I                                       31  330AMI11
     I                                       34  360AMI12
     I            DS
     I                                        1  960NU
     I                                        1   80ANU01
     I                                        9  160ANU02
     I                                       17  240ANU03
     I                                       25  320ANU04
     I                                       33  400ANU05
     I                                       41  480ANU06
     I                                       49  560ANU07
     I                                       57  640ANU08
     I                                       65  720ANU09
     I                                       73  800ANU10
     I                                       81  880ANU11
     I                                       89  960ANU12
     I            DS
     I                                        1  960FRH
     I                                        1   80AFH01
     I                                        9  160AFH02
     I                                       17  240AFH03
     I                                       25  320AFH04
     I                                       33  400AFH05
     I                                       41  480AFH06
     I                                       49  560AFH07
     I                                       57  640AFH08
     I                                       65  720AFH09
     I                                       73  800AFH10
     I                                       81  880AFH11
     I                                       89  960AFH12
     I            DS
     I                                        1  360FRS
     I                                        1   30AFS01
     I                                        4   60AFS02
     I                                        7   90AFS03
     I                                       10  120AFS04
     I                                       13  150AFS05
     I                                       16  180AFS06
     I                                       19  210AFS07
     I                                       22  240AFS08
     I                                       25  270AFS09
     I                                       28  300AFS10
     I                                       31  330AFS11
     I                                       34  360AFS12
     I            DS
     I                                        1  12 NC
     I                                        1   1 ANC01
     I                                        2   2 ANC02
     I                                        3   3 ANC03
     I                                        4   4 ANC04
     I                                        5   5 ANC05
     I                                        6   6 ANC06
     I                                        7   7 ANC07
     I                                        8   8 ANC08
     I                                        9   9 ANC09
     I                                       10  10 ANC10
     I                                       11  11 ANC11
     I                                       12  12 ANC12
     I            DS
     I                                        1  200@NO
     I                                        1   20@NO1
     I                                        3   40@NO2
     I                                        5   60@NO3
     I                                        7   80@NO4
     I                                        9  100@NO5
     I                                       11  120@NO6
     I                                       13  140@NO7
     I                                       15  160@NO8
     I                                       17  180@NO9
     I                                       19  200@NOA
     I            DS
     I                                        1  30 KT
     I                                        1   3 AKOT1
     I                                        4   6 AKOT2
     I                                        7   9 AKOT3
     I                                       10  12 AKOT4
     I                                       13  15 AKOT5
     I                                       16  18 AKOT6
     I                                       19  21 AKOT7
     I                                       22  24 AKOT8
     I                                       25  27 AKOT9
     I                                       28  30 AKOTA
     I            DS
     I                                        1 100 KJ
     I                                        1  10 AKOJ1
     I                                       11  20 AKOJ2
     I                                       21  30 AKOJ3
     I                                       31  40 AKOJ4
     I                                       41  50 AKOJ5
     I                                       51  60 AKOJ6
     I                                       61  70 AKOJ7
     I                                       71  80 AKOJ8
     I                                       81  90 AKOJ9
     I                                       91 100 AKOJA
     I            DS
     I                                        1  30 KB
     I                                        1   3 AKBN1
     I                                        4   6 AKBN2
     I                                        7   9 AKBN3
     I                                       10  12 AKBN4
     I                                       13  15 AKBN5
     I                                       16  18 AKBN6
     I                                       19  21 AKBN7
     I                                       22  24 AKBN8
     I                                       25  27 AKBN9
     I                                       28  30 AKBNA
     I            DS
     I                                        1  800NK
     I                                        1   80ANOK1
     I                                        9  160ANOK2
     I                                       17  240ANOK3
     I                                       25  320ANOK4
     I                                       33  400ANOK5
     I                                       41  480ANOK6
     I                                       49  560ANOK7
     I                                       57  640ANOK8
     I                                       65  720ANOK9
     I                                       73  800ANOKA
     I            DS
     I                                        1  800NB
     I                                        1   80ANOB1
     I                                        9  160ANOB2
     I                                       17  240ANOB3
     I                                       25  320ANOB4
     I                                       33  400ANOB5
     I                                       41  480ANOB6
     I                                       49  560ANOB7
     I                                       57  640ANOB8
     I                                       65  720ANOB9
     I                                       73  800ANOBA
     I            DS
     I                                        1  400NT
     I                                        1   40ATIM1
     I                                        5   80ATIM2
     I                                        9  120ATIM3
     I                                       13  160ATIM4
     I                                       17  200ATIM5
     I                                       21  240ATIM6
     I                                       25  280ATIM7
     I                                       29  320ATIM8
     I                                       33  360ATIM9
     I                                       37  400ATIMA
     I            DS
     I                                        1 150 NTM
     I                                        1  15 ATMN1
     I                                       16  30 ATMN2
     I                                       31  45 ATMN3
     I                                       46  60 ATMN4
     I                                       61  75 ATMN5
     I                                       76  90 ATMN6
     I                                       91 105 ATMN7
     I                                      106 120 ATMN8
     I                                      121 135 ATMN9
     I                                      136 150 ATMNA
      *
     I            DS
     I                                        1  30 CKT
     I                                        1   3 C6KOT1
     I                                        4   6 C6KOT2
     I                                        7   9 C6KOT3
     I                                       10  12 C6KOT4
     I                                       13  15 C6KOT5
     I                                       16  18 C6KOT6
     I                                       19  21 C6KOT7
     I                                       22  24 C6KOT8
     I                                       25  27 C6KOT9
     I                                       28  30 C6KOTA
     I            DS
     I                                        1 160 CKJ
     I                                        1  16 C6BMN1
     I                                       17  32 C6BMN2
     I                                       33  48 C6BMN3
     I                                       49  64 C6BMN4
     I                                       65  80 C6BMN5
     I                                       81  96 C6BMN6
     I                                       97 112 C6BMN7
     I                                      113 128 C6BMN8
     I                                      129 144 C6BMN9
     I                                      145 160 C6BMNA
     I            DS
     I                                        1  30 CKB
     I                                        1   3 C6KBN1
     I                                        4   6 C6KBN2
     I                                        7   9 C6KBN3
     I                                       10  12 C6KBN4
     I                                       13  15 C6KBN5
     I                                       16  18 C6KBN6
     I                                       19  21 C6KBN7
     I                                       22  24 C6KBN8
     I                                       25  27 C6KBN9
     I                                       28  30 C6KBNA
     I            DS
     I                                        1  800CNK
     I                                        1   80C6NYD1
     I                                        9  160C6NYD2
     I                                       17  240C6NYD3
     I                                       25  320C6NYD4
     I                                       33  400C6NYD5
     I                                       41  480C6NYD6
     I                                       49  560C6NYD7
     I                                       57  640C6NYD8
     I                                       65  720C6NYD9
     I                                       73  800C6NYDA
     I            DS
     I                                        1  800CNB
     I                                        1   80C6KND1
     I                                        9  160C6KND2
     I                                       17  240C6KND3
     I                                       25  320C6KND4
     I                                       33  400C6KND5
     I                                       41  480C6KND6
     I                                       49  560C6KND7
     I                                       57  640C6KND8
     I                                       65  720C6KND9
     I                                       73  800C6KNDA
     I            DS
     I                                        1  600CNT
     I                                        1   60C6KNT1
     I                                        7  120C6KNT2
     I                                       13  180C6KNT3
     I                                       19  240C6KNT4
     I                                       25  300C6KNT5
     I                                       31  360C6KNT6
     I                                       37  420C6KNT7
     I                                       43  480C6KNT8
     I                                       49  540C6KNT9
     I                                       55  600C6KNTA
     I            DS
     I                                        1 100 CNTM
     I                                        1  10 C6KNN1
     I                                       11  20 C6KNN2
     I                                       21  30 C6KNN3
     I                                       31  40 C6KNN4
     I                                       41  50 C6KNN5
     I                                       51  60 C6KNN6
     I                                       61  70 C6KNN7
     I                                       71  80 C6KNN8
     I                                       81  90 C6KNN9
     I                                       91 100 C6KNNA
     I*
     I            DS
     I                                        1   80AAHIZK
     I                                        1   40AAYY
     I                                        5   60AAMM
     I                                        7   80AADD
     I            DS
     I                                        1   8 C6SGNO
     I                                        1   4 C6ZETI
     I                                        5   5 HI1
     I                                        6   8 C6RTNO
     I            DS
     I                                        1   9 C6TKRB
     I                                        1   1 C6TKR1
     I                                        2   2 HI2
     I                                        3   4 C6TKR2
     I                                        5   5 HI3
     I                                        6   7 C6TKR3
     I                                        8   8 HI4
     I                                        9   9 C6TKR4
     I            DS
     I                                        1  100C6HKHB
     I                                        1   80C6HKDT
     I                                        9  100C6HKBB
     I            DS
     I                                        1   8 WWSGNO
     I                                        1   4 WWZETI
     I                                        6   8 WWRTNO
     I            DS
     I                                        1   8 WWSG
     I                                        1   4 WWSG1
     I                                        6   8 WWSG2
     I            DS
     I                                        1  100WWHK
     I                                        1   80WWHKHZ
     I                                        1   40WWHKYY
     I                                        5   60WWHKMM
     I                                        7   80WWHKDD
     I                                        9  100WWHKBB
     I            DS
     I                                        1  14 AAHIN
     I                                        1   5 AAHIN1
     I                                        6   6 HI5
     I                                        7  11 AAHIN2
     I                                       12  12 HI6
     I                                       13  14 AAHIN3
     I            DS
     I                                        1   80AAFRHZ
     I                                        1   40AAFRYY
     I                                        5   60AAFRMM
     I                                        7   80AAFRDD
     I**          DS
     I**                                      1  100AAMHZK
     I**                                      1   80AAMHIZ
     I**                                      9  100AAMBBK
     I            DS
     I                                        1   80WNKHZ
     I                                        1   40WNKYY
     I                                        5   60WNKMM
     I                                        7   80WNKDD
     I            DS
     I                                        1  100AAHKHZ
     I                                        1   40AAHKYY
     I            DS
     I                                        1   80@@HKHZ
     I                                        1   40@@HKYY
     I                                        5   60@@HKMM
     I                                        7   80@@HKDD
     I            DS
     I                                        1   80HYMD
     I                                        1   40HYY
     I                                        5   60HMM
     I                                        7   80HDD
      *
     I            DS
     I                                        1  140#DATE
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I            DS
     I                                        1   8 K@SGNO
     I                                        1   4 K@ZETI
     I                                        5   5 K@SGHI
     I                                        6   8 K@RTNO
     I            DS
     I                                        1  100K@HKDB
     I                                        1   80K@HKDT
     I           SDS
     I                                     *PROGRAM @@PGM
     I                                      244 253 @@WSID
     I                                      254 263 @@USER
      *--------------------------------------------------
      *   KEY LIST
      *--------------------------------------------------
     C           KEY1      KLIST
     C                     KFLD           AAHIN1
     C                     KFLD           AAHIN2
     C                     KFLD           AAHIN3
     C                     KFLD           AAHIZK
      *
     C           KEY2      KLIST
     C                     KFLD           AAHIN1
     C                     KFLD           AAHIN2
     C                     KFLD           AAHIN3
      *
     C           KEY3      KLIST
     C                     KFLD           WWZETI
     C                     KFLD           WWRTNO
     C                     KFLD           @@HKHZ
     C                     KFLD           @@HKHB
      *
      *
     C***        KEY4      KLIST
     C***                  KFLD           WWJOKN
     C***                  KFLD           WWKCD1
      *
     C           ROLKEY    KLIST
     C                     KFLD           AAHIN1
     C                     KFLD           AAHIN2
     C                     KFLD           AAHIN3
     C                     KFLD           WWHKHZ
     C                     KFLD           WWHKBB
     C                     KFLD           WWSG1
     C                     KFLD           WWSG2
      *
     C           KEY5      KLIST
     C                     KFLD           WWHKHZ
     C                     KFLD           WWHKBB
     C                     KFLD           WWSG1
     C                     KFLD           WWSG2
     C* <<試作手配データ　進捗遅れリスト対象管理>>
     C           STKEY4    KLIST
     C                     KFLD           C6ZETI           *手配№　絶対番号
     C                     KFLD           C6RTNO           *手配№　連番
     C                     KFLD           C6HKDT           *納期
      *--------------------------------------------------
      *   ENTRY LIST
      *--------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
     C                     PARM           PCMD    2
     C                     MOVELPUS       PUS2    2
     C                     MOVEL*BLANK    PCMD
      *
     C**************************************************
     C* MAIN
     C**************************************************
     C                     TIME           #DATE
     C*
     C                     MOVEL'-'       HI5
     C                     MOVEL'-'       HI6
     C                     Z-ADDSDATE     HYMD
     C           STEP0     TAG
     C                     MOVEL*BLANK    AAHIN1
     C                     MOVEL*BLANK    AAHIN2
     C                     MOVEL*BLANK    AAHIN3
     C                     Z-ADD0         AAHIZK
     C**************************************************
     C* 1ST SCREEN
     C**************************************************
     C           STEP1     TAG
     C                     EXFMTCA#PW011
     C                     SETOF                     010299
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     373839
     C                     SETOF                     404142
     C                     SETOF                     1918
     C                     MOVEL*BLANK    MSG
      *
     C           *INKA     IFEQ '1'
     C                     MOVEL'01'      PCMD
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *INKG     IFEQ '1'
     C                     MOVEL'07'      PCMD
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           AAHIN1    IFEQ *BLANK
     C           AAHIN2    ANDEQ*BLANK
     C           AAHIN3    ANDEQ*BLANK
     C           AAHIZK    ANDEQ0
     C                     SETON                     010299
     C                     MOVELER,1      MSG
     C                     GOTO STEP1
     C                     END
      *
     C                     MOVE *BLANK    SW      1
      *
     C*--------------*
     C*  ..品番..  *
     C*--------------*
     C           AAHIN1    IFEQ *BLANK
     C           AAHIN2    ANDEQ*BLANK
     C           AAHIN3    ANDEQ*BLANK
     C                     MOVE 'D'       SW               DATEのみ
     C                     END
      *
     C*------------------*
     C*  ..照会日付..  *
     C*------------------*
     C           AAHIZK    IFEQ 0
     C                     MOVE 'P'       SW               PARTNOのみ
     C                     ELSE
      *
     C                     MOVE AAHIZK    PDATE
     C                     MOVE *BLANK    PRTN
     C                     CALL 'DATR10'
     C                     PARM           PDATE   8
     C                     PARM           PRTN    1
     C           PRTN      IFEQ '1'
     C                     SETON                     0299
     C                     MOVELER,2      MSG
     C                     GOTO STEP1
     C                     END
     C                     END
      *
     C*------------------------------------------*
     C*  ..Ａ－ＰＩＣＳⅡ確定発注累積データ..  *
     C*------------------------------------------*
     C           STEP15    TAG
     C                     Z-ADD0         A       20
     C                     Z-ADD0         B       20
     C                     Z-ADD0         C       40
      *
     C                     SETON                     222324
     C                     SETON                     262753
     C                     SETON                     545556
     C                     SETON                     939697
      *
     C                     SELEC
     C           SW        WHEQ 'P'
     C           KEY2      SETLLCA#PL011                   PARTNO
     C           SW        WHEQ 'D'
     C           *LOVAL    SETLLCA#PL051                   ISSUED DATE
     C                     OTHER
     C           KEY1      SETLLCA#PL011                   BOTH
     C                     ENDSL
     C                     DO   *HIVAL
     C                     SETOF                     94
     C                     SELEC
     C           SW        WHEQ 'D'
     C                     READ CA#PL051                 94ISSUED DATE
     C                     OTHER
     C           KEY2      READECA#PL011                 94
     C                     ENDSL
     C   94                GOTO @END1
      *
     C           *IN94     IFEQ '0'
     C           C6SKJY    ANDEQ'D'
     C           C6SKDT    ANDLESDATE
     C                     GOTO EXIT1
     C                     END
      *
     C           SW        IFEQ 'D'
     C           C6HKDT    IFLT AAHIZK
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      *
     C                     ADD  1         A
     C                     ADD  1         B
     C                     ADD  1         C
      *
     C           A         IFEQ 1
     C                     MOVEL*BLANK    SG
     C                     Z-ADD0         NO
     C                     Z-ADD0         HK
     C                     Z-ADD0         MI
     C                     Z-ADD0         NU
     C                     Z-ADD0         FRH
     C                     Z-ADD0         FRS
     C                     MOVEL*BLANK    NC
     C                     MOVEA'00000000'*IN,70
     C                     MOVEA'0000'    *IN,78
     C                     END
      *
     C                     MOVEL'-'       HI1
     C                     MOVELC6SGNO    SG,A
     C                     Z-ADDC         NO,A
     C                     Z-ADDC6HKHB    HK,A
     C                     Z-ADDC6MAIS    MI,A
     C***                  Z-ADDC6NUKO    NU,A
     C                     Z-ADDC6FRHZ    FRH,A
     C                     Z-ADDC6FRHS    FRS,A
     C                     Z-ADDA         Y       20
     C                     EXSR #CA#91
     C                     Z-ADDA         WW      20
     C                     EXSR MINO
      *
     C           A         IFEQ 12
     C                     GOTO STEP3
     C                     END
      *
     C           EXIT1     TAG
     C  N04                END
     C           @END1     TAG
      *
     C           STEP3     TAG
     C           B         IFEQ 0
     C                     SETON                     010299
     C                     MOVELER,3      MSG
     C                     GOTO STEP1
     C                     END
      *
      *
     C*------------------*
     C                     Z-ADD0         @CONT   20
     C                     MOVEA'00000000'*IN,41
     C           STEP35    TAG
     C                     Z-ADD0         AANO
     C                     MOVE *BLANK    AASK
     C                     MOVEA'00000000'*IN,28
     C                     MOVEA'00000'   *IN,36
      *
     C           AAHIN1    IFNE *BLANK
     C           SW        ANDEQ'D'
     C                     MOVEL*BLANK    AAHIN1
     C                     MOVEL*BLANK    AAHIN2
     C                     MOVEL*BLANK    AAHIN3
     C                     ENDIF
      *
      *
     C**************************************************
     C* 2ND SCREEN       *
     C**************************************************
     C           STEP4     TAG
     C                     EXFMTCA#PW012
     C                     SETOF                     039899
     C                     SETOF                     0418
     C                     MOVE *BLANK    ANCUP
      *
     C           *INKA     IFEQ '1'
     C                     MOVEL'01'      PCMD
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *INKB     IFEQ '1'
     C                     GOTO STEP0
     C                     END
      *
     C           *INKI     IFEQ '1'
     C                     EXSR #IN09
     C                     GOTO STEP4
     C                     END
      *
     C*------------------------*
     C*  ..ＲＯＬＬ－ＵＰ..  *
     C*------------------------*
     C           *IN90     IFEQ '1'
     C                     EXSR ROLUP
      *
     C           *IN98     IFEQ '1'
     C                     SETON                     99
     C                     MOVELER,4      MSG
     C                     END
      *
     C                     GOTO STEP4
     C                     END
      *
     C*--------------------------*
     C*  ..ＲＯＬＬ－ＤＷＮ..  *
     C*--------------------------*
     C           *IN91     IFEQ '1'
     C           @CONT     IFNE 0
     C                     EXSR ROLDW
     C                     SUB  1         @CONT
     C                     END
      *
     C           *IN98     IFEQ '1'
     C                     SETON                     99
     C                     MOVELER,5      MSG
     C                     END
      *
     C                     GOTO STEP4
     C                     END
      *
     C*------------------*
     C*  ..照会番号..  *
     C*------------------*
     C           AANO      IFEQ 0
     C                     SETON                     0399
     C                     MOVELER,6      MSG
     C                     GOTO STEP4
     C                     END
      *
     C           AASK      IFNE '0'
     C           AASK      ANDNE'R'
     C           AASK      ANDNE' '
     C                     SETON                     0499
     C                     MOVELER,8      MSG
     C                     GOTO STEP4
     C                     END
      *
     C                     SETOF                     05
     C                     Z-ADD1         D       20
     C           AANO      LOKUPNO,D                     05
      *
     C           *IN05     IFEQ '1'
     C                     Z-ADD0         KAZ     20
     C                     Z-ADDD         KAZ
     C                     END
      *
     C           *IN05     IFEQ '0'
     C                     SETON                     0399
     C                     MOVELER,6      MSG
     C                     GOTO STEP4
     C                     END
      *--
     C                     MOVEL*BLANK    WWSGNO
     C                     MOVELSG,D      WWSGNO
     C                     MOVELHK,D      @@HKHZ
     C                     MOVE HK,D      @@HKHB  20
      *
      *-------------------------------------------
      *   "R"  RE-PRINT
      *-------------------------------------------
     C           AASK      IFEQ 'R'
     C                     EXSR #REPR
     C                     GOTO STEP4
     C                     ENDIF
      *-------------------------------------------
     C                     MOVEL*BLANK    AASAGO
     C                     Z-ADD0         AAMAIS
     C                     Z-ADD0         AAHKHZ
      *
     C                     MOVEL*BLANK    KT
     C                     MOVEL*BLANK    KJ
     C                     MOVEL*BLANK    KB
     C                     Z-ADD0         NK
     C                     Z-ADD0         NB
     C                     Z-ADD0         NT
     C                     MOVEL*BLANK    NTM
      *
     C                     Z-ADD0         AASYOS
     C                     MOVEL*BLANK    HI2
     C                     MOVEL*BLANK    HI3
     C                     MOVEL*BLANK    HI4
     C                     MOVEL*BLANK    AATKRO
     C                     Z-ADD0         AAFRHZ
     C                     Z-ADD0         AAFRHS
     C                     MOVEL*BLANK    AAFRMK
     C*------------------------------------------*
     C*  ..Ａ－ＰＩＣＳⅡ確定発注累積データ..  *
     C*------------------------------------------*
     C                     SETOF                     06
      *
     C           KEY3      SETLLCA#PL041
     C                     DO   *HIVAL
     C           KEY3      READECA#PL041                 06
     C   06                LEAVE
      *
     C           C6SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
      *
     C                     MOVELSG,D      AASAGO
     C                     Z-ADDMI,D      AAMAIS
     C                     Z-ADDHK,D      AAHKHZ
     C                     Z-ADDC6FRHZ    AAFRHZ
     C                     Z-ADDC6FRHS    AAFRHS
     C                     MOVELC6FRMK    AAFRMK
      *
     C           AAHIN1    IFEQ *BLANK
     C           AAHIN2    ANDEQ*BLANK
     C           AAHIN3    ANDEQ*BLANK
     C           SW        ANDEQ'D'
     C                     MOVELC6HIN1    AAHIN1
     C                     MOVELC6HIN2    AAHIN2
     C                     MOVELC6HIN3    AAHIN3
     C                     ENDIF
      *
     C*------------------*
     C*  ..工程情報..  *
     C*------------------*
     C                     Z-ADDC6NYD1    #NK,1
     C                     Z-ADDC6NYD2    #NK,2
     C                     Z-ADDC6NYD3    #NK,3
     C                     Z-ADDC6NYD4    #NK,4
     C                     Z-ADDC6NYD5    #NK,5
     C                     Z-ADDC6NYD6    #NK,6
     C                     Z-ADDC6NYD7    #NK,7
     C                     Z-ADDC6NYD8    #NK,8
     C                     Z-ADDC6NYD9    #NK,9
     C                     Z-ADDC6NYDA    #NK,10
     C***                  Z-ADDC6NYDB    #NK,11
     C***                  Z-ADDC6NYDC    #NK,12
     C***                  Z-ADDC6NYDK    #NK,13
      *----------------*
      *８工程以上CHK *
      *----------------*
     C                     Z-ADD1         T       20
     C                     Z-ADD31        H       20
     C           1         DO   10        T
     C                     Z-ADDT         @NO,T
     C                     MOVELCKT,T     KT,T
     C                     MOVELCKB,T     KB,T
     C                     Z-ADDCNB,T     NB,T
     C           CNT,T     DIV  100       WNT     40
     C                     Z-ADDWNT       NT,T
     C                     Z-ADD#NK,T     NK,T
     C                     MOVEL*BLANK    WWKJ    4
     C                     MOVEL*BLANK    WWKJNM 16
      *
     C                     MOVELCNTM,T    WKNTM   6
      *
     C           WKNTM     CHAINMRHPP71              25
     C           *IN25     IFEQ *OFF
     C                     MOVELSBOPNM    NTM,T
     C                     ENDIF
      *
     C                     MOVELCKJ,T     KJ,T
      *
     C           CKT,T     IFEQ *BLANK
     C                     MOVEL'1'       *IN,H
     C                     END
     C                     ADD  1         H
     C                     ENDDO
      *
     C                     SETOF                     9294
     C                     MOVEL' '       @CHK    1
     C*------------------*
     C*  ..部品情報..  *
     C*------------------*
     C                     Z-ADDC6SYOS    AASYOS
     C                     MOVEL'-'       HI2
     C                     MOVEL'-'       HI3
     C                     MOVEL'-'       HI4
     C                     MOVELC6TKRB    AATKRO
      *
     C                     LEAVE
      *
     C                     ENDDO
      *
     C           *IN06     IFEQ *ON
     C                     SETON                     0399
     C                     MOVELER,17     MSG
     C                     GOTO STEP4
     C                     ENDIF
      *
     C                     MOVEA'00000000'*IN,82
     C                     EXSR MINO2
      *
     C*---------------------------
     C                     Z-ADD0         CONT    20
      * PROTECT SCREEN  WHEN DELETE
     C           AASK      IFEQ '0'
     C                     MOVEA'11111111'*IN,28
     C                     MOVEA'11111'   *IN,36
     C                     ENDIF
      *
     C**************************************************
     C* 3RD SCREEN       *
     C**************************************************
     C           STEP5     TAG
     C                     EXFMTCA#PW013
     C                     SETOF                     606162
     C                     SETOF                     636465
     C                     SETOF                     666757
     C                     SETOF                     585999
     C                     SETOF                     95
      *
     C           *INKC     IFEQ '1'
     C                     GOTO STEP35
     C                     END
      *
     C           CONT      IFEQ 0
     C                     Z-ADDNK,1      #NK,1
     C                     Z-ADDNK,2      #NK,2
     C                     Z-ADDNK,3      #NK,3
     C                     Z-ADDNK,4      #NK,4
     C                     Z-ADDNK,5      #NK,5
     C                     Z-ADDNK,6      #NK,6
     C                     Z-ADDNK,7      #NK,7
     C                     Z-ADDNK,8      #NK,8
     C                     Z-ADDNK,9      #NK,9
     C                     Z-ADDNK,10     #NK,10
     C                     END
      *
     C*--------------------------------------------*
     C*  ..不良発生日・不良箱数・不良発生部署..  *
     C*--------------------------------------------*
     C           AAFRHZ    IFNE 0
     C           AAFRHS    IFEQ 0
     C                     SETON                     5899
     C                     MOVE ER,12     MSG
     C                     GOTO STEP5
     C                     END
      *
     C           AAFRYY    IFGE 1993
     C           AAFRMM    ANDGE01
     C           AAFRMM    ANDLE12
     C           AAFRDD    ANDGE01
     C           AAFRDD    ANDLE31
     C                     ELSE
     C                     SETON                     5799
     C                     MOVE ER,13     MSG
     C                     GOTO STEP5
     C                     END
     C                     ELSE
      *
     C           AAFRHS    IFNE 0
     C                     SETON                     5799
     C                     MOVE ER,14     MSG
     C                     GOTO STEP5
     C                     END
      *
     C                     END
      *
     C*----------------------------*
     C*  ..納期日付のチェック..  *
     C*----------------------------*
     C                     Z-ADD1         K       20
     C                     Z-ADD59        L       20
     C                     Z-ADD0         WNKHZ
     C           1         DO   10        K
     C                     ADD  1         L
     C           K         IFNE 10
      *
     C           KT,K      IFEQ *BLANK
     C           NK,K      IFNE 0
     C                     MOVE '1'       *IN,L
     C                     SETON                     99
     C                     MOVE ER,7      MSG
     C                     GOTO STEP5
     C                     END
     C                     ELSE
      *
     C           NK,K      IFEQ 0
     C                     MOVE '1'       *IN,L
     C                     SETON                     99
     C                     MOVE ER,9      MSG
     C                     GOTO STEP5
     C                     END
     C                     END
     C                     END
      *
     C           NK,K      IFNE 0
     C                     Z-ADDNK,K      WNKHZ
     C           WNKMM     IFGE 01
     C           WNKMM     ANDLE12
     C           WNKDD     ANDGE01
     C           WNKDD     ANDLE31
     C                     ELSE
      *
     C                     MOVE '1'       *IN,L
     C                     SETON                     99
     C                     MOVE ER,9      MSG
     C                     GOTO STEP5
     C                     END
     C                     END
     C                     ENDDO
      *
     C**         *IN94     IFEQ '1'
     C**         ANOKK     IFEQ 0
     C**                   MOVE '1'       *IN,95
     C**                   SETON                     99
     C**                   MOVE ER,8      MSG
     C**                   GOTO STEP5
     C**                   END
      *
     C**         ANOKK     IFNE 0
     C**                   Z-ADDANOKK     WNKHZ
     C**         WNKMM     IFGE 01
     C**         WNKMM     ANDLE12
     C**         WNKDD     ANDGE01
     C**         WNKDD     ANDLE31
     C**                   ELSE
      **
     C**                   MOVE '1'       *IN,95
     C**                   SETON                     99
     C**                   MOVE ER,9      MSG
     C**                   GOTO STEP5
     C**                   END
     C**                   END
     C**                   END
      **
     C*--------------------------------*
     C*  ..納期（年月日）.. 13工程 *
     C*--------------------------------*
     C                     Z-ADD1         K
     C                     Z-ADD0         $NK1
     C***        1         DO   13        K
     C           1         DO   10        K
     C           #NK,K     IFNE 0
     C                     Z-ADD#NK,K     $NK1,K
     C                     END
     C                     ENDDO
      *
     C*-----------------------*
     C*  ..納期（年月日）.. *
     C*-----------------------*
      *
     C           CONT      IFEQ 0
     C           @CHK      ANDEQ' '
     C                     Z-ADD1         K
     C                     Z-ADD0         $NK
     C           1         DO   10        K
     C           K         IFLE 10
     C           #NK,K     IFNE 0
     C                     Z-ADD#NK,K     WNKHZ
      *
     C           WNKMM     IFEQ 01
     C           WNKMM     OREQ 02
     C           WNKMM     OREQ 03
      *
     C           HMM       IFEQ 10
     C           HMM       OREQ 11
     C           HMM       OREQ 12
     C           HYY       ADD  1         WNKYY
     C                     ELSE
      *
     C           AAHKYY    IFNE HYY
     C                     Z-ADDUYEAR     WNKYY
     C                     END
     C                     END
     C                     END
      *
     C                     Z-ADDWNKHZ     $NK,K
     C                     END
     C                     ELSE
     C                     END
     C                     ENDDO
     C                     END
      *
     C           CONT      IFEQ 0
     C           @CHK      ANDEQ'*'
     C                     Z-ADD1         K
     C                     Z-ADD0         $NK
     C           1         DO   10        K
     C           #NK,K     IFNE 0
     C                     Z-ADD#NK,K     WNKHZ
      *
     C           WNKMM     IFEQ 01
     C           WNKMM     OREQ 02
     C           WNKMM     OREQ 03
      *
     C           HMM       IFEQ 10
     C           HMM       OREQ 11
     C           HMM       OREQ 12
     C           HYY       ADD  1         WNKYY
     C                     ELSE
      *
     C           AAHKYY    IFNE HYY
     C                     Z-ADDHYY       WNKYY
     C                     END
     C                     END
     C                     END
      *
     C                     Z-ADDWNKHZ     $NK,K
     C                     END
     C                     ENDDO
     C                     END
      *
     C           CONT      IFEQ 1
     C                     Z-ADD1         K
     C                     Z-ADD9         V       20
     C                     Z-ADD0         $NK
     C           1         DO   5         K
     C           #NK,V     IFNE 0
     C                     Z-ADD#NK,V     WNKHZ
      *
     C           WNKMM     IFEQ 01
     C           WNKMM     OREQ 02
     C           WNKMM     OREQ 03
      *
     C           HMM       IFEQ 10
     C           HMM       OREQ 11
     C           HMM       OREQ 12
     C           HYY       ADD  1         WNKYY
     C                     ELSE
      *
     C           AAHKYY    IFNE HYY
     C                     Z-ADDUYEAR     WNKYY
     C                     END
     C                     END
     C                     END
      *
     C                     Z-ADDWNKHZ     $NK,K
     C                     END
     C                     ADD  1         V
     C                     ENDDO
     C                     END
     C*----------------------------*
     C*  ..納期日付のチェック..  *
     C*----------------------------*
     C                     Z-ADD1         K
     C                     Z-ADD59        L
     C           1         DO   10        K
     C                     ADD  1         L
     C           K         IFGT 1
      *
     C           $NK,K     IFNE 0
     C           K         SUB  1         M       20
      *
     C*------------------*
     C*  ..工程－８..  *
     C*------------------*
     C           K         IFEQ 9
     C                     ADD  1         M
      *
     C                     DO   *HIVAL
     C                     SETOF                     08
     C                     SUB  1         M
     C           M         IFEQ 0
     C                     GOTO STEP6
     C                     END
     C           $NK,M     IFNE 0
     C                     SETON                     08
     C                     END
     C  N08                END
     C                     END
      *
T.S. C                     MOVEL$NK,M     NK8M    80
T.S. C                     MOVEL$NK,K     NK8K    80
T.S. C           NK8M      IFGT NK8K
     C           K         SUB  M         N       20
     C           L         SUB  N         O       20
     C                     MOVE '1'       *IN,O
     C                     SETON                     99
     C                     MOVE ER,10     MSG
     C                     GOTO STEP5
     C                     END
      *
     C           STEP6     TAG
     C                     END
     C                     END
     C                     END
      *
     C           CONT      IFEQ 0
     C           @CHK      ANDEQ'*'
T.S. C                     MOVEL$NK,8     NK88    80
T.S. C                     MOVEL$NK,9     NK89    80
T.S. C           NK88      IFGT NK89
     C                     MOVE '1'       *IN,67
     C                     SETON                     99
     C                     MOVE ER,10     MSG
     C                     GOTO STEP5
     C                     END
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STEP5
     C                     END
      *
      *
     C           AASK      IFEQ '0'
     C                     Z-ADD40        T       20
     C                     ADD  KAZ       T
     C                     MOVE '1'       *IN,T
     C                     MOVE 'D'       C6SKJY
     C                     Z-ADDSDATE     C6SKDT
     C                     Z-ADDSTIME     C6KOTM
     C                     MOVELPUS       C6KOME
     C                     UPDATCA#PL041
     C                     SETON                     19
     C                     ELSE
     C                     Z-ADDSDATE     C6KODT
     C                     TIME           C6KOTM
     C                     MOVELPUS       C6KOME
     C                     Z-ADD$NK1      CNK
     C                     Z-ADDAAFRHZ    C6FRHZ
     C                     Z-ADDAAFRHS    C6FRHS
     C                     MOVELAAFRMK    C6FRMK
     C***                  Z-ADDAAFBMN    C6FBMN
     C                     UPDATCA#PL041
     C                     END
      *
     C                     Z-ADDAAFRHZ    FRH,D
     C                     Z-ADDAAFRHS    FRS,D
     C                     GOTO STEP35
      *
      *
     C*------------------------*
     C*   ..サブルーチン..   *
     C*  ..ＲＯＬＬ－ＵＰ..  *
     C*------------------------*
     C           ROLUP     BEGSR
      *
     C           NO,12     IFEQ 0
     C                     SETON                     98
     C                     GOTO ROLUPE
     C                     END
      *
     C                     ADD  1         @CONT
     C                     MOVEA'00000000'*IN,41
      *
     C                     Z-ADDHK,12     WWHK
     C                     MOVELSG,12     WWSG
     C                     Z-ADDNO,12     C
      *
     C*------------------------------------------*
     C*  ..Ａ－ＰＩＣＳⅡ確定発注累積データ..  *
     C*------------------------------------------*
     C                     SELEC
     C           SW        WHEQ 'D'
     C           KEY5      SETGTCA#PL051
     C                     OTHER
     C           ROLKEY    SETGTCA#PL011
     C                     ENDSL
     C                     Z-ADD0         F       20
     C                     Z-ADD41        Q       20
      *
     C                     DO   *HIVAL
     C                     SETOF                     09
     C                     SELEC
     C           SW        WHEQ 'D'
     C                     READ CA#PL051                 09
     C                     OTHER
     C           KEY2      READECA#PL011                 09
     C                     ENDSL
     C   09                GOTO ROLUPE
      *
      *
     C           *IN19     IFEQ '1'
     C           C6SKJY    IFEQ 'D'
     C           C6SKDT    IFLT SDATE
     C                     GOTO EXIT2
     C                     END
     C           C6KOTM    IFNE STIME
     C                     GOTO EXIT2
     C                     ENDIF
     C                     ENDIF
     C                     ELSE
     C           C6SKJY    IFEQ 'D'
     C           C6SKDT    ANDLESDATE
     C                     GOTO EXIT2
     C                     END
     C                     ENDIF
      *
     C           SW        IFEQ 'D'
     C           SW        OREQ 'B'
     C           C6HKDT    IFLT AAHIZK
     C                     GOTO EXIT2
     C                     END
     C                     END
      *
     C           C6SKJY    IFEQ 'D'
     C                     MOVE '1'       *IN,Q
     C                     END
      *
     C                     ADD  1         F
     C                     ADD  1         C
     C                     ADD  1         Q
      *
     C           F         IFEQ 1
     C                     MOVEL*BLANK    SG
     C                     Z-ADD0         NO
     C                     Z-ADD0         HK
     C                     Z-ADD0         MI
     C                     Z-ADD0         NU
     C                     Z-ADD0         FRH
     C                     Z-ADD0         FRS
     C                     MOVEA'00000000'*IN,70
     C                     MOVEA'0000'    *IN,78
     C                     SETON                     222324
     C                     SETON                     262753
     C                     SETON                     545556
     C                     SETON                     939697
     C                     END
      *
     C                     MOVEL'-'       HI1
     C                     MOVELC6SGNO    SG,F
     C                     Z-ADDC         NO,F
     C                     Z-ADDC6HKHB    HK,F
     C                     Z-ADDC6MAIS    MI,F
     C***                  Z-ADDC6NUKO    NU,F
     C                     Z-ADDC6FRHZ    FRH,F
     C                     Z-ADDC6FRHS    FRS,F
     C                     Z-ADDF         Y       20
     C                     EXSR #CA#91
     C                     Z-ADDF         WW
     C                     EXSR MINO
      *
     C           F         IFEQ 12
     C                     GOTO ROLUPE
     C                     END
      *
     C           EXIT2     TAG
     C  N09                END
     C           ROLUPE    TAG
      *
     C           F         IFEQ 0
     C                     SETON                     98
     C                     END
      *
     C                     ENDSR
      *
      *
     C*--------------------------*
     C*    ..サブルーチン..    *
     C*  ..ＲＯＬＬ－ＤＷＮ..  *
     C*--------------------------*
     C           ROLDW     BEGSR
      *
     C           NO,1      IFEQ 0
     C                     SETON                     98
     C                     GOTO ROLDWE
     C                     END
      *
     C                     MOVEA'00000000'*IN,41
      *
     C                     Z-ADDHK,1      WWHK
     C                     MOVELSG,1      WWSG
     C                     Z-ADDNO,1      C
      *
     C*------------------------------------------*
     C*  ..Ａ－ＰＩＣＳⅡ確定発注累積データ..  *
     C*------------------------------------------*
     C                     SELEC
     C           SW        WHEQ 'D'
     C           KEY5      SETLLCA#PL051
     C                     OTHER
     C           ROLKEY    SETLLCA#PL011
     C                     ENDSL
     C                     Z-ADD13        G       20
     C                     Z-ADD52        Q       20
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C                     SELEC
     C           SW        WHEQ 'D'
     C                     READPCA#PL051                 10
     C                     OTHER
     C           KEY2      REDPECA#PL011                 10
     C                     ENDSL
     C   10                GOTO ROLDWE
      *
     C           *IN19     IFEQ '1'
     C           C6SKJY    IFEQ 'D'
     C           C6SKDT    IFLT SDATE
     C                     GOTO EXIT3
     C                     ENDIF
     C           C6KOTM    IFNE STIME
     C                     GOTO EXIT3
     C                     ENDIF
     C                     ENDIF
     C                     ELSE
     C           C6SKJY    IFEQ 'D'
     C           C6SKDT    ANDLESDATE
     C                     GOTO EXIT3
     C                     END
     C                     ENDIF
      *
     C           SW        IFEQ 'D'
     C           SW        OREQ 'B'
     C           C6HKDT    IFLT AAHIZK
     C                     GOTO EXIT3
     C                     END
     C                     END
      *
     C           C6SKJY    IFEQ 'D'
     C                     MOVE '1'       *IN,Q
     C                     ENDIF
      *
     C                     SUB  1         G
     C                     SUB  1         C
     C                     SUB  1         Q
      *
     C           G         IFEQ 12
     C                     MOVEL*BLANK    SG
     C                     Z-ADD0         NO
     C                     Z-ADD0         HK
     C                     Z-ADD0         MI
     C                     Z-ADD0         NU
     C                     Z-ADD0         FRH
     C                     Z-ADD0         FRS
     C                     MOVEA'00000000'*IN,70
     C                     MOVEA'0000'    *IN,78
     C                     SETON                     222324
     C                     SETON                     262753
     C                     SETON                     545556
     C                     SETON                     939697
     C                     END
      *
     C                     MOVEL'-'       HI1
     C                     MOVELC6SGNO    SG,G
     C                     Z-ADDC         NO,G
     C                     Z-ADDC6HKHB    HK,G
     C                     Z-ADDC6MAIS    MI,G
     C***                  Z-ADDC6NUKO    NU,G
     C                     Z-ADDC6FRHZ    FRH,G
     C                     Z-ADDC6FRHS    FRS,G
     C                     Z-ADDG         Y       20
     C                     EXSR #CA#91
     C                     Z-ADDG         WW
     C                     EXSR MINO
      *
     C           G         IFEQ 1
     C                     GOTO ROLDWE
     C                     END
      *
     C           EXIT3     TAG
     C  N10                END
     C           ROLDWE    TAG
      *
     C           G         IFEQ 14
     C                     SETON                     98
     C                     END
      *
     C                     ENDSR
      *
      *
     C*--------------------------*
     C*    ..サブルーチン..    *
     C*      ..未納検索..      *
     C*--------------------------*
     C           MINO      BEGSR
      *
     C                     Z-ADD1         XX      20
     C                     SETOF                     30
     C           1         DO   10        XX
     C           CNK,XX    IFNE 0
     C           CNB,XX    ANDEQ0
     C           CNK,XX    IFLT SDATE
     C           CNB,XX    IFEQ 0
     C                     Z-ADD0         ZZ      20
     C           WW        ADD  69        ZZ
     C                     MOVEA'1'       *IN,ZZ
     C                     SETON                     30
     C                     ELSE
      *
     C           CNK,XX    IFLT CNB,XX
     C                     Z-ADD0         ZZ
     C           WW        ADD  69        ZZ
     C                     MOVEA'1'       *IN,ZZ
     C                     SETON                     30
     C                     END
     C                     END
     C                     END
     C                     END
     C  N30                END
     C                     ENDSR
      *
     C*--------------------------*
     C*    ..サブルーチン..    *
     C*     ..未納検索２..     *
     C*--------------------------*
     C           MINO2     BEGSR
     C                     Z-ADD1         XX
     C           1         DO   10        XX
     C           CNK,XX    IFNE 0
     C           CNB,XX    ANDEQ0
     C           CNK,XX    IFLT SDATE
     C           CNB,XX    IFEQ 0
     C                     Z-ADD0         ZZ      20
     C           XX        ADD  81        ZZ
     C                     MOVEA'1'       *IN,ZZ
     C                     ELSE
      *
     C           CNK,XX    IFLT CNB,XX
     C                     Z-ADD0         ZZ
     C           XX        ADD  81        ZZ
     C                     MOVEA'1'       *IN,ZZ
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C***        *IN92     IFEQ '1'
     C***        @CHK      IFEQ '*'
     C***        CNK,13    IFLT SDATE
     C***        CNB,13    IFEQ 0
     C***                  SETON                     93
     C***                  ELSE
     C***        CNK,13    IFLT CNB,13
     C***                  SETON                     93
     C***                  END
     C***                  END
     C***                  END
     C***                  END
     C***                  END
      *
     C***        *IN92     IFEQ '0'
     C***        CNK,13    IFNE 0
     C***        CNB,13    ANDEQ0
     C***        CNK,13    IFLT SDATE
     C***        CNB,13    IFEQ 0
     C***                  SETON                     93
     C***                  ELSE
     C***        CNK,13    IFLT CNB,13
     C***                  SETON                     93
     C***                  END
     C***                  END
     C***                  END
     C***                  END
     C***                  END
     C                     ENDSR
     C*--------------------------*
     C*    ..サブルーチン..    *
     C*     ..未納検索３..     *
     C*--------------------------*
     C           MINO3     BEGSR
     C                     Z-ADD9         YY      20
     C                     Z-ADD1         XX
     C           1         DO   10        XX
     C           YY        IFLE 12
     C           CNK,YY    IFNE 0
     C           CNB,YY    ANDEQ0
     C           CNK,YY    IFLT SDATE
     C           CNB,YY    IFEQ 0
     C                     Z-ADD0         ZZ      20
     C           XX        ADD  81        ZZ
     C                     MOVEA'1'       *IN,ZZ
     C                     ELSE
      *
     C           CNK,YY    IFLT CNB,YY
     C                     Z-ADD0         ZZ
     C           XX        ADD  81        ZZ
     C                     MOVEA'1'       *IN,ZZ
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     ADD  1         YY
     C                     END
      *
      *
     C                     ENDSR
     C*----------------------------------------------------
     C*  RE-PRINT-  SUB ROUTINE
     C*----------------------------------------------------
     C           #REPR     BEGSR
      *
     C                     MOVELSG,D      D2ASG
     C                     Z-ADDHK,D      D2AHK
      *
     C           *INKC     DOWEQ*OFF
     C           *INKE     ANDEQ*OFF
      *
     C                     EXFMTCA#PW014
      *
     C           *INKE     IFEQ *ON
     C                     CLEARCAAPP081
     C                     MOVEL@@USER    C8CRUS
     C                     Z-ADDSDATE     C8CRDT
     C                     Z-ADDSTIME     C8CRTM
     C                     Z-ADD0111      C8TBCD
     C                     Z-ADD@@HKHZ    C8DTHZ
     C                     Z-ADD@@HKHB    C8DTBB
     C                     MOVELWWZETI    C8SGNO
     C                     MOVELWWRTNO    C8STNO
     C                     WRITECAAPP081
     C                     Z-ADD0         AANO
     C                     MOVEL*BLANK    AASK
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           EREPR     ENDSR
     C*----------------------------------------------------
     C*  DUMMY UPDATE
     C*----------------------------------------------------
     C           #DUMM     BEGSR
     C           *LOVAL    READECAAPP081                 88
     C                     UPDATCAAPP081
     C           EDUMM     ENDSR
      *-------------------------------------------------------------------------
      *          #CA#91    CA#PP91 CHECK
      *-------------------------------------------------------------------------
     C           #CA#91    BEGSR
      *
     C                     MOVE *BLANK    NC,Y
     C           STKEY4    CHAINCA#PP91              91
     C           *IN91     IFEQ '0'
     C           S9GSJY    ANDEQ*BLANK
     C                     MOVE '*'       NC,Y
     C                     ENDIF
      *
     C           Y         DIV  12        @DIV    20
     C                     MVR            @AMR    20
     C           C6FFLG    IFEQ *BLANK
     C                     SELEC
     C           @AMR      WHEQ 1
     C                     SETOF                     22
     C           @AMR      WHEQ 2
     C                     SETOF                     23
     C           @AMR      WHEQ 3
     C                     SETOF                     24
     C           @AMR      WHEQ 4
     C                     SETOF                     26
     C           @AMR      WHEQ 5
     C                     SETOF                     27
     C           @AMR      WHEQ 6
     C                     SETOF                     53
     C           @AMR      WHEQ 7
     C                     SETOF                     54
     C           @AMR      WHEQ 8
     C                     SETOF                     55
     C           @AMR      WHEQ 9
     C                     SETOF                     56
     C           @AMR      WHEQ 10
     C                     SETOF                     93
     C           @AMR      WHEQ 11
     C                     SETOF                     96
     C           @AMR      WHEQ 0
     C                     SETOF                     97
     C                     ENDSL
     C                     ENDIF
      *
     C           ECA#91    ENDSR
      *-------------------------------------------------------------------------
      *          #IN09     MRHPP91 UPDATE
      *-------------------------------------------------------------------------
     C           #IN09     BEGSR
      *
     C                     Z-ADD1         Z       50
     C***        @CONT     IFNE 0
     C***        @CONT     MULT 12        Z
     C***                  ADD  1         Z
     C***                  ENDIF
     C                     DO   12
     C           NC,Z      IFNE *BLANK
     C           NC,Z      ANDNE'*'
     C                     SETON                     1899
     C                     MOVELER,21     MSG
     C                     GOTO EIN09
     C                     ENDIF
     C                     ADD  1         Z
     C                     ENDDO
      *
      *
     C                     Z-ADD1         Z       50
     C***        @CONT     IFNE 0
     C***        @CONT     MULT 12        Z
     C***                  ADD  1         Z
     C***                  ENDIF
     C                     DO   12
      *
     C                     MOVELSG,Z      K@SGNO
     C                     Z-ADDHK,Z      K@HKDB
      *
     C           STKEY5    KLIST
     C                     KFLD           K@ZETI
     C                     KFLD           K@RTNO
     C                     KFLD           K@HKDT
      *
     C           STKEY5    CHAINCA#PP91              91
S1   C           *IN91     IFEQ '0'                        登録有り
      *削除ブランク、＊無し＝削除UPDATE
S2   C           S9GSJY    IFEQ *BLANK
S3   C           NC,Z      IFEQ *BLANK
     C                     MOVEL'D'       S9GSJY
     C                     Z-ADDSDATE     S9GSHZ
     C                     Z-ADDSDATE     S9GKHZ
     C                     Z-ADDSTIME     S9GKTM
     C                     MOVEL@@PGM     S9GKPG
     C                     MOVEL@@USER    S9GKNM
     C                     UPDATCA#PP911
E3   C                     ENDIF
      *削除済み、＊有り＝ UPDATE
X2   C                     ELSE
S3   C           NC,Z      IFEQ '*'
     C                     MOVEL*BLANK    S9GSJY
     C                     Z-ADD0         S9GSHZ
     C                     Z-ADDSDATE     S9GKHZ
     C                     Z-ADDSTIME     S9GKTM
     C                     MOVEL@@PGM     S9GKPG
     C                     MOVEL@@USER    S9GKNM
     C                     UPDATCA#PP911
E3   C                     ENDIF
E2   C                     ENDIF
      *
X1   C                     ELSE                            登録無し
S2   C           NC,Z      IFEQ '*'
     C                     MOVEL*BLANK    S9GSJY
     C                     Z-ADD0         S9GSHZ
     C                     Z-ADDSDATE     S9GKHZ
     C                     Z-ADDSTIME     S9GKTM
     C                     MOVEL@@PGM     S9GKPG
     C                     MOVEL@@USER    S9GKNM
     C                     MOVELK@ZETI    S9THI1
     C                     MOVELK@RTNO    S9THI2
     C                     MOVELK@HKDT    S9HAHZ
     C                     WRITECA#PP911
E2   C                     ENDIF
E1   C                     ENDIF
      *
     C                     ADD  1         Z
     C                     ENDDO
      *
     C                     MOVE 'UPDATED' ANCUP
      *
     C           EIN09     ENDSR
************************************************************
**  MSG
E-01 INPUT PART NO. OR ISSUED DATE
E-02 INCORRECT DATE.
E-03 NO DATA FOR INQUIRY.
E-04 NO FOLLOWING DATA.
E-05 NO PREVIOUS DATA.
E-06 INCORRECT NO.
E-07 FOR REVERSED DELIVERY TIME,CANNOT ENTER NONEXISTENT PROCESS.
E-08 INCORRECT OPTION.
E-09 INCORRECT PLAN DATE.
E-10 REVERSED DELIVERY DATE LATER THAN LATER PROCESS.
E-11 UPDATE (CMD-5) ONLY BY PRODUCTION CONTROL SECTION STAFF.
E-12 N/C BOX QUANTITY IS NOT ENTERED.
E-13 STOP DATE IS INCORRECT.
E-14 STOP DATE IS NOT ENTERED.
E-15 DEPARTMENT OF DEFECT OCCURRENCE NOT ENTERED.
E-16 ONLY DELETE CODE '0' IS VALID.
E-17 THE DATA HAS ALREADY BEEN DELETED.
E-18 NO DATA FOR 8TH PROCESS OR HIGHER.
E-19 THIS IS THE TOP PROCESS SCREEN.
E-20 THIS IS THE BOTTOM PROCESS SCREEN.
E-21 INPUT '*' FOR NO COVER
