     H            Y.
     F** CA#RC2 **************************
     F* CHECK GATE SCAN FOR A-PICS2/3 & PILOT
     F*     T.SAKAKI  2021.04.03         *
     F*----------+-----+----------+-----------------------------------*
     F*2021.07.08|TEC. |T.MITSUI  | A-PICS2 (19362)                   *
     F*****************************************************************
     FCA#PWC2 CF  E                    WORKSTN
     F                                        #RRN1 KSFILE FMT300S
     F                                              KINFDS INFDS
     FCA#PL08 IF  E           K        DISK
     FMRHPL51 UF  E           K        DISK
     FMRHPP71 IF  E           K        DISK
      *
     E                    ER      1  10 60
      * MASTER VALUE
     E                    CKOT       15  3
     E                    KOT        15  4
     E                    BMN        15 16
     E                    KBN        15  3
     E                    HAK        15  1
     E                    NYD        15  8 0
     E                    NYB        15  2 0
     E                    KND        15  8 0
     E                    KNT        15  6 0
     E                    KNN        15 10
      *
     I*==< SYSTEM INF. >==*
     I           SDS
     I                                     *PROGRAM $$PGM
     I                                      244 253 $$WSID
     I                                      254 263 $$USER
     I                                      264 269 $$JBNO
     I*==< WROKSTATION INF. >==*
     IINFDS       DS
     I                                      273 282 $$WSNM
     I                                    B 370 3710$$CUR
     I                                    B 378 3790$$RRN
     I*==< SCREEN >==*
     IF2BARC      DS
     I                                        1   4 F2BZET
     I                                        5   7 F2BTHI
     I                                        8  20 F2B820
     I            DS
     I                                        1  14 F3PART
     I                                        1   5 F3PAR1
     I                                        6   6 WKH1
     I                                        7  11 F3PAR2
     I                                       12  12 WKH2
     I                                       13  14 F3PAR3
     I*==< CA#PL08 >==*
     I*         ( PROCESS )
     I            DS
     I                                        1  45 CKOT
     I                                        1   3 C6KOT1
     I                                        4   6 C6KOT2
     I                                        7   9 C6KOT3
     I                                       10  12 C6KOT4
     I                                       13  15 C6KOT5
     I                                       16  18 C6KOT6
     I                                       19  21 C6KOT7
     I                                       22  24 C6KOT8
     I                                       25  27 C6KOT9
     I                                       28  30 C6KOTA
     I            DS
     I                                        1  60 KOT
     I                                        1   4 W6KOT1
     I                                        5   8 W6KOT2
     I                                        9  12 W6KOT3
     I                                       13  16 W6KOT4
     I                                       17  20 W6KOT5
     I                                       21  24 W6KOT6
     I                                       25  28 W6KOT7
     I                                       29  32 W6KOT8
     I                                       33  36 W6KOT9
     I                                       37  40 W6KOTA
     I*         ( DEPT )
     I            DS
     I                                        1 240 BMN
     I                                        1  16 C6BMN1
     I                                       17  32 C6BMN2
     I                                       33  48 C6BMN3
     I                                       49  64 C6BMN4
     I                                       65  80 C6BMN5
     I                                       81  96 C6BMN6
     I                                       97 112 C6BMN7
     I                                      113 128 C6BMN8
     I                                      129 144 C6BMN9
     I                                      145 160 C6BMNA
     I*         ( MACHINE # )
     I            DS
     I                                        1  45 KBN
     I                                        1   3 C6KBN1
     I                                        4   6 C6KBN2
     I                                        7   9 C6KBN3
     I                                       10  12 C6KBN4
     I                                       13  15 C6KBN5
     I                                       16  18 C6KBN6
     I                                       19  21 C6KBN7
     I                                       22  24 C6KBN8
     I                                       25  27 C6KBN9
     I                                       28  30 C6KBNA
     I*         ( BOX COLR )
     I            DS
     I                                        1  15 HAK
     I                                        1   1 C6HAK1
     I                                        2   2 C6HAK2
     I                                        3   3 C6HAK3
     I                                        4   4 C6HAK4
     I                                        5   5 C6HAK5
     I                                        6   6 C6HAK6
     I                                        7   7 C6HAK7
     I                                        8   8 C6HAK8
     I                                        9   9 C6HAK9
     I                                       10  10 C6HAKA
     I*         ( DELIV DATE )
     I            DS
     I                                        1 1200NYD
     I                                        1   80C6NYD1
     I                                        9  160C6NYD2
     I                                       17  240C6NYD3
     I                                       25  320C6NYD4
     I                                       33  400C6NYD5
     I                                       41  480C6NYD6
     I                                       49  560C6NYD7
     I                                       57  640C6NYD8
     I                                       65  720C6NYD9
     I                                       73  800C6NYDA
     I*         ( DELIV BIN )
     I            DS
     I                                        1  300NYB
     I                                        1   20C6NYB1
     I                                        3   40C6NYB2
     I                                        5   60C6NYB3
     I                                        7   80C6NYB4
     I                                        9  100C6NYB5
     I                                       11  120C6NYB6
     I                                       13  140C6NYB7
     I                                       15  160C6NYB8
     I                                       17  180C6NYB9
     I                                       19  200C6NYBA
     I*         ( PROCESS DATE )
     I            DS
     I                                        1 1200KND
     I                                        1   80C6KND1
     I                                        9  160C6KND2
     I                                       17  240C6KND3
     I                                       25  320C6KND4
     I                                       33  400C6KND5
     I                                       41  480C6KND6
     I                                       49  560C6KND7
     I                                       57  640C6KND8
     I                                       65  720C6KND9
     I                                       73  800C6KNDA
     I*         ( PROCESS TIME )
     I            DS
     I                                        1  900KNT
     I                                        1   60C6KNT1
     I                                        7  120C6KNT2
     I                                       13  180C6KNT3
     I                                       19  240C6KNT4
     I                                       25  300C6KNT5
     I                                       31  360C6KNT6
     I                                       37  420C6KNT7
     I                                       43  480C6KNT8
     I                                       49  540C6KNT9
     I                                       55  600C6KNTA
     I*         ( CHECK TM )
     I            DS
     I                                        1 150 KNN
     I                                        1  10 C6KNN1
     I                                       11  20 C6KNN2
     I                                       21  30 C6KNN3
     I                                       31  40 C6KNN4
     I                                       41  50 C6KNN5
     I                                       51  60 C6KNN6
     I                                       61  70 C6KNN7
     I                                       71  80 C6KNN8
     I                                       81  90 C6KNN9
     I                                       91 100 C6KNNA
     I*==< WORK >==*
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        7  140WTIHZ
      *---------------------------------------------------
      * KEY LIST
      *---------------------------------------------------
     C           KEY1      KLIST
     C                     KFLD           WKZETI  4
     C                     KFLD           WKTEHI  3
      *
      *---------------------------------------------------
      * MAIN ROUTINE
      *---------------------------------------------------
     C                     MOVEL'EDT1'    S@PROC  4
      *
     C           S@PROC    DOWNE'EXIT'
      *
     C                     SELEC
     C           S@PROC    WHEQ 'EDT1'
     C                     EXSR #EDT1
      *
     C           S@PROC    WHEQ 'DSP1'
     C                     EXSR #DSP1
      *
     C           S@PROC    WHEQ 'CHK1'
     C                     EXSR #CHK1
      *
     C           S@PROC    WHEQ 'EDT2'
     C                     EXSR #EDT2
      *
     C           S@PROC    WHEQ 'DSP2'
     C                     EXSR #DSP2
      *
     C           S@PROC    WHEQ 'CHK2'
     C                     EXSR #CHK2
      *
     C           S@PROC    WHEQ 'EDT3'
     C                     EXSR #EDT3
      *
     C           S@PROC    WHEQ 'DSP3'
     C                     EXSR #DSP3
      *
     C           S@PROC    WHEQ 'CHK3'
     C                     EXSR #CHK3
      *
     C           S@PROC    WHEQ 'EDT4'
     C                     EXSR #EDT4
      *
     C           S@PROC    WHEQ 'DSP4'
     C                     EXSR #DSP4
      *
     C           S@PROC    WHEQ 'UPDT'
     C                     EXSR #UPDT
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *---------------------------------------------------
      * 1ST SCREEN  INPUT OPERATOR CODE      < SETTINGS >
      *---------------------------------------------------
     C           #EDT1     BEGSR
      *
     C                     MOVEL*BLANK    F1OPCD
     C                     MOVEL*BLANK    F1EMSG
     C                     SETOF                     4099
      *
     C                     MOVEL'DSP1'    S@PROC
      *
     C           #EDT1E    ENDSR
      *---------------------------------------------------
      * 1ST SCREEN  INPUT OPERATOR CODE       < DISPLAY >
      *---------------------------------------------------
     C           #DSP1     BEGSR
      *
     C                     EXFMTFMT100
      *
     C                     SELEC
     C           *IN01     WHEQ '1'
     C                     MOVEL'EXIT'    S@PROC
     C                     OTHER
     C                     MOVEL'CHK1'    S@PROC
     C                     ENDSL
      *
     C           #DSP1E    ENDSR
      *---------------------------------------------------
      * 1ST SCREEN  INPUT OPERATOR CODE   < INPUT CHECK >
      *---------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     MOVEL*BLANK    F1EMSG
     C                     SETOF                     4099
      *
     C                     MOVEL*BLANK    F2OPNM
     C                     MOVEL*BLANK    F1EMSG
     C                     SETOF                     4099
      *
     C           F1OPCD    IFEQ *BLANK
     C  N99                MOVELER,01     F1EMSG
     C                     SETON                     4099
      *
     C                     ELSE
     C           F1OPCD    CHAINMRHPP71              70
     C           *IN70     IFEQ '0'
     C                     MOVELSBOPNM    F2OPNM           G1-PNL
     C                     ELSE
     C  N99                MOVELER,03     F1EMSG
     C                     SETON                     4099
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN99     IFEQ '0'
     C                     MOVEL'EDT2'    S@PROC
     C                     ELSE
     C                     MOVEL'DSP1'    S@PROC
     C                     ENDIF
      *
     C           #CHK1E    ENDSR
      *---------------------------------------------------
      * 2ND SCREEN   SCAN KANBAN BARCODE     < SETTINGS >
      *---------------------------------------------------
     C           #EDT2     BEGSR
      *
     C                     MOVEL*BLANK    F2BARC
     C                     MOVEL*BLANK    F2EMSG
     C                     SETOF                     4199
      *
     C                     MOVEL'DSP2'    S@PROC
      *
     C           #EDT2E    ENDSR
      *---------------------------------------------------
      * 2ND SCREEN   SCAN KANBAN BARCODE      < DISPLAY >
      *---------------------------------------------------
     C           #DSP2     BEGSR
      *
     C                     EXFMTFMT200
      *
     C                     SELEC
     C           *IN03     WHEQ '1'
     C                     MOVEL'EDT1'    S@PROC
     C                     OTHER
     C                     MOVEL'CHK2'    S@PROC
     C                     ENDSL
      *
     C           #DSP2E    ENDSR
      *---------------------------------------------------
      * 2ND SCREEN   SCAN KANBAN BARCODE  < INPUT CHECK >
      *---------------------------------------------------
     C           #CHK2     BEGSR
      *
     C                     MOVEL*BLANK    GETFLG  1
     C                     MOVEL*BLANK    FRFLG   1
     C                     MOVEL*BLANK    FLFLG   1
     C                     MOVEL*BLANK    WKPAR1  5
     C                     MOVEL*BLANK    WKPAR2  5
     C                     MOVEL*BLANK    WKPAR3  2
     C                     MOVEL*BLANK    WKZETI
     C                     MOVEL*BLANK    WKTEHI
     C                     MOVEL*BLANK    F2EMSG
     C                     SETOF                     4199
      *
     C           F2BARC    IFEQ *BLANK
     C  N99                MOVELER,03     F2EMSG
     C                     SETON                     4199
      *
     C                     ELSE
     C                     SELEC
     C           F2B820    WHNE *BLANK                     < CA#PP01 >
     C                     CALL 'BARR81'
     C                     PARM F2BARC    Q@BARC 20
     C                     PARM *BLANK    Q@KRKB  1
     C                     PARM *BLANK    Q@ZETI  4
     C                     PARM *BLANK    Q@TEHI  3
     C                     PARM *BLANK    Q@PAGN  2
     C                     PARM *BLANK    Q@BCKA  1
     C                     PARM *BLANK    Q@BCTK  1
     C                     PARM *BLANK    Q@BCYK  1
     C                     PARM *BLANK    Q@BCHK  1
     C                     PARM *BLANK    Q@BCKD  1
      *
     C                     MOVELF2BARC    PMAREA    P
     C                     CALL 'ALBRCC'
     C                     PARM           PMAREA100
     C                     PARM '014'     PMBYTE  3
     C                     PARM *BLANK    PMCHK   1
     C                     PARM *BLANK    PMRTCD  1
      *
     C           Q@BCKD    IFNE PMCHK
     C  N99                MOVELER,04     F2EMSG
     C                     SETON                     4199
      *
     C                     ELSE
     C                     MOVELQ@ZETI    WKZETI
     C                     MOVELQ@TEHI    WKTEHI
      *
     C                     EXSR #CA#P                       CA#PL08 GET
     C                     ENDIF
      *
     C           F2B820    WHEQ *BLANK                     < MRHPP51 >
     C                     MOVELF2BZET    WKZETI
     C                     MOVELF2BTHI    WKTEHI
      *
     C                     EXSR #MRHP                       MRHPL51 GET
     C                     ENDSL
      * NOT FOUND
     C           GETFLG    IFEQ *BLANK
     C  N99                MOVELER,05     F2EMSG
     C                     SETON                     4199
     C                     ENDIF
      * NON-CONFORMANCE
     C           FRFLG     IFNE *BLANK
     C  N99                MOVELER,08     F2EMSG
     C                     SETON                     4199
     C                     ENDIF
      * ALREADY FINISHED
     C           FLFLG     IFNE *BLANK
     C  N99                MOVELER,09     F2EMSG
     C                     SETON                     4199
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           *IN99     IFEQ '0'
     C                     SETOF                     61
     C                     MOVEL'EDT3'    S@PROC
     C                     ELSE
     C                     MOVEL'DSP2'    S@PROC
     C                     ENDIF
      *
     C           #CHK2E    ENDSR
      *===================================================*
      *  CA#PL08                                          *
      *===================================================*
     C           #CA#P     BEGSR
      *
     C                     MOVEL*BLANK    KOT
     C                     MOVEL*BLANK    BMN
     C                     MOVEL*BLANK    KBN
     C                     MOVEL*BLANK    HAK
     C                     Z-ADD*ZERO     NYD
     C                     Z-ADD*ZERO     NYB
     C                     Z-ADD*ZERO     KND
     C                     Z-ADD*ZERO     KNT
     C                     MOVEL*BLANK    KNN
      *
     C           KEY1      SETGTCA#PL08
     C           KEY1      REDPECA#PL08                  91
      *
     C           *IN91     DOWEQ'0'
     C           C6SKJY    ANDEQ'D'
     C           KEY1      REDPECA#PL08                  91
     C                     ENDDO
      *
     C           *IN91     IFEQ '0'
     C                     MOVEL'1'       GETFLG
      *
     C           C6FRHZ    IFNE *ZERO                       BREAK DATE
     C                     MOVEL'1'       FRFLG
     C                     ENDIF
      *
     C           C6FFLG    IFNE *BLANK                      FINISH FLAG
     C                     MOVEL'1'       FLFLG
     C                     ENDIF
      *
     C                     MOVELC6HIN1    WKPAR1
     C                     MOVELC6HIN2    WKPAR2
     C                     MOVELC6HIN3    WKPAR3
      *
     C                     DO   10        J
     C                     MOVELCKOT,J    KOT,J
     C                     ENDDO1
      *
     C                     ENDIF
      *
     C           #CA#PE    ENDSR
      *===================================================*
      *  MRHPL51                                          *
      *===================================================*
     C           #MRHP     BEGSR
      *
     C                     MOVEL*BLANK    KOT
     C                     MOVEL*BLANK    BMN
     C                     MOVEL*BLANK    KBN
     C                     MOVEL*BLANK    HAK
     C                     Z-ADD*ZERO     NYD
     C                     Z-ADD*ZERO     NYB
     C                     Z-ADD*ZERO     KND
     C                     Z-ADD*ZERO     KNT
     C                     MOVEL*BLANK    KNN
      *
     C           KEY1      SETLLMRHPL51
     C           KEY1      READEMRHPL51                  91
      *
     C           *IN91     DOWEQ'0'
     C           STGSJY    IFEQ 'D'
     C           STGSHZ    ANDLE*DATE
     C*                    |
     C                     ELSE
     C                     Z-ADDSTKTNO    J
     C                     MOVELSTKTEI    KOT,J
     C                     MOVELSTKBNM    BMN,J     P
     C                     MOVELSTMSNO    KBN,J
     C                     MOVELSTBCCD    HAK,J
     C                     Z-ADDSTKNHZ    NYD,J
     C                     Z-ADD*ZERO     NYB,J
     C                     Z-ADDSTCOHZ    KND,J
     C                     Z-ADD*ZERO     KNT,J
     C                     MOVELSTCONM    KNN,J
      *
     C                     MOVEL'1'       GETFLG
     C           STFFLG    IFNE *BLANK                      FINISH FLAG
     C                     MOVEL'1'       FLFLG
     C                     ENDIF
     C           STBRHZ    IFNE *ZERO                       BREAK DATE
     C                     MOVEL'1'       FRFLG
     C                     ENDIF
      *
     C                     MOVELSTSHN1    WKPAR1
     C                     MOVELSTSHN2    WKPAR2
     C                     MOVELSTSHN3    WKPAR3
     C                     ENDIF
      *
     C           KEY1      READEMRHPL51                  91
     C                     ENDDO
      *
     C           #MRHPE    ENDSR
      *---------------------------------------------------
      * 3RD SCREEN  INPUT PROCESS #          < SETTINGS >
      *---------------------------------------------------
     C           #EDT3     BEGSR
      *
     C                     SETON                     70
     C                     WRITEFMT300C
     C                     SETOF                     70
     C                     Z-ADD*ZERO     #RRN1
     C                     Z-ADD*ZERO     S@RRN1  40
     C                     Z-ADD*ZERO     Q#PCNO
     C                     MOVEL*BLANK    F3EMSG
     C                     SETOF                     4299
      *
     C                     MOVEL*BLANK    F3PART
     C                     MOVELWKPAR1    F3PAR1
     C           WKPAR2    IFNE *BLANK
     C                     MOVEL'-'       WKH1
     C                     MOVELWKPAR2    F3PAR2
     C                     ENDIF
     C           WKPAR3    IFNE *BLANK
     C                     MOVEL'-'       WKH2
     C                     MOVELWKPAR3    F3PAR3
     C                     ENDIF
      *
     C                     MOVELWKZETI    F3ZETI
     C                     MOVELWKTEHI    F3TEHI
      *
     C                     Z-ADD1         J       30
     C           J         DOWLE15
     C           KOT,J     ANDNE*BLANK
     C                     SETOF                     51
     C                     Z-ADDJ         @NO               PROCESS NO
     C                     MOVELKOT,J     AKOT              PROCESS CODE
     C                     MOVELBMN,J     AKOJ              DEPARTMENT NAME
     C                     MOVELKBN,J     AKBN              MACHINE #
     C                     Z-ADDNYD,J     ANOK              PLAN DATE
     C                     Z-ADDKND,J     ANOB              COMP.DATE
     C           KNT,J     DIV  100       ATIM              COMP.TIME
     C                     MOVELKNN,J     K@OPID  6
      *
     C           K@OPID    CHAINMRHPP71              92
      *
     C           *IN92     IFEQ '0'
     C                     MOVELSBOPNM    ATMN              TM CODE
     C                     ELSE
     C                     MOVEL*BLANK    ATMN              TM CODE
     C                     ENDIF
      *
     C                     SELEC
     C           F2B820    WHNE *BLANK                     < CA#PP01 >
     C           KND,J     IFNE *ZERO
     C                     SETOF                     52
     C                     ELSE
     C                     SETON                     52
     C                     ENDIF
     C           F2B820    WHEQ *BLANK                     < MRHPP51 >
     C                     SETON                     52
     C                     ENDSL
     C                     MOVEL*IN51     DHIN51           標識51
     C                     MOVEL*IN52     DHIN52           標識52
     C                     ADD  1         #RRN1
      *
     C                     WRITEFMT300S
      *
     C                     ADD  1         J
     C                     ENDDO
      *
     C           #RRN1     IFNE *ZERO
     C                     Z-ADD#RRN1     S@LAST  50
     C                     SETON                     71
     C                     ELSE
     C                     Z-ADD*ZERO     S@LAST
     C                     SETOF                     71
     C                     ENDIF
      *
     C                     SETOF                     61
     C                     Z-ADD1         S@RRN1
     C                     MOVEL'DSP3'    S@PROC
      *
     C           #EDT3E    ENDSR
      *---------------------------------------------------
      * 3RD SCREEN  INPUT PROCESS #           < DISPLAY >
      *---------------------------------------------------
     C           #DSP3     BEGSR
      *
     C                     Z-ADDS@RRN1    #RRN1
     C                     WRITEFMT300
     C                     EXFMTFMT300C
     C                     Z-ADD$$RRN     S@RRN1
     C                     TIME           WTIME
      *
     C                     SELEC
     C           *IN03     WHEQ '1'
     C                     MOVEL'EDT2'    S@PROC
     C                     OTHER
     C                     MOVEL'CHK3'    S@PROC
     C                     ENDSL
      *
     C           #DSP3E    ENDSR
      *---------------------------------------------------
      * 3RD SCREEN  INPUT PROCESS #       < INPUT CHECK >
      *---------------------------------------------------
     C           #CHK3     BEGSR
      *
     C                     MOVEL*BLANK    F3EMSG
     C                     SETOF                     4299
      *
     C           Q#PCNO    IFEQ 0
     C  N99                MOVELER,06     F3EMSG
     C                     SETON                     4299
      *
     C                     ELSE
     C           Q#PCNO    CHAINFMT300S              81
      *
     C           *IN81     IFEQ '1'
     C  N99                MOVELER,06     F3EMSG
     C                     SETON                     4299
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN99     IFEQ '0'
     C                     MOVEL'EDT4'    S@PROC
     C                     ELSE
     C                     MOVEL'DSP3'    S@PROC
     C                     ENDIF
      *
     C           #CHK3E    ENDSR
      *---------------------------------------------------
      * 4TH SCREEN  UPDATE                   < SETTINGS >
      *---------------------------------------------------
     C           #EDT4     BEGSR
      *
     C                     Z-ADD1         #RRN1
     C           #RRN1     CHAINFMT300S              81
      *
     C           *IN81     DOWEQ'0'
     C                     MOVELDHIN51    *IN51
     C                     MOVELDHIN52    *IN52
      *
     C           #RRN1     IFEQ Q#PCNO
     C                     SETON                     51
     C                     Z-ADDWTIHZ     DHANOB
     C                     Z-ADDWJFB      DHATIM
     C                     ELSE
     C                     SETOF                     51
     C                     Z-ADD*ZERO     DHANOB
     C                     Z-ADD*ZERO     DHATIM
     C                     ENDIF
      *
     C                     MOVEL*IN51     DHIN51
     C                     MOVEL*IN52     DHIN52
      *
     C                     UPDATFMT300S
     C                     ADD  1         #RRN1
     C           #RRN1     CHAINFMT300S              81
     C                     ENDDO
      *
     C                     Z-ADDQ#PCNO    S@RRN1
     C                     SETON                     61
     C                     MOVEL'DSP4'    S@PROC
      *
     C           #EDT4E    ENDSR
      *---------------------------------------------------
      * 4TH SCREEN  UPDATE                    < DISPLAY >
      *---------------------------------------------------
     C           #DSP4     BEGSR
      *
     C                     Z-ADDS@RRN1    #RRN1
     C                     WRITEFMT300
     C                     EXFMTFMT300C
     C                     Z-ADD$$RRN     S@RRN1
      *
     C                     SELEC
     C           *IN03     WHEQ '1'
     C                     MOVEL'EDT3'    S@PROC
     C           *IN05     WHEQ '1'
     C                     MOVEL'UPDT'    S@PROC
     C                     OTHER
     C                     MOVEL'DSP4'    S@PROC
     C                     ENDSL
      *
     C           #DSP4E    ENDSR
      *---------------------------------------------------
      * DATA UPDATE
      *---------------------------------------------------
     C           #UPDT     BEGSR
      *
     C           Q#PCNO    CHAINFMT300S              81
      *
     C           *IN81     IFEQ '0'
      *
     C                     SELEC
     C           F2B820    WHNE *BLANK                     < CA#PP01 >
     C                     MOVELF1OPCD    P@KNN     P
     C                     CALL 'CA#RC6'
     C                     PARM F2BARC    P@BARC 20
     C                     PARM @NO       P@NO    20
     C                     PARM DHANOB    P@KND   80
     C                     PARM DHATIM    P@KNT   60
     C                     PARM           P@KNN  10
      *
     C           F2B820    WHEQ *BLANK                     < MRHPP51 >
     C           KEY1      SETLLMRHPL51
     C           KEY1      READEMRHPL51                  91
      *
     C           *IN91     DOWEQ'0'
     C           STGSJY    IFEQ 'D'
     C           STGSHZ    ANDLE*DATE
     C*                    |
     C                     ELSE
     C           @NO       IFEQ S@LAST
     C                     MOVEL'1'       STFFLG
     C                     ENDIF
     C           @NO       IFEQ STKTNO
     C                     Z-ADDDHANOB    STCOHZ
     C                     MOVELF1OPCD    STCONM
     C                     ENDIF
     C                     UPDATMRHPL511
     C                     ENDIF
      *
     C           KEY1      READEMRHPL51                  91
     C                     ENDDO
      *
     C                     ENDSL
      *
     C                     ENDIF
      *
     C                     MOVEL'CHK2'    S@PROC
      *
     C           #UPDTE    ENDSR
      *----------------------------------------------------*
** ER
E-01 THIS IS A REQUIRED FIELD.
E-02 INCORRECT OPERATOR CODE.
E-03 INPUT BARCODE
E-04 CHECK DIGIT ERR
E-05 DATA NOT FOUND
E-06 INCORRECT PROCESS #.
E-07 CURRENT PROCESS IS #
E-08 NON-CONFORMACE LOT #.
E-09 ALREADY FINISHED.
E-10 PROCESS # SELECTION IS INCORRECT.
