     H            Y.
     F** CAAR50 **************************
     F* * PRODUCT ORDER AGAIN AND OVER MADE DATA INPUT
     F*        <INSTRUCTION KANBAN>    *
     F* A.IDOTA 1993.08.27 *
     F************************** CAAR50 **
     FCABPL01 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FCAAPL50 UF  E           K        DISK                      A
     FCAAPP51 UF  E           K        DISK                      A
     FADAPP01 O   E                    DISK
     FCA#PP11 O   E                    DISK
     E                    CKKB       15  3               新　機番
     E                    CKBM       15  4 0             　　部門
     E                    CKKO       15  3               　　工程
     E                    CKTR       15  6               　　所番地
     E                    CKTY       15  1               　　かんばん
     E                    CKQN       15  3               旧　機番
     E                    CKQB       15  4 0             　　部門
     E                    CKQK       15  3               　　工程
     E                    CKQR       15  6               　　所番地
     E                    CKQS       15  1               　　かんばん
     E                    CKHZ       15 10 0             切替日
     E                    #BAR    1  20  5               ﾌﾟﾇﾝｰnﾞ
     I            DS
     I                                        1  45 CKKB
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  600CKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  45 CKKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  90 CKTR
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  15 CKTY
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  45 CKQN
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN10
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I            DS
     I                                        1  600CKQB
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  45 CKQK
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  90 CKQR
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1  15 CKQS
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I            DS
     I                                        1 1500CKHZ
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
      *削除日付*
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *収容数切替日*
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      *時間*
     I            DS
     I                                        1   60WTIME
     I                                        1   20HH
     I                                        3   40SS
      *バーコード*
     I            DS
     I                                        1  15 BAR@@
     I                                        1   1 KSN@@
     I                                        2   5 ZETI@@
     I                                        6   8 TENO@@
     I                                        9  11 PNO@@
     I                                       15  15 CD@@
     I            DS
     I                                        1  10 @KOME
     I                                        1   5 WUSNAM
      * PARM *
     C           *ENTRY    PLIST
     C                     PARM           PARM1  10        ﾏｰﾅﾞｰ ﾃｰnﾞ
     C                     PARM           PARM2   5        品番・１
     C                     PARM           PARM3   5        　　・２
     C                     PARM           PARM4   2        　　・３
     C                     PARM           PARM5   30       枚数
     C                     PARM           PARM6   1        mﾞｰj区分
     C                     PARM           PARM7   70       増減数
     C                     PARM           PARM8   1        ﾌﾞｰﾃｰnﾞ区分
     C                     PARM           PARM9  15        ﾌﾞｰﾃｰnﾞ
     C                     PARM           PARMA   1        業務区分
      * MOVE *
     C                     MOVELPARM1     @KOME  10
     C                     MOVELPARM2     @SHN1   5
     C                     MOVELPARM3     @SHN2   5
     C                     MOVELPARM4     @SHN3   2
     C                     Z-ADDPARM5     @MISU   30
     C                     MOVELPARM6     @KBN    1
     C                     Z-ADDPARM7     @ZGSU   70
     C                     MOVELPARM8     @BAR    1
     C                     MOVELPARM9     BAR@@  15
     C                     MOVELPARMA     @GYM    1
      * KEY *
     C           KEY1      KLIST
     C                     KFLD           @SHN1
     C                     KFLD           @SHN2
     C                     KFLD           @SHN3
     C           KEY2      KLIST
     C                     KFLD           WYEAR
     C                     KFLD           WMONTH
     C                     KFLD           WDAY
      *
     C                     TIME           WTIME
     C                     Z-ADD*YEAR     WYEAR   40
     C                     Z-ADDUMONTH    WMONTH  20
     C                     Z-ADDUDAY      WDAY    20
      *------------------------------------------*
      *Ａ－ＰＩＣＳⅡ平準化確定発注累積ファイル*
      *------------------------------------------*
     C                     SETOF                     30
     C           KEY1      CHAINCABPL011             30
     C           *IN30     IFEQ '0'
     C           C3SKJY    IFEQ 'D'
     C           C3SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C                     END
     C           *IN30     IFEQ '0'
      *--------------------------------*
      *Ａ－ＰＩＣＳⅡ受注累積ファイル*
      *--------------------------------*
     C                     MOVE *BLANK    C7SKJY
     C                     Z-ADD0         C7SKYY
     C                     Z-ADD0         C7SKMM
     C                     Z-ADD0         C7SKDD
     C                     Z-ADD*YEAR     C7KOYY
     C                     Z-ADDUMONTH    C7KOMM
     C                     Z-ADDUDAY      C7KODD
     C                     Z-ADDHH        C7KOHH
     C                     Z-ADDSS        C7KOSS
     C                     MOVEL@KOME     C7KOME
      *
     C                     MOVELC3SHN1    C7SHN1
     C                     MOVELC3SHN2    C7SHN2
     C                     MOVELC3SHN3    C7SHN3
     C                     MOVELC3SJSR    C7KDAI
     C                     MOVELC3ZETI    C7ZETI
      *
     C           @BAR      IFEQ 'N'
  K.YC                     MOVE *ALL'0'   C7THNO
     C                     ELSE
     C                     MOVELTENO@@    C7THNO
     C                     END
      *
     C                     Z-ADDC3MBCD    C7MBMN
     C                     MOVELC3TKR1    C7TKR1
     C                     MOVELC3TKR2    C7TKR2
     C                     MOVELC3TKR3    C7TKR3
     C                     MOVELC3TKR4    C7TKR4
     C                     Z-ADD@MISU     C7HKSU
     C                     Z-ADDC3SJSU    C7SYOS
     C                     Z-ADD*YEAR     C7KEYY
     C                     Z-ADDUMONTH    C7KEMM
     C                     Z-ADDUDAY      C7KEDD
     C                     Z-ADDHH        C7KEJI
     C                     Z-ADDSS        C7KEPN
      *
     C                     MOVEL'20'      C7GYOM
     C           @GYM      IFEQ 'A'
     C                     MOVEL'23'      C7GYOM
     C                     END
      *
     C                     Z-ADD0         C7DTYY
     C                     Z-ADD0         C7DTMM
     C                     Z-ADD0         C7DTDD
     C                     Z-ADD0         C7DTHH
     C                     Z-ADD0         C7DTSS
     C                     WRITECA#PP111
      *------------------------------*
      *再手配・作り過ぎ累積ファイル*
      *------------------------------*
     C                     Z-ADD*YEAR     ADKOYY
     C                     Z-ADDUMONTH    ADKOMM
     C                     Z-ADDUDAY      ADKODD
     C                     Z-ADDHH        ADKOJI
     C                     Z-ADDSS        ADKOPN
     C                     MOVEL@KOME     ADKOME
     C                     MOVELC3SHN1    ADHIN1
     C                     MOVELC3SHN2    ADHIN2
     C                     MOVELC3SHN3    ADHIN3
      *機番*
     C                     MOVE *BLANK    ADKBN1
     C                     MOVE *BLANK    ADKBN2
     C                     SETOF                     31
     C           KEY1      CHAINAAMPL111             31
     C           *IN31     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     31
     C                     END
      *
     C           *IN31     IFEQ '0'
     C                     DO   15        X       20
     C                     MOVELCKHZ,X    WUKH    80
     C           *DATE     IFLT WUKH
     C           CKQK,X    IFNE *BLANK
     C           CKQS,X    ANDEQ'F'
     C                     MOVELCKQN,X    ADKBN1
     C                     END
     C                     ELSE
      *
     C           CKKO,X    IFNE *BLANK
     C           CKTY,X    ANDEQ'F'
     C                     MOVELCKKB,X    ADKBN1
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     Z-ADDC3MBCD    ADZBMN
     C                     Z-ADD0         ADMBMN
     C                     MOVELC3RAIN    ADLAIN
     C                     MOVELC3MKBA    ADBARL
     C                     Z-ADD0         ADCHAK
     C                     Z-ADDC3SJSU    ADSYOS
     C                     Z-ADD@MISU     ADMAIS
      *単位*
     C                     SETOF                     31
     C                     MOVE *BLANK    ADSYOT
     C           KEY1      CHAINFCEPL011             31
     C           *IN31     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     31
     C                     END
     C           *IN31     IFEQ '0'
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYT    ADSYOT
     C                     ELSE
     C                     MOVE A2SSYT    ADSYOT
     C                     END
     C                     END
      *------------------------------*
      *再手配・作り過ぎ回数カウント*
      *------------------------------*
     C                     SETOF                     31
     C           KEY1      CHAINCAAPL501             31
     C           *IN31     IFEQ '1'
     C                     MOVELC3SHN1    APHIN1
     C                     MOVELC3SHN2    APHIN2
     C                     MOVELC3SHN3    APHIN3
     C           @KBN      IFEQ '1'
     C                     Z-ADD1         APSKIS
     C                     Z-ADD0         APTKIS
     C                     ELSE
     C                     Z-ADD0         APSKIS
     C                     Z-ADD1         APTKIS
     C                     END
     C                     WRITECAAPL501
     C                     ELSE
      *
     C           @KBN      IFEQ '1'
     C                     ADD  1         APSKIS
     C                     ELSE
     C                     ADD  1         APTKIS
     C                     END
     C                     UPDATCAAPL501
     C                     END
      *
     C           @KBN      IFEQ '1'
     C                     Z-ADDAPSKIS    ADKAIS
     C                     ELSE
     C                     Z-ADDAPTKIS    ADKAIS
     C                     END
      *
     C                     Z-ADDC3BHAS    ADBTNS
     C                     Z-ADD@ZGSU     ADZGSU
     C           C3BHAS    ADD  @ZGSU     ADKSSU
      *
     C           @BAR      IFEQ 'N'
     C                     MOVE *BLANK    ADKSKB
     C                     MOVE *BLANK    ADZETI
     C                     MOVE *BLANK    ADTHNO
     C                     MOVE *BLANK    ADPGNO
     C                     ELSE
     C                     MOVELKSN@@     ADKSKB
     C                     MOVELZETI@@    ADZETI
     C                     MOVELTENO@@    ADTHNO
     C                     MOVELPNO@@     ADPGNO
     C                     END
      *
     C           @KBN      IFEQ '1'
     C                     MOVEL'S'       ADDTKB
     C                     ELSE
     C                     MOVEL'T'       ADDTKB
     C                     END
      *
     C                     WRITEADAPP011
      *----------------------------------------*
      *再手配・作り過ぎバーコード読みとり件数*
      *----------------------------------------*
     C                     Z-ADD1         E       20
     C                     SETOF                     31
     C           WUSNAM    LOKUP#BAR,E                   31
     C           *IN31     IFEQ '1'
      *
     C                     SETOF                     31
     C           KEY2      CHAINCAAPP511             31
     C           *IN31     IFEQ '1'
     C           @KBN      IFEQ '1'
     C                     Z-ADD*YEAR     AWKOYY
     C                     Z-ADDUMONTH    AWKOMM
     C                     Z-ADDUDAY      AWKODD
     C                     Z-ADD1         AWSAIT
     C                     Z-ADD0         AWTSUK
     C                     ELSE
     C                     Z-ADD*YEAR     AWKOYY
     C                     Z-ADDUMONTH    AWKOMM
     C                     Z-ADDUDAY      AWKODD
     C                     Z-ADD0         AWSAIT
     C                     Z-ADD1         AWTSUK
     C                     END
     C                     WRITECAAPP511
      *
     C                     ELSE
      *
     C           @KBN      IFEQ '1'
     C                     ADD  1         AWSAIT
     C                     ADD  0         AWTSUK
     C                     ELSE
     C                     ADD  0         AWSAIT
     C                     ADD  1         AWTSUK
     C                     END
     C                     UPDATCAAPP511
     C                     END
     C                     END
      *****
     C                     END
      *****
     C                     SETON                     LR
     C                     RETRN
**  #BAR
A0001
A0002
A0003
A0004
A0005
A0006
A0009
A0010
A0011
A0012
A0013
A0014
A0015
A0016
A2024
A2027
A2028
A2030
A2032
A2033
