     H            Y.                                    1
      ** CAAR31 **********************************
      * WRITE A-PICS2 INSTORE KANBAN ISSUE FILE  *
      *               CREATE DATE : 2021.07.21   *
      *               AUTHOR      : T.SAKAKI     *
      ********************************** CAAR31 **
     FCAAWP30 IP  F     512            DISK
     FCAAPP30 O   E                    DISK
     FNZUPP01 O   E                    DISK
     FCA#PP11 O   E                    DISK
     ICAAWP30 AA  01
     I                                        1   1 C3TYPE
     I                                        2   90C3PRDT
     I                                       10  150C3PRTM
     I                                       16  180C3SEQN
     I                                       23  23 C3KDAI
     I                                       24  24 C3KSYO
     I                                       48  52 C3SHN1
     I                                       53  57 C3SHN2
     I                                       58  59 C3SHN3
     I                                       60  60 C3TKR1
     I                                       61  62 C3TKR2
     I                                       63  64 C3TKR3
     I                                       65  65 C3TKR4
     I                                       67  70 C3RZET
     I                                       71  73 C3RTHI
     I                                      111 1150C3SYOS
     I                                      116 116 C3SYOT
     I                                      135 137 C3JKOT
      * # OF NORMAL KANBAN
     I                                      274 2760W3LOT
      * # OF EXTRA
     I                                      277 2790W3BOX
      * # OF PARTIAL
     I                                      280 2820W3PAR
      *
     I                                      283 283 C3KANR
     I                                      284 287 C3SZET
     I                                      288 290 C3STHI
     I                                      291 292 C3SPAG
     I                                      293 293 C3NIJI
     I                                      294 294 C3TAIS
     I                                      295 295 C3SYKO
     I                                      296 296 C3HKSY
     I                                      297 297 C3CHKD
      *
     I                                      298 303 W3TMCD
      *
     I            DS
     I                                        1   80C7KOHZ
     I                                        1   40C7KOYY
     I                                        5   60C7KOMM
     I                                        7   80C7KODD
     I            DS
     I                                        1   80C7KEHZ
     I                                        1   40C7KEYY
     I                                        5   60C7KEMM
     I                                        7   80C7KEDD
      *
     I            DS
     I                                        1  140WDATE
     I                                        1   60STIME
     I                                        1   20SHOUR
     I                                        3   40SMINU
     I                                        7  140SDATE
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *---------------------------------------------------
      * MAIN
      *---------------------------------------------------
     C                     TIME           WDATE
      *
      * WRITE INSTORE-KANBAN ISSUE RESULT
     C                     EXSR #WRT1
      * WRITE A-PICS STATUS
     C           C3TAIS    IFNE '3'                        PARTIAL +
     C                     EXSR #WRT2
     C                     ENDIF
      *
      * WRITE A-PICS2 ORDER
     C           C3SEQN    IFEQ 1                          SEQ #
     C           W3LOT     SUB  W3BOX     QTY     30
      *
     C           QTY       IFNE 0
     C                     EXSR #WRT3
     C                     ENDIF
      *
     C                     ENDIF
     C***************************************************
      * WRITE INSTORE-KANBAN ISSUE RESULT
     C           #WRT1     BEGSR
     C***************************************************
     C                     Z-ADDSDATE     C3ADDT
     C                     Z-ADDSTIME     C3ADTM
     C                     MOVELW3TMCD    C3TMCD
     C                     WRITECAAPP301
     C*
     C           EWRT1     ENDSR
     C***************************************************
      * WRITE A-PICS STATUS
     C           #WRT2     BEGSR
     C***************************************************
     C                     CLEARNZUPP011
     C                     Z-ADDSDATE     N2KOHZ
     C                     Z-ADDSTIME     N2KOTI
     C                     MOVELW#USER    N2KOME
     C                     MOVELW#PGM     N2KOPG
     C                     MOVEL'1'       N2ONOF
     C                     MOVELC3SHN1    N2SHN1
     C                     MOVELC3SHN2    N2SHN2
     C                     MOVELC3SHN3    N2SHN3
     C                     MOVELC3SZET    N2ZETI
     C                     MOVELC3STHI    N2TEHI
     C                     MOVELC3SPAG    N2PAGN
     C                     MOVELC3KDAI    N2KDAI
     C                     MOVELC3KSYO    N2KSYO
     C                     Z-ADDC3SYOS    N2KSYU
     C                     MOVELC3SYOT    N2KSTI
     C                     MOVELC3JKOT    N2JKOT
     C                     MOVEL'0111'    N2JBMN
     C                     MOVELC3TKR1    N2JTK1
     C                     MOVELC3TKR2    N2JTK2
     C                     MOVELC3TKR3    N2JTK3
     C                     MOVELC3TKR4    N2JTK4
     C                     MOVEL*BLANK    N2MKOT
     C                     MOVEL'0111'    N2MBMN
     C                     MOVEL*BLANK    N2MTK1
     C                     MOVEL*BLANK    N2MTK2
     C                     MOVEL*BLANK    N2MTK3
     C                     MOVEL*BLANK    N2MTK4
     C                     Z-ADDC3PRDT    N2HAHZ
     C                     Z-ADD1         N2HABB
     C                     Z-ADD0         N2SYHZ
     C                     Z-ADD0         N2SYBB
     C                     Z-ADD0         N2MKHZ
     C                     Z-ADD0         N2MKBB
     C                     Z-ADD0         N2KSHZ
     C                     Z-ADD0         N2KSBB
     C*
     C                     MOVELC3KANR    N2KANR
     C                     MOVELC3SZET    N2SZET
     C                     MOVELC3STHI    N2STHI
     C                     MOVE C3SPAG    N2SPAG
     C                     MOVELC3NIJI    N2NIJI
     C                     MOVELC3TAIS    N2TAIS
     C                     MOVELC3SYKO    N2SYKO
     C                     MOVELC3HKSY    N2HKSY
     C                     MOVELC3CHKD    N2CHKD
     C                     Z-ADD0         N2NYHZ
     C                     Z-ADD0         N2NYTI
     C                     Z-ADD0         N2DEHZ
     C                     Z-ADD0         N2DETI
     C                     WRITENZUPP011
     C*
     C           EWRT2     ENDSR
     C***************************************************
     C*  .WRITE A-PICS2 ORDER FILE
     C           #WRT3     BEGSR
     C***************************************************
      *
     C                     CLEARCA#PP111
      *
     C                     Z-ADDSDATE     C7KOHZ
     C                     Z-ADDSHOUR     C7KOHH
     C                     Z-ADDSMINU     C7KOSS
     C                     MOVELW#USER    C7KOME
     C                     MOVELW#PGM     C7KOPG
     C                     MOVELC3SHN1    C7SHN1
     C                     MOVELC3SHN2    C7SHN2
     C                     MOVELC3SHN3    C7SHN3
     C                     MOVELC3KDAI    C7KDAI
     C                     MOVELC3SZET    C7ZETI
     C                     MOVE C3STHI    C7THNO
      *
     C                     Z-ADDC3SYOS    C7SYOS
      *
     C                     Z-ADDQTY       C7HKSU
      * PARTIAL +
     C           C7HKSU    IFGT 0
     C                     MOVE '32'      C7GYOM
     C                     ENDIF
      * EXTRA   -
     C           C7HKSU    IFLT 0
     C                     MOVE '56'      C7GYOM
     C                     ENDIF
      *
     C                     Z-ADDSDATE     C7KEHZ
     C                     Z-ADDSHOUR     C7KEJI
     C                     Z-ADDSMINU     C7KEPN
      *
     C                     WRITECA#PP111
      *
     C           EWRT3     ENDSR
