     H            Y.
     F** CAAR41 **************************
     F* A-PICS2 USAGE RECORD ENTRY       *
     F*       T.SAKAKI 2020.08.19        *
     F************************** CAAR41 **
     FCAAWP40 IP  E           K        DISK
     FCA#PL02 IF  E           K        DISK
     FCA#PP11 O   E                    DISK
     ICAAWP401
     I                                              CAZETIL1
     I                                              CATEHIL1
     I            DS
     I                                        1  140WTIME
     I                                        1   20HH
     I                                        3   40SS
     I                                        7  100WYEAR
     I                                       11  120WMONTH
     I                                       13  140WDAY
     C           *ENTRY    PLIST
     C                     PARM           US     10
      * KEY *
     C           KEY       KLIST
     C                     KFLD           ZETI
     C                     KFLD           TEHI
      *
     C                     TIME           WTIME
      **********************************************
      *  初期設定                        MAIN-1  *
      **********************************************
     C           *INL1     IFEQ '1'
     C                     Z-ADD0         MISU    30
     C                     END
      **********************************************
      *  加算                            MAIN-2  *
      **********************************************
     C                     ADD  CAMISU    MISU
      **********************************************
      *  出力                            MAIN-3  *
      **********************************************
     CL1                   EXSR SUB
      *--------------------------------------------*
      *  受注累積ファイルに出力          SUB-1   *
      *--------------------------------------------*
     C           SUB       BEGSR
      *確定発注累積ファイル*
     C                     MOVELCAZETI    ZETI    4
     C                     MOVELCATEHI    TEHI    3
      *
     C                     SETOF                     30
     C           KEY       CHAINCA#PL021             30
     C           *IN30     IFEQ '0'
     C           C6SKJY    ANDEQ'D'
     C           C6SKDT    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '1'
     C                     GOTO SEND
     C                     END
      *出力*
     C                     MOVE *BLANK    C7SKJY
     C                     Z-ADD0         C7SKYY
     C                     Z-ADD0         C7SKMM
     C                     Z-ADD0         C7SKDD
     C                     Z-ADD0         C7KOYY
     C                     Z-ADD0         C7KOMM
     C                     Z-ADD0         C7KODD
     C                     Z-ADD0         C7KOHH
     C                     Z-ADD0         C7KOSS
     C                     MOVE *BLANK    C7KOME
     C                     MOVE *BLANK    C7SHN1
     C                     MOVE *BLANK    C7SHN2
     C                     MOVE *BLANK    C7SHN3
     C                     MOVE *BLANK    C7KDAI
     C                     MOVE *BLANK    C7ZETI
     C                     MOVEL*BLANK    C7THNO
     C                     Z-ADD0         C7MBMN
     C                     MOVE *BLANK    C7TKR1
     C                     MOVE *BLANK    C7TKR2
     C                     MOVE *BLANK    C7TKR3
     C                     MOVE *BLANK    C7TKR4
     C                     Z-ADD0         C7HKSU
     C                     Z-ADD0         C7SYOS
     C                     Z-ADD0         C7KEYY
     C                     Z-ADD0         C7KEMM
     C                     Z-ADD0         C7KEDD
     C                     Z-ADD0         C7KEJI
     C                     Z-ADD0         C7KEPN
     C                     MOVE *BLANK    C7GYOM
     C                     Z-ADD0         C7DTYY
     C                     Z-ADD0         C7DTMM
     C                     Z-ADD0         C7DTDD
     C                     Z-ADD0         C7DTHH
     C                     Z-ADD0         C7DTSS
      * MOVE *
     C                     Z-ADDWYEAR     C7KOYY
     C                     Z-ADDWMONTH    C7KOMM
     C                     Z-ADDWDAY      C7KODD
     C                     Z-ADDHH        C7KOHH
     C                     Z-ADDSS        C7KOSS
     C                     MOVELUS        C7KOME
     C                     MOVELC6HIN1    C7SHN1
     C                     MOVELC6HIN2    C7SHN2
     C                     MOVELC6HIN3    C7SHN3
     C                     MOVEL'F'       C7KDAI
     C                     MOVELC6ZETI    C7ZETI
     C                     MOVELC6RTNO    C7THNO
     C                     Z-ADD0111      C7MBMN
     C                     MOVELC6TKR1    C7TKR1
     C                     MOVELC6TKR2    C7TKR2
     C                     MOVELC6TKR3    C7TKR3
     C                     MOVELC6TKR4    C7TKR4
     C                     Z-ADDMISU      C7HKSU
     C                     Z-ADDC6SYOS    C7SYOS
     C                     Z-ADDWYEAR     C7KEYY
     C                     Z-ADDWMONTH    C7KEMM
     C                     Z-ADDWDAY      C7KEDD
     C                     Z-ADDHH        C7KEJI
     C                     Z-ADDSS        C7KEPN
     C                     MOVEL'25'      C7GYOM
      *
     C                     WRITECA#PP111
     C           SEND      ENDSR
