     H            Y.
     F** CAAR05 ****************************
     F* WRITE INSTRUCTION KANBAN DATA  ..  *
     F*         T-SAKAKI    2020.09.10     *
     F**************************** CAAR05 **
     FCAAWP05 IF  E           K        DISK
     FCAAPP05 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WDATE
     I                                        1   60STIME
     I                                        7  140SDATE
      *---------------------------------------------
      * MAIN
      *---------------------------------------------
     C                     TIME           WDATE
     C                     Z-ADD0         WSKNO   40
      *
     C           *LOVAL    SETLLCAAWP051
     C                     DO   *HIVAL
     C                     READ CAAWP051                 02
     C   02                LEAVE
     C*
     C                     MOVEL*BLANK    C6SKJY
     C                     Z-ADD0         C6SKDT
     C                     Z-ADDSDATE     C6CRDT
     C                     Z-ADDSTIME     C6CRTM
     C                     ADD  1         WSKNO
     C                     Z-ADDWSKNO     C6SKNO
      *
     C                     WRITECAAPP051
      *
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
