     H            Y.
     F** CAAR03 **************************************
     F* A-PICS2  DIVIDE QUANTITY                 *
     F*     T-SAKAKI                2020.08.19   *
     F************************************** CAAR03 **
     FCAAWP03 IP  F     100            DISK
     FCABPL01 UF  E           K        DISK
     ICAAWP03 AA  01
     I                                        1   5 ISHN1
     I                                        6  10 ISHN2
     I                                       11  12 ISHN3
     I                                       13  210ISRYO
     C           KEY1      KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
      *
     C                     SETOF                     02
     C           KEY1      CHAINCABPL011             02
     C           *IN02     IFEQ '0'
     C           C3SKJY    ANDEQ'D'
     C           C3SKHZ    ANDLE*DATE
     C                     SETON                     02
     C                     END
     C           *IN02     IFEQ '1'
     C                     GOTO END
     C                     END
      *
     C           ISRYO     ADD  C3BHAS    WJBSU  100
      *
     C****       C3SJSU    MULT C3MKBA    WBRSU   70
      *
     C* PRODUCTION LOT QTY
     C           C3SJSU    MULT C3PROL    WBRSU   70
      *
      * BARREL QTY < LOT QTY
     C           WJBSU     IFLT WBRSU
     C                     Z-ADDWJBSU     C3BHAS
     C                     ELSE
      *
     C                     Z-ADD0         C3BHAS
      * BARREQ QTY / LOT QTY
     C           WJBSU     DIV  WBRSU     WSRYO   30
     C                     MVR            WAMAR   90
      *
     C                     Z-ADDWAMAR     C3BHAS
      *
     C           WSRYO     MULT C3PROL    WSRBA   30
      *
     C           C3T1KU    IFEQ 0
     C                     ADD  WSRBA     C3T1SU
     C                     ELSE
     C                     ADD  WSRBA     C3Y1SU
     C                     END
      *
     C                     END
      *
     C                     UPDATCABPL011
      *
     C           END       TAG
