     H            Y.
     F** CAARB1 **************************************
     F*  ..Ａ－ＰＩＣＳⅡ未転送データリスト出力..  *
     F*  ..Ａ－ＰＩＣＳⅡ平準化確定発注ファイル    *
     F*      I-HASADA                  93.05.13      *
     F************************************** CAARB1 **
     FCABPL02 UP  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER                        UC
     E                    TM1     1   1 48
     E                    TM2     1   1 54
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
      *
     C           *IN10     IFEQ '0'
     C                     SETON                     10
      *
     C                     SETOF                     11
     C                     MOVE *BLANK    WUSNM   9
     C           PUS       CHAINRGAPL111             11
     C           *IN11     IFEQ '0'
     C           J8SKJY    ANDEQ*BLANK
     C                     MOVELJ8NAME    WUSNM
     C                     END
      *
     C                     END
      *
     C                     SETOF                     01
     C           C3T1SU    IFNE 0
     C           C3T1KU    ANDEQ0
     C                     SETON                     01
     C                     END
      *
     C           C3T2SU    IFNE 0
     C           C3T2KU    ANDEQ0
     C                     SETON                     01
     C                     END
      *
     C           *IN01     IFEQ '1'
      *
     C           *IN02     IFEQ '0'
     C                     SETON                     02OF
     C                     OPEN QPRINT
     C                     TIME           WTIME   60
     C                     END
      *
     C           *INOF     IFEQ '1'
     C                     SETOF                     OF
      *
     C           WPRKB     IFEQ '*'
     C                     EXCPTMEI2
     C                     END
      *
     C                     MOVE '*'       WPRKB   1
     C                     EXCPTHED
     C                     END
      *
     C                     SETON                     U2
     C                     EXCPTMEI1
     C                     END
      *
     C                     Z-ADDC3Y1SU    C3T1SU
     C                     Z-ADDC3Y1KU    C3T1KU
     C                     Z-ADDC3Y2SU    C3T2SU
     C                     Z-ADDC3Y2KU    C3T2KU
     C                     Z-ADD0         C3Y1SU
     C                     Z-ADD0         C3Y1KU
     C                     Z-ADD0         C3Y2SU
     C                     Z-ADD0         C3Y2KU
     C                     UPDATCABPL021
      *
     CLR 02                EXCPTMEI2
     CLR 02                CLOSEQPRINT
      *
     OQPRINT  E  102           HED
     O                                  131 '.....................'
     O        E  1             HED
     O                                  131 '.         .         .'
     O        E  1             HED
     O                                   89 'TIME'
     O                         WTIME Y   98
     O                                  131 '.         .         .'
     O                         WUSNM    130
     O        E  2             HED
     O                                   10 'CAARB1-1'
     O                                   30 'BY-FACTORY PART '
     O                                   42 'NO. SEQUENCE'
     O                         TM1,1     93
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        E  1             HED
     O                                   23 'FORWARDING DESTINATION '
     O                                   41 'PRECEDING PROCESS'
     O                                  109 '1 BIN ORDER-PLACEMENT'
     O                                  132 '2 BIN ORDER-PLACEMENT'
     O        E  2             HED
     O                                   16 'DEPARTMENT'
     O                                   37 'DEPARTMENT'
     O                                   60 'IN-HOUSE PART NO.'
     O                                   71 'ID NUMBER'
     O                                   87 'ALLOCATION NO.'
     O                                  104 'BOX QUANTITY'
     O                                  127 'BOX QUANTITY'
     O        E  2             MEI1
     O                         C3TBCD    12
     O                         C3MBCD    35
     O                         C3SHN1    49
     O                                   50 '-'
     O                         C3SHN2    55
     O                                   56 '-'
     O                         C3SHN3    58
     O                         C3ZETI    68
     O                         C3RTNO    79
     O                         C3T1SU2  101
     O                         C3T2SU2  124
     O        E   62           MEI2
     O                         TM2,1    107
** TM1
 ****  A-PICS2  UNFORWARDED DATA LIST  ****
** TM2
 * GIVE TO PRODUCTION CONTROL SECTION PROJECT MANAGER!
