     H            Y.
     F** CAAR02 ********************************
     F*   A-PICS2 PRODUCTION DATA CREATE       *
     F*       T-SAKAKI         2020.08.19      *
     F******************************** CAAR02 **
     FCA#PP11 UP  E                    DISK
     FCABPL01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FCA#PP21 O   E                    DISK                      A
     FCAAWP02 O   F     100            DISK
     FQPRINT  O   F     132     OF     PRINTER                        UC
     E                    TM1     1   1 50               ﾒﾇn
     E                    TM2     1   1 54               ﾒﾇn
     E                    TB1    23  23  2               gﾞｭcw hﾎﾞ]
     E                    TB2    10  23  6               gﾞｭcw hﾎﾞ]xb
     I            DS
     I                                        1   80C7SKHZ
     I                                        1   40C7SKYY
     I                                        5   60C7SKMM
     I                                        7   80C7SKDD
     I            DS
     I                                        1   80C7KOHZ
     I                                        1   40C7KOYY
     I                                        5   60C7KOMM
     I                                        7   80C7KODD
     I            DS
     I                                        1   60C7TIME
     I                                        1   20C7KOHH
     I                                        3   40C7KOSS
     I            DS
     I                                        1   80C7KEHZ
     I                                        1   40C7KEYY
     I                                        5   60C7KEMM
     I                                        7   80C7KEDD
     I            DS
     I                                        1   40C7KEJP
     I                                        1   20C7KEJI
     I                                        3   40C7KEPN
     I            DS
     I                                        1   80C7DTHZ
     I                                        1   40C7DTYY
     I                                        5   60C7DTMM
     I                                        7   80C7DTDD
     I            DS
     I                                        1   60C7DTHS
     I                                        1   20C7DTHH
     I                                        3   40C7DTSS
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     C           KEY1      KLIST
     C                     KFLD           C7SHN1
     C                     KFLD           C7SHN2
     C                     KFLD           C7SHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
      *
     C                     TIME           WTIME   60
      *
     C           *IN10     IFEQ '0'
     C                     SETON                     10
      *
     C                     SETOF                     11
     C                     MOVE *BLANK    WUSNM   9
     C           PUS       CHAINRGAPL111             11
     C           *IN11     IFEQ '0'
     C           J8SKJY    ANDEQ*BLANK
     C                     MOVELJ8NAME    WUSNM
     C                     END
     C                     END
      *
     C           C7SKJY    IFEQ 'D'
     C           C7SKHZ    ANDLE*DATE
     C                     GOTO END
     C                     END
      *
     C           C7KEHZ    IFGT *DATE
     C                     GOTO END
     C                     END
      *
     C*----------------------------------------------*
     C*  ..Ａ－ＰＩＣＳⅡ平準化確定発注ファイル..  *
     C*----------------------------------------------*
     C                     SETOF                     01
     C           KEY1      CHAINCABPL011             01
     C           *IN01     IFEQ '0'
     C           C3SKJY    ANDEQ'D'
     C           C3SKHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
     C           *IN01     IFEQ '1'
     C                     EXSR SUB1
     C                     GOTO END
     C                     END
     C*
     C           C3TYPE    IFEQ 'A2'
     C           C3TYPE    OREQ 'A3'
     C                     ELSE
     C                     EXSR SUB1
     C                     GOTO END
     C                     ENDIF
     C*
      *
     C*----------------------*
     C*  ..部品マスター..  *
     C*----------------------*
     C                     SETOF                     03
     C           KEY1      CHAINFCEPL011             03
     C           *IN03     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     03
     C                     END
      *
     C           *IN03     IFEQ '0'
     C           A2TEHI    IFNE 'G'
     C                     SETON                     03
     C                     END
     C                     END
      *
     C           *IN03     IFEQ '1'
     C                     EXSR SUB1
      *
     C           *IN06     IFEQ '0'
     C                     OPEN QPRINT
     C                     SETON                     06OF
     C                     END
      *
     C           *INOF     IFEQ '1'
     C                     SETOF                     OF
      *
     C           WPRKB     IFEQ '*'
     C                     EXCPTMEI2
     C                     END
      *
     C                     MOVE '*'       WPRKB   1
     C                     EXCPTHED
     C                     END
      *
     C                     SETOF                     04
     C                     Z-ADD1         A       20
     C                     MOVE *BLANK    WGYNM   6
     C           C7GYOM    LOKUPTB1,A                    04
     C           *IN04     IFEQ '1'
     C                     MOVE TB2,A     WGYNM
     C                     END
      *
     C                     SETON                     U2
     C                     EXCPTMEI1
     C                     GOTO END
     C                     END
      *
     C           C7HKSU    MULT C7SYOS    WSRYO   90
      *
     C                     EXCPTDT1
      *
     C*----------------------------------------*
     C*  ..Ａ－ＰＩＣＳⅡ受注抜出ファイル..  *
     C*----------------------------------------*
     C                     Z-ADD*DATE     C7DTHZ
     C                     TIME           C7DTHS
     C                     MOVEL'CAAR02'  C7KOME
     C                     WRITECA#PP211
      *
     C                     EXSR SUB1
      *
     C           END       TAG
      *
     CLR 06                EXCPTMEI2
     CLR 06                CLOSEQPRINT
      *
      *
     C*----------------------------------------*
     C*  ..サブルーチン..                    *
     C*  ..Ａ－ＰＩＣＳⅡ受注累積ファイル..  *
     C*----------------------------------------*
     C           SUB1      BEGSR
      *
     C                     MOVE 'D'       C7SKJY
     C                     Z-ADD*DATE     C7SKHZ
     C                     Z-ADD*DATE     C7KOHZ
     C                     TIME           C7TIME
     C                     MOVEL'QPGMR'   C7KOME
     C                     MOVEL'CAAR02'  C7KOPG
     C                     UPDATCA#PP111
      *
     C                     ENDSR
      *
     OQPRINT  E  102           HED
     O                                  131 '.....................'
     O        E  1             HED
     O                                  131 '.         .         .'
     O        E  1             HED
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O                         WUSNM    130
     O        E  2             HED
     O                                   10 'CAAR02-1'
     O                         TM1,1     82
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        E  2             HED
     O                                   41 'IN-HOUSE PART NO.'
     O                                   55 'ID NUMBER'
     O                                   79 'COMPLETION LOCATION'
     O                                  102 'APPROPRIATION DATE'
     O                                  120 'BUSINESS CODE'
     O        E  2             MEI1
     O                         C7SHN1    30
     O                                   31 '-'
     O                         C7SHN2    36
     O                                   37 '-'
     O                         C7SHN3    39
     O                         C7ZETI    52
     O                         C7TKR1    66
     O                                   67 '-'
     O                         C7TKR2    69
     O                                   70 '-'
     O                         C7TKR3    72
     O                                   73 '-'
     O                         C7TKR4    74
     O                         C7KEHZY   95
     O                                   96 '-'
     O                         C7KEJP   101 '  :  '
     O                         C7GYOM   108
     O                         WGYNM    117
     O        E   62           MEI2
     O                         TM2,1    105
      *
     OCAAWP02 E                DT1
     O                         C7SHN1     5
     O                         C7SHN2    10
     O                         C7SHN3    12
     O                         WSRYO     21
      *
** TM1
 ** A-PICS2 PART M/F UNMATCH LIST **
** TM2
 * GIVE TO PRODUCTION CONTROL SECTION PROJECT MANAGER!
** TB1
0102030405060708091011121314151617181920212223
** TB2
 OT    K T   K D   K T   BI   GENERLRECEPTDELV DO DELV B 2
 SK   UPDATE T +   P +   R +   S +  PR NGT R T   R B  REORDR
O INCMO SALEINVCTL
