     H            Y.
     F** CAAR88 *********************************
     F*指示かんばんの発行データに通信ヘッダー等を付与する
     F* T.SAKASHITA                2020.09.29   *
     F********************************* AAFR80 **
     FOUTPUT1 IP  F    3072            DISK
     FOUTPUT2 O   F    3072            DISK
     IOUTPUT1 AA  01
     I                                        73072 IDAT1
     I                                        7   8 IDTSB
     I****                                 23092316 IDTHZ
     I****                                 23172318 IDTBB
      *--------------------------------------------------
      *  ENTRY LIST
      *--------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           PDATE   80
     C                     PARM           PBIN    2
      *
     C                     MOVE '0111'    PKOJO   4
     C                     MOVE PDATE     IDTHZ   8
     C                     MOVE PBIN      IDTBB   2
      *
     C           *IN21     IFEQ '0'
     C                     SETON                     21
     C                     Z-ADD0         TRE     40
     C                     Z-ADD1         TTRE    40
     C                     EXCPTMHD1
     C                     EXCPTMHD2
     C                     END
     C                     ADD  1         TRE
     C                     ADD  1         TTRE
     C                     EXCPTMDT1
      ****************************************************************
      *　通信　データ                                              *
      ****************************************************************
     OOUTPUT2 E                MHD1
     O                                    2 'HD'
     O                         PKOJO      6
     O                         IDTSB      8
     O                                   11 '00'
     O                         IDTHZ     25
     O                         IDTBB
     O        E                MHD2
     O                                    2 'BK'
     O                                    4 '99'
     O                                    5 'F'
     O                         PKOJO      9
     O        E                MDT1
     O                                    2 'DT'
     O                         TRE        6
     O                         IDAT1   3072
     O        T        LR
     O                                    2 'EE'
     O                         TTRE       6
