     H            Y.
     F** CABR01 ********************************************
     F*  .A-PICS2/3 LEVELLED FIXED ORDERING FILE - UPDATE. *
     F*       T.SAKAKI                    2020.03.10       *
     F******************************************** CABR01 **
     FCABPW01 CF  E                    WORKSTN
     F                                              KNUM        1
     F                                              KINFDS FEEDBK
     FCABPL01 UF  E           K        DISK
     FCABWL01 UF  E           K        DISK                      A
     FCA#PL11 UF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FGCMPL31 IF  E           K        DISK
     FCADPL03 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
      * LEVELLED PRODUCTION FIXED ORDERING FILE A-PICS OPERATION PART NUMBER *
     FAGAPL31 IF  E           K        DISK
     FAGAWL31 IF  E           K        DISK
      **
     E                    TAB1    1   3  1   TAB2    6
.    E***********         TAB3    1   1  4 0 TAB4    4 0
.    E                    TAB3    1   2  4 0 TAB4    4 0
.    E***********         TAB5    1   1  4 0 TAB6   16
.    E                    TAB5    1   2  4 0 TAB6   16
     E                    TB1     1   2  1   TB2    20   gﾞｭcwhﾎﾞ]
     E                    ER      1  20 72
     E                    CKTY       15  1               f]ﾌﾞ]ﾆｬﾓb (NEW)
     E                    CKNB       15  6               nﾃﾜﾌﾞ]k   (NEW)
     E                    CKBM       15  4 0             ﾎﾞy](NEW)
     I            DS
     I                                        1  15 CKTY
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  90 CKNB
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  600CKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  14 AASHIN
     I                                        1   5 AASHN1
     I                                        6   6 HHN1
     I                                        7  11 AASHN2
     I                                       12  12 HHN2
     I                                       13  14 AASHN3
     I            DS
     I                                        1   6 WWTKR
     I                                        1   1 WWTKR1
     I                                        2   3 WWTKR2
     I                                        4   5 WWTKR3
     I                                        6   6 WWTKR4
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1  100WWUKHZ
     I                                        1   40WWUKYY
     I                                        5   60WWUKMM
     I                                        7   80WWUKDD
     I                                        9  100WWUKBB
     I            DS
     I                                        1   80AASTHZ
     I                                        1   40AASTYY
     I                                        5   60AASTMM
     I                                        7   80AASTDD
     I            DS
     I                                        1  100AAUKHZ
     I                                        1   80AAUHIZ
     I                                        1   40AAUKYY
     I                                        5   60AAUKMM
     I                                        7   80AAUKDD
     I                                        9  100AAUKBB
     I            DS
     I                                        1   60TIME
     I                                        1   20WWHH
     I                                        3   40WWSS
     I            DS
     I                                        1   80CBGYHZ
     I                                        1   40CBGYYY
     I                                        5   60CBGYMM
     I                                        7   80CBGYDD
     I            DS
     I                                        1   80C7SKHZ
     I                                        1   40C7SKYY
     I                                        5   60C7SKMM
     I                                        7   80C7SKDD
     I            DS
     I                                        1   80C7KOHZ
     I                                        1   40C7KOYY
     I                                        5   60C7KOMM
     I                                        7   80C7KODD
      *
     I            DS
     I                                        1   80HYMD
     I                                        1   40HYY
     I                                        5   60HMM
     I                                        7   80HDD
     IFEEDBK      DS
     I                                     *STATUS  @STTS
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *
     C           KEY1      KLIST
     C                     KFLD           AASHN1
     C                     KFLD           AASHN2
     C                     KFLD           AASHN3
      *
     C           KEY2      KLIST
     C                     KFLD           WWTKR1
     C                     KFLD           WWTKR2
     C                     KFLD           WWTKR3
     C                     KFLD           WWTKR4
      *
     C           KEY3      KLIST
     C                     KFLD           AAKDAI
     C                     KFLD           WTYPE
      *
      *  ﾎｧｰﾓnﾞ hﾒaｰ
     C                     Z-ADD*DATE     HYMD
     C           STEP1     TAG
     C                     MOVEL*BLANK    AAKSN
     C                     MOVEL*BLANK    AASHN1
     C                     MOVEL*BLANK    AASHN2
     C                     MOVEL*BLANK    AASHN3
      *
      *  fﾞx] 1 ﾆｬlﾒｭh
     C           STEP2     TAG
     C                     WRITECABPW011
     C                     READ CABPW01                999999TIME eｰﾌﾞｰ
      *
     C                     SETOF                     0102
      *
      *  CMD-1  kｩｮh
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
      *  ﾃcﾆ]hﾎﾞ] kｩｮh
     C           AAKSN     IFEQ *BLANK
     C                     MOVELER,1      MSG
     C                     SETON                     0199
     C                     GOTO STEP2
     C                     END
      *
     C                     SETOF                     11
     C           AAKSN     LOKUPTAB1      TAB2           11
     C           *IN11     IFEQ '0'
     C                     MOVELER,2      MSG
     C                     SETON                     0199
     C                     GOTO STEP2
     C                     END
     C                     MOVELTAB2      AAKSNM
      *
     C                     SETOF                       7980
     C           AAKSN     COMP '1'                    7980
      *
      *  ﾆｫobﾍ]ﾌﾞ]  kｩｮh
     C           AASHN1    IFEQ *BLANK
     C           AASHN2    ANDEQ*BLANK
     C           AASHN3    ANDEQ*BLANK
     C                     MOVELER,3      MSG
     C                     SETON                     0299
     C                     GOTO STEP2
     C                     END
      *
      *  fﾞx] 2 ﾉ ﾎｧｰﾓnﾞ hﾒaｰ
     C                     MOVEL*BLANK    HHN1
     C                     MOVEL*BLANK    HHN2
     C           AASHN2    IFNE *BLANK
     C                     MOVEL'-'       HHN1
     C                     END
     C           AASHN3    IFNE *BLANK
     C                     MOVEL'-'       HHN2
     C                     END
      *
     C                     Z-ADD0         AASTYY
     C                     Z-ADD0         AASTMM
     C                     Z-ADD0         AASTDD
     C                     MOVEL*BLANK    AAKDAI
     C                     MOVEL*BLANK    AAKDNM
     C                     Z-ADD0         AAUKYY
     C                     Z-ADD0         AAUKMM
     C                     Z-ADD0         AAUKDD
     C                     Z-ADD0         AAUKBB
     C                     Z-ADD0         AATBMO
     C                     MOVEL*BLANK    AATBNM
     C                     Z-ADD0         AAHAKO
     C                     Z-ADD0         AASYOS
     C                     Z-ADD0         AAMBMO
     C                     MOVEL*BLANK    AAMBNM
     C                     MOVEL*BLANK    AAZETI
     C                     MOVEL'000'     AATENO
     C                     Z-ADD0         AAHASU
     C                     MOVEL*BLANK    AARAIN
     C                     Z-ADD0         AAPROL
     C                     Z-ADD0         AACART
     C                     Z-ADD0         AABARA
     C                     Z-ADD0         AATHAK
     C                     Z-ADD0         AATHCH
     C                     Z-ADD0         AAYHAK
     C                     Z-ADD0         AAYHCH
     C                     MOVEL*BLANK    AANAIY
     C                     MOVEL*BLANK    AATYPE
      *
      * s]ﾃc ､ nﾒiﾆ ﾉ ﾌﾞab --------------------------------*
      *
     C                     MOVEL*BLANK    SW1     1
     C                     MOVEL*BLANK    SW2     1
      *
     C                     SETOF                     3235
     C           AAKSN     IFEQ '1'
     C           AAKSN     OREQ '0'
     C                     SETOF                     1315
     C           KEY1      CHAINCABWL011             13
     C           *IN13     IFEQ '0'
     C           GBSKJY    ANDEQ'D'
     C           GBSKHZ    ANDLE*DATE
     C                     SETON                     131532
     C                     END
     C           GBFRAG    IFEQ '1'
     C                     SETON                     1335
     C                     END
      *
     C           *IN13     IFEQ '1'
     C                     SETOF                     14
     C           KEY1      CHAINCABPL011             14
     C           *IN14     IFEQ '0'
     C           C3SKJY    ANDEQ'D'
     C           C3SKHZ    ANDLE*DATE
     C                     SETON                     1415
     C                     END
     C           *IN14     IFEQ '1'
     C  N15                MOVELER,4      MSG
     C   15                MOVELER,5      MSG
     C                     SETON                     0199
     C                     GOTO STEP2
     C                     END
      *
     C                     MOVEL'MASTER'  AANAIY
     C                     Z-ADDC3TAYY    AASTYY
     C                     Z-ADDC3TAMM    AASTMM
     C                     Z-ADDC3TADD    AASTDD
     C                     Z-ADDC3BHAS    AAHASU
     C                     Z-ADDC3T1SU    AATHAK
     C                     Z-ADDC3T1KU    AATHCH
     C                     Z-ADDC3Y1SU    AAYHAK
     C                     Z-ADDC3Y1KU    AAYHCH
     C                     MOVELC3SJSR    AAKDAI
     C                     MOVELC3RTNO    AATENO
     C                     MOVE C3GYOM    AAGYOM  1
     C                     Z-ADDC3GYHZ    AAGYHZ  80
     C                     MOVE C3TYPE    AATYPE
     C  N32                MOVEL'*'       SW1
     C  N32N35             MOVEL'*'       SW2
      *
     C           AAKSN     IFEQ '0'
     C                     MOVEL'ALL   '  AANAIY
     C                     MOVELC3SJSR    AAKDAI
     C                     Z-ADDC3UKYY    AAUKYY
     C                     Z-ADDC3UKMM    AAUKMM
     C                     Z-ADDC3UKDD    AAUKDD
     C                     Z-ADDC3UKBB    AAUKBB
     C                     Z-ADDC3TBCD    AATBMO
     C                     Z-ADDC3GEHA    AAHAKO
     C                     Z-ADDC3SJSU    AASYOS
     C                     Z-ADDC3MBCD    AAMBMO
     C                     MOVELC3ZETI    AAZETI
     C                     MOVELC3RAIN    AARAIN
     C                     Z-ADDC3MKBA    AABARA
     C                     Z-ADDC3PROL    AAPROL
     C                     Z-ADDC3CART    AACART
     C                     END
      *
     C                     SETOF                     24
     C                     MOVE 'A'       WTYPE   1
     C           KEY3      CHAINGCMPL311             24
     C           *IN24     IFEQ '0'
     C           T3SKJY    ANDEQ'D'
     C           T3SKHZ    ANDLE*DATE
     C                     SETON                     24
     C                     END
     C  N24                MOVELT3NAMN    AAKDNM
      *
     C                     SETOF                     24
     C           AATBMO    CHAINFGBPL011             24
     C           *IN24     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     24
     C                     END
     C  N24                MOVELB2SMEI    AATBNM
      *
     C                     SETOF                     24
     C           AAMBMO    CHAINFGBPL011             24
     C           *IN24     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     24
     C                     END
     C  N24                MOVELB2SMEI    AAMBNM
     C                     ELSE
      *
     C                     MOVEL'WORK  '  AANAIY
     C                     Z-ADDGBTAYY    AASTYY
     C                     Z-ADDGBTAMM    AASTMM
     C                     Z-ADDGBTADD    AASTDD
     C                     Z-ADDGBBHAS    AAHASU
     C                     Z-ADDGBT1SU    AATHAK
     C                     Z-ADDGBT1KU    AATHCH
     C                     Z-ADDGBY1SU    AAYHAK
     C                     Z-ADDGBY1KU    AAYHCH
     C                     MOVELGBRTNO    AATENO
     C                     MOVE GBGYOM    AAGYOM
     C                     Z-ADDGBGYHZ    AAGYHZ
     C                     MOVE GBTYPE    AATYPE
      *
     C           AAKSN     IFEQ '0'
     C                     MOVEL'ALL   '  AANAIY
     C                     MOVELGBSJSR    AAKDAI
     C                     Z-ADDGBUKYY    AAUKYY
     C                     Z-ADDGBUKMM    AAUKMM
     C                     Z-ADDGBUKDD    AAUKDD
     C                     Z-ADDGBUKBB    AAUKBB
     C                     Z-ADDGBTBCD    AATBMO
     C                     Z-ADDGBGEHA    AAHAKO
     C                     Z-ADDGBSJSU    AASYOS
     C                     Z-ADDGBMBCD    AAMBMO
     C                     MOVELGBZETI    AAZETI
     C                     MOVELGBRAIN    AARAIN
     C                     Z-ADDGBMKBA    AABARA
     C                     Z-ADDGBPROL    AAPROL
     C                     Z-ADDGBCART    AACART
     C                     END
      *
     C                     SETOF                     24
     C                     MOVE 'A'       WTYPE
     C           KEY3      CHAINGCMPL311             24
     C           *IN24     IFEQ '0'
     C           T3SKJY    ANDEQ'D'
     C           T3SKHZ    ANDLE*DATE
     C                     SETON                     24
     C                     END
     C  N24                MOVELT3NAMN    AAKDNM
      *
     C                     SETOF                     24
     C           AATBMO    CHAINFGBPL011             24
     C           *IN24     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     24
     C                     END
     C  N24                MOVELB2SMEI    AATBNM
      *
     C                     SETOF                     24
     C           AAMBMO    CHAINFGBPL011             24
     C           *IN24     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     24
     C                     END
     C  N24                MOVELB2SMEI    AAMBNM
     C                     END
     C                     END
      *
      * lbf ﾉ ﾌﾞab  --------------------------------------*
      *
     C                     SETOF                     32
     C           AAKSN     IFEQ '2'
     C                     SETOF                     16
     C           KEY1      CHAINCABWL011             16
     C           *IN16     IFEQ '0'
     C           GBSKJY    ANDEQ'D'
     C           GBSKHZ    ANDLE*DATE
     C                     SETON                     1632
     C                     END
     C           *IN16     IFEQ '0'
     C                     SETON                     010299
     C                     MOVELER,6      MSG
     C                     GOTO STEP2
     C                     END
      *
     C                     SETOF                     17
     C           KEY1      CHAINCABPL011             17
     C           *IN17     IFEQ '0'
     C           C3SKJY    IFEQ 'D'
     C           C3SKHZ    ANDLE*DATE
     C                     SETON                     17
     C                     END
     C           *IN17     IFEQ '0'
     C                     SETON                     010299
     C                     MOVELER,6      MSG
     C                     GOTO STEP2
     C                     END
     C                     END
      *
     C                     MOVE '*'       AAGYOM
     C                     Z-ADD0         AAGYHZ
     C                     MOVEL'MASTER'  AANAIY
     C  N32                MOVEL'*'       SW2
     C                     END
      *
      * gﾞｭcwhﾎﾞ]
     C           AAGYOM    IFEQ *BLANK
     C           AAGYHZ    ANDEQ*DATE
     C                     MOVE TB2,1     WGYMN
     C                     ELSE
      *
     C                     SETOF                     22
     C                     Z-ADD1         A       20
     C                     MOVE *BLANK    WGYMN
     C           AAGYOM    LOKUPTB1,A                    22
     C           *IN22     IFEQ '1'
     C                     MOVE TB2,A     WGYMN
     C                     END
     C                     END
      *
     C           AAKSN     CABEQ'0'       STEP3
      *
      *  ﾆｫobf]ﾌﾞ] gﾒfd uﾇjｰ  kｩｮh
     C                     SETOF                     18
     C           KEY1      CHAINAAMPL111             18
     C           *IN18     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     18
     C                     END
      *
     C           *IN18     IFEQ '1'
     C                     MOVELER,7      MSG
     C                     SETON                     0299
     C                     GOTO STEP2
     C                     END
      *
     C                     SETOF                     19
     C                     MOVEL*BLANK    WWTKR   6
     C                     MOVE ' '       $$CUKN  1        中間工程F
     C                     DO   15        I       50
     C           16        SUB  I         J       50
     C           CKTY,J    IFNE *BLANK
     C  N19                MOVELCKTY,J    AAKDAI
     C           CKTY,J    IFEQ 'F'
     C                     MOVELCKNB,J    WWTKR
     C                     ENDIF
     C   19      CKTY,J    IFEQ 'F'
     C                     MOVE '*'       $$CUKN
     C                     LEAVE
     C                     ENDIF
     C                     SETON                     19
     C                     END
     C                     END
      *
     C                     Z-ADD1         I
     C                     SETOF                     33
     C                     DO   15        I
     C           CKNB,I    IFNE '------'
     C           CKNB,I    ANDNE'++++++'
     C           CKTY,I    ANDNE'F'
     C                     Z-ADDCKBM,I    AAMBMO
     C                     SETON                     33
     C                     END
     C  N33                END
      *
     C           AAMBMO    IFEQ 0
     C                     Z-ADDCKBM,1    AAMBMO
     C                     END
      *
     C           AAMBMO    IFNE 0
     C                     SETOF                     29
     C           AAMBMO    LOKUPTAB3      TAB4           29
     C           *IN29     IFEQ '1'
     C                     Z-ADDTAB4      AATBMO
     C                     ELSE
     C                     Z-ADD0111      AATBMO
     C                     END
     C                     END
      *
     C                     SETOF                     22
     C           AATBMO    LOKUPTAB5      TAB6           22
     C           *IN22     IFEQ '1'
     C                     MOVE TAB6      AATBNM
     C                     END
      *
     C                     SETOF                     22
     C           AAMBMO    CHAINFGBPL011             22
     C           *IN22     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     22
     C                     END
     C  N22                MOVELB2SMEI    AAMBNM
      *
     C                     SETOF                     20
     C                     MOVE 'A'       WTYPE
     C           KEY3      CHAINGCMPL311             20
     C           *IN20     IFEQ '0'
     C           T3SKJY    ANDEQ'D'
     C           T3SKHZ    ANDLE*DATE
     C                     SETON                     20
     C                     END
     C           *IN20     IFEQ '0'
     C                     MOVELT3NAMN    AAKDNM
     C                     END
      *
      * LEVELLED PRODUCTION FIXED ORDERING FILE A-PICS OPERATION PART NUMBER *
      *
     C           KEY1      CHAINAGAPL31              18
     C  N18      CBSKJY    IFEQ 'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     18
     C                     ENDIF
     C*
     C           *IN18     IFEQ *ON                         AGAPP31無
     C           KEY1      CHAINAGAWL31              18
     C  N18      WBSKJY    IFEQ 'D'
     C           WBSKHZ    ANDLE*DATE
     C                     SETON                     18
     C                     ENDIF
     C                     ENDIF
      *
     C** A-PICS 1
     C           *IN18     IFEQ *ON                         AGAPP31無
     C           AAKDAI    IFNE 'F'
     C                     MOVELER,8      MSG
     C                     SETON                     0299
     C                     GOTO STEP2
     C                     END
     C                     ELSE
     C**                                                    AGAPP31有
     C           AAKDAI    IFEQ 'F'
     C* * *                MOVELER,18     MSG
     C* * *                SETON                     0299
     C* * *                GOTO STEP2
     C                     ENDIF
     C* 中間工程内に"F"が無いとき
     C           $$CUKN    IFEQ ' '                        中間工程F
     C* * *                MOVELER,19     MSG
     C* * *                SETON                     0299
     C* * *                GOTO STEP2
     C                     ENDIF
     C                     ENDIF
      *
      *  ﾆﾆﾞf]ﾌﾞ]uﾇjｰ  ﾑﾒ
     C           KEY2      SETGTCADPL031
     C                     SETOF                     2128
     C                     DO   *HIVAL
     C           KEY2      REDPECADPL031                 21
     C           *IN,21    IFEQ '0'
     C           C2SKJY    IFEQ 'D'
     C           C2SKHZ    ANDLE*DATE
     C                     ELSE
     C           C2DTHE    IFEQ '2'
     C           C2DTHE    OREQ '6'
     C           C2PROL    OREQ 0
     C           C2CART    OREQ 0
     C                     MOVELER,9      MSG
     C                     SETON                     0299
     C                     GOTO STEP2
     C                     END
      *
     C                     Z-ADDC2UKYY    AAUKYY
     C                     Z-ADDC2UKMM    AAUKMM
     C                     Z-ADDC2UKDD    AAUKDD
     C                     Z-ADDC2UBIN    AAUKBB
     C                     Z-ADDC2SYOS    AASYOS
     C                     MOVELC2RAIN    AARAIN
     C                     Z-ADDC2BARA    AABARA
     C                     Z-ADDC2PROL    AAPROL
     C                     Z-ADDC2CART    AACART
     C                     MOVE C2TKR1    WWTKR1
     C                     MOVE C2TKR2    WWTKR2
     C                     MOVE C2TKR3    WWTKR3
     C                     MOVE C2TKR4    WWTKR4
      *
     C                     SETON                     28
     C                     GOTO EXIT1
     C                     END
     C                     END
     C  N21                END
      *
     C           EXIT1     TAG
     C           *IN28     IFEQ '0'
     C                     MOVELER,14     MSG
     C                     SETON                     0299
     C                     GOTO STEP2
     C                     END
      *
      *  ﾎﾞﾍ]uﾇjｰ  ﾑﾒ
     C                     SETOF                     23
     C           KEY1      CHAINFCEPL011             23
     C           *IN23     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     23
     C                     END
     C           *IN23     IFEQ '1'
     C                     MOVELER,10     MSG
     C                     SETON                     0299
     C                     GOTO STEP2
     C                     END
     C                     Z-ADD0         WWSYOS  50
     C           A2SYHZ    IFGT *DATE
     C                     Z-ADDA2KSYS    WWSYOS
     C                     ELSE
     C                     Z-ADDA2SSYS    WWSYOS
     C                     END
     C           A2GEKN    DIV  WWSYOS    AAHAKO    H
      *
     C                     MOVELA2ZETI    AAZETI
      *
     C                     Z-ADDAAUKYY    WWUKYY
     C                     Z-ADDAAUKMM    WWUKMM
     C                     Z-ADDAAUKDD    WWUKDD
     C                     Z-ADDAAUKBB    WWUKBB
      *
     C           STEP3     TAG
      *
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     070809
     C                     SETOF                     101199
      *
     C           STEP4     TAG
     C                     WRITECABPW012
     C                     READ CABPW01                999999TIME eｰﾌﾞｰ
      *
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     070809
     C                     SETOF                     1011
     C                     SETOF                     77
      *
     C           *INKC     IFEQ '1'
     C                     GOTO STEP1
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           AAKSN     CABEQ'0'       STEP5
      *
     C           AASTYY    IFLT 1991
     C           AASTMM    ORGT 12
     C           AASTMM    ORLT 01
     C           AASTDD    ORGT 31
     C           AASTDD    ORLT 01
     C                     MOVELER,11     MSG
     C                     SETON                     010203
     C                     SETON                     99
     C                     GOTO STEP4
     C                     END
      *
     C           AAUKYY    IFLT 1991
     C           AAUKMM    ORGT 12
     C           AAUKMM    ORLT 01
     C           AAUKDD    ORGT 31
     C           AAUKDD    ORLT 01
     C           AAUKBB    ORLT 01
     C                     MOVELER,12     MSG
     C                     SETON                     040506
     C                     SETON                     0799
     C                     GOTO STEP4
     C                     END
      *
     C           WWUKHZ    IFGT AAUKHZ
     C                     MOVELER,13     MSG
     C                     SETON                     040506
     C                     SETON                     0799
     C                     GOTO STEP4
     C                     END
      *
     C           AASTHZ    IFNE AAUHIZ
     C                     MOVELER,15     MSG
     C                     SETON                     010203
     C                     SETON                     040506
     C                     SETON                     0799
     C                     GOTO STEP4
     C                     END
      *
     C                     SETOF                     30
     C           AATBMO    LOKUPTAB5      TAB6           30
     C           *IN30     IFEQ '0'
     C                     MOVELER,16     MSG
     C                     SETON                     0899
     C                     GOTO STEP4
     C                     ELSE
     C                     MOVELTAB6      AATBNM
     C                     END
      *
     C                     SETOF                     31
     C           AAMBMO    CHAINFGBPL01              31
     C           *IN31     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     31
     C                     END
     C           *IN31     IFEQ '1'
     C                     MOVELER,17     MSG
     C                     SETON                     0999
     C                     GOTO STEP4
     C                     ELSE
     C                     MOVELB2SMEI    AAMBNM
     C                     END
      *
     C           AATYPE    IFEQ 'A2'
     C           AATYPE    OREQ 'A3'
     C                     ELSE
     C                     MOVELER,20     MSG
     C                     SETON                     7799
     C                     GOTO STEP4
     C                     END
      *
     C           STEP5     TAG
      *
     C  NKE                GOTO STEP4
      *
     C                     SETOF                     25
     C           AAKSN     COMP '2'                      25
      *
     C           AAKSN     IFEQ '2'
     C                     MOVEL*BLANK    GBSKJY
     C                     Z-ADD0         GBSKYY
     C                     Z-ADD0         GBSKMM
     C                     Z-ADD0         GBSKDD
     C                     Z-ADDHYY       GBKOYY
     C                     Z-ADDHMM       GBKOMM
     C                     Z-ADDHDD       GBKODD
     C                     TIME           TIME
     C                     Z-ADDWWHH      GBKOHH
     C                     Z-ADDWWSS      GBKOSS
     C                     MOVELUS        GBKOME
     C                     END
      *
     C           AAKSN     IFEQ '1'
     C                     MOVEL*BLANK    GBSKJY
     C                     Z-ADD0         GBSKYY
     C                     Z-ADD0         GBSKMM
     C                     Z-ADD0         GBSKDD
     C                     Z-ADDHYY       GBKOYY
     C                     Z-ADDHMM       GBKOMM
     C                     Z-ADDHDD       GBKODD
     C                     TIME           TIME
     C                     Z-ADDWWHH      GBKOHH
     C                     Z-ADDWWSS      GBKOSS
     C                     MOVELUS        GBKOME
     C                     END
      *
     C           AAKSN     IFEQ '1'
     C           AAKSN     OREQ '2'
     C                     MOVELAASHN1    GBSHN1
     C                     MOVELAASHN2    GBSHN2
     C                     MOVELAASHN3    GBSHN3
     C                     Z-ADDAASTYY    GBTAYY
     C                     Z-ADDAASTMM    GBTAMM
     C                     Z-ADDAASTDD    GBTADD
     C                     MOVEL'F'       GBSJSR
     C                     Z-ADDAAUKYY    GBUKYY
     C                     Z-ADDAAUKMM    GBUKMM
     C                     Z-ADDAAUKDD    GBUKDD
     C                     Z-ADDAAUKBB    GBUKBB
     C                     Z-ADDAATBMO    GBTBCD
     C                     Z-ADDAAHAKO    GBGEHA
     C                     Z-ADDAASYOS    GBSJSU
     C                     Z-ADDAAMBMO    GBMBCD
     C                     MOVELAAZETI    GBZETI
     C                     MOVELAATENO    GBRTNO
     C                     MOVELWWTKR1    GBTKR1
     C                     MOVELWWTKR2    GBTKR2
     C                     MOVELWWTKR3    GBTKR3
     C                     MOVELWWTKR4    GBTKR4
     C                     Z-ADDAAHASU    GBBHAS
     C                     MOVELAARAIN    GBRAIN
     C                     Z-ADDAABARA    GBMKBA
     C                     Z-ADDAAPROL    GBPROL
     C                     Z-ADDAACART    GBCART
     C   25                Z-ADDAATHAK    GBT1SU
     C                     Z-ADDAATHCH    GBT1KU
     C                     Z-ADD0         GBT2SU
     C                     Z-ADD0         GBT2KU
     C   25                Z-ADDAAYHAK    GBY1SU
     C                     Z-ADDAAYHCH    GBY1KU
     C                     Z-ADD0         GBY2SU
     C                     Z-ADD0         GBY2KU
     C                     MOVELAAKSN     GBKBBN
     C                     MOVEL*BLANK    GBFRAG
     C                     MOVE AAGYOM    GBGYOM
     C                     Z-ADDAAGYHZ    GBGYHZ
     C                     MOVE AATYPE    GBTYPE
      *
     C           SW2       IFEQ '*'
     C                     WRITECABWL011
     C                     ELSE
     C                     UPDATCABWL011
     C                     END
     C                     END
      *
     C           AAKSN     IFEQ '0'
     C                     EXSR #DEL1
     C           SW1       IFEQ '*'
     C                     Z-ADDHYY       C3KOYY
     C                     Z-ADDHMM       C3KOMM
     C                     Z-ADDHDD       C3KODD
     C                     TIME           TIME
     C                     Z-ADDWWHH      C3KOHH
     C                     Z-ADDWWSS      C3KOSS
     C                     MOVELUS        C3KOME
     C                     MOVEL'D'       C3SKJY
     C                     Z-ADDHYY       C3SKYY
     C                     Z-ADDHMM       C3SKMM
     C                     Z-ADDHDD       C3SKDD
     C                     UPDATCABPL011
     C                     ELSE
      *
     C                     Z-ADDHYY       GBKOYY
     C                     Z-ADDHMM       GBKOMM
     C                     Z-ADDHDD       GBKODD
     C                     TIME           TIME
     C                     Z-ADDWWHH      GBKOHH
     C                     Z-ADDWWSS      GBKOSS
     C                     MOVELUS        GBKOME
     C                     MOVEL'D'       GBSKJY
     C                     Z-ADDHYY       GBSKYY
     C                     Z-ADDHMM       GBSKMM
     C                     Z-ADDHDD       GBSKDD
     C                     UPDATCABWL011
      *
     C                     SETOF                     27
     C           KEY1      CHAINCABPL011             27
     C           *IN27     IFEQ '0'
     C           C3SKJY    ANDEQ'D'
     C           C3SKHZ    ANDLE*DATE
     C                     SETON                     27
     C                     END
      *
     C           *IN27     IFEQ '0'
     C                     Z-ADDHYY       C3KOYY
     C                     Z-ADDHMM       C3KOMM
     C                     Z-ADDHDD       C3KODD
     C                     TIME           TIME
     C                     Z-ADDWWHH      C3KOHH
     C                     Z-ADDWWSS      C3KOSS
     C                     MOVELUS        C3KOME
     C                     MOVEL'D'       C3SKJY
     C                     Z-ADDHYY       C3SKYY
     C                     Z-ADDHMM       C3SKMM
     C                     Z-ADDHDD       C3SKDD
     C                     UPDATCABPL011
     C                     END
     C                     END
     C                     END
      *
     C                     GOTO STEP1
      *
     C           #DEL1     BEGSR
     C           KEY1      SETLLCA#PL111
     C                     DO   *HIVAL
     C                     SETOF                     30
     C           KEY1      READECA#PL111                 30
     C           *IN30     IFEQ '0'
     C           C7SKJY    IFEQ *BLANK
     C           C7SKHZ    ANDEQ0
     C                     MOVE 'D'       C7SKJY
     C                     Z-ADD*DATE     C7SKHZ
     C                     Z-ADD*DATE     C7KOHZ
     C                     TIME           TIME
     C                     Z-ADDWWHH      C7KOHH
     C                     Z-ADDWWSS      C7KOSS
     C                     UPDATCA#PL111
     C                     END
     C                     END
     C  N30                END
     C                     ENDSR
** (TAB1/TAB2)
0CANCEL
1UPDATE
2ADD
** (TAB3/TAB4)
01110111
** (TAB5/TAB6)
0111 IAF
** TB1､TB2
*DISKETTE PUBLICATION
 KANBAN IMPORT
**  ERROR MESSAGES
E-01 ENTER THE UPDATE INSTRUCTION.
E-02 THE UPDATE INSTRUCTIONS ARE 0,1, AND 2 ONLY.
E-03 ENTER THE IN-HOUSE PART NO.
E-04 CHANGE OR CANCEL WAS SPECIFIED,BUT THIS PART NO. IS NOT REGISTERED.
E-05 CHANGE OR CANCEL WAS SPECIFIED,BUT THIS PART NO. HAS BEEN CANCELED.
E-06 ADD WAS SPECIFIED,BUT THIS PART NO. IS ALREADY REGISTERED.
E-07 THIS PART NO. IS NOT YET REGISTERED IN THE IN-HOUSE KANBAN CHANGEOVER M/F.
E-08 THE FINAL-PROCESS KANBAN KIND IS NOT 'F'.
E-09 THE KANBAN M/F HAS NOT BEEN UPDATED.
E-10 TO PART NO. CANNOT BE UPDATED BECAUSE IT IS NOT REGISTERED IN THE PART M/F.
E-11 THE A-PICS START DATE IS INCORRECT.
E-12 THE KANBAN EFFECTIVE DATE IS INCORRECT.
E-13 THE KANBAN EFFECTIVE DATE IS INCORRECT.
E-14 THIS PART NO. IS NOT  REGISTERED IN THE INSTRUCTION KANBAN M/F.
E-15 THE RELATION BETWEEN THE A-PICS START DATE AND THE KANBAN EFFECTIVE DATE ..
E-16 THE FORWARDING DESTINATION DEPARTMENT IS INCORRECT.
E-17 THE PRECEDING PROCESS DEPARTMENT IS INCORRECT.
E-18 THIS PART NO. EXISTS IN A-PICS1 LEVELING FILE.
E-19 THIS PART NO. NOT A-PICS3
E-20 TYPE IS A2 OR A3.
