     H            Y.
      ** CADRS1 ********************************
      *INSTRUCTION KANBAN M/F --> CSV DATA     *
      *   T.SAKAKI               2021.05.31    *
      ******************************** ACDRS1 **
     FCADPL03 IF  E           K        DISK
     FGHCTL21 IF  E           K        DISK
     FAAFPL09 IF  E           K        DISK
     FAAHPL09 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FMFAPL25 IF  E           K        DISK
     FFCGPP31 IF  E           K        DISK
     FFCGPP41 IF  E           K        DISK
     FFCGPP05 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FABHWPS1 O   F    2048            DISK
     FABHWPS2 O   F    2048            DISK
     FABHWPS4 O   E                    DISK
     FABBPP7G IF  E           K        DISK
      *
     E                    BMN        10  4 0             DEPT
     E                    KOT        10  3               PROCESS
     E                    KBN        10  3               MACHINE
      *
     E                    PRC     1  28  3               CHECK
      *
      *
     I            DS
     I                                        1  400BMN
     I                                        1   40C2BMN1
     I                                        5   80C2BMN2
     I                                        9  120C2BMN3
     I                                       13  160C2BMN4
     I                                       17  200C2BMN5
     I                                       21  240C2BMN6
     I                                       25  280C2BMN7
     I                                       29  320C2BMN8
     I                                       33  360C2BMN9
     I                                       37  400C2BMNA
      *
     I            DS
     I                                        1  30 KOT
     I                                        1   3 C2KOT1
     I                                        4   6 C2KOT2
     I                                        7   9 C2KOT3
     I                                       10  12 C2KOT4
     I                                       13  15 C2KOT5
     I                                       16  18 C2KOT6
     I                                       19  21 C2KOT7
     I                                       22  24 C2KOT8
     I                                       25  27 C2KOT9
     I                                       28  30 C2KOTA
      *
     I            DS
     I                                        1  30 KBN
     I                                        1   3 C2KBN1
     I                                        4   6 C2KBN2
     I                                        7   9 C2KBN3
     I                                       10  12 C2KBN4
     I                                       13  15 C2KBN5
     I                                       16  18 C2KBN6
     I                                       19  21 C2KBN7
     I                                       22  24 C2KBN8
     I                                       25  27 C2KBN9
     I                                       28  30 C2KBNA
      *================================================================
      *
      *================================================================
      *  ENTRY LIST
      *===============================================================
     C           *ENTRY    PLIST
     C                     PARM           K1KBN   1
     C                     PARM           K1YYM   60
     C                     PARM           K1RITU  30
      *================================================================
      *  START  PROGRAM
      *===============================================================
     C                     MOVEL'#INT    '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INT    '#INIT
     C           @STEP     CASEQ'#JIK    '#JIKKO
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C*   << INIT >>
     C*===============================================================
     C           #INIT     BEGSR
     C                     MOVEA*ALL'0'   *IN
     C                     MOVELK1KBN     D1KBN   1
     C                     Z-ADDK1YYM     D1YYM   60
     C                     Z-ADDK1RITU    D1RITU  30
     C                     MOVEL'#JIK  '  @STEP
     C                     ENDSR
      *===============================================================
     C           #JIKKO    BEGSR
     C           *LOVAL    SETLLCADPL03
     C*-------------------------
     C                     DO   *HIVAL
     C                     READ CADPL03                  91
     C   91                LEAVE
     C*
     C           C2SKJY    IFEQ 'D'
     C           C2SYOS    OREQ 0
     C           C2STYY    ORNE 9999
     C                     ITER
     C                     ENDIF
     C*
     C                     MOVELC2SHN1    P@HIN1  5
     C                     MOVELC2SHN2    P@HIN2  5
     C                     MOVELC2SHN3    P@HIN3  2
     C                     MOVELC2TKR1    P@BAN1  1
     C                     MOVELC2TKR2    P@BAN2  2
     C                     MOVELC2TKR3    P@BAN3  2
     C                     MOVELC2TKR4    P@BAN4  1
     C*
     C                     Z-ADD1         @X      20
     C                     Z-ADD1         @Y      20
     C                     Z-ADD1         @Z      20
     C*
     C           1         DO   10        @X
     C*
     C           KOT,@X    IFEQ *BLANK
     C                     LEAVE
     C                     ENDIF
     C*
     C           KOT,@X    LOKUPPRC,@Y                   88
      * OWN
     C           *IN88     IFEQ *ON
     C                     Z-ADDBMN,@X    W@BMON  40
     C                     MOVELKOT,@X    W@AKT   3
     C                     MOVELKBN,@X    W@KBN   3
      * NEXT
     C                     MOVEL*BLANK    O@KOTE  3
     C                     MOVEL*BLANK    O@KIBN 15
     C           @X        ADD  1         @Z
     C           BMN,@Z    IFNE 0
     C                     MOVELKOT,@Z    O@KOTE
     C                     MOVELKBN,@Z    O@KIBN
     C           BMN,@Z    IFNE 0111
     C                     Z-ADDBMN,@Z    N@BMON  40
     C           N@BMON    CHAINFGBPL01              65
     C  N65                MOVELB2SMEI    O@KIBN
     C                     ENDIF
     C                     ENDIF
      * PRE
     C                     MOVEL*BLANK    @@KOTE  3
     C                     MOVEL*BLANK    @@KIBN 15
     C           @X        SUB  1         @Z
     C           @Z        IFGE 1
     C                     MOVELKOT,@Z    @@KOTE
     C                     MOVELKBN,@Z    @@KIBN
     C                     ENDIF
      *
     C                     MOVELC2SHN1    O@HIN1  5
     C                     MOVELC2SHN2    O@HIN2  5
     C                     MOVELC2SHN3    O@HIN3  2
      *
     C                     EXSR #CLR2
     C                     EXSR #OUT
     C                     EXSR #OUT2
      *
     C                     ENDIF
      *
     C                     ENDDO
     C*
     C                     ENDDO
     C*-------------------------
     C                     MOVEL'#END    '@STEP
     C                     ENDSR
      *===============================================================
      *
      *================================================================
     C           #OUT      BEGSR
      *
     C                     EXSR #MFA
      *
     C           FCEKEY    KLIST
     C                     KFLD           O@HIN1
     C                     KFLD           O@HIN2
     C                     KFLD           O@HIN3
      *
     C                     EXSR #FCE
     C   55                GOTO EOUT
      *
     C                     MOVE 'A'       O@FLG   1
      *
      *
     C                     EXCPTODAT
      *
     C           C2SYOS    IFNE 0
     C           C2KSSU    DIV  C2SYOS    W@BOX   61H
     C                     ELSE
     C           C2KSSU    DIV  A2SSYS    W@BOX   61H
     C                     END
      *
     C           W@BOX     DIV  20        W@BXPD  72H
      *
     C           C2PROL    IFNE 0
     C           W@BXPD    DIV  C2PROL    W@LTPD  62H
     C                     ELSE
     C                     Z-ADD0         W@LTPD  62H
     C                     ENDIF
      *
     C           BANKEY    KLIST
     C                     KFLD           C2TKR1
     C                     KFLD           C2TKR2
     C                     KFLD           C2TKR3
     C                     KFLD           C2TKR4
      *
     C                     EXSR #GHC
      *
     C           EOUT      ENDSR
      *===============================================================
      *
      *================================================================
     C           #GHC      BEGSR
      *
     C           BANKEY    SETLLGHCTL21
     C                     DO   *HIVAL
     C           BANKEY    READEGHCTL21                  77
     C   77                LEAVE
     C           C2SHN1    IFEQ MDJHN1
     C           C2SHN2    ANDEQMDJHN2
     C           C2SHN3    ANDEQMDJHN3
     C                     ITER
     C                     END
      *
     C                     MOVE MDJHN1    O@HIN1
     C                     MOVE MDJHN2    O@HIN2
     C                     MOVE MDJHN3    O@HIN3
     C                     EXSR #FCE
     C   55                GOTO EGHC
      *
     C                     MOVE 'G'       O@FLG
     C                     EXCPTODAT
      *
     C                     ENDDO
      *
     C           EGHC      ENDSR
      *================================================================
      *
      *================================================================
     C           #AAF      BEGSR
      *
     C           BANKEY    SETLLAAFPL09
     C                     DO   *HIVAL
     C           BANKEY    READEAAFPL09                  77
     C   77                LEAVE
     C           A3SKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C           A3STYY    IFNE 9999
     C                     ITER
     C                     END
     C           C2SHN1    IFEQ A31HB5
     C           C2SHN2    ANDEQA32HB5
     C           C2SHN3    ANDEQA33HB2
     C                     ITER
     C                     END
      *
     C                     MOVE A31HB5    O@HIN1
     C                     MOVE A32HB5    O@HIN2
     C                     MOVE A33HB2    O@HIN3
     C                     EXSR #FCE
     C   55                GOTO EAAF
      *
     C                     MOVE 'C'       O@FLG
     C                     EXCPTODAT
     C                     ENDDO
      *
     C           EAAF      ENDSR
      *================================================================
      *
      *================================================================
     C           #AAH      BEGSR
      *
     C           BANKEY    SETLLAAHPL09
     C                     DO   *HIVAL
     C           BANKEY    READEAAHPL09                  77
     C   77                LEAVE
     C           L6SKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C           L6STYY    IFNE 9999
     C                     ITER
     C                     END
     C           C2SHN1    IFEQ L6SHN1
     C           C2SHN2    ANDEQL6SHN2
     C           C2SHN3    ANDEQL6SHN3
     C                     ITER
     C                     END
      *
     C                     MOVE L6SHN1    O@HIN1
     C                     MOVE L6SHN2    O@HIN2
     C                     MOVE L6SHN3    O@HIN3
     C                     EXSR #FCE
     C   55                GOTO EAAH
      *
     C                     MOVE 'E'       O@FLG
     C                     EXCPTODAT
     C                     ENDDO
      *
     C           EAAH      ENDSR
      *================================================================
      *
      *================================================================
     C           #FCE      BEGSR
      *
     C           FCEKEY    CHAINFCEPL01              55
     C           *IN55     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C                     SETON                     55
     C                     END
     C                     END
      *設定数
     C                     Z-ADD0         W@GEKN
     C           *IN55     IFEQ '0'
     C           A2GEKN    DIV  20        W@GEKN  90
     C                     ADD  W@GEKN    WWGEKN
     C                     END
      *内示
      * P@TNSU:内示がなかった納入先の実績
     C                     CALL 'ABBRS6'
     C                     PARM           O@HIN1  5
     C                     PARM           O@HIN2  5
     C                     PARM           O@HIN3  2
     C                     PARM           P@N2NM 100
     C                     PARM           P@N1NM 100
     C                     PARM           P@NNNM 100
     C                     PARM           P@1NNM 100
     C                     PARM           P@2NNM 100
     C                     PARM           P@NTYM  60
     C                     PARM           P@TNSU 100
      *内示月度
     C                     MOVELP@NTYM    F@NTYM
     C                     CALL 'AGDRS1'
     C                     PARM           F@NTYM  6
     C                     PARM           F@DAYS  2
     C                     MOVE F@DAYS    F#DAYS  20
     C*
     C                     MOVE F@NTYM    F@NTMM  2
      *
      * 2020/04 SPECIAL
     C           F#DAYS    IFEQ 0
     C           P@NTYM    ANDEQ202004
     C                     Z-ADD22        F#DAYS
     C                     ENDIF
      *
     C           P@NNNM    DIV  F#DAYS    F@NNNM 100
     C                     ADD  F@NNNM    WWNNNM
      * N/N+1/N+2を求める
     C                     CALL 'ABBRSD'
     C                     PARM           F@NTYM
     C                     PARM           F@N1
     C                     PARM           F@N2
      * N+1の稼働日
     C                     CALL 'AGDRS1'
     C                     PARM           F@N1    6
     C                     PARM           F@DAY1  2
     C                     MOVE F@DAY1    F#DAY1  20
     C                     MOVE F@N1      F@N1MM  2
      *
     C           P@1NNM    DIV  F#DAY1    F@1NNM 100
     C                     ADD  F@1NNM    WW1NNM
      * N+2の稼働日
     C                     CALL 'AGDRS1'
     C                     PARM           F@N2    6
     C                     PARM           F@DAY2  2
     C                     MOVE F@DAY2    F#DAY2  20
     C                     MOVE F@N2      F@N2MM  2
      *
     C           P@2NNM    DIV  F#DAY2    F@2NNM 100
     C                     ADD  F@2NNM    WW2NNM
      *実績
     C                     CALL 'MBERS1'
     C                     PARM           O@HIN1  5
     C                     PARM           O@HIN2  5
     C                     PARM           O@HIN3  2
     C                     PARM           P@GOKE  80
      *実績月度
     C                     CALL 'MCEC00'
     C                     PARM           R@DATE  8
     C                     MOVELR@DATE    R@YYMM  6
      *実績月度の稼働日
     C                     CALL 'AGDRS1'
     C                     PARM           R@YYMM  6
     C                     PARM           R@DAYS  2
     C                     MOVE R@DAYS    R#DAYS  20
      * CHECK WORK DAYS
     C           R#DAYS    IFEQ 0
     C                     Z-ADD1         R#DAYS
     C                     ENDIF
      *
     C                     MOVE R@YYMM    R@MM    2
      *
     C           P@GOKE    DIV  R#DAYS    R@GOKE  80
     C                     ADD  R@GOKE    WWGOKE
      *内示なし実績
     C           P@TNSU    DIV  R#DAYS    R@TNSU  80
      * N
     C                     ADD  R@TNSU    F@NNNM
     C                     ADD  R@TNSU    WWNNNM
      * N+1
     C                     ADD  R@TNSU    F@1NNM
     C                     ADD  R@TNSU    WW1NNM
      * N+2
     C                     ADD  R@TNSU    F@2NNM
     C                     ADD  R@TNSU    WW2NNM
      *
     C                     EXSR #FCG
      *
     C                     EXSR #AAM
      *
     C                     MOVE A21HB5    K@CMP1
     C                     MOVE A22HB5    K@CMP2
     C                     MOVE A23HB2    K@CMP3
     C                     EXSR #CMP
     C                     Z-ADDEDHDSC    E#HDS1  83
     C                     Z-ADDED2SDS    E#2SD1  83
     C                     MOVE W@ENGN    W@ENG1 15
      *
     C                     MOVE A24HB5    K@CMP1
     C                     MOVE A25HB5    K@CMP2
     C                     MOVE A26HB2    K@CMP3
     C                     EXSR #CMP
     C                     Z-ADDEDHDSC    E#HDS2  83
     C                     Z-ADDED2SDS    E#2SD2  83
     C                     MOVE W@ENGN    W@ENG2 15
      *
      *
     C           EFCE      ENDSR
      *================================================================
      *
      *================================================================
     C           #MFA      BEGSR
      *
     C                     Z-ADD0         W@KADO 100
     C                     Z-ADD0         WWKADO 100
      *
     C           MFAKEY    KLIST
     C                     KFLD           W@BMON
     C                     KFLD           W@KBN
     C                     KFLD           W@AKT
      *
     C           MFAKEY    SETLLMFAPL25
     C                     DO   *HIVAL
     C           MFAKEY    READEMFAPL25                  44
     C   44                LEAVE
     C           M@SKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C                     LEAVE
     C                     ENDDO
      *
     C                     Z-ADD0         T#OUTS 100
     C                     Z-ADD0         T#HOUR 100
     C                     Z-ADD0         T#RPMH  60
      *
     C           *IN44     IFEQ '1'
     C                     MOVE *BLANK    M@KGUN
     C                     MOVE *BLANK    M@KEIS
     C                     Z-ADD0         M@RPMH
     C                     GOTO EMFA
     C                     END
      *実績月度
     C                     CALL 'MCEC00'
     C                     PARM           R@DATE  8
      *
     C                     MOVE R@DATE    T#SDAT
     C                     MOVE '01'      T#SDAT
     C                     MOVE R@DATE    T#EDAT
     C                     MOVELW@KBN     T#KIBN
     C                     CALL 'MTARS1'
     C                     PARM           T#SDAT  80
     C                     PARM           T#EDAT  80
     C                     PARM           T#KIBN  3
     C                     PARM           T#OUTS 100
     C                     PARM           T#HOUR 100
     C                     PARM           T#RPMH  60
      *
     C                     Z-ADDT#RPMH    W@KADO
     C                     Z-ADDT#RPMH    WWKADO
      *
     C           EMFA      ENDSR
      *================================================================
      *
      *================================================================
     C           #FCG2     BEGSR
      *
     C           FCGKEY    KLIST
     C                     KFLD           E1SHP1
     C                     KFLD           FCGKY1  1
     C                     KFLD           FCGKY2  1
      *
     C                     MOVE '1'       FCGKY1
     C                     MOVE E1SHP1    FCGKY2
     C           FCGKEY    CHAINFCGPP41              76
     C           *IN76     IFEQ '0'
     C                     MOVELE@ENGN    EWSHP1
     C                     END
      *
     C                     MOVE '2'       FCGKY1
     C                     MOVE E1SHP2    FCGKY2
     C           FCGKEY    CHAINFCGPP41              76
     C           *IN76     IFEQ '0'
     C                     MOVELE@ENGN    EWSHP2
     C                     END
      *
     C                     MOVE '3'       FCGKY1
     C                     MOVE E1SHP3    FCGKY2
     C           FCGKEY    CHAINFCGPP41              76
     C           *IN76     IFEQ '0'
     C                     MOVELE@ENGN    EWSHP3
     C                     END
      *
     C                     MOVE '4'       FCGKY1
     C                     MOVE E1SHP4    FCGKY2
     C           FCGKEY    CHAINFCGPP41              76
     C           *IN76     IFEQ '0'
     C                     MOVELE@ENGN    EWSHP4
     C                     END
      *
     C                     MOVE '5'       FCGKY1
     C                     MOVE E1SHP5    FCGKY2
     C           FCGKEY    CHAINFCGPP41              76
     C           *IN76     IFEQ '0'
     C                     MOVELE@ENGN    EWSHP5
     C                     END
      *
     C                     MOVE '6'       FCGKY1
     C                     MOVE E1SHP6    FCGKY2
     C           FCGKEY    CHAINFCGPP41              76
     C           *IN76     IFEQ '0'
     C                     MOVELE@ENGN    EWSHP6
     C                     END
      *
     C           EFCG2     ENDSR
      *================================================================
      *
      *================================================================
     C           #FCG      BEGSR
      *
     C           FCEKEY    CHAINFCGPP31              78
     C           *IN78     IFEQ '0'
     C           E1SKJY    IFEQ 'D'
     C                     SETON                     78
     C                     END
     C                     END
     C           *IN78     IFEQ '1'
     C                     MOVE *BLANK    E1KODO
     C                     MOVE *BLANK    E1SHP1
     C                     MOVE *BLANK    E1SHP2
     C                     MOVE *BLANK    E1SHP3
     C                     MOVE *BLANK    E1SHP4
     C                     MOVE *BLANK    E1SHP5
     C                     MOVE *BLANK    E1SHP6
     C                     END
      *
     C                     MOVE *BLANK    EWSHP1
     C                     MOVE *BLANK    EWSHP2
     C                     MOVE *BLANK    EWSHP3
     C                     MOVE *BLANK    EWSHP4
     C                     MOVE *BLANK    EWSHP5
     C                     MOVE *BLANK    EWSHP6
     C                     MOVELE1SHP1    EWSHP1 15
     C                     MOVELE1SHP2    EWSHP2 15
     C                     MOVELE1SHP3    EWSHP3 15
     C                     MOVELE1SHP4    EWSHP4 15
     C                     MOVELE1SHP5    EWSHP5 15
     C                     MOVELE1SHP6    EWSHP6 15
      *
     C                     EXSR #FCG2
      *
     C           EFCG      ENDSR
      *================================================================
      *
      *================================================================
     C           #CMP      BEGSR
      *
     C                     MOVE *BLANK    W@ENGN 15
      *
     C           CMPKEY    KLIST
     C                     KFLD           K@CMP1  5
     C                     KFLD           K@CMP2  5
     C                     KFLD           K@CMP3  2
     C           CMPKEY    SETGTFCGPP05
     C           CMPKEY    REDPEFCGPP05                  75
     C   75                Z-ADD0         EDHDSC
     C   75                Z-ADD0         ED2SDS
     C   75                GOTO ECMP
      *
     C           FCGKKK    KLIST
     C                     KFLD           EDSHP1
     C                     KFLD           FCGKY1  1
     C                     KFLD           FCGKY2  1
      *
     C                     MOVE '4'       FCGKY1
     C                     MOVE EDSHP4    FCGKY2
     C           FCGKKK    CHAINFCGPP41              76
     C           *IN76     IFEQ '0'
     C                     MOVELE@ENGN    W@ENGN
     C                     END
      *
     C           ECMP      ENDSR
      *================================================================
      *================================================================
     C           #AAM      BEGSR
      *
     C                     MOVEL*BLANK    O@HDK   3
     C                     Z-ADD1         @Y
     C           'HD '     LOKUPKOT,@Y                   88
     C   88                MOVELKBN,@Y    O@HDK
      *
     C           'BM '     LOKUPKOT,@Y                   88
     C   88                MOVELKBN,@Y    O@HDK
      *
     C           'NF '     LOKUPKOT,@Y                   88
     C   88                MOVELKBN,@Y    O@HDK
      *
     C                     MOVE *BLANK    O@RLK   3
     C           'RL '     LOKUPKOT,@Y                   88
     C   88                MOVELKBN,@Y    O@RLK
      *
     C           'RRL'     LOKUPKOT,@Y                   88
     C   88                MOVELKBN,@Y    O@RLK
      *
     C           'FRL'     LOKUPKOT,@Y                   88
     C   88                MOVELKBN,@Y    O@RLK
      *
     C           'TP '     LOKUPKOT,@Y                   88
     C   88                MOVELKBN,@Y    O@RLK
      *
     C           EAAM      ENDSR
      *================================================================
     C           #CLR2     BEGSR
     C                     Z-ADD0         WWGOKE  80
     C                     Z-ADD0         WWNNNM 100
     C                     Z-ADD0         WW1NNM 100
     C                     Z-ADD0         WW2NNM 100
     C                     Z-ADD0         WWGEKN  90
     C                     Z-ADD0         WWKADO 100
     C           ECLR2     ENDSR
      *================================================================
      *
      *================================================================
     C           #OUT2     BEGSR
     C*
     C           T1KEY     KLIST
     C                     KFLD           C2SHN1
     C                     KFLD           C2SHN2
     C                     KFLD           C2SHN3
     C*
     C           D1KBN     IFEQ '1'                        :FUTURE
     C           WWGEKN    MULT D1RITU    W$GEKN 120
     C           W$GEKN    DIV  100       WWGEKN
     C                     ENDIF
     C*
     C*
     C                     EXCPTODAT2
     C*
JW1  C                     EXSR #SIZE
"    C                     MOVEL@SIZE     W@SIZ
"    C                     WRITEABHWPS41
     C*
     C           EOUT2     ENDSR
JW1   *================================================================
 |    * GET SIZE
 |    *================================================================
 |   C           #SIZE     BEGSR
 |   C                     MOVE *BLANK    @SIZE   3
 |   C           W@KBN     IFNE *BLANK
 |   C           W@KBN     CHAINABBPP7G              99
 |   C           *IN99     IFEQ *OFF
 |   C           A#SKJY    ANDNE'D'
 |   C                     MOVELA#SIZE    @SIZE
 |   C                     ENDIF
 |   C                     ENDIF
 |    *
JW1  C                     ENDSR
      *================================================================
      *
      *================================================================
     OABHWPS1 E                ODAT
     O                         W@AKT
     O                                      ','
     O                         W@KBN
     O                                      ','
     O                         M@KEIS
     O                                      ','
     O                         M@KGUN
     O                                      ','
     O                                      '="'
     O                         M@COS1
     O                                      '-'
     O                         M@COS2
     O                                      '-'
     O                         M@COS3
     O                                      '"'
     O                                      ','
     O                         M@RPMH
     O                                      ','
     O                         C2SHN1
     O                                      '-'
     O                         C2SHN2
     O                                      '-'
     O                         C2SHN3
     O                                      ','
     O                         O@HIN1
     O                                      '-'
     O                         O@HIN2
     O                                      '-'
     O                         O@HIN3
     O                                      ','
     O                         C2PROL
     O                                      ','
     O                         C2ZANM
     O                                      ','
     O                         C2ZAIK1
     O                                      ','
     O                         A2KUBI       ' 0 .  '
     O                                      ','
     O                         E1KODO
     O                                      ','
     O                         A2TUSZ       '0 . '
     O                                      ','
     O                         EWSHP1
     O                                      ','
     O                         EWSHP2
     O                                      ','
     O                         EWSHP3
     O                                      ','
     O                         EWSHP4
     O                                      ','
     O                         EWSHP5
     O                                      ','
     O                         EWSHP6
     O                                      ','
     O                         W@GEKN
     O                                      ','
     O                         W@KADO
     O                                      ','
     O                         R@GOKE
     O                                      ','
     O                         F@NNNM
     O                                      ','
     O                         F@1NNM
     O                                      ','
     O                         F@2NNM
     O                                      ','
     O                         A21HB5
     O                                      '-'
     O                         A22HB5
     O                                      '-'
     O                         A23HB2
     O                                      ','
     O                         E#HDS1       '   0 .   '
     O                                      ','
     O                         E#2SD1       '   0 .   '
     O                                      ','
     O                         W@ENG1
     O                                      ','
     O                         A24HB5
     O                                      '-'
     O                         A25HB5
     O                                      '-'
     O                         A26HB2
     O                                      ','
     O                         E#HDS2       '   0 .   '
     O                                      ','
     O                         E#2SD2       '   0 .   '
     O                                      ','
     O                         W@ENG2
     O                                      ','
     O                         O@KOTE
     O                                      ','
     O                         O@KIBN
     O                                      ','
     O                         O@HDK
     O                                      ','
     O                         O@RLK
     O                                      ','
     O                         C2SYOS
     O                                      ','
     O                         C2KMAX
     O                                      ','
     O                         @@KOTE
     O                                      ','
     O                         @@KIBN
     O                                      ','
      *************************
     OABHWPS2 E                ODAT2
     O                         W@AKT
     O                                      ','
     O                                      '="'
     O                         W@KBN
     O                                      '"'
     O                                      ','
     O                         M@KEIS
     O                                      ','
     O                         M@KGUN
     O                                      ','
     O                                      '="'
     O                         M@COS1
     O                                      '-'
     O                         M@COS2
     O                                      '-'
     O                         M@COS3
     O                                      '"'
     O                                      ','
     O                         M@RPMH
     O                                      ','
     O                                      '="'
     O                         C2SHN1
     O                                      '-'
     O                         C2SHN2
     O                                      '-'
     O                         C2SHN3
     O                                      '"'
     O                                      ','
     O                         C2PROL
     O                                      ','
     O                         C2ZANM
     O                                      ','
     O                         C2ZAIK1
     O                                      ','
     O                         A2KUBI       ' 0 .  '
     O                                      ','
     O                         E1KODO
     O                                      ','
     O                         A2TUSZ       '0 . '
     O                                      ','
     O                         EWSHP1
     O                                      ','
     O                         EWSHP2
     O                                      ','
     O                         EWSHP3
     O                                      ','
     O                         EWSHP4
     O                                      ','
     O                         EWSHP5
     O                                      ','
     O                         EWSHP6
     O                                      ','
     O                         WWGEKN
     O                                      ','
     O                         WWKADO
     O                                      ','
     O                         WWGOKE
     O                                      ','
     O                         WWNNNM
     O                                      ','
     O                         WW1NNM
     O                                      ','
     O                         WW2NNM
     O                                      ','
     O                         A21HB5
     O                                      '-'
     O                         A22HB5
     O                                      '-'
     O                         A23HB2
     O                                      ','
     O                         E#HDS1       '   0 .   '
     O                                      ','
     O                         E#2SD1       '   0 .   '
     O                                      ','
     O                         W@ENG1
     O                                      ','
     O                         A24HB5
     O                                      '-'
     O                         A25HB5
     O                                      '-'
     O                         A26HB2
     O                                      ','
     O                         E#HDS2       '   0 .   '
     O                                      ','
     O                         E#2SD2       '   0 .   '
     O                                      ','
     O                         W@ENG2
     O                                      ','
     O                         C2SYOS
     O                                      ','
     O                                      '1'
     O                                      ','
     O                         C2KMAX
     O                                      ','
** PRC
HD
BM
NF
NP
TP
PRS
FRL
RL
RRL
RRT
HK
HN
INJ
LAN
AOQ
SB
KRO
KW
CUB
SK
SL
SL1
SP
TC
PNK
VNL
DT
HT
