     H            Y.
     F** CADRSB ********************************************
     F*めっきかんばん旧番地取得                          *
     F*      MSK                           2008.12.12      *
     F******************************************************
     FCADTL04 IF  E           K        DISK
      *
     C           *ENTRY    PLIST
     C                     PARM           PHIN1   5
     C                     PARM           PHIN2   5
     C                     PARM           PHIN3   2
     C                     PARM           PUKYY   40
     C                     PARM           PUKMM   20
     C                     PARM           PUKDD   20
     C                     PARM           PUBIN   20
     C                     PARM           OATK1   1
     C                     PARM           OATK2   2
     C                     PARM           OATK3   2
     C                     PARM           OATK4   1
      **
     C                     MOVELPHIN1     WHIN1   5
     C                     MOVELPHIN2     WHIN2   5
     C                     MOVELPHIN3     WHIN3   2
     C                     Z-ADDPUKYY     WUKYY   40
     C                     Z-ADDPUKMM     WUKMM   20
     C                     Z-ADDPUKDD     WUKDD   20
     C                     Z-ADDPUBIN     WUBIN   20
     C                     MOVE *BLANK    OATK1   1
     C                     MOVE *BLANK    OATK2   2
     C                     MOVE *BLANK    OATK3   2
     C                     MOVE *BLANK    OATK4   1
      *
     C           CADKEY    KLIST
     C                     KFLD           WHIN1
     C                     KFLD           WHIN2
     C                     KFLD           WHIN3
     C                     KFLD           WUKYY
     C                     KFLD           WUKMM
     C                     KFLD           WUKDD
     C                     KFLD           WUBIN
     C           CADKY2    KLIST
     C                     KFLD           WHIN1
     C                     KFLD           WHIN2
     C                     KFLD           WHIN3
      *パラメータのめっきかんばんを探す。
     C           CADKEY    SETGTCADTL041
     C                     DO   *HIVAL
     C           CADKEY    REDPECADTL041                 55
     C   55                LEAVE
     C           C2SKJY    IFEQ 'D'
     C           C2SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
     C                     LEAVE
     C                     ENDDO
     C   55                EXSR #SB300
      *見つかっためっきかんばんの一つ前のかんばんを探す。
     C                     DO   *HIVAL
     C           CADKY2    REDPECADTL041                 55
     C   55                LEAVE
     C           C2SKJY    IFEQ 'D'
     C           C2SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
     C                     LEAVE
     C                     ENDDO
      *
     C   55                EXSR #SB300
      *
     C                     MOVE C2KTR1    OATK1
     C                     MOVE C2KTR2    OATK2
     C                     MOVE C2KTR3    OATK3
     C                     MOVE C2KTR4    OATK4
      *
     C                     EXSR #SB300
      *
      *----------------------------------------------------*
      *   終了処理                                       *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
