     H            Y.
     F** CHGR10 ******************************************
     F* CHECK SPOOL ATTRIBUTE                            *
     F*                           T.SAKAKI   2018.05.09  *
     F****************************************** BX012R **
     FCHGWP10 IP  F     256            DISK
     E                    THD1    1   2  6
     ICHGWP10 AA  01
     I                                        1 254 BXDATA
      *ＯＵＴＱ調査と読み飛ばしに使用
     I                                        3   3 BXHD2
     I                                        3   8 BXHD1
     I                                        3  12 BXFILE
     I                                       14  14 BXHD3
     I                                       14  23 BXJOBU
     I                                       37  39 BXSTS
     I                                       74  79 BXSPNB
     I                                       85  94 BXJOB
     I                                       96 101 BXJOBN
     I                                      103 104 BXHZYY
     I                                      106 107 BXHIMM
     I                                      109 110 BXHIDD
     I                                      112 113 BXTIHH
     I                                      115 116 BXTIMM
     I                                      118 119 BXTISS
     C           *ENTRY    PLIST
     C                     PARM           @ARI
     C           BXFILE    IFEQ 'QPRTSPLQ'
     C                     GOTO @JIREC
     C                     END
      * ヘッダー行なら読み飛ばす
     C                     MOVE *BLANK    @ARI    1
     C                     SETOF                     91
     C           BXHD1     LOKUPTHD1                     91
      *
     C           *IN91     IFEQ '1'
     C                     GOTO @JIREC
     C                     END
      *
     C           BXHD2     IFEQ 'F'
     C           BXHD3     ANDEQ'U'
     C                     GOTO @JIREC
     C                     END
      *
     C           BXHD1     IFEQ '      '
     C                     GOTO @JIREC
     C                     END
      *
     C                     MOVE '1'       @ARI    1
     C                     MOVE BXJOBN    DXJOBN  60
     C                     MOVE BXSPNB    DXSPNB  60
     C                     MOVE DXJOBN    PXJOBN  6
     C                     Z-ADDDXSPNB    PXSPNB  60
     C                     CALL 'CHGC11'
     C                     PARM           BXFILE
     C                     PARM           BXJOB
     C                     PARM           BXJOBU
     C                     PARM           BXJOBN
     C                     PARM           PXSPNB
     C           @JIREC    TAG
**  THD1 01234567890123456789012345678901234567890123456789012345
5770SS
    (N
