     H            Y.
      ** CHKRXA *******************************************************
      * ..配布待ち行列状況の確認        ..
      *  T.SAKASHITA 2015.06.02
      *****************************************************************
     FCHKWPX1 IP  E                    DISK
     C           *ENTRY    PLIST
     C                     PARM           P@FLG   1
     C           *IN77     IFEQ '0'
     C                     MOVE *BLANK    P@FLG
     C                     SETON                     77
     C                     END
      *
     C           CSGENZ    IFNE 0
     C                     MOVE '*'       P@FLG
     C                     END
      *
     C           CSSTAT    IFNE 'Waiting '
     C                     MOVE '*'       P@FLG
     C                     END
      *
