     H            Y.
     F***CHKR39G ***************************************************************
     F*  PROGRAM    : CHECK FORECAST VS PRICE MASTER                           *
     F*  WRITTEN    : JW   2025.01.09                                          *
     F**************************************************************************
     FABBPL05 IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
     E                    MSG     1   1 60
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I            DS
     I                                        1  20 Q5MHIN
     I                                        1   5 Q5MHN1
     I                                        6  10 Q5MHN2
     I                                       11  15 Q5MHN3
     I                                       16  20 Q5MHN4
     I            DS
     I                                        1   80Q5NHHZ
     I                                        1   40Q5NHYY
     I                                        5   60Q5NHMM
     I                                        7   80Q5NHDD
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           *LOVAL    SETLLABBPL05
     C                     DO   *HIVAL
     C                     READ ABBPL05                  98
     C   98                LEAVE
      * IGNORE
     C           Q5NNNM    IFEQ 0
     C           Q51NNM    ANDEQ0
     C           Q52NNM    ANDEQ0
     C                     ITER
     C                     ENDIF
      * FIRST?
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     Z-ADDQ5TOKU    SVTOKU  40
     C                     Z-ADDQ5NONY    SVNONY  40
     C                     MOVELQ5MHIN    SVMHIN 20
     C                     Z-ADDQ5NHHZ    SVNHHZ  80
     C                     MOVELQ5NKOJ    SVNKOJ  1
     C                     MOVELQ5NUKE    SVNUKE  4
     C                     ENDIF
      * BREAK?
     C           Q5TOKU    IFNE SVTOKU
     C           Q5NONY    ORNE SVNONY
     C           Q5MHIN    ORNE SVMHIN
     C                     EXSR #BRK1
     C                     ENDIF
     C                     ENDDO
      * LAST BREAK
     C           FIRST     IFEQ 'N'
     C                     EXSR #BRK1
     C                     ENDIF
      *
     C           SEQ#      IFNE 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  BREAK                                             *
      *----------------------------------------------------*
     C           #BRK1     BEGSR
      * CHECK PRICE 1
     C                     MOVELSVTOKU    $TOKU
     C                     MOVELSVNONY    $NONY
     C                     MOVELSVMHIN    $CPART
     C                     CALL 'UTLR17'
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $CPART 20
     C                     PARM           $EFDT   8
     C                     PARM           $UP     9
     C                     PARM           $RTN1   1
      * PRICE NOT FOUND 1
     C           $RTN1     IFEQ '*'
     C                     MOVELSVTOKU    $TOKU
     C                     MOVELSVNONY    $NONY
     C                     MOVELSVMHIN    LTR10  10        SEARCH BY 10 DIGITS
     C                     MOVELLTR10     $CPART    P
     C                     CALL 'UTLR17'
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $CPART 20
     C                     PARM           $EFDT   8
     C                     PARM           $UP     9
     C                     PARM           $RTN1   1
     C                     ENDIF
      * PRICE NOT FOUND 2
     C           $RTN1     IFEQ '*'
      * CUST BREAK?
     C           SVNONY    IFNE BBNONY
     C           BBNONY    ANDNE0
     C                     EXCPT@DTL2
     C                     ENDIF
     C                     Z-ADDSVNONY    BBNONY
      *
     C                     EXSR #PRINT
     C                     ENDIF
      * RESET
     C                     Z-ADDQ5TOKU    SVTOKU
     C                     Z-ADDQ5NONY    SVNONY
     C                     MOVELQ5MHIN    SVMHIN
     C                     Z-ADDQ5NHHZ    SVNHHZ
     C                     MOVELQ5NKOJ    SVNKOJ
     C                     MOVELQ5NUKE    SVNUKE
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  PRINT 1                                           *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      * EDIT
     C                     MOVELMSG,1     MSG1   60
      * PART#
     C                     MOVELSVMHIN    $MHIN
     C                     CALL 'EDTR02A'
     C                     PARM           $MHIN  20
     C                     PARM           $MHIN2 23
      * NAME
     C                     MOVELSVNONY    PMNONY
     C                     MOVE 'D'       PMOPT
     C                     CALL 'UTLR16'
     C                     PARM           PMNONY  4
     C                     PARM           PMOPT   1
     C                     PARM           PMNAME 20
     C                     PARM           PTOKU   4
     C                     PARM           PMRTN   1
      * ENTRY TYPE
     C                     MOVELSVNONY    $NONY
     C                     MOVELSVNKOJ    $NKOJ
     C                     MOVELSVNUKE    $NUKE
     C                     MOVELSVMHIN    $MHIN
     C                     CALL 'UEXR44 '
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $MHIN  20
     C                     PARM           $OTYP   1
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL1
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $RTN    1
      *
     C                     MOVE *BLANK    $RTN
     C                     TIME           SDATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD99        LIN#    30
     C                     MOVE 'Y'       FIRST   1
     C                     Z-ADD0         BBNONY  40
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** FORECAST PRICE ER'
     O                                   60 'ROR REPORT **       '
     O                         TODAY     78 '    .  .  '
     O                         NOW       88 '  :  :  '
     O                                   94 'PAGE'
     O                         PAGE  Z   98
     O        E   03           @HDR
     O                                    6 'SEQ#'
     O                                   10 'TYP'
     O                                   15 'CUST'
     O                                   21 'DELV'
     O                                   27 'NAME'
     O                                   54 'USER_PART'
     O                                   76 'UPD_DATE'
     O                                   89 'ERROR MSG'
     O        E 1              @DTL1
     O                         SEQ#  Z +002
     O                         $OTYP   +002
     O                         SVTOKU  +002
     O                         SVNONY  +002
     O                         PMNAME  +002
     O                         $MHIN2  +002
     O                         SVNHHZ  +000 '    /  /  '
     O                         MSG1    +002
      *
     O        E 1              @DTL2
     O                                    1 '.'
      *
** MSG(60A) .......2.........3.........4.........5........6
PRICE NOT FOUND IN THE PRICE MASTER!
