     H            Y.
     F** CHKR41 ****************************************************************
     F*  PROGRAM    : CHECK HONDA SHIP CODE (AB#PP2A)                          *
     F*             : RUN IN FCKC00 (10:10AM BY JOBSCDE)                       *
     F*  WRITTEN    : 2019.06.12                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FAB#PL19DIF  E           K        DISK
     FAB#PL2ACIF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *---------------------------------------------------
     I            DS
     I                                        1  140@DATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ***********************************************************
     C                     EXSR #INIT
      *
     C           *LOVAL    SETLLAB#PL19D
     C                     DO   *HIVAL
     C                     READ AB#PL19D                 98
     C   98                LEAVE
      * SELECT
     C           BASKJY    IFEQ 'D'
     C           BAEDIK    ORNE 'M'
     C           BAURYY    ORNE 0
     C                     ITER
     C                     ENDIF
      * CHECK AB#PP2A
     C                     EXSR #CHK1
      *
     C                     ENDDO
      * SET RETURN CODE
     C           SEQ#      IFNE 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  CHECK AB#PP2A                                     *
      *----------------------------------------------------*
     C           #CHK1     BEGSR
      *
     C                     MOVE *OFF      *IN97
     C                     Z-ADDBANONY    K#NONY
     C                     MOVELBAODRN    K#ODRN    P
     C                     Z-ADDBANOBN    K#BIN
     C                     MOVELBAMHN1    K#MHN1
     C                     MOVELBAMHN2    K#MHN2
     C                     MOVELBAMHN3    K#MHN3
     C                     MOVELBAMHN4    K#MHN4
     C           K#PL2A    SETLLAB#PL2AC
     C                     DO   *HIVAL
     C           K#PL2A    READEAB#PL2AC                 97
     C   97                LEAVE
      * IGNORE
     C           ACUPID    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      * SELECT
     C           ACPLSH    IFEQ BANOHZ
     C           ACASDT    OREQ BANOHZ
      * GET PLANT
     C                     MOVELBAODRN    $ODRN
     C                     MOVELBANOHZ    $NOHZ
     C                     MOVE *BLANK    $PLNT
     C                     MOVE *BLANK    $SHCD
     C                     CALL 'UEXR09'
     C                     PARM           $ODRN  10
     C                     PARM           $NOHZ   8
     C                     PARM           $PLNT   3
     C                     PARM           $SHCD  10
     C                     PARM           $RTN1   1
      *
     C           $PLNT     IFNE *BLANK
     C           $PLNT     IFNE ACPLNT
     C           $SHCD     ORNE ACSHCD
     C                     EXSR #PRINT
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $RTN    1
      *
     C           K#PL2A    KLIST
     C                     KFLD           K#NONY  40
     C                     KFLD           K#ODRN 20
     C                     KFLD           K#BIN   20
     C                     KFLD           K#MHN1  5
     C                     KFLD           K#MHN2  5
     C                     KFLD           K#MHN3  5
     C                     KFLD           K#MHN4  5
      *
     C                     MOVE *BLANK    $RTN
     C                     TIME           @DATE
     C                     Z-ADD0         SEQ#    50
     C                     Z-ADD88        LIN#    30
      *
     C                     ENDSR
      ************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** HONDA ORDER PLANT'
     O                                   60 '/SHIP CODE ERROR LIS'
     O                                   80 'T (AB#PP2A) **      '
     O                         TODAY     98 '    .  .  '
     O                         NOW      108 '0 :  :  '
     O                                  112 'P.'
     O                         PAGE  Z  116
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   11 'CUST'
     O                                   17 'DELV'
     O                                   27 'SHP_DATE'
     O                                   34 'BIN#'
     O                                   41 'ORDER#'
     O                                   53 'EDI_PLNT'
     O                                   63 'IAF_ORDR'
     O                                   74 'EDI_SHPTO'
     O                                   85 'IAF_ORDR '
     O                                   93 'PART1'
     O                                   99 'PART2'
     O                                  105 'PART3'
     O                                  114 'CRT_DATE'
     O        E 1              @DTL
     O                         SEQ#  Z +000
     O                         BATOKU  +002
     O                         BANONY  +002
     O                         BANOHZ  +002 '    /  /  '
     O                         BANOBN  +002
     O                         BAODRN  +002
     O                         $PLNT   +002
     O                         ACPLNT  +007
     O                         $SHCD   +005
     O                         ACSHCD  +001
     O                         BAMHN1  +002
     O                         BAMHN2  +001
     O                         BAMHN3  +001
     O                         ACCRDT  +001 '    /  /  '
