     H            Y.
     F***CHKR56*****************************************************************
     F*  PROGRAM    : CHECK HONDA ORDERS CONFLICT ORDER#                       *
     F*             : READ AB#PL1N                                             *
     F*  WRITTEN    : 2019.06.28                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FAB#PL1N IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    MSG     1   3 40
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I            DS
     I                                        1   80K#YMD
     I                                        1   40K#YY
     I                                        5   60K#MM
     I                                        7   80K#DD
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1  20 BAMHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           K#PP10    SETLLAB#PL1N
     C                     DO   *HIVAL
     C                     READ AB#PL1N                  98
     C   98                LEAVE
      *
      * SELECT HONDA
     C           BATOKU    IFNE 0294
     C           BATOKU    ANDNE0295
     C           BATOKU    ANDNE0296
     C           BATOKU    ANDNE0390
     C           BATOKU    ANDNE0391
     C           BATOKU    ANDNE0400
     C           BATOKU    ANDNE1602
     C           BATOKU    ANDNE3135
     C                     ITER
     C                     ENDIF
      *
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           BAURYY    IFNE 0
     C                     ITER
     C                     ENDIF
      * CHECK
     C                     EXSR #CHK1
     C           *IN85     IFEQ *ON
     C                     MOVELMSG,1     XMSG   40
     C                     EXSR #PRINT
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           SEQ#      IFNE 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  CHECK EDI (AB#EP90)                               *
      *----------------------------------------------------*
     C           #CHK1     BEGSR
      *
     C                     MOVE *OFF      *IN85
      * GET EDI ORDER
     C                     MOVELBANONY    $NONY
     C                     MOVELBAODRN    $ODRN
     C                     MOVELBAMHIN    $MHIN
     C                     CALL 'UEXR37'
     C                     PARM           $NONY   4
     C                     PARM           $ODRN  10
     C                     PARM           $MHIN  20
     C                     PARM           $RTN    1
      *
     C           $RTN      IFEQ '*'
     C                     MOVE *ON       *IN85
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      * GET CUSTOMER NAME
     C                     MOVELBANONY    $DLV
     C                     CALL 'UTLR62'
     C                     PARM           $DLV    4
     C                     PARM           $GRP    3
     C                     PARM           $NAME1 15
     C                     PARM           $NAME2 50
     C                     PARM           $RTN    1
     C                     MOVEL$NAME1    XNAME   7
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     MOVELSVODRN    @ORD1
     C                     MOVELBAODRN    @ORD2
     C                     Z-ADDBASRYO    XXSRYO  60
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $DATE   8
     C                     PARM           $RTN    1
      *
     C           K#PP10    KLIST
     C                     KFLD           K#YY
     C                     KFLD           K#MM
     C                     KFLD           K#DD
      *
     C                     MOVEL$DATE     @TGDAT  80
     C                     MOVEL$DATE     K#YMD
     C                     MOVE *BLANK    $RTN
     C                     TIME           SDATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD88        LIN#    30
     C                     MOVE 'Y'       FIRST   1
      *
     C                     MOVE *BLANK    @ORD1  10
     C                     MOVE *BLANK    @ORD2  10
      *
     C                     Z-ADD0         SVNOHZ  80
     C                     Z-ADD0         SVNOBN  20
     C                     Z-ADD0         SVTOKU  40
     C                     Z-ADD0         SVNONY  40
     C                     MOVE *BLANK    SVODRN 16
     C                     MOVE *BLANK    BAODR6  6
     C                     MOVE *BLANK    SVODR6  6
     C                     MOVE *BLANK    SVMHIN 20
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** UNIDENTIFIED HOND'
     O                                   60 'A ORDERS VS EDI DATA'
     O                                   80 ' (PP10) **          '
     O                                   89 'DATE'
     O                         TODAY     92 '    .  .  '
     O                         NOW      102 '  :  :  '
     O                                  106 'P.'
     O                         PAGE  Z  110
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   14 'SHP_DATE'
     O                                   21 'BIN#'
     O                                   30 'CUST'
     O                                   35 'DELV'
     O                                   58 'CUST_PART_______'
     O                                   67 'ORDER#'
     O                                   79 'QTY'
     O                                   85 'NAME'
     O                                  105 '** ERROR MSG **'
     O        E 1              @DTL
     O                         SEQ#  1 +000
     O                         BANOHZ  +001 '    /  /  '
     O                         BANOBN  +002
     O                         BAEDIK  +003
     O                         BATOKU  +002
     O                         BANONY  +001
     O                         BANKOJ  +001
     O                         BANUKE  +001
     O                         BAMHN1  +000
     O                         BAMHN2  +001
     O                         BAMHN3  +001
     O                         BAODRN  +002
     O                         XXSRYO1 +001
     O                         XNAME   +002
     O                         XMSG    +002
** MSG (30A) .+....2....+....3....+....4
PO# & PART CONBINATION NOT FOUND IN EDI! 01
                                         02
                                         03
