     H            Y.
     F***CHKR37*****************************************************************
     F*  PROGRAM    : CHECK DUPLICATE ORDERS (AB#PP10)                         *
     F*             : RUN IN VJBC71 ( 5:45AM BY JOBSCDE)                       *
     F*             : RUN IN FCKC00 (10:10AM BY JOBSCDE)                       *
     F*             : RUN IN VJBC72 ( 4:30PM BY JOBSCDE)                       *
     F*  WRITTEN    : 12/7/2018                                                *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FAB#PL19DIF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I            DS
     I                                        1  20 BAMHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
     I            DS
     I                                        1   80BAURHZ
     I                                        1   40BAURYY
     I                                        5   60BAURMM
     I                                        7   80BAURDD
     I            DS
     I                                        1   80BADEHZ
     I                                        1   40BADEYY
     I                                        5   60BADEMM
     I                                        7   80BADEDD
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           *IN98     DOWEQ*OFF
     C                     READ AB#PL19D                 98
     C           *IN98     IFEQ *OFF
     C           BASKJY    ANDNE'D'
     C           BAURHZ    ANDEQ0
      * FORD FLAG
     C           BATOKU    IFEQ 5149
     C                     MOVE *ON       *IN44
     C                     ELSE
     C                     MOVE *OFF      *IN44
     C                     ENDIF
      *
     C   44                EXSR #FORD
     C  N44                EXSR #OTHER
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           SEQ#      IFNE 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * FORD                                               *
      *----------------------------------------------------*
     C           #FORD     BEGSR
      * CHAIN
     C           BATOKU    IFEQ SVTOKU
     C           BANONY    ANDEQSVNONY
     C           BAMHIN    ANDEQSVMHIN
     C           BANKOJ    ANDEQSVNKOJ
     C           BANUKE    ANDEQSVNUKE
     C           BANOHZ    ANDEQSVNOHZ
     C           BANOBN    ANDEQSVNOBN
     C           BAODRN    ANDEQSVODRN
FORD C           BADEHZ    ANDEQSVDEHZ
     C                     EXSR #PRINT
     C                     ELSE
     C                     Z-ADDBATOKU    SVTOKU
     C                     Z-ADDBANONY    SVNONY
     C                     MOVELBAMHIN    SVMHIN
     C                     MOVELBANKOJ    SVNKOJ
     C                     MOVELBANUKE    SVNUKE
     C                     Z-ADDBANOHZ    SVNOHZ
     C                     Z-ADDBANOBN    SVNOBN
     C                     MOVELBAODRN    SVODRN
     C                     MOVELBADEHZ    SVDEHZ
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  OTHER THAN FORD                                   *
      *----------------------------------------------------*
     C           #OTHER    BEGSR
      * CHAIN
     C           BATOKU    IFEQ SVTOKU
     C           BANONY    ANDEQSVNONY
     C           BAMHIN    ANDEQSVMHIN
     C           BANKOJ    ANDEQSVNKOJ
     C           BANUKE    ANDEQSVNUKE
     C           BANOHZ    ANDEQSVNOHZ
     C           BANOBN    ANDEQSVNOBN
     C           BAODRN    ANDEQSVODRN
     C                     EXSR #PRINT
     C                     ELSE
     C                     Z-ADDBATOKU    SVTOKU
     C                     Z-ADDBANONY    SVNONY
     C                     MOVELBAMHIN    SVMHIN
     C                     MOVELBANKOJ    SVNKOJ
     C                     MOVELBANUKE    SVNUKE
     C                     Z-ADDBANOHZ    SVNOHZ
     C                     Z-ADDBANOBN    SVNOBN
     C                     MOVELBAODRN    SVODRN
     C                     MOVELBADEHZ    SVDEHZ
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $RTN    1
      *
     C                     MOVE *BLANK    $RTN
     C                     TIME           SDATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD88        LIN#    30
     C                     Z-ADD0         SVTOKU  40
     C                     Z-ADD0         SVNONY  40
     C                     MOVE *BLANK    SVMHIN 20
     C                     MOVE *BLANK    SVNKOJ  1
     C                     MOVE *BLANK    SVNUKE  4
     C                     Z-ADD0         SVNOHZ  80
     C                     Z-ADD0         SVNOBN  20
     C                     MOVE *BLANK    SVODRN 10
     C                     MOVE *BLANK    SVDEHZ  80
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** DUPLICATE ORDER R'
     O                                   60 'EPORT (AB#PP10) **  '
     O                                   79 'DATE'
     O                         TODAY     82 '    .  .  '
     O                         NOW       92 '  :  :  '
     O                                   95 'P.'
     O                         PAGE  Z   99
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   10 'CUST'
     O                                   15 'DELV'
     O                                   31 'SHP_DATE'
     O                                   34 'BN'
     O                                   44 'USER_PART'
     O                                   62 'ORDER#'
     O                 44                62 'DELIV_DT'
     O        E 1              @DTL
     O                         SEQ#    +001
     O                         SVTOKU  +001
     O                         SVNONY  +001
     O                         SVNKOJ  +001
     O                         SVNUKE  +001
     O                         SVNOHZ  +001
     O                         SVNOBN  +001
     O                         SVMHIN  +001
     O                         SVODRN  +001
     O                 44      SVDEHZ  +001
