     H            Y.
     F***CHKR48*****************************************************************
     F*  PROGRAM    : PRINT HONDA ADJUSTED FULL BOX QTY REPORT                 *
     F*  WRITTEN    : 3/20/2019                                                *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FAB#WP55 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I            DS
     I                                        1  20 WMHIN
     I                                        1   5 WMHN1
     I                                        6  10 WMHN2
     I                                       11  15 WMHN3
     I                                       16  20 WMHN4
     I            DS
     I                                        1  17 @MHIN
     I                                        1   5 @MHN1
     I                                        6   6 @H1
     I                                        7  11 @MHN2
     I                                       12  12 @H2
     I                                       13  17 @MHN3
     I            DS
     I                                        1  140@SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR @INIT
      *
     C                     DO   *HIVAL
     C                     READ AB#WP55                  98
     C   98                LEAVE
      *
     C           WADFL     IFEQ '**'
      * GET ACTUAL BIN#
     C                     MOVELWNONY     $NONY
     C                     MOVELWNUKE     $NUKE
     C                     MOVELWNYMD     $NOHZ
     C                     MOVELWMHIN     $MHIN
     C                     MOVELWODRN     $ODRN
     C                     CALL 'UTLR72'
     C                     PARM           $NONY   4
     C                     PARM           $NUKE   4
     C                     PARM           $NOHZ   8
     C                     PARM           $MHIN  20
     C                     PARM           $ODRN  10
     C                     PARM           $BIN    2
     C                     PARM           $ASN   16
     C                     PARM           $RTN    1
      *
     C                     EXSR @PRINT
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           SEQ#      IFGE 1
     C                     MOVE '*'       $PRNT
     C                     ELSE
     C                     MOVE ' '       $PRNT
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           @PRINT    BEGSR
      * ADJ
     C                     MOVELWMHN1     @MHN1
     C                     MOVELWMHN2     @MHN2
     C                     MOVELWMHN3     @MHN3
     C           WMHN2     IFEQ *BLANK
     C                     MOVE ' '       @H1
     C                     ELSE
     C                     MOVE '-'       @H1
     C                     ENDIF
      *
     C           WMHN3     IFEQ *BLANK
     C                     MOVE ' '       @H2
     C                     ELSE
     C                     MOVE '-'       @H2
     C                     ENDIF
      *
     C           WSYOS     IFEQ 0
     C                     Z-ADD0         @BOX
     C                     ELSE
     C           WSURY     DIV  WSYOS     @BOX
     C                     ENDIF
      *
     C           $BIN      IFEQ '00'
     C                     MOVEL'01'      $BIN
     C                     ENDIF
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD5         LIN#
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           @INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $PRNT   1
      *
     C                     TIME           @SDATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD88        LIN#    30
     C                     Z-ADD0         @BOX    40
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** HONDA ORDER QTY ('
     O                                   60 'ADJUSTED TO BE FULL '
     O                                   80 'BOX QTY) **         '
     O                                   99 'DATE'
     O                         TODAY     92 '    .  .  '
     O                         NOW      102 '  :  :  '
     O                         PAGE  Z  109
     O                                  106 'P.'
     O        E   03           @HDR
     O                                   58 'ORIGINAL'
     O                                   71 'ADJUSTED'
     O                                   79 'IAF'
     O        E 1              @HDR
     O                                    5 'SEQ#'
     O                                   10 'CUST'
     O                                   15 'DELV'
     O                                   25 'USER PART'
     O                                   43 'SHIP_DATE'
     O                                   49 'BIN#'
     O                                   58 'QTY'
     O                                   71 'QTY'
     O                                   79 'Q/C'
     O                                   85 'BOX'
     O                                   93 'ORDER#'
     O                                  101 'ASN#'
     O        E 1              @HDR
     O                                   20 '--------------------'
     O                                   40 '--------------------'
     O                                   60 '--------------------'
     O                                   80 '--------------------'
     O                                  100 '--------------------'
     O                                  120 '--------------------'
     O                                  130 '----------'
     O        E 1              @DTL
     O                         SEQ#  Z +001
     O                         WTOKU   +001
     O                         WNONY   +001
     O                         @MHIN   +001
     O                         WNYMD   +001 '    /  /  '
     O                         $BIN    +002
     O                         WOGQT 1 +001
     O                                 +001 '-->'
     O                         WSURY 1 +000
     O                         WSYOS 1 +001
     O                         @BOX  1 +001
     O                         WODRN   +002
     O                         $ASN    +000
