     H            Y.
     F***CHKR29*****************************************************************
     F*  PROGRAM    : CHECK OUTSRC PO VS LEVELLED MASTER (AGAPP31)             *
     F*             : RUN IN FCKC00 (10:10AM BY JOBSCDE)                       *
     F*  WRITTEN    : 9/27/2018                                                *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FAFAPL80 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *---------------------------------------------------
     E                    NY       1000  4 0
     I            DS
     I                                        1  140@DATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ***********************************************************
     C                     EXSR @INIT
      *
     C           *LOVAL    SETLLAFAPL80
     C                     DO   *HIVAL
     C                     READ AFAPL80                  98
     C   98                LEAVE
      *
     C           A8SKJY    IFNE *BLANK
     C                     ITER
     C                     ENDIF
      *
     C           A8SUYY    IFNE 0
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         CNT
     C           KEY1      CHAINAGAPL31              99
     C           *IN99     IFEQ *OFF
     C           CBSKJY    ANDEQ'D'
     C           *IN99     OREQ *ON
     C                     EXSR #PRINT
     C                     ENDIF
      *
     C                     ENDDO
      * SET RETURN CODE
     C           SEQ#      IFNE 0
     C                     MOVE '*'       @RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           @INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           @RTN    1
      *
     C           KEY1      KLIST
     C                     KFLD           A8PAR1
     C                     KFLD           A8PAR2
     C                     KFLD           A8PAR3
      *
     C                     MOVE *BLANK    @RTN
     C                     TIME           @DATE
     C                     Z-ADD0         SEQ#    50
     C                     Z-ADD88        LIN#    30
     C                     Z-ADD0         CNT     40
      *
     C                     ENDSR
      ************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** OUTSRC PO VS AGAP'
     O                                   60 'P31(LEVELLED MASTER)'
     O                                   80 ' **                 '
     O                                   99 'DATE'
     O                         TODAY    102 '    .  .  '
     O                         NOW      112 '  :  :  '
     O                                  115 'P.'
     O                         PAGE  Z  119
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   10 'SUPP'
     O                                   16 'PART1'
     O                                   22 'PART2'
     O                                   30 'ZETI'
     O                                   35 'TEHI'
     O                                   40 'PAGE'
     O                                   45 'DATE'
     O                                   53 'RE#'
     O        E 1              @DTL
     O                         SEQ#  Z +000
     O                         A8SUPP  +001
     O                         A8PAR1  +001
     O                         A8PAR2  +001
     O                         A8PAR3  +001
     O                         A8ZETI  +001
     O                         A8TEHI  +001
     O                         A8PAGE  +002
     O                         A8DATE  +003
     O                         A8RENO  +001
