     H            Y.
     F** CHKR90 ********************************************
     F*  CHECK NUMERIC                                     *
     F*  T.SAKASHITA       2007.10.30                      *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'CHKR90'
     F*                    PARM           $TEXT  20
     F*                    PARM           $LENG   2
     F*                    PARM           $RTN    1
     F*   IN  $TEXT : 20A TEXT 20A
     F*   IN  $LENG :  2A LENGTH
     F*  OUT  $RTN  :  1A RETURN CODE (0:NUMERIC, 1:NOT NUMERIC)
     F******************************************************
     E                    TMJ        20  1
     I            DS
     I                                        1  20 TMJ
     I                                        1  20 WMJ
     C*PRTN='0':OK
     C*PRTN='1':NG
     C           *ENTRY    PLIST
     C                     PARM           PMOJI  20
     C                     PARM           PKETA   2
     C                     PARM           PRTN    1
     C*
     C                     MOVE PMOJI     WMJ
     C*
     C                     MOVE PKETA     W@KETA  20
     C           1         DO   W@KETA    XX      20
     C           TMJ,XX    IFEQ '1'
     C           TMJ,XX    OREQ '2'
     C           TMJ,XX    OREQ '3'
     C           TMJ,XX    OREQ '4'
     C           TMJ,XX    OREQ '5'
     C           TMJ,XX    OREQ '6'
     C           TMJ,XX    OREQ '7'
     C           TMJ,XX    OREQ '8'
     C           TMJ,XX    OREQ '9'
     C           TMJ,XX    OREQ '0'
     C                     ELSE
     C                     MOVE '1'       PRTN
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C                     ENDDO
     C*
     C                     MOVE '0'       PRTN
     C*
     C                     SETON                     LR
     C                     RETRN
