     H            Y.
     F** CHKR61F ***************************************************************
     F*  PROGRAM    : CHECK FORD ROUTE M/F DUP ERR BY NONY/DOCK                *
     F*  WRITTEN    : 2022.12.19                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FABFDL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        7  100@YEAR
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           *LOVAL    SETLLABFDL01
      *
     C                     DO   *HIVAL
     C                     READ ABFDL01                  98
     C   98                LEAVE
      * IGNORE
     C           QASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      * FIRST?
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     MOVELQANONY    SVNONY  40
     C                     MOVELQADOCK    SVDOCK  4
     C                     ENDIF
      * BREAK?
     C           QANONY    IFNE SVNONY
     C           QADOCK    ORNE SVDOCK
     C                     EXSR #BRK1
     C                     ENDIF
      * DETAIL PROCESS
     C                     SELEC
     C           XPLNT1    WHEQ *BLANK
     C                     MOVELQAPLAN    XPLNT1
     C           XPLNT2    WHEQ *BLANK
     C           XPLNT1    IFNE QAPLAN
     C                     MOVELQAPLAN    XPLNT2
     C                     ENDIF
     C           XPLNT3    WHEQ *BLANK
     C           XPLNT1    IFNE QAPLAN
     C           XPLNT2    ANDNEQAPLAN
     C                     MOVELQAPLAN    XPLNT3
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      * LAST BREAK
     C           FIRST     IFEQ 'N'
     C                     EXSR #BRK1
     C                     ENDIF
      * TOTAL
     C           SEQ#      IFEQ 0
     C                     EXCPT@HDR
     C                     EXCPT@TTL1
     C                     ELSE
     C                     MOVE '*'       $RTN
     C                     EXCPT@TTL2
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  BREAK                                             *
      *----------------------------------------------------*
     C           #BRK1     BEGSR
      *
     C           XPLNT2    IFNE *BLANK
     C                     EXSR #PRINT
     C                     ENDIF
      * RESET
     C                     Z-ADDQANONY    SVNONY
     C                     MOVELQADOCK    SVDOCK
     C                     MOVE *BLANK    XPLNT1
     C                     MOVE *BLANK    XPLNT2
     C                     MOVE *BLANK    XPLNT3
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $RTN    1
      *
     C                     TIME           SDATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD88        LIN#    30
     C                     MOVE 'Y'       FIRST   1
     C                     MOVE ' '       $RTN
     C                     Z-ADD0         RCNT    40       RECORD#
     C                     MOVE *BLANK    XPLNT1  5
     C                     MOVE *BLANK    XPLNT2  5
     C                     MOVE *BLANK    XPLNT3  5
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** FORD ROUTE MASTR '
     O                                   60 'ERROR (DUPLICATE NON'
     O                                   70 'Y/DOCK) **'
     O                                   80 'DATE'
     O                         TODAY     91 '    .  .  '
     O                         NOW      101 '  :  :  '
     O                                  105 'P.'
     O                         PAGE  Z  109
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   10 'NONY'
     O                                   16 'DOCK'
     O                                   25 'PLANT1'
     O                                   33 'PLANT2'
     O                                   41 'PLANT3'
     O        E 1              @DTL
     O                         SEQ#  1 +000
     O                         SVNONY  +001
     O                         SVDOCK  +002
     O**                       SVICCD  +001
     O                         XPLNT1  +003
     O                         XPLNT2  +003
     O                         XPLNT3  +003
      *
     O        E 1              @TTL1
     O                                 +000 ' ** THERE IS NO ERRO'
     O                                 +000 'R FOR THIS REPORT **'
      *
     O        E 1              @TTL2
     O                                 +000 ' ** TOTAL ERROR'
     O                         SEQ#  1 +001
     O                                 +001 '**'
