     H            Y.
     F***CHKR61A****************************************************************
     F*  PROGRAM    : CHECK FORD SHIP SCHEDULE                                 *
     F*  WRITTEN    : 2020.12.16                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F*------------------------------------------------------------------------*
     F*                                                                        *
     F**************************************************************************
     FABF2L08 IF  E           K        DISK
     FABFWP20 O   E           K        DISK
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           @RCVD6    SETLLABF2L08
     C                     DO   *HIVAL
     C           @RCVD6    READEABF2L08                  97
     C   97                LEAVE
      * IGNORE
     C           AFTPCD    IFEQ 'FORDX'
     C                     ITER
     C                     ENDIF
      * IGNORE
     C           AFDLDT    IFGT @TDATE
     C                     ITER
     C                     ENDIF
      * FIRST ?
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     MOVELAFSTID    SVSTID  5
     C                     MOVELAFDOCK    SVDOCK  4
     C                     MOVELAFICCD    SVICCD  5
     C                     MOVELAFIPAR    SVIPAR 20
     C                     Z-ADD0         SEQ#
     C                     ENDIF
      * BREAK ?
     C           AFSTID    IFNE SVSTID
     C           AFDOCK    ORNE SVDOCK
     C           AFICCD    ORNE SVICCD
     C           AFIPAR    ORNE SVIPAR
     C                     EXSR #BRK1
     C                     ENDIF
      * DETAIL PROCESS
     C                     EXSR #SAVE
     C                     ADD  1         SEQ#
     C           SEQ#      IFEQ 1
     C                     Z-ADDAFYSQY    @SHP    70
     C                     ENDIF
      *
     C                     Z-ADDAFQTY2    W6FDEM
     C                     Z-ADDAFYSQY    W6FYTD
     C                     Z-ADD@SHP      W6ISHP
     C                     Z-ADDAFDLDT    W6LSHP
     C                     Z-ADDAFDLDT    SVDLDT  80
      *
     C           AFQTY2    SUB  @SHP      @QTY    70
     C           @QTY      IFGT 0
     C                     ADD  @QTY      @SHP
     C                     ENDIF
      *
     C                     ENDDO
      * LAST BREAK
     C           FIRST     IFEQ 'N'
     C                     EXSR #BRK1
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  SAVE ABF2P01 DATA                                 *
      *----------------------------------------------------*
     C           #SAVE     BEGSR
      *
     C                     MOVELAFTPCD    W6TPCD
     C                     MOVELAFTSID    W6TSID
     C                     MOVELAFSPCD    W6SPCD
     C                     MOVELAFREF#    W6REF#
     C                     MOVELAFPOR#    W6POR#
     C                     MOVELAFSIDT    W6SIDT
     C                     MOVELAFHSDT    W6HSDT
     C                     MOVELAFHEDT    W6HEDT
     C                     MOVELAFSTIQ    W6STIQ
     C                     MOVELAFSTID    W6STID
     C                     MOVELAFIDCD    W6IDCD
     C                     MOVELAFPART    W6PART
     C                     MOVELAFDOCK    W6DOCK
     C                     MOVELAFALFL    W6ALFL
     C                     MOVELAFRALF    W6RALF
     C                     MOVELAFUBM1    W6UBM1
     C                     MOVELAFPKCD    W6PKCD
     C                     MOVELAFQTY1    W6QTY1
     C                     MOVELAFWEIT    W6WEIT
     C                     MOVELAFUBM2    W6UBM2
     C                     MOVELAFEQMT    W6EQMT
     C                     MOVELAFQTY2    W6QTY2
     C                     MOVELAFDLDT    W6DLDT
     C                     MOVELAFTIME    W6TIME
     C                     MOVELAFDATE    W6DATE
     C                     MOVELAFIPAR    W6IPAR
     C                     MOVELAFLRDT    W6LRDT
     C                     MOVELAFLRQY    W6LRQY
     C                     MOVELAFLSDT    W6LSDT
     C                     MOVELAFLSQY    W6LSQY
     C                     MOVELAFYRDT    W6YRDT
     C                     MOVELAFYRQY    W6YRQY
     C                     MOVELAFYSDT    W6YSDT
     C                     MOVELAFYSQY    W6YSQY
     C                     MOVELAFEXCD    W6EXCD
     C                     MOVELAFRDCD    W6RDCD
     C                     MOVELAFICCD    W6ICCD
     C                     MOVELAFUSER    W6USER
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  BREAK                                             *
      *----------------------------------------------------*
     C           #BRK1     BEGSR
      *
     C           @QTY      IFGT 0
     C           SVDLDT    ANDEQ@TDATE
     C                     EXSR #OUT
     C                     ENDIF
      * RESET
     C                     MOVELAFSTID    SVSTID
     C                     MOVELAFDOCK    SVDOCK
     C                     MOVELAFICCD    SVICCD
     C                     MOVELAFIPAR    SVIPAR
     C                     Z-ADD0         SEQ#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  WRITE RECORD                                      *
      *----------------------------------------------------*
     C           #OUT      BEGSR
      * GET DELIEVERY#
     C                     MOVELSVSTID    $PLNT
     C                     MOVELSVDOCK    $DOCK
     C                     CALL 'UTLR34A'
     C                     PARM           $PLNT   5
     C                     PARM           $DOCK   4
     C                     PARM           $NONY   4
     C                     PARM           $RTN    1
      * GET QPC
     C                     MOVELSVIPAR    $SHIN
     C                     CALL 'UTLR78'
     C                     PARM           $SHIN  12
     C                     PARM           $ZETI   4
     C                     PARM           $FPRC   3
     C                     PARM           $FMCN   3
     C                     PARM           $FSIZE  3
     C                     PARM           $LLOC   6
     C                     PARM           $QPC    60
     C                     PARM           $MSET   90
     C                     PARM           $DSVB   61
     C                     PARM           $DSVQ   80
     C                     PARM           $RTN    1
      *
     C                     Z-ADDTODAY     W6CRDT
     C                     Z-ADDNOW       W6CRTM
     C                     MOVEL#USER     W6CRUS
     C                     MOVELSVSTID    W6PLNT
     C                     MOVELSVDOCK    W6NUKE
     C                     MOVELSVICCD    W6IC2
     C                     MOVEL$NONY     W6NONY
     C                     MOVEL$TDATE    W6NOHZ
     C                     MOVELSVIPAR    W6MHIN
     C                     Z-ADD@QTY      W6SRYO
     C                     Z-ADD$QPC      W6QPC
     C           $QPC      IFEQ 0
     C                     Z-ADD@QTY      W6BOX
     C                     ELSE
     C           W6SRYO    DIV  $QPC      SHO     70
     C                     MVR            REM     70
     C           REM       IFNE 0
     C                     ADD  1         SHO
     C                     ENDIF
     C                     Z-ADDSHO       W6BOX
     C                     ENDIF
      *
     C                     WRITEABFWP201
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $TDATE  8        TARGET (SHP DATE)
      *
     C                     TIME           SDATE
     C                     MOVEL$TDATE    @TDATE  80
     C                     MOVE 'Y'       FIRST   1
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD0         RCNT    40
      * GET DATE 2 DAYS EARLIER
     C                     MOVEL$TDATE    $DT8
     C                     MOVE '-'       $SIGN
     C                     MOVEL'0002'    $DAYS
     C                     MOVE 'N'       $IAF
     C                     CALL 'UTLR10'
     C                     PARM           $DT8    8
     C                     PARM           $SIGN   1
     C                     PARM           $DAYS   4
     C                     PARM           $IAF    1
     C                     PARM           $TGT8   8
     C                     PARM           $RTN    1
     C                     MOVE $TGT8     @DAY6   60
     C                     Z-ADD0         @RCVD6  60
      * GET RECEIVED DATE
     C           @DAY6     SETGTABF2L08
     C                     DO   *HIVAL
     C                     READPABF2L08                  98
     C   98                LEAVE
     C                     Z-ADDAFDATE    @RCVD6
     C                     LEAVE
     C                     ENDDO
      *
     C                     ENDSR
