     H            Y.
     F** CHKR61E ***************************************************************
     F*  PROGRAM    : CHECK FORD ROUTE MASTER ERROR                            *
     F*  WRITTEN    : 2022.01.19                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FABFDL03 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        7  100@YEAR
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           *LOVAL    SETLLABFDL03
      *
     C                     DO   *HIVAL
     C                     READ ABFDL03                  98
     C   98                LEAVE
      * IGNORE
     C           QASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      * FIRST?
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     MOVELQAPLAN    SVPLAN  5
     C                     MOVELQADOCK    SVDOCK  4
     C                     MOVELQAICCD    SVICCD  5
     C                     ENDIF
      * BREAK?
     C           QAPLAN    IFNE SVPLAN
     C           QADOCK    ORNE SVDOCK
     C           QAICCD    ORNE SVICCD
     C                     EXSR #BRK1
     C                     ENDIF
      * DETAIL PROCESS
     C                     SELEC
     C           XNONY1    WHEQ 0
     C                     Z-ADDQANONY    XNONY1
     C           XNONY2    WHEQ 0
     C           XNONY1    IFNE QANONY
     C                     Z-ADDQANONY    XNONY2
     C                     ENDIF
     C           XNONY3    WHEQ 0
     C           XNONY1    IFNE QANONY
     C           XNONY2    ANDNEQANONY
     C                     Z-ADDQANONY    XNONY3
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      * LAST BREAK
     C           FIRST     IFEQ 'N'
     C                     EXSR #BRK1
     C                     ENDIF
      * TOTAL
     C           SEQ#      IFEQ 0
     C                     EXCPT@HDR
     C                     EXCPT@TTL1
     C                     ELSE
     C                     MOVE '*'       $RTN
     C                     EXCPT@TTL2
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  BREAK                                             *
      *----------------------------------------------------*
     C           #BRK1     BEGSR
      *
     C           XNONY2    IFNE 0
     C                     EXSR #PRINT
     C                     ENDIF
      * RESET
     C                     MOVELQAPLAN    SVPLAN
     C                     MOVELQADOCK    SVDOCK
     C                     MOVELQAICCD    SVICCD
     C                     Z-ADD0         XNONY1
     C                     Z-ADD0         XNONY2
     C                     Z-ADD0         XNONY3
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $RTN    1
      *
     C                     TIME           SDATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD88        LIN#    30
     C                     MOVE 'Y'       FIRST   1
     C                     MOVE ' '       $RTN
     C                     Z-ADD0         RCNT    40       RECORD#
     C                     Z-ADD0         XNONY1  40
     C                     Z-ADD0         XNONY2  40
     C                     Z-ADD0         XNONY3  40
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** FORD ROUTE MASTR '
     O                                   60 'ERROR REPORT  ** (AB'
     O                                   70 'FDP01)    '
     O                                   80 'DATE'
     O                         TODAY     91 '    .  .  '
     O                         NOW      101 '  :  :  '
     O                                  105 'P.'
     O                         PAGE  Z  109
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   11 'PLANT'
     O                                   16 'DOCK'
     O                                   24 'IC_CODE'
     O                                   29 'DLV1'
     O                                   35 'DLV2'
     O                                   41 'DLV3'
     O        E 1              @DTL
     O                         SEQ#  1 +000
     O                         SVPLAN  +001
     O                         SVDOCK  +001
     O                         SVICCD  +001
     O                         XNONY13 +003
     O                         XNONY23 +002
     O                         XNONY33 +002
      *
     O        E 1              @TTL1
     O                                 +000 ' ** THERE IS NO ERRO'
     O                                 +000 'R FOR THIS REPORT **'
      *
     O        E 1              @TTL2
     O                                 +000 ' ** TOTAL ERROR'
     O                         SEQ#  1 +001
     O                                 +001 '**'
