     H            Y.
      *､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､*
      *  PROGRAM ID.   : CHKR01                                        *
      *                : RUN IN FCKC00 (10:10AM BY JOBSCDE)            *
      *                : A.IDOTA                                       *
      *､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､､*
     FCHKPW01 CF  E                    WORKSTN
     E                    ER      1   3 60
      *チェックデジット
     C           CHKR01    PLIST
     C                     PARM           PMAREA100        *フィールド
     C                     PARM           PMBYTE  3        *有効桁数
     C                     PARM           PMCHK   1        * kｩｮhmﾞﾆﾞｮn
     C                     PARM           PMRTCD  1        * ﾒjｰ]ﾃｰnﾞ
      *
     C                     SETOF                     010299
     C                     MOVE *BLANK    FIL1
     C                     Z-ADD0         FIL2
     C                     MOVE *BLANK    FIL3
      *
     C           STP1      TAG
     C                     EXFMTCHKPW011
     C                     SETOF                     010299
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           FIL1      IFEQ *BLANK
     C                     MOVELER,1      MSG
     C                     SETON                     0199
     C                     GOTO STP1
     C                     END
      *
     C           FIL2      IFEQ 0
     C           FIL2      ORGT 100
     C                     MOVELER,2      MSG
     C                     SETON                     0299
     C                     GOTO STP1
     C                     END
      *
     C                     MOVELFIL1      PMAREA100        *フィールド
     C                     MOVELFIL2      PMBYTE  3        *有効桁数
     C                     MOVE *BLANK    PMCHK   1        * kｩｮhmﾞﾆﾞｮn
     C                     MOVE *BLANK    PMRTCD  1        * ﾒjｰ]ﾃｰnﾞ
     C                     CALL 'CHKR01'  CHKR01
      *
     C           PMRTCD    IFEQ '1'
     C                     MOVELER,3      MSG
     C                     SETON                     010299
     C                     GOTO STP1
     C                     END
      *
     C                     MOVELPMCHK     FIL3
     C                     GOTO STP1
** ＥＲＲ・ＭＳＧ
E-01　計算内容を入力して下さい。
E-02　計算桁数を入力して下さい。
E-03　チェックデジット計算不可能
