     H            Y.
     F***CHKR37B ***************************************************************
     F*  PROGRAM    : CHECK ORDERS (INVOICE# = BLANK)                          *
     F*             : RUN IN FCKC00 (10:10AM BY JOBSCDE)                       *
     F*  WRITTEN    : JW  2022.05.26                                           *
     F**************************************************************************
     FAB#PL12 IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        7  100SYY
     I                                       11  120SMM
     I                                       13  140SDD
     I            DS
     I                                        1  20 BAMHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
     I            DS
     I                                        1   80BAURHZ
     I                                        1   40BAURYY
     I                                        5   60BAURMM
     I                                        7   80BAURDD
     I            DS
     I                                        1   80BADEHZ
     I                                        1   40BADEYY
     I                                        5   60BADEMM
     I                                        7   80BADEDD
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           K#PL12    SETLLAB#PL12
     C                     DO   *HIVAL
     C                     READ AB#PL12                  98
     C   98                LEAVE
      *
     C           BASKJY    IFEQ 'D'
     C           BAURHZ    ORNE 0
     C           BAINVN    ORNE *BLANK
     C                     ITER
     C                     ENDIF
      * SELECT DELIV#
     C           BANONY    IFNE 0492                       AWNC
     C           BANONY    ANDNE0493                       AWTX
     C           BANONY    ANDNE0966                       AISIN(AUM)
     C**         BANONY    ANDNE8006                       MYTOX
     C           BANONY    ANDNE5253                       LITENS
     C           BANONY    ANDNE8005                       WKW
     C           BANONY    ANDNE0579                       FIO
     C           BANONY    ANDNE3094                       TAC
     C           BANONY    ANDNE9408                       TECHFORM
     C                     ITER
     C                     ENDIF
      * PRINT
     C           BANOHZ    IFNE SVNOHZ
     C           SVNOHZ    ANDNE0
     C                     EXCPT@SKP
     C                     ADD  1         LIN#
     C                     ENDIF
      *
     C                     EXSR #PRINT
     C                     Z-ADDBANOHZ    SVNOHZ
      *
     C                     ENDDO
      *
     C           SEQ#      IFNE 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      * GET CUSTOMER NAME
     C                     MOVELBANONY    PMNONY
     C                     MOVE 'D'       PMOPT
     C                     CALL 'UTLR16'
     C                     PARM           PMNONY  4
     C                     PARM           PMOPT   1
     C                     PARM           PMNAME 20
     C                     PARM           PTOKU   4
     C                     PARM           PMRTN   1
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $RTN    1
      *
     C           K#PL12    KLIST
     C                     KFLD           KANOYY  40
     C                     KFLD           KANOMM  20
     C                     KFLD           KANODD  20
      *
     C                     MOVE *BLANK    $RTN
     C                     TIME           SDATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD88        LIN#    30
     C                     Z-ADDSYY       KANOYY
     C                     Z-ADDSMM       KANOMM
     C                     Z-ADDSDD       KANODD
     C                     Z-ADD0         SVNOHZ  80
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** INVOICE# = BLANK '
     O                                   60 '(AB#PP10) **        '
     O                                   79 'DATE'
     O                         TODAY     82 '    .  .  '
     O                         NOW       92 '  :  :  '
     O                                   95 'P.'
     O                         PAGE  Z   99
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   16 'SHP_DATE'
     O                                   23 'CUST'
     O                                   28 'DELV'
     O                                   38 'BN'
     O                                   48 'USER_PART'
     O                                   66 'ORDER#'
     O                                   84 'QTY'
     O        E 1              @DTL
     O                         SEQ#    +001
     O                         BAEDIK  +001
     O                         BANOHZ  +001 '    /  /  '
     O                         BATOKU  +001
     O                         BANONY  +001
     O                         BANKOJ  +001
     O                         BANUKE  +001
     O                         BANOBN  +001
     O                         BAMHIN  +001
     O                         BAODRN  +001
     O                         BASRYO1 +001
     O                         PMNAME  +001
      *
     O        E 1              @SKP
     O                                    1 '.'
