     H            Y.
     F** CHKR25A  **************************************************************
     F*  PROGRAM    : CHECK & FIX EDIPP45 BY PP2A                              *
     F*  WRITTEN    : JW (SRA)    2022.0318                                    *
     F**************************************************************************
     FAB#PL2A4IF  E           K        DISK
     FEDIPP45 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      * -------------------------------------
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      **************************************************************************
     C                     EXSR #INIT
      *
     C           @DATE     SETLLAB#PL2A4
     C                     DO   *HIVAL
     C                     READ AB#PL2A4                 98
     C   98                LEAVE
      * IGNORE
     C           ACUPID    IFNE '1'
     C           ACUPID    ANDNE'3'
     C                     ITER
     C                     ENDIF
      * IGNORE
     C                     MOVE ACKPGM    LTR1    1
     C           LTR1      IFEQ 'M'
     C                     ITER
     C                     ENDIF
      * CHECK EDIPP45
     C           K#PP45    SETLLEDIPP45
     C                     DO   *HIVAL
     C           K#PP45    READEEDIPP45                  97
     C   97                LEAVE
      *
     C           E5SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           E5UPRT    IFNE ACMHIN
     C                     EXSR #PRINT
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDDO
      *
     C           SEQ#      IFEQ 0
     C                     EXCPT@FOOT
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $DATE   8
      *
     C           K#PP45    KLIST
     C                     KFLD           ACNONY
     C                     KFLD           ACMHN1
     C                     KFLD           ACMHN2
     C                     KFLD           ACMHN3
     C                     KFLD           ACMHN4
      *
     C                     TIME           SDATE
     C           $DATE     IFEQ *BLANK
     C                     Z-ADDTODAY     @DATE   80
     C                     ELSE
     C                     MOVEL$DATE     @DATE
     C                     ENDIF
      *
     C                     Z-ADD0         CNT     40
     C                     Z-ADD0         SEQ#    40
      *
     C                     EXCPT@HDR
      *
     C           EINIT     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM       9
     O                                   25 'SHIP DATE FROM:'
     O                         @DATE     36 '    .  .  '
     O                                   70 '** USER PART ERROR R'
     O                                   90 'EPORT (PP2A) **     '
     O                                   99 'DATE'
     O                         TODAY    102 '    .  .  '
     O                         NOW      112 '  :  :  '
     O                                  115 'P.'
     O                         PAGE  Z  119
     O        E   02           @HDR
     O                                    5 'SEQ#'
     O                                   12 'DELV#'
     O                                   23 'USER PART'
     O                                   47 'MASTER PART'
     O        E 1              @DTL
     O                         SEQ#  Z +001
     O                         ACNONY  +003
     O                         ACMHIN  +002
     O                         E5UPRT  +002
     O        E 1              @FOOT
     O                                   25 '** ERROR NOT FOUND **'
