     H            Y.
     F***CHKR39F ***************************************************************
     F*  PROGRAM    : PURGE ABBPP01 DUPLICATE FORECAST DATA                    *
     F*  WRITTEN    : JW   2023.09.08                                          *
     F**************************************************************************
     FABBPL04 UF  E           K        DISK
     FABBPP01PO   E                    DISK
     F**************************************************************************
     I            DS
     I                                        1  20 KMHIN
     I                                        1   5 KMHN1
     I                                        6  10 KMHN2
     I                                       11  15 KMHN3
     I                                       16  20 KMHN4
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           K#PL04    SETLLABBPL04
     C                     DO   *HIVAL
     C           K#PL04    READEABBPL04                  98
     C   98                LEAVE
      *
     C           Q5NNNK    IFEQ *BLANK
     C           Q5NNNM    ANDEQ0
     C           Q51NNM    ANDEQ0
     C           Q52NNM    ANDEQ0
     C                     DELETABBPP011
      *
     C                     Z-ADDTODAY     Q5KOHZ
     C                     Z-ADDNOW       Q5KOTM
     C                     MOVEL#USER     Q5KOUS
     C                     MOVEL#PGM      Q5KOPG
     C                     WRITEABBPP01R
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $CUST   4
     C                     PARM           $NONY   4
     C                     PARM           $MHIN  20
      *
     C           K#PL04    KLIST
     C                     KFLD           KCUST   40
     C                     KFLD           KMHN1   5
     C                     KFLD           KMHN2   5
     C                     KFLD           KMHN3   5
     C                     KFLD           KMHN4   5
     C                     KFLD           KNONY   40
      *
     C                     TIME           SDATE
     C                     MOVEL$CUST     KCUST
     C                     MOVEL$NONY     KNONY
     C                     MOVEL$MHIN     KMHIN
      *
     C                     ENDSR
