     H            Y.
     F** CHKR18 ********************************************
     F*  AS/400 USER INQUIRY BY NAME                       *
     F*  J.WATANABE  2018.12.04                            *
     F******************************************************
     FCHKPW18 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN   KSFILE SFREC1
     FRGAPL12 IF  E           K        DISK
      *
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     I            DS
     I                                        1   80SBSKHZ
     I                                        1   40SBSKYY
     I                                        5   60SBSKMM
     I                                        7   80SBSKDD
     I            DS
     I                                        1   80J8KOHZ
     I                                        1   40J8KOYY
     I                                        5   60J8KOMM
     I                                        7   80J8KODD
     I            DS
     I                                        1   40J8KOTM
     I                                        1   20J8KOJI
     I                                        3   40J8KOFN
      *****************************************************
      * MAIN ROUTINE                                      *
      *****************************************************
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT            初期処理
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C*  INITIAL SET
     C*===============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $ID     1
      *
     C                     MOVEA*ALL'0'   *IN
     C*  SFLCLR
     C                     SETON                     82
     C                     WRITESFCTL1
     C                     SETOF                     82
     C                     Z-ADD0         RRN     40
     C                     Z-ADD0         ENDRRN  40
     C                     MOVE *BLANK    @@UMU   1
     C                     MOVEL$ID       K#PL12 15 P
      *
     C           K#PL12    SETLLRGAPL12
     C*-------------------------
S1   C                     DO   *HIVAL
     C                     READ RGAPL12                  90
     C   90                LEAVE
 S2  C           J8SKJY    IFEQ 'D'
     C                     ITER
 E2  C                     ENDIF
     C*
     C                     MOVELJ8PROF    @USRID
     C                     MOVELJ8NAME    @USRNM
     C                     Z-ADDJ8KOHZ    @KOHZ
     C                     Z-ADDJ8KOTM    @KOTM
      *
     C                     MOVEL*BLANK    WUSRID 10
     C                     MOVEL*BLANK    WUSRNM 15
     C                     MOVELJ8PROF    WUSRID
     C                     MOVELJ8NAME    WUSRNM
     C**                   EXCPTDT
      *
     C                     ADD  1         RRN
     C                     WRITESFREC1
E1   C                     ENDDO
     C*-------------------------
     C           RRN       IFEQ 0
     C                     MOVE '#END    '@STEP
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     Z-ADD1         DSPRRN
     C                     ENDIF
     C                     ENDSR
     C*===============================================================
      *  DISPLAY SREEN
     C*===============================================================
     C           #DSP1     BEGSR
     C                     SETON                     71
     C                     WRITEDSP01
     C                     EXFMTSFCTL1
     C                     SETOF                     71
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD$$RRN     DSPRRN
      *----*
      * F3 *
      *----*
     C   KA                MOVE '#END    '@STEP
     C   KC                MOVE '#END    '@STEP
     C   KL                MOVE '#END    '@STEP
      *
     C                     ENDSR
