     H            Y.
     F***CHKR23C ***************************************************************
     F*  PROGRAM    : TEST PRINT BBHR50 AND BBHR51 COMPARISON                  *
     F*  WRITTEN    : 2022.11.01                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FMBDPL16 IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
     I            DS
     I                                        1  20 F4MHIN
     I                                        1   5 F4MHN1
     I                                        6  10 F4MHN2
     I                                       11  15 F4MHN3
     I                                       16  20 F4MHN4
     I            DS
     I                                        1  12 SHN50
     I                                        1   5 SHN50A
     I                                        6  10 SHN50B
     I                                       11  12 SHN50C
     I            DS
     I                                        1  12 SHN51
     I                                        1   5 SHN51A
     I                                        6  10 SHN51B
     I                                       11  12 SHN51C
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           2022      SETLLMBDPL16                  91
     C                     DO   *HIVAL
     C           2022      READEMBDPL16                  91
     C   91                LEAVE
      * BBHR50
     C                     MOVELF4TOKU    $TOKU
     C                     MOVELF4NONY    $NONY
     C                     MOVELF4NKOJ    $NKOJ
     C                     MOVELF4NUKE    $NUKE
     C                     MOVELF4MHIN    $MHIN
     C                     CALL 'BBHR50'                        *
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $MHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @FLG    1
     C                     MOVEL@SHIN     SHN50
      * BBHR51
     C                     CALL 'BBHR51'                        *
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $MHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @FLG    1
     C                     MOVEL@SHIN     SHN51
      *
     C           SHN50     IFNE SHN51
     C                     EXSR #PRINT
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      * DETAIL
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C                     TIME           SDATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD88        LIN#    30
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   45 '** BBHR50 AND BBHR51'
     O                                   65 ' COMPARISON LISTT **'
     O                                   85 '                    '
     O                                  105 '                    '
     O                                  106 'DATE'
     O                         TODAY    109 '    .  .  '
     O                         NOW      119 '  :  :  '
     O                                  122 'P.'
     O                         PAGE  Z  126
     O        E   02           @HDR
     O                                    1 '.'
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   10 'CUST'
     O                                   15 'DELV'
     O                                   17 'F'
     O                                   22 'DOCK'
     O                                   33 'USER_PART#'
     O                                   50 'IAF_PART#'
     O                                   65 'IAF_PART#'
     O                                   80 'IAF_PART#'
     O        E 1              @HDR
     O                                   33 '(MBD)     '
     O                                   50 '(MBD)    '
     O                                   65 'BBHR50   '
     O                                   80 'BBHR51   '
     O        E 1              @HDR
     O                                   20 '--------------------'
     O                                   40 '--------------------'
     O                                   60 '--------------------'
     O                                   80 '--------------------'
     O                                  100 '--------------------'
     O                                  120 '--------------------'
     O                                  140 '--------------------'
     O                                  160 '--------------------'
     O                                  180 '--------------------'
     O        E 1              @DTL
     O                         SEQ#    +001
     O                         F4TOKU  +001
     O                         F4NONY  +001
     O                         F4NKOJ  +001
     O                         F4NUKE  +001
     O                         F4MHN1  +001
     O                         F4MHN2  +001
     O                         F4MHN3  +001
     O                         F4SHN1  +001
     O                         F4SHN2  +001
     O                         F4SHN3  +001
      *
     O                         SHN50A  +001
     O                         SHN50B  +001
     O                         SHN50C  +001
     O                         SHN51A  +001
     O                         SHN51B  +001
     O                         SHN51C  +001
