     H            Y.
     F***CHKR59*****************************************************************
     F*  PROGRAM    : CHECK HONDA ORDERS USER PART# IN AB#PPA1                 *
     F*             : READ EGBPL13                                             *
     F*  WRITTEN    : 2019.07.08                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FEGBPL13 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FVVVPPB0 IF  E           K        DISK
     FCHKWP60 O   E           K        DISK
     E                    MSG     1   2 40
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
      *
     C           *LOVAL    SETLLEGBPL13
     C                     DO   *HIVAL
     C                     READ EGBPL13                  98
     C   98                LEAVE
      *
      * SELECT
     C           MLSKJY    IFEQ 'D'
     C           MLPGMN    OREQ *BLANK
     C                     ITER
     C                     ENDIF
      * GET OBJECT
     C                     MOVELMLPGMN    LTR10  10
     C           LTR10     CHAINVVVPPB0              99
     C   99                MOVELMSG,1     VWTEXT
      * GET USER NAME
     C           MLUSRC    CHAINRGAPL11              99
     C   99                MOVELMSG,2     J8NAME
      * GET LAST USE
     C                     MOVELMLPGMN    $OBJ      P
     C                     CALL 'UTLC76'
     C                     PARM           $OBJ   10
     C                     PARM           $LDAT   8
     C                     PARM           $RTN    1
      *
     C                     CLEARCHKWP601
     C                     MOVELMLPGMN    C6OBJ
     C                     MOVELVWTEXT    C6ONAM
     C                     MOVELMLUSRC    C6USR
     C                     MOVELJ8NAME    C6UNAM
     C                     MOVELMLMNNO    C6OPT
     C                     MOVE MLMNDN    C6OPT
     C                     MOVEL$LDAT     C6LDAT
     C                     WRITECHKWP601
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
** MSG
* OBJECT NOT FOUND *
* NO USER ID *
