     H            Y.
     F***CHKR55C ***************************************************************
     F*  PROGRAM    : CHECK HONDA ORDER'S ASN#                                 *
     F*             : READ AB#PL1N                                             *
     F*  WRITTEN    : 2022.12.12                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FAB#PL1N IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    ERR     1   1 55
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I            DS
     I                                        1   80K#YMD
     I                                        1   40K#YY
     I                                        5   60K#MM
     I                                        7   80K#DD
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           K#PP10    SETLLAB#PL1N
     C                     DO   *HIVAL
     C                     READ AB#PL1N                  98
     C   98                LEAVE
      *
      * SELECT HONDA
     C           BATOKU    IFNE 0294
     C           BATOKU    ANDNE0295
     C           BATOKU    ANDNE0296
     C           BATOKU    ANDNE0390
     C           BATOKU    ANDNE0391
     C           BATOKU    ANDNE0400
     C           BATOKU    ANDNE1602
     C           BATOKU    ANDNE3135
     C                     ITER
     C                     ENDIF
      *
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      * CHECK
     C                     EXSR #CHK1
     C           *IN85     IFEQ *ON
     C                     EXSR #PRINT
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           SEQ#      IFNE 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * CHECK LENGTH OF ASN#                               *
      *----------------------------------------------------*
     C           #CHK1     BEGSR
      *
     C                     MOVE *OFF      *IN85
     C                     MOVE *BLANK    XMSG
     C                     MOVE BAINVN    LTR8    8
     C           LTR8      IFNE *BLANK
     C                     MOVE *ON       *IN85
     C                     MOVELERR,1     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           XCHK1     ENDSR
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      * GET CUSTOMER NAME
     C                     MOVELBANONY    $DLV
     C                     CALL 'UTLR62'
     C                     PARM           $DLV    4
     C                     PARM           $GRP    3
     C                     PARM           $NAME1 15
     C                     PARM           $NAME2 50
     C                     PARM           $RTN    1
     C                     MOVEL$NAME1    XNAME  15
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $DATE   8
     C                     PARM           $RTN    1
      *
     C           K#PP10    KLIST
     C                     KFLD           K#YY
     C                     KFLD           K#MM
     C                     KFLD           K#DD
      *
     C                     TIME           SDATE
     C           $DATE     IFEQ *BLANK
     C           $DATE     OREQ *ZEROS
     C                     Z-ADDTODAY     @TGDAT  80
     C                     ELSE
     C                     MOVEL$DATE     @TGDAT
     C                     ENDIF
      *
     C                     MOVEL@TGDAT    K#YMD
     C                     MOVE *BLANK    $RTN
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD88        LIN#    30
     C                     MOVE *BLANK    XMSG   35
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** CHECK HONDA ORDER'
     O                                   60 ' ASN# ISSUE **      '
     O                                   80 '                    '
     O                                   89 'DATE'
     O                         TODAY     92 '    .  .  '
     O                         NOW      102 '  :  :  '
     O                                  106 'P.'
     O                         PAGE  Z  110
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   10 'TYPE'
     O                                   15 'CUST'
     O                                   20 'DELV'
     O                                   36 'SHP_DATE'
     O                                   43 'BIN#'
     O                                   53 'ASN#____'
     O                                   67 'NAME'
     O                                   88 'ERROR MSG'
     O        E 1              @DTL
     O                         SEQ#  1 +000
     O                         BAEDIK  +002
     O                         BATOKU  +003
     O                         BANONY  +001
     O                         BANKOJ  +001
     O                         BANUKE  +001
     O                         BANOHZ  +001 '    /  /  '
     O                         BANOBN  +002
     O                         BAINVN  +003
     O                         XNAME   +002
     O                         XMSG    +001
** ERR(35) ........2.........3....>
ASN# SHOULD BE LESS THAN 8 DIGITS
