     H            Y.
     F*=========================================================================
     F*  PROGRAM    : CHKRJ5                                                   *
     F*  FUNCTION   : READ CHKWPU1 AND DITECT ERROR STATUS                     *
     F*------------------------------------------------------------------------*
     F* CHANGE DATE| PROGRAMMER  | ID  | MEMO                                  *
     F*------------------------------------------------------------------------*
     F* 2017/12/19 | JW (SRA)    | JW1 | ADD LCKW AND TIMW                     *
     F*=========================================================================
      *
     FCHKWPU1 IP  E                    DISK
     F**CHKPL01 IF  E           K        DISK
JW1  FCHKPL01 UF  E           K        DISK
     FCHKWPJ2 O   E                    DISK
      *
     C           KEY       KLIST
     C                     KFLD           CSSBYS
     C                     KFLD           CSJOB
      *
     C           KEY       CHAINCHKPL01              88
     C   88                GOTO @END
      *
     C**JW       CSSTAT    IFNE 'MSGW'
     C**                   GOTO @END
     C**                   END
JW1   * IF GET TIMW 2 TIMES CONTINUOUSLY --> SEND ERROR MSG
 |    * IF GET LCKW 2 TIMES CONTINUOUSLY --> SEND ERROR MSG
 |   C                     MOVE *BLANK    ERRFLG  1
 |   C                     SELEC
 |   C           CSSTAT    WHEQ 'TIMW'
 |   C           C1FLG     IFEQ 'T'
 |   C                     MOVE 'T'       ERRFLG
 |   C                     ENDIF
 |   C           CSSTAT    WHEQ 'LCKW'
 |   C           C1FLG     IFEQ 'L'
 |   C                     MOVE 'L'       ERRFLG
 |   C                     ENDIF
 |   C                     ENDSL
JW1   * UPDATE CHKPP01
 |   C                     SELEC
 |   C           CSSTAT    WHEQ 'MSGW'
 |   C                     MOVE 'M'       C1FLG
 |   C           CSSTAT    WHEQ 'LCKW'
 |   C                     MOVE 'L'       C1FLG
 |   C           CSSTAT    WHEQ 'TIMW'
 |   C                     MOVE 'T'       C1FLG
 |   C                     OTHER
 |   C                     MOVE *BLANK    C1FLG
 |   C                     ENDSL
JW1  C                     UPDATCHKPL011
      *
JW1  C           CSSTAT    IFEQ 'MSGW'
JW1  C           ERRFLG    ORNE *BLANK
     C                     MOVE ':/N'     CSKAIG
     C                     WRITECHKWPJ21
JW1  C                     ENDIF
      *
     C           @END      TAG
      *
