     H            Y.
     F** CHKR42A ***************************************************************
     F*  PROGRAM    : DETECT UNIT PRICE ERROR IN PP10 D                        *
     F*  WRITTEN    : JW     2022.03.028                                       *
     F**************************************************************************
     FAB#PL1A UF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      **************************************************************************
     C                     EXSR #INIT
      *
     C           @NOHZ     SETLLAB#PL1A
      *
     C                     DO   *HIVAL
     C                     READ AB#PL1A                  98
     C   98                LEAVE
      *
     C           BASKJY    IFEQ 'D'
     C           BATANK    OREQ 0
     C                     ITER
     C                     ENDIF
      *
     C           BAURYY    IFNE 0
     C           BATANK    ANDNE0
     C                     ITER
     C                     ENDIF
      * PRINT
     C                     EXSR #PRNT1
      * DELETE
     C           $UPD      IFEQ 'Y'
     C                     Z-ADD0         BATANK
     C                     ENDIF
     C                     UPDATAB#PL141
      *
     C                     ENDDO
      *
     C           SEQ#      IFEQ 0
     C           $UPD      IFEQ 'N'
     C                     EXSR #PRNT2
     C                     ENDIF
     C                     ELSE
     C                     MOVEL'*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT ERROR DETAIL                                *
      *----------------------------------------------------*
     C           #PRNT1    BEGSR
      *
     C           LIN#      IFGE 60
     C                     EXCPT#HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPT#DTL1
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  PRINT FOOT                                        *
      *----------------------------------------------------*
     C           #PRNT2    BEGSR
      *
     C           LIN#      IFGE 60
     C                     EXCPT#HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     EXCPT#FOT
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NOHZ   8
     C                     PARM           $UPD    1
     C                     PARM           $RTN    1
      *
     C           $UPD      IFNE 'Y'
     C                     MOVE 'N'       $UPD
     C                     ENDIF
      *
     C                     MOVEL*BLANK    $RTN
     C                     TIME           SDATE
     C                     Z-ADD88        LIN#    30
     C                     Z-ADD0         SEQ#    40
      *
     C           $NOHZ     IFEQ *BLANK
     C           $NOHZ     OREQ *ZERO
     C                     MOVELTODAY     $NOHZ
     C                     ENDIF
     C                     MOVEL$NOHZ     @NOHZ   80
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           #HDR
     O                         #PGM      10
     O                                   17 'UPDATE:'
     O                         $UPD      19
     O                                   50 '** PRICE ERROR REPOR'
     O                                   70 'T (PP10) **         '
     O                                   99 'DATE'
     O                         TODAY    102 '    .  .  '
     O                         NOW      112 '  :  :  '
     O                                  115 'P.'
     O                         PAGE  Z  119
     O        E   03           #HDR
     O                                    5 'SEQ#'
     O                                   11 'CUST'
     O                                   17 'DELV'
     O                                   20 'F'
     O                                   26 'DOCK'
     O                                   36 'SHIP_DATE'
     O                                   41 'BN'
     O                                   49 'ORDER#'
     O                                   64 'USER_PART'
     O                                   89 'QTY'
     O                                  104 'PRICE'
     O                                  114 'BIL_DATE'
     O        E 1              #DTL1
     O                         SEQ#  Z +001
     O                         BATOKU  +002
     O                         BANONY  +002
     O                         BANKOJ  +002
     O                         BANUKE  +002
     O                         BANOHZ  +001 '    /  /  '
     O                         BANOBN  +002
     O                         BAODRN  +002
     O                         BAMHIN  +002
     O                         BASRYO1 +001
     O                         BATANK1 +001
     O                         BAURHZ  +002
      *
     O        E 1              #FOT
     O                                   20 '** THERE IS NO ERROR'
     O                                   40 ' PRICE **           '
