     H            Y.
     F***CHKR47*****************************************************************
     F*  PROGRAM    : CHECK FILE STATUS                                        *
     F*             : RUN IN FCKC00 (10:10AM BY JOBSCDE)                       *
     F*  WRITTEN    : 2018.11.06                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FVVVPP30 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *---------------------------------------------------
     E                    MSG     1   4 30
     I            DS
     I                                        1  140@DATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ***********************************************************
     C                     EXSR @INIT
      *
     C                     DO   *HIVAL
     C                     READ VVVPP30                  98
     C   98                LEAVE
      * 1.USE% >= 50
     C           MBRCDC    IFEQ 0
     C                     Z-ADD0         WKUSE  111
     C                     ELSE
     C           MBNRCD    MULT 100       WKUSE
     C                     DIV  MBRCDC    WKUSE
     C                     ENDIF
     C           WKUSE     IFGE 50
     C                     Z-ADD1         IX
     C                     EXSR #PRINT
     C                     ENDIF
      *
      * 2.DELETED RECORD >= 10000
     C           MBNDTR    IFGE 10000
     C                     Z-ADD2         IX
     C                     EXSR #PRINT
     C                     ENDIF
      *
      * 3.OCCURENCE <> 0
     C           MBCURI    IFNE 0
     C                     Z-ADD3         IX
     C                     EXSR #PRINT
     C                     ENDIF
      *
      * 4.RECORD# >= 30,000,000
     C           MBNRCD    IFGE 30000000
     C                     Z-ADD4         IX
     C                     EXSR #PRINT
     C                     ENDIF
      *
     C                     ENDDO
      * SET RETURN CODE
     C           SEQ#      IFEQ 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     Z-ADDWKUSE     NUM41   41
     C                     MOVELMSG,IX    XMSG   30
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           @INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $RTN    1
      *
     C                     MOVE *BLANK    $RTN
     C                     TIME           @DATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD88        LIN#    30
     C                     Z-ADD0         IX      10
      *
     C                     ENDSR
      ************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** FILE STATUS **   '
     O                                   89 'DATE'
     O                         TODAY     92 '    .  .  '
     O                         NOW      102 '  :  :  '
     O                                  105 'P.'
     O                         PAGE  Z  109
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   10 'FILE'
     O                                   30 'OCCUR'
     O                                   44 'CAPACITY'
     O                                   58 'REC'
     O                                   65 'USE%'
     O                                   79 'DLT'
     O                                   84 'MSG'
     O        E 1              @DTL
     O                         SEQ#    +001
     O                         MBFILE  +001
     O                         MBCURI1 +001
     O                         MBRCDC1 +001
     O                         MBNRCD1 +001
     O                         NUM41 1 +002
     O                         MBNDTR1 +001
     O                         XMSG    +002
** MSG ---.---------.---------> 30
USE% >= 50
DELETED RECORDS >= 10,000
OCCURRENC <> 0
TOTAL RECORDS >= 30,000,000
