     H            Y.
     F** CHKR42 ****************************************************************
     F*  PROGRAM    : DETECT PRICE RECORD TO BE DELETED                        *
     F*  WRITTEN    : 06/13/2019                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FFBCPL18 UF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *
     I            DS
     I                                        1  140@DATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        7  100SYY
     I                                       11  120SMM
     I                                       13  140SDD
      *
     I            DS
     I                                        1   80SVKOHZ
     I                                        1   40SVKOYY
     I                                        5   60SVKOMM
     I                                        7   80SVKODD
      *
     I            DS
     I                                        1  20 SVMHIN
     I                                        1   5 SVMHN1
     I                                        6  10 SVMHN2
     I                                       11  15 SVMHN3
     I                                       16  20 SVMHN4
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      **************************************************************************
     C                     EXSR #INIT
      *
     C           *LOVAL    SETLLFBCPL18
      *
     C                     DO   *HIVAL
     C                     READ FBCPL18                  98
     C   98                LEAVE
      *
     C           FBSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      * FIRST?
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     Z-ADDFBTOKU    SVTOKU
     C                     Z-ADDFBNONY    SVNONY
     C                     MOVELFBNKOJ    SVNKOJ
     C                     MOVELFBNUKE    SVNUKE
     C                     MOVELFBMHIN    SVMHIN
     C                     ENDIF
      * BREAK?
     C           FBTOKU    IFNE SVTOKU
     C           FBNONY    ORNE SVNONY
     C           FBNKOJ    ORNE SVNKOJ
     C           FBNUKE    ORNE SVNUKE
     C           FBMHIN    ORNE SVMHIN
     C                     EXSR #BRK1
     C                     ENDIF
      * DETAIL
     C           ENDFLG    IFEQ 'Y'
     C                     EXSR #PRINT
      * DELETE
     C           UPDFLG    IFEQ 'Y'
     C                     MOVE 'D'       FBSKJY
     C                     MOVE 'XX'      FBKOME
     C                     Z-ADDSYY       FBSKYY
     C                     Z-ADDSMM       FBSKMM
     C                     Z-ADDSDD       FBSKDD
     C                     UPDATFBCPL181
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           FBTSHZ    IFEQ 99999999
     C                     MOVE 'Y'       ENDFLG
     C                     MOVE 'Y'       PRTFLG
     C                     Z-ADDFBTKHZ    SVTKHZ
     C                     Z-ADD99999999  SVTSHZ
     C                     Z-ADDFBNTAN    SVNTAN
     C                     Z-ADDFBKOHZ    SVKOHZ
     C                     MOVELFBKOME    SVKOME
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           SEQ#      IFEQ 0
     C                     EXCPT@FOT
     C                     ELSE
     C                     MOVEL'*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  BREAK                                             *
      *----------------------------------------------------*
     C           #BRK1     BEGSR
      *
     C                     Z-ADDFBTOKU    SVTOKU
     C                     Z-ADDFBNONY    SVNONY
     C                     MOVELFBNKOJ    SVNKOJ
     C                     MOVELFBNUKE    SVNUKE
     C                     MOVELFBMHIN    SVMHIN
     C                     MOVE *BLANK    ENDFLG
     C                     Z-ADD0         SVTKHZ
     C                     MOVE 'N'       PRTFLG
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C           PRTFLG    IFEQ 'Y'
     C                     MOVE *BLANK    @COMM
     C                     EXCPT@DTL1
     C                     MOVE 'N'       PRTFLG
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     MOVEL' XX'     @COMM
     C                     EXCPT@DTL2
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           UPDFLG  1
     C                     PARM           $RTN    1
      *
     C                     MOVEL*BLANK    $RTN
     C                     MOVEL'Y'       FIRST   1
     C                     TIME           @DATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD0         SEQ#0   40
     C                     Z-ADD0         SVTOKU  40
     C                     Z-ADD0         SVNONY  40
     C                     MOVE *BLANK    SVNKOJ  1
     C                     MOVE *BLANK    SVNUKE  4
     C                     MOVE *BLANK    SVMHIN 20
     C                     MOVE *BLANK    ENDFLG  1
     C                     Z-ADD0         SVTKHZ  80
     C                     Z-ADD0         SVTSHZ  80
     C                     Z-ADD0         SVNTAN 105
     C                     Z-ADD0         SVKOHZ  80
     C                     MOVE *BLANK    SVKOME 10
     C                     MOVE *BLANK    PRTFLG  1
     C                     MOVE *BLANK    @COMM   3
      *
     C                     EXCPT@HDR
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   50 '** PRICE ERROR REPOR'
     O                                   70 'T **                '
     O                                   99 'DATE'
     O                         TODAY    102 '    .  .  '
     O                         NOW      112 '  :  :  '
     O                                  115 'P.'
     O                         PAGE  Z  119
     O        E   02           @HDR
     O                                   50 '(EXP DATE IS 9999, B'
     O                                   70 'UT NOT LAST)        '
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   14 'CUST'
     O                                   19 'DELV'
     O                                   21 'F'
     O                                   26 'DOCK'
     O                                   36 'CUST_PART'
     O                                   59 'EFFECTIV'
     O                                   70 'EXP_DATE'
     O                                   81 'UPD_DATE'
     O                                   92 'UPD_USER'
     O                                  107 'PRICE'
     O        E 1              @DTL1
     O                                    1 '.'
     O        E 1              @DTL1
     O                         SEQ#0 Z +001
     O                         @COMM   +001
     O                         SVTOKU  +001
     O                         SVNONY  +001
     O                         SVNKOJ  +001
     O                         SVNUKE  +001
     O                         SVMHN1  +001
     O                         SVMHN2  +001
     O                         SVMHN3  +001
     O                         SVMHN4  +001
     O                         SVTKHZ  +001 '    /  /  '
     O                         SVTSHZ  +001 '    /  /  '
     O                         SVKOHZ  +001 '    /  /  '
     O                         SVKOME  +001
     O                         SVNTAN1 +001
      *
     O        E 1              @DTL2
     O                         SEQ#  Z +001
     O                         @COMM   +001
     O                         FBTOKU  +001
     O                         FBNONY  +001
     O                         FBNKOJ  +001
     O                         FBNUKE  +001
     O                         FBMHN1  +001
     O                         FBMHN2  +001
     O                         FBMHN3  +001
     O                         FBMHN4  +001
     O                         FBTKHZ  +001 '    /  /  '
     O                         FBTSHZ  +001 '    /  /  '
     O                         FBKOHZ  +001 '    /  /  '
     O                         FBKOME  +001
     O                         FBNTAN1 +001
     O        E 1              @FOT
     O                                   20 '** THERE IS NO TARGE'
     O                                   40 'T DATA **           '
