     H            Y.
     F** CHKR42C ***************************************************************
     F*  PROGRAM    : CHECK UNIT PRICE=0 IN PP01                               *
     F*  WRITTEN    : JW     2023.09.27                                        *
      *----------------------------------------------
     F*                    CALL 'CHKR42B'
     F*                    PARM           $NOHZ   8
     F*                    PARM           $UPD    1
     F*                    PARM           $RTN    1
     F*--PARAMETERS --
     F*  IN  $NOHZ   8  FROM DATE
     F*  "   $UPD    1  Y=UPDATE
     F*  OUT $RTN    1  BLANK=NO ERROR
     F**************************************************************************
     FAB#PL0B UF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I            DS
     I                                        1   80KNOHZ
     I                                        1   40KNOYY
     I                                        5   60KNOMM
     I                                        7   80KNODD
     I            DS
     I                                        1   80B1NOHZ
     I                                        1   40B1NOYY
     I                                        5   60B1NOMM
     I                                        7   80B1NODD
     I            DS
     I                                        1   80B1URHZ
     I                                        1   40B1URYY
     I                                        5   60B1URMM
     I                                        7   80B1URDD
     I            DS
     I                                        1  20 B1MHIN
     I                                        1   5 B1MHN1
     I                                        6  10 B1MHN2
     I                                       11  15 B1MHN3
     I                                       16  20 B1MHN4
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      **************************************************************************
     C                     EXSR #INIT
      *
     C           K#NOHZ    SETLLAB#PL0B
      *
     C                     DO   *HIVAL
     C                     READ AB#PL0B                  98
     C   98                LEAVE
      *
      * <TEMP>
     C           B1TOKU    IFNE 5149
     C                     ITER
     C                     ENDIF
      *
     C           B1SKJY    IFEQ 'D'
     C           B1URYY    OREQ 0
     C                     ITER
     C                     ENDIF
      *
     C           B1TANK    IFNE 0
     C                     ITER
     C                     ENDIF
      * IGNORE (TEMP)
      * CHECK PRICE
     C                     MOVELB1TOKU    PTOKU   4
     C                     MOVELB1NONY    PNONY   4
     C                     MOVELB1NKOJ    PNKOJ   1
     C                     MOVELB1NUKE    PNUKE   4
     C                     MOVELB1MHIN    PMHIN  20
     C                     MOVELB1NOHZ    PNOHZ   8
     C                     CALL 'FBCR10'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           PMHIN  20
     C                     PARM           PNOHZ   8
     C                     PARM           PTANK  105
     C                     PARM           PCHEK   1
     C           PTANK     IFEQ 0
     C                     ITER
     C                     ENDIF
      * PRINT
     C                     EXSR #PRNT1
      * DELETE
     C           $UPD      IFEQ 'Y'
     C                     Z-ADDPTANK     B1TANK
     C                     UPDATAB#PP011
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           SEQ#      IFEQ 0
     C           $UPD      IFEQ 'N'
     C                     EXSR #PRNT2
     C                     ENDIF
     C                     ELSE
     C                     MOVEL'*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT ERROR DETAIL                                *
      *----------------------------------------------------*
     C           #PRNT1    BEGSR
      *
     C           LIN#      IFGE 60
     C                     EXCPT#HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPT#DTL1
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  PRINT FOOT                                        *
      *----------------------------------------------------*
     C           #PRNT2    BEGSR
      *
     C           LIN#      IFGE 60
     C                     EXCPT#HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     EXCPT#FOT
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NOHZ   8
     C                     PARM           $UPD    1
     C                     PARM           $RTN    1
      *
     C           K#NOHZ    KLIST
     C                     KFLD           KNOYY
     C                     KFLD           KNOMM
     C                     KFLD           KNODD
      *
     C           $UPD      IFNE 'Y'
     C                     MOVE 'N'       $UPD
     C                     ENDIF
      *
     C                     MOVEL*BLANK    $RTN
     C                     TIME           SDATE
     C                     Z-ADD88        LIN#    30
     C                     Z-ADD0         SEQ#    40
      *
     C           $NOHZ     IFEQ *BLANK
     C           $NOHZ     OREQ *ZERO
     C                     MOVELTODAY     $NOHZ
     C                     ENDIF
     C                     MOVEL$NOHZ     @NOHZ   80
     C                     MOVEL@NOHZ     KNOHZ
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           #HDR
     O                         #PGM      10
     O                                   17 'UPDATE:'
     O                         $UPD      19
     O                                   60 '** PRICE ERROR REPOR'
     O                                   80 'T (PP01) **         '
     O                                   99 'DATE'
     O                         TODAY    102 '    .  .  '
     O                         NOW      112 '  :  :  '
     O                                  116 'P.'
     O                         PAGE  Z  120
     O        E   02           #HDR
     O                                   17 'FROM DATE:'
     O                         @NOHZ     28 '    /  /  '
     O        E   03           #HDR
     O                                    5 'SEQ#'
     O                                   11 'CUST'
     O                                   17 'DELV'
     O                                   20 'F'
     O                                   26 'DOCK'
     O                                   36 'SHIP_DATE'
     O                                   41 'BN'
     O                                   49 'ORDER#'
     O                                   57 'USER_PART'
     O                                   82 'QTY'
     O                                   95 'PRICE'
     O                                  108 'TO_BE'
     O                                  118 'BIL_DATE'
     O        E 1              #DTL1
     O                         SEQ#  Z +001
     O                         B1TOKU  +002
     O                         B1NONY  +002
     O                         B1NKOJ  +002
     O                         B1NUKE  +002
     O                         B1NOHZ  +001 '    /  /  '
     O                         B1NOBI  +002
     O                         B1ODR1  +002
     O                         B1MHN1  +002
     O                         B1MHN2  +001
     O                         B1MHN3  +001
     O                         B1SRYO1 +001
     O                         B1TANK1 +001
     O                         PTANK 1 +001
     O                         B1URHZ  +002
      *
     O        E 1              #FOT
     O                                   20 '** THERE IS NO ERROR'
     O                                   40 ' PRICE **           '
