     H            Y.
     F*=========================================================================
     F*  PROGRAM    : CHKRJ42                                                  *
     F*  FUNCTION   : SERACH MSGW FROM WRKACTJOB DATA (CHKWPU1)                *
     F*  JW         : 2025.03.06                                               *
     F*=========================================================================
     FCHKWPU1 IF  E           K        DISK
     FCHKWPJ42O   E                    DISK
      *=========================================================================
     I* SYSTEM TIME
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *====================================================
     C           *LOVAL    SETLLCHKWPU1
     C                     DO   *HIVAL
     C                     READ CHKWPU1                  98
     C   98                LEAVE
      *
     C           CSSTAT    IFEQ 'MSGW'
     C                     ADD  1         LIN#
     C           LIN#      IFEQ 1
     C                     EXSR #HDR
     C                     ENDIF
      *
     C                     EXSR #MOVE
     C                     WRITECHKWPJ43
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------------------------*
      * HEADER
      *------------------------------------------------------------------------*
     C           #HDR      BEGSR
      *
     C                     MOVEL'SUBSYS  'C4SBYS    P
     C                     MOVEL'JOB_NAME'C4JOB     P
     C                     MOVEL'USER    'C4USER    P
     C                     MOVEL'JOB#'    C4JOBN    P
     C                     MOVEL'TYP '    C4TYPE    P
     C                     MOVEL'PR '     C4PTY     P
     C                     MOVEL'CPU%'    C4CPUP    P
     C                     MOVEL'STATS '  C4STAT    P
     C**                   MOVEL'DATE'    C4CRDT    P
     C**                   MOVEL'TIME'    C4CRTM    P
     C                     MOVEL':/N '    C4KAIG
     C                     WRITECHKWPJ43
      *
     C                     ENDSR
      *------------------------------------------------------------------------*
      * MOVE DATA
      *------------------------------------------------------------------------*
     C           #MOVE     BEGSR
      *
     C                     MOVELCSSBYS    C4SBYS    P
     C                     MOVELCSJOB     C4JOB     P
     C                     MOVELCSUSER    C4USER    P
     C                     MOVELCSJOBN    C4JOBN    P
     C                     MOVELCSTYPE    C4TYPE    P
     C                     MOVELCSPTY     C4PTY     P
     C                     MOVELCSCPUP    C4CPUP    P
     C                     MOVELCSSTAT    C4STAT    P
     C**                   Z-ADDTODAY     C4CRHZ
     C**                   Z-ADDNOW       C4CRTM
     C                     MOVEL':/N '    C4KAIG
      *
     C                     ENDSR
      *------------------------------------------------------------------------*
      * INITIAL SET
      *------------------------------------------------------------------------*
     C           *INZSR    BEGSR
      *
     C           KEY       KLIST
     C                     KFLD           CSSBYS
     C                     KFLD           CSJOB
      *
     C                     TIME           SDATE
     C                     Z-ADD0         LIN#    30
      *
     C                     ENDSR
