     H            Y.
     F***CHKR56H****************************************************************
     F*  PROGRAM    : CHECK ORDER DATA (BASYOS=0)                              *
     F*             : RUN IN FCKC00 (10:10AM BY JOBSCDE)                       *
     F*  WRITTEN BY : J.WATANABE  2021.03.30                                   *
     F**************************************************************************
     F** AB#PL1T UF  E           K        DISK
     FAB#PL1T IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    ERR     1   5 16
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        7  100K#NOYY
     I                                       11  120K#NOMM
     I                                       13  140K#NODD
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           K#DATE    SETLLAB#PL1T
     C                     DO   *HIVAL
     C                     READ AB#PL1T                  98
     C   98                LEAVE
      *
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           BASYOS    IFEQ 0
     C           BATOKU    ANDNE3411
     C                     EXSR #QPC
     C                     MOVELERR,1     MSG1
     C                     EXSR #PRINT
     C           $UPD      IFEQ 'Y'
     C                     EXSR #UPD
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           SEQ#      IFNE 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  GET QPC                                           *
      *----------------------------------------------------*
     C           #QPC      BEGSR
      *
     C                     Z-ADD0         @SYOS   60
     C           BASHIN    IFNE *BLANK
     C                     CALL 'UTLR35B'
     C                     PARM           $SHIN  12
     C                     PARM           $DATE   8
     C                     PARM           $SRV    1
     C                     PARM           $SYOS   6
     C                     PARM           $RTNX   1
     C                     MOVEL$SYOS     @SYOS
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  UPDATE FILE                                       *
      *----------------------------------------------------*
     C           #UPD      BEGSR
      *
     C                     SELEC
     C           @SYOS     WHNE 0
     C                     Z-ADD@SYOS     BASYOS
     C           BAUSYS    WHNE 0
     C           BAUSYS    ANDNE1
     C                     Z-ADDBAUSYS    BASYOS
     C                     OTHER
     C                     Z-ADDBASRYO    BASYOS
     C                     ENDSL
      *
     C** AVOID CONFLICTION UPDATAB#PL141
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $UPD    1
     C                     PARM           $RTN    1
      *
     C                     MOVE *BLANK    $RTN
     C                     TIME           SDATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD88        LIN#    30
     C                     MOVE *BLANK    MSG1   10
      * DATE 30 BACK
     C                     MOVELTODAY     $DT8
     C                     MOVE '-'       $SIGN
     C                     MOVEL'0030'    $DAYS
     C                     MOVE 'N'       $IAF
     C                     CALL 'UTLR10'
     C                     PARM           $DT8    8
     C                     PARM           $SIGN   1
     C                     PARM           $DAYS   4
     C                     PARM           $IAF    1
     C                     PARM           $TGT8   8
     C                     PARM           $RTNX   1
     C                     MOVEL$TGT8     K#DATE  80
     C*
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   18 'UPDFLG='
     O                         $UPD      19
     O                                   40 '** INCORRECT ORDER '
     O                                   60 '(QPC=0) **          '
     O                                   80 '                    '
     O                                   89 'DATE'
     O                         TODAY     92 '    .  .  '
     O                         NOW      102 '  :  :  '
     O                                  106 'P.'
     O                         PAGE  Z  110
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   10 'CUST'
     O                                   15 'DELV'
     O                                   33 'SHP_DATE'
     O                                   39 'BIN'
     O                                   49 'USER_PART'
     O                                   66 'IAF_PART'
     O                                   76 'ORDER#'
     O                                   94 'ORD_QTY'
     O                                  103 'IAF_QPC'
     O                                  112 'USR_QPC'
     O                                  121 'S/B_QPC'
     O**                                131 '*** ERROR MSG ***'
     O        E 1              @DTL
     O                         SEQ#  1 +000
     O                         BATOKU  +001
     O                         BANONY  +001
     O                         BANKOJ  +001
     O                         BANUKE  +001
     O                         BAEDIK  +001
     O                         BANOHZY +001
     O                         BANOBN  +002
     O                         BAMHN1  +001
     O                         BAMHN2  +001
     O                         BAMHN3  +001
     O                         BASHN1  +001
     O                         BASHN2  +001
     O                         BAODRN  +001
     O                         BASRYO1 +001
     O                         BASYOS1 +002
     O                         BAUSYS1 +002
     O                         @SYOS 1 +002
     O**                       MSG1    +002
** ERR (16A) ..>
IAF QPC=0 !                              01
                                         02
                                         03
                                         04
                                         05
