     H            Y.
     F** CLRR01 ********************************************
     F*  PROGRAM: (FORD) CLEAR HFILE1/AB#EP63/64/65/66     *
     F*  WRITTEN: J.W    2026.01.06                        *
     F*----------------------------------------------------*
     FAB#EP66 UF  E           K        DISK
     FAB#EP63 UF  E           K        DISK
     FAB#EP64 UF  E           K        DISK
     FAB#EP65 UF  E           K        DISK
     FJCMPL11EIF  E           K        DISK
      *--------------------------------------------------------
      *
     C                     DO   *HIVAL
     C                     READ AB#EP66                  98
     C   98                LEAVE
      *
     C                     MOVELE6SHID    @SHID  10
     C           @SHID     CHAINJCMPL11E             99
     C           *IN99     IFEQ *OFF
     C                     DELETAB#EP661
     C                     EXSR #EP6X
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------
      * DELETE AB#EP63/EP64/EP65
      *----------------------------------------------------
     C           #EP6X     BEGSR
      *
      * DELETE AB#EP63 ------------------------------------
     C           @SHID     SETLLAB#EP63
     C                     DO   *HIVAL
     C           @SHID     READEAB#EP63                  91
     C   91                LEAVE
      *
     C                     DELETAB#EP631
     C                     ENDDO
      *
      * DELETE AB#EP64 ------------------------------------
     C           @SHID     SETLLAB#EP64
     C                     DO   *HIVAL
     C           @SHID     READEAB#EP64                  91
     C   91                LEAVE
      *
     C                     DELETAB#EP641
     C                     ENDDO
      *
      * DELETE AB#EP65 ------------------------------------
     C           @SHID     SETLLAB#EP65
     C                     DO   *HIVAL
     C           @SHID     READEAB#EP65                  91
     C   91                LEAVE
      *
     C                     DELETAB#EP651
     C                     ENDDO
      *
     C                     ENDSR
