     H            Y.
      ** CNVR11 *********************
      * MONTH CONVERSION PGM        *
      *    GENERAL PGM              *
      * PROGRAM-ID. ==> CNVR11.     *
      * CREATE DATE ==> 1997/APR/09.*
      * AUTHOR.     ==> S.OHTAKE.   *
      ********************  CNVR11 **
     E                    TAB1    1  12  2 0 TAB2    3   MONTH
      *
     I            DS
     I                                        1   80DAHZ
     I                                        1   40DAYY
     I                                        5   60DAMM
     I                                        7   80DADD
     I            DS
     I                                        1  11 DAHZ2
     I                                        1   3 CNVMM
     I                                        4   4 SLASH1
     I                                        5   60DADD2
     I                                        7   7 SLASH2
     I                                        8  110DAYY2
      *
     C           *ENTRY    PLIST
     C                     PARM           @DAT    80
     C                     PARM           @DAT2  11
     C                     Z-ADD@DAT      DAHZ    80
      *
     C                     SETOF                     10
     C           DAMM      LOKUPTAB1      TAB2           10
     C   10                MOVELTAB2      CNVMM
     C                     MOVE '/'       SLASH1
     C                     MOVE '/'       SLASH2
     C                     Z-ADDDAYY      DAYY2
     C                     Z-ADDDADD      DADD2
     C                     MOVE DAHZ2     @DAT2
      *
     C                     SETON                     LR
     C                     RETRN
** MONTH CONVERT
01JAN
02FEB
03MAR
04APR
05MAY
06JUN
07JUL
08AUG
09SEP
10OCT
11NOV
12DEC
