     H            Y/                                    1
     H** AB#RH80 ******************************************************
     H*  CHANGE ORDER DATA FOR ALL CUSTOMER (MENU)                    *
     H*  JW   2020.10.12                                              *
     H*****************************************************************
     FAB#PWH80CF  E                    WORKSTN
      *================================================================
     E                    MSG     1   3 70
      *================================================================
     I            DS
     I                                        1  140@TIME
     I                                        1   60@NOW
     I                                        7  140@TODAY
      *
     I           SDS
     I                                     *PROGRAM #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I                                      264 269 #JBNO
      *===============================================================
      *  START  PROGRAM
      *===============================================================
     C                     EXSR #INIT
     C*
     C                     DO   *HIVAL
     C                     EXFMTDSP00
     C                     MOVE *OFF      *IN41
     C                     MOVE *OFF      *IN85
     C                     MOVE *BLANK    XMSG
     C* F1: END
     C           *INKA     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C                     EXSR #CHK1
     C           *IN85     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     SELEC
     C           XSEL      WHEQ 01
     C                     CALL 'AB#RH81'
     C                     ENDSL
     C                     ENDIF
     C*
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      * CHECK SCREEN1 DATA
      *===============================================================
     C           #CHK1     BEGSR
      *
     C           XSEL      IFEQ 0
     C                     SETON                     4185
     C                     MOVELMSG,1     XMSG
     C                     GOTO @CHK1
     C                     ENDIF
     C*
     C           XSEL      IFNE 01
     C                     SETON                     4185
     C                     MOVELMSG,2     XMSG
     C                     GOTO @CHK1
     C                     ENDIF
      *
     C           *IN85     IFEQ *OFF
     C                     MOVELMSG,3     XMSG
     C                     ENDIF
      *
     C           @CHK1     ENDSR
      *===============================================================
      *   << INIT >>
      *===============================================================
     C           #INIT     BEGSR
      *
     C                     Z-ADD0         XSEL
     C                     MOVE *BLANK    XMSG
      *
     C                     ENDSR
**  MSG(70A)-------2---------3---------4---------5---------6---------7
ENTER SELECTION!                                                       01
SELECTION SHOULD BE 1!                                                 02
PRESS F5 TO PROCESS...                                                 03
