     H            Y.
     F* ADD NEW *
     F* OVRDBF DA#PPIF ATCFILE/DA#PPIF
     FDA#PPIF IP  E                    DISK
     FDA#PPAT IF  E           K        DISK                      A
      *
     C           KEY       KLIST
     C                     KFLD           B8KKBN
     C                     KFLD           B8SAMM
     C                     KFLD           B8RENO
      *
     C           KEY       CHAINDA#PPAT              77
     C   77                WRITEDA#PPAT1
      *
