     H            Y.
     F** DATR10 ********************************************
     F*  ..日付論理チェック..                            *
     F*      T.SAKASHITA                   2003.09.26      *
     F******************************************** DATR10 **
     I* FOR #SB800
     I            DS
     I                                        1   80WKDATE
     I                                        3   80WKDAT6
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
     C*PRTN='0':OK
     C*PRTN='1':NG
     C           *ENTRY    PLIST
     C                     PARM           PDATE   8
     C                     PARM           PRTN    1
     C*
     C                     MOVE PDATE     WKDATE
     C                     SETOF                     99
     C                     MOVE '0'       PRTN
     C                     EXSR $SB800
     C           *IN99     IFEQ '1'
     C                     MOVE '1'       PRTN
     C                     ENDIF
     C*
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *     日付のチェック                               *
      *----------------------------------------------------*
     CSR         $SB800    BEGSR
     C           WKMM      IFLT 01
     C           WKMM      ORGT 12
     C                     SETON                       99
     C                     GOTO $S800E
     C                     END
      *
     C                     MOVE '1'       URSW    1
     C           WKYY      DIV  4         @@URY   40
     C                     MVR            @@URA   40
     C           @@URA     IFNE 0
     C                     MOVE '0'       URSW
     C                     ELSE
     C           WKYY      DIV  100       @@URY
     C                     MVR            @@URA
     C           @@URA     IFEQ 0
     C           WKYY      DIV  400       @@URY
     C                     MVR            @@URA
     C           @@URA     IFEQ 0
     C                     MOVE '0'       URSW
     C                     END
     C                     END
     C                     END
      *
     C           WKDD      IFLT 01
     C                     SETON                       99
     C                     GOTO $S800E
     C                     END
      *
     C           WKMM      IFEQ 01
     C           WKMM      OREQ 03
     C           WKMM      OREQ 05
     C           WKMM      OREQ 07
     C           WKMM      OREQ 08
     C           WKMM      OREQ 10
     C           WKMM      OREQ 12
      *
     C           WKDD      IFGE 01
     C           WKDD      ANDLE31
     C                     ELSE
     C                     SETON                       99
     C                     GOTO $S800E
     C                     END
     C                     END
      *
     C           WKMM      IFEQ 04
     C           WKMM      OREQ 06
     C           WKMM      OREQ 09
     C           WKMM      OREQ 11
      *
     C           WKDD      IFGE 01
     C           WKDD      ANDLE30
     C                     ELSE
     C                     SETON                       99
     C                     GOTO $S800E
     C                     END
     C                     END
      *
     C           WKMM      IFEQ 02
      *
     C           URSW      IFEQ '0'
     C           WKDD      IFGE 01
     C           WKDD      ANDLE28
     C                     ELSE
     C                     SETON                       99
     C                     GOTO $S800E
     C                     END
     C                     ELSE
     C           WKDD      IFGE 01
     C           WKDD      ANDLE29
     C                     ELSE
     C                     SETON                       99
     C                     GOTO $S800E
     C                     END
      *
     C                     END
      *
     C                     END
      *
     CSR         $S800E    ENDSR
