     H            Y.
     F** DATR1A ********************************************
     F*指定日からプラス・マイナスした稼動日付を算出      *
     F*青山カレンダー                                    *
     F*      T.SAKASHITA                   2008.06.12      *
     F******************************************** DATR10 **
     FAGDPL11 IF  E           K        DISK
     I* FOR #SB800
     I            DS
     I                                        1   80WKDATE
     I                                        3   80WKDAT6
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
     C*PRTN='0':OK
     C*PRTN='1':NG
     C           *ENTRY    PLIST
     C                     PARM           PDATE   8
     C                     PARM           PPORM   1        + OR -
     C                     PARM           PDAYS   4
     C                     PARM           PRDAT   8
     C                     PARM           PRTN    1
     C*
     C           DATR10    PLIST
     C                     PARM           CDATE   8
     C                     PARM           CRTN    1
     C*
     C                     MOVE '0'       PRTN
     C                     MOVE PDATE     WKDATE
     C                     MOVELPDAYS     WDAYS   40
     C*----------------------------------------------------------------
     C                     SETOF                     99
     C                     DO   *HIVAL
     C*
     C           WDAYS     IFLE 0
     C                     LEAVE
     C                     END
     C*
     C           PPORM     IFEQ '-'
     C                     EXSR #M
     C                     ELSE
     C                     EXSR #P
     C                     END
     C*
     C                     MOVE *BLANK    CRTN
     C                     MOVE WKDATE    CDATE
     C                     CALL 'DATR10'  DATR10
     C*存在する日付だったら
     C           CRTN      IFNE '1'
     C                     MOVE *BLANK    W@KADO  1
     C                     EXSR CHKAGD
     C*稼動日だったら
     C           W@KADO    IFEQ *BLANK
     C           WDAYS     SUB  1         WDAYS
     C                     ITER
     C                     END
     C                     END
     C*
     C                     ENDDO
     C*----------------------------------------------------------------
     C                     MOVE WKDATE    PRDAT
     C                     SETON                     LR
     C                     RETRN
     C*----------------------------------------------------------------
     C*マイナス処理
     C*----------------------------------------------------------------
     C           #M        BEGSR
      *日マイナス
     C           WKDD      SUB  1         WKDD
     C           WKDD      IFEQ 0
     C                     Z-ADD31        WKDD
     C           WKMM      SUB  1         WKMM
     C                     END
      *月マイナス
     C           WKMM      IFEQ 0
     C                     Z-ADD12        WKMM
     C           WKYY      SUB  1         WKYY
     C                     END
      *年プラス
     C           WKYY      IFEQ 0
     C                     Z-ADD9999      WKYY
     C                     END
      *
     C           EM        ENDSR
     C*----------------------------------------------------------------
     C*プラス処理
     C*----------------------------------------------------------------
     C           #P        BEGSR
      *日プラス
     C           WKDD      ADD  1         WKDD
     C           WKDD      IFEQ 32
     C                     Z-ADD1         WKDD
     C           WKMM      ADD  1         WKMM
     C                     END
      *月プラス
     C           WKMM      IFEQ 13
     C           WKYY      ADD  1         WKYY
     C                     Z-ADD1         WKMM
     C                     END
      *年プラス
     C           WKYY      IFEQ 9999
     C                     Z-ADD0         WKYY
     C                     END
     C*
     C           EP        ENDSR
     C*----------------------------------------------------------------
     C*稼働日チェック
     C*----------------------------------------------------------------
     C           CHKAGD    BEGSR
      *
     C           AGDKEY    KLIST
     C                     KFLD           WKYY
     C                     KFLD           WKMM
     C                     KFLD           WKDD
      *
     C           AGDKEY    CHAINAGDPL111             77
     C           *IN77     IFEQ '1'
     C                     MOVE '*'       W@KADO
     C                     END
      *
     C                     ENDSR
