     H            Y.
     F** DATR11 ********************************************
     F*  CHECK WHETHER WORKING DAY OR NOT                  *
     F*      T.SAKAKI                      2021.04.02      *
     F******************************************** DATR11 **
     FAGDPL12 IF  E           K        DISK
     I            DS
     I                                        1   80KDATE
     I                                        1   40KYY
     I                                        5   60KMM
     I                                        7   80KDD
     C           KEY1      KLIST
     C                     KFLD           KYY
     C                     KFLD           KMM
     C                     KFLD           KDD
      *
     C           *ENTRY    PLIST
     C                     PARM           PDATE   8
      *PMOD = 0  WORKING DAY ONLY
      *PMOD = 1  CHECK ALL DAY
     C                     PARM           PMOD    1
      *PRTN = 0  OK
      *PRTN = 1  NG
     C                     PARM           PRTN    1
      *
     C                     MOVE PDATE     KDATE
     C                     MOVEL'0'       PRTN
     C                     SETOF                     77
     C           KEY1      CHAINAGDPL121             77
     C*
     C           *IN77     IFEQ '0'
     C* WORKING DAY?
     C           PMOD      IFEQ '0'
     C           F8HIRU    IFEQ '*'
     C           F8YORU    OREQ '*'
     C                     MOVEL'1'       PRTN
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVEL'1'       PRTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
