     H            Y.
     F** DATR00 ********************************************
     F*  ..西暦２０００年対応..                          *
     F*  ..和暦日付（6桁）→西暦日付（8桁）に変換    *
     F*      I-HASADA                        99.01.23      *
     F******************************************** DATR00 **
     I            DS
     I                                        1   6 WZYMD
     I                                        1   2 WZYY
     I                                        3   4 WZMM
     I            DS
     I                                        1   8 WKYMD
     I                                        3   8 WKYMD6
     I                                        1   2 WKYY
      *
     C           *ENTRY    PLIST
     C                     PARM           PZYMD   6
     C                     PARM           PKYMD   8
     C                     MOVE PZYMD     WZYMD
     C                     MOVE *BLANK    PKYMD
     C                     MOVE *BLANK    WKYMD
     C                     MOVE PZYMD     WKYMD6
      *
     C           WZMM      IFNE '00'
     C           WZMM      ANDNE'99'
      *
     C           WZYY      IFGT '80'
     C                     MOVE '19'      WKYY
     C                     ELSE
     C                     MOVE '20'      WKYY
     C                     END
     C                     ELSE
      *
     C           WZMM      IFEQ '99'
     C                     MOVE '99'      WKYY
     C                     ELSE
     C                     MOVE '00'      WKYY
     C                     END
     C                     END
      *
     C                     MOVE WKYMD     PKYMD
      *
     C                     RETRN
