     H            Y.
     F*** DATRD1 *********************************
     F*日付4-2-2分解                         *
     F*   C:T.SAKASHITA             2021.02.17   *
     F*------------------------------------------*
     F* PARM('12345678' ' ' ' ' ' ')             *
     F*                      *   *   * )         *
     F********************************************
     I            DS
     I                                        1   8 W@DATE
     I                                        1   4 W@YY
     I                                        5   6 W@MM
     I                                        7   8 W@DD
      *
     C           *ENTRY    PLIST
     C                     PARM           P@DATE  8
     C                     PARM           P@YY    4
     C                     PARM           P@MM    2
     C                     PARM           P@DD    2
      *
     C                     MOVE P@DATE    W@DATE
     C                     MOVE W@YY      P@YY
     C                     MOVE W@MM      P@MM
     C                     MOVE W@DD      P@DD
      *
     C                     SETON                     LR
     C                     RETRN
      *
