     H*****************************************************************
     H*                                                               *
     H*   システム名      :　　　　　　　　　　　　　　　　　　 *
     H*   サブシステム名  :共通サブ　　　　　　　　　　　　　　 *
     H*   プログラム名    :日付チェックＳＵＢ　　　　　　　　　 *
     H*   プログラムＩＤ  : SUB001                                *
     H*                                                               *
     H*     作　成　者    :　　　　　　　　　　　　　　　　　　 *
     H*     作　成　日    :　　　　　　　　　　　　　　　　　　 *
     H*                                                               *
     H*     変　更　者    :　　　　　　　　　　　　　　　　　　 *
     H*     変　更　日    :　　　　　　　　　　　　　　　　　　 *
     H*                                                               *
     H*  プログラム概要                                             *
     H*CＩ／Ｏ　　　西暦８桁（ＹＹＹＹＭＭＤＤ）　　　　　　　　　*
     H*C　　　　　　和暦６桁（ＹＹＭＭＤＤ）　　　　　　　　　　　*
     H*C　　　　　　元号（Ｍ，Ｔ，Ｓ，Ｈ）　　　　　　　　　　　　*
     H*CＯＵＴ　　　チェック（Ｅ：エラー）　　　　　　　　　　　　*
     H*C　　　　　　ジュリアン日付（ＹＹＹＹＤＤＤ）　　　　　　　*
     H*****************************************************************
     H            Y                                     1
     F*----------------------------------------------------*
     E                    TBL        12  2 0
     I*----------------------------------------------------*
     I*　　Ｄ　　Ｓ　　　　　　　　　　　　　　　　　　　*
     I*----------------------------------------------------*
     I            DS
     I                                        1   80P$ISDT
     I                                        1   40P$ISYY
     I                                        5   60P$ISMM
     I                                        7   80P$ISDD
     I            DS
     I                                        1   60P$IWDT
     I                                        1   20P$IWYY
     I                                        3   40P$IWMM
     I                                        5   60P$IWDD
     I            DS
     I                                        1   1 P$IGEN
     I            DS
     I                                        1   1 P$OCHK
     I            DS
     I                                        1   70P$JLN
     I                                        1   40P$JYY
     I                                        5   70P$JDD
     C           *ENTRY    PLIST
     C                     PARM           PPISDT  8        *西暦
     C                     PARM           PPIWDT  6        *和暦
     C                     PARM           PPIGEN  1        *元号
     C                     PARM           PPOCHK  1        *チェツク
     C                     PARM           PPJLN   7        *ジュリアン
     C*----------------------------------------------------*
     C*    CNTROL  PROCESS                                 *
     C*----------------------------------------------------*
     C                     EXSR #CHK1
     C           P$OCHK    IFEQ *BLANK
     C                     EXSR #CHK2
     C                     END
     C           P$OCHK    IFEQ *BLANK
     C                     EXSR #RST
     C                     END
     C                     MOVE P$ISDT    PPISDT           *西暦
     C                     MOVE P$IWDT    PPIWDT           *和暦
     C                     MOVE P$IGEN    PPIGEN           *元号
     C                     MOVE P$JLN     PPJLN            *ジュリアン
     C                     MOVE P$OCHK    PPOCHK           *チェツク
     C                     SETON                     LR
     C                     RETRN
     C*----------------------------------------------------*
     C*         パラメータ　チェツク
     C*----------------------------------------------------*
     C           #CHK1     BEGSR
     C*
     C                     MOVE PPISDT    P$ISDT           *西暦
     C                     MOVE PPIWDT    P$IWDT           *和暦
     C                     MOVE PPIGEN    P$IGEN           *元号
     C                     MOVE *BLANK    P$OCHK
     C                     Z-ADD0         P$JLN
     C*
     C           P$ISDT    IFEQ *ZERO
     C           P$IWDT    ANDEQ*ZERO
     C                     MOVE 'E'       P$OCHK
     C                     GOTO $CHK1E
     C                     END
     C           P$IWDT    IFNE *ZERO
     C           P$IGEN    IFNE *BLANK
     C           P$IGEN    ANDNE'M'                        *明治
     C           P$IGEN    ANDNE'T'                        *大正
     C           P$IGEN    ANDNE'S'                        *昭和
     C           P$IGEN    ANDNE'H'                        *平成
     C                     MOVE 'E'       P$OCHK
     C                     GOTO $CHK1E
     C                     END
     C                     END
     C*
     C           P$IWDT    IFEQ *ZERO
     C           P$IGEN    ANDNE*BLANK
     C                     MOVE 'E'       P$OCHK
     C                     GOTO $CHK1E
     C                     END
     C*
     C           P$IGEN    IFEQ 'M'
     C           P$IWYY    ANDGE45
     C                     MOVE 'E'       P$OCHK
     C                     GOTO $CHK1E
     C                     END
     C           P$IGEN    IFEQ 'T'
     C           P$IWYY    ANDGE15
     C                     MOVE 'E'       P$OCHK
     C                     GOTO $CHK1E
     C                     END
     C           P$IGEN    IFEQ 'S'
     C           P$IWYY    ANDGE64
     C                     MOVE 'E'       P$OCHK
     C                     GOTO $CHK1E
     C                     END
     C*
     C           P$IWDT    IFNE *ZERO
     C                     Z-ADDP$IWMM    P$ISMM
     C                     Z-ADDP$IWDD    P$ISDD
     C           P$IGEN    IFEQ 'M'
     C           P$IWYY    ADD  1865      P$ISYY
     C                     END
     C           P$IGEN    IFEQ 'T'
     C           P$IWYY    ADD  1911      P$ISYY
     C                     END
     C           P$IGEN    IFEQ 'S'
     C           P$IWYY    ADD  1925      P$ISYY
     C                     END
     C           P$IGEN    IFEQ 'H'
     C           P$IWYY    ADD  1988      P$ISYY
     C                     END
     C                     END
     C*
     C                     EXSR #TBL
     C*
     C           $CHK1E    ENDSR
     C*----------------------------------------------------*
     C*         ＴＢＬ　作成
     C*----------------------------------------------------*
     C           #TBL      BEGSR
     C*
     C                     Z-ADD31        TBL,1
     C                     Z-ADD31        TBL,3
     C                     Z-ADD30        TBL,4
     C                     Z-ADD31        TBL,5
     C                     Z-ADD30        TBL,6
     C                     Z-ADD31        TBL,7
     C                     Z-ADD31        TBL,8
     C                     Z-ADD30        TBL,9
     C                     Z-ADD31        TBL,10
     C                     Z-ADD30        TBL,11
     C                     Z-ADD31        TBL,12
     C           P$ISYY    DIV  4         WRST    40
     C                     MVR            WAMR1   40
     C           P$ISYY    DIV  100       WRST
     C                     MVR            WAMR3   40
     C           P$ISYY    DIV  400       WRST
     C                     MVR            WAMR2   40
     C           WAMR1     IFEQ *ZERO
     C           WAMR2     IFEQ *ZERO
     C                     Z-ADD29        TBL,2
     C                     ELSE
     C           WAMR3     IFEQ *ZERO
     C                     Z-ADD28        TBL,2
     C                     ELSE
     C                     Z-ADD29        TBL,2
     C                     ENDIF
     C                     ENDIF
     C                     ELSE
     C                     Z-ADD28        TBL,2
     C                     END
     C*
     C                     ENDSR
     C*----------------------------------------------------*
     C*         関連チェツク
     C*----------------------------------------------------*
     C           #CHK2     BEGSR
     C*
     C           P$ISMM    IFLT 1
     C           P$ISMM    ORGT 12
     C                     MOVE 'E'       P$OCHK
     C                     GOTO $CHK2E
     C                     END
     C                     MOVE P$ISMM    I       20
     C           P$ISDD    IFLT 1
     C           P$ISDD    ORGT TBL,I
     C                     MOVE 'E'       P$OCHK
     C                     END
     C*
     C           $CHK2E    ENDSR
     C*----------------------------------------------------*
     C*         変換処理
     C*----------------------------------------------------*
     C           #RST      BEGSR
     C*
     C           P$ISMM    SUB  1         I       20
     C                     Z-ADD*ZERO     J       20
     C           1         DO   I
     C                     ADD  1         J
     C                     ADD  TBL,J     P$JDD
     C                     END
     C                     Z-ADDP$ISYY    P$JYY
     C                     ADD  P$ISDD    P$JDD
     C*
     C           P$IWDT    IFNE *ZERO
     C                     GOTO $RSTE
     C                     END
     C*
     C                     MOVE P$ISMM    P$IWMM
     C                     MOVE P$ISDD    P$IWDD
     C           P$ISYY    IFGE 1866
     C           P$ISYY    ANDLE1911
     C                     MOVE 'M'       P$IGEN
     C           P$ISYY    SUB  1865      P$IWYY
     C                     END
     C*
     C           P$ISYY    IFGE 1912
     C           P$ISYY    ANDLE1925
     C                     MOVE 'T'       P$IGEN
     C           P$ISYY    SUB  1911      P$IWYY
     C                     END
     C*
     C           P$ISYY    IFGE 1926
     C           P$ISYY    ANDLE1988
     C                     MOVE 'S'       P$IGEN
     C           P$ISYY    SUB  1925      P$IWYY
     C                     END
     C*
     C           P$ISYY    IFGE 1989
     C                     MOVE 'H'       P$IGEN
     C           P$ISYY    SUB  1988      P$IWYY
     C                     END
     C*
     C           $RSTE     ENDSR
