     F** DATR43 ********************************************
     F*日数加算                                          *
     F*      T.SAKASHITA                   2011.06.01      *
     F******************************************** DATR20 **
     FDATPW43 CF  E                    WORKSTN
     C                     EXFMTDATPW431
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C                     CALL 'YX003G'
     C                     PARM           PIDATE 260
     C                     PARM           PF      1
     C                     PARM           PA      50
     C                     PARM           PODATE 260
