     F** DATR43 ********************************************
     F*日数加算                                          *
     F*      T.SAKASHITA                   2011.06.01      *
     F******************************************** DATR20 **
     I            DS
     I                                        1  260WWDATE
     I                                        1   60WWDAT1
     I                                        7  200WWYMDT
     I                                        7  140WWYMD
     I                                       15  200WWTIM
     I                                       21  260WWDAT2
     C           *ENTRY    PLIST
     C                     PARM           P@IDAT  80
     C                     PARM           P@ITIM  60
     C                     PARM           PF      1
     C                     PARM           PA      50
     C                     PARM           P@ODAT  80
     C                     PARM           P@OTIM  60
      *
     C                     Z-ADD0         WWDAT1
     C                     Z-ADDP@IDAT    WWYMD
     C                     Z-ADDP@ITIM    WWTIM
     C                     Z-ADD0         WWDAT2
      *
     C                     MOVE WWDATE    PIDATE 260
     C                     Z-ADD0         PODATE 260
     C                     CALL 'YX003G'
     C                     PARM           PIDATE 260
     C                     PARM           PF      1
     C                     PARM           PA      50
     C                     PARM           PODATE 260
      *
     C                     Z-ADDPODATE    WWDATE
     C                     Z-ADDWWYMD     P@ODAT
     C                     Z-ADDWWTIM     P@OTIM
      *
     C                     SETON                     LR
     C                     RETRN
      *
