     H            Y.
      **********************************************************
      *   DELIVERY INFORMATION / SUBJECT PARTS TAG PUBLICATION *
      *   1997.02.18                                           *
      **********************************************************
     F* DELIVERY INFORMATION / SUBJECT PARTS TAG DATA WORK FILE
     FDC#WP11 IF  E                    DISK
     F* CUSTOMER CONTRACT M/F
     FKFAPL11 IF  E           K        DISK
     F* SHIPMENT M/F
     FGADPL11 IF  E           K        DISK
     F* DELIVERY INFORMATION / SUBJECT PARTS TAG / SALES VOTES PRINT FILE
     FDC#PR13 O   E                    PRINTER
     E*================================================================
     E                    COM     1   2 25               DELIVERY METHOD
     E                    CHK1       11  1               * BARCODE
     E                    CHK2        7  1               * BARCODE
     E                    TABX1  11  43  1   TABY1   2 0 * CHR->NUMERI
     E                    TABX2  11  43  2 0 TABY2   1   * NUMERIC->CH
     I*================================================================
     I            DS
     I                                        1   8 B8ME
     I                                        1   20B8MEMM
     I                                        3   40B8MEDD
     I                                        5   80B8MEYY
     I            DS
     I                                        1   8 B8TE
     I                                        1   20B8TEMM
     I                                        3   40B8TEDD
     I                                        5   80B8TEYY
     I            DS
     I                                        1  14 BARCD
     I                                        1   1 W1BAR
     I                                        2  13 BARC
     I                                        2  12 BBAR
     I                                        2   30B8SAMM
     I                                        4   80B8RENO
     I                                        9  12 B8ZETI
     I                                       13  13 CHKD
     I                                       14  14 W2BAR
     I            DS
     I                                        1  10 BARCD2
     I                                        1   1 W3BAR
     I                                        2   9 BARC2
     I                                        2   8 BBAR2
     I                                        2   30BBSAMM
     I                                        4   80BBRENO
     I                                        9   9 CHKD2
     I                                       10  10 W4BAR
     C*================================================================
     C*****>>    *ENTRY    PLIST
     C*****>>              PARM           P@DATE  8
     C*****>>              MOVE P@DATE    WDATE   80
     C*--------------------
     C                     DO   *HIVAL
     C                     READ DC#WP11                  90
     C   90                LEAVE
     C* DUMMY(SKIP)
     C*------------
     C           @FIRST    IFNE ' '
     C                     WRITEDC#PR134
     C                     ENDIF
      *
     C                     MOVE '*'       @FIRST  1
      *
     C                     MOVE B8TE      B8TEHZ  80
     C*****>>    B8TEHZ    IFGT WDATE
     C*****>>              GOTO ESC
     C*****>>              ENDIF
      *
     C* NUMBER OF BOXED CALCULATION
     C           B8SRYO    DIV  B8SYUY    WKHAKO  30
     C                     MVR            B8HASU  50       ﾌﾇc
     C           B8HASU    IFEQ 0
     C                     Z-ADDWKHAKO    B8HAKO  30
     C                     ELSE
     C           WKHAKO    ADD  1         B8HAKO
     C                     ENDIF
     C* CUSTOMER CONTRACT M/F
     C                     SETOF                     80
     C           B8NONY    CHAINKFAPL11              80    RECEIVING CO
     C           *IN80     IFEQ *ON
     C                     MOVE *BLANK    D1TOK1
     C                     MOVE *BLANK    D1TOK2
     C                     ENDIF
     C                     MOVE *BLANK    WKHIKI
     C           B8HIKI    IFEQ 'A'
     C                     MOVE COM,1     WKHIKI
     C                     ENDIF
     C           B8HIKI    IFEQ 'B'
     C                     MOVE COM,2     WKHIKI
     C                     ENDIF
     C*
     C*           BXMEYY        11      5 56TEXT('MAKE DELIVERY DATE YY')
     C                     MOVE B8ME      P@INDT
     C                     CALL 'CNVR10'
     C                     PARM           P@INDT  8
     C                     PARM           P@OTDT 11
     C                     MOVE P@OTDT    BXMEYY
     C*           BXTEYY        11     17  3TEXT('SHIP ORDER DATE YY')
     C                     MOVE B8TE      P@INDT
     C                     CALL 'CNVR10'
     C                     PARM           P@INDT  8
     C                     PARM           P@OTDT 11
     C                     MOVE P@OTDT    BXTEYY
     C* DELIVERY INFORMATION
     C*-------------
     C                     MOVEL'*'       W1BAR
     C                     MOVEL'*'       W2BAR
     C                     EXSR BARSUB
     C                     WRITEDC#PR131
      *
     C* SUBJECT PARTS TAG
     C*----------
     C                     Z-ADD0         B8CT1
     C                     Z-ADDB8HAKO    B8CT2
     C                     MOVE *BLANK    WKFAN1           FACTORY NAME 1
     C                     MOVE *BLANK    WKFAN2           FACTORY NAME 2
     C                     MOVE *BLANK    WKUKN1           RECEIVING NAME1
     C                     MOVE *BLANK    WKUKN2           RECEIVING NAME2
      *
     C           KEY1      KLIST
     C                     KFLD           B8TOKU
     C                     KFLD           B8NONY
     C                     KFLD           B8NKOJ
     C                     KFLD           B8NUKE
      *
     C                     SETOF                     70
     C           KEY1      CHAINGADPL11              70
     C           *IN70     IFEQ '1'
     C                     GOTO STEP1
     C                     ENDIF
      *
     C           B5SKJY    IFEQ 'D'
     C           B5SKHZ    ANDLE*DATE
     C                     GOTO STEP1
     C                     ENDIF
      *
     C                     MOVELB5KMEI    WKFAN1
     C           STEP1     TAG
     C                     Z-ADD0         B8SYSU           ATTENDANCE NO
     C                     DO   B8HAKO
     C                     ADD  1         B8CT1
     C                     Z-ADDB8SYUY    B8SYSU           ATTENDANCE NO
     C           B8HASU    IFNE 0
     C           B8CT1     ANDEQB8CT2
     C                     Z-ADDB8HASU    B8SYSU           ATTENDANCE NO
     C                     ENDIF
     C                     WRITEDC#PR132
     C                     ENDDO
     C* SALES VOTES
     C*---------
     C                     MOVEL'*'       W3BAR
     C                     MOVEL'*'       W4BAR
     C                     Z-ADDB8SAMM    BBSAMM  20
     C                     Z-ADDB8RENO    BBRENO  50
     C                     EXSR BR2SUB
     C                     WRITEDC#PR133
     C*
     C           ESC       TAG
     C                     ENDDO
     C*--------------------
     C                     SETON                     LR
     C                     RETRN
     C*================================================================
      *  CHECKDIGIT
     C           BARSUB    BEGSR
     C                     MOVEABBAR      CHK1
     C                     Z-ADD11        XX      20
     C                     Z-ADD0         I       20
     C                     Z-ADD0         WKKEI   50
     C           1         DO   XX        I
     C                     SETOF                     75
     C           CHK1,I    LOKUPTABX1     TABY1          75
     C           *IN75     IFEQ '1'
     C                     ADD  TABY1     WKKEI
     C                     END
     C                     END
      *
     C           WKKEI     DIV  43        WKSHO   20
     C                     MVR            WAMARI  20
      *
     C                     SETOF                     75
     C           WAMARI    LOKUPTABX2     TABY2          75
     C           *IN75     IFEQ '1'
     C                     MOVE TABY2     CHKD    1
     C                     END
     C                     MOVE BARCD     BAR    14
     C                     ENDSR
     C*================================================================
      *  CHECKDIGIT
     C           BR2SUB    BEGSR
     C                     MOVEABBAR2     CHK1
     C                     Z-ADD7         XX      20
     C                     Z-ADD0         I       20
     C                     Z-ADD0         WKKEI   50
     C           1         DO   XX        I
     C                     SETOF                     75
     C           CHK1,I    LOKUPTABX1     TABY1          75
     C           *IN75     IFEQ '1'
     C                     ADD  TABY1     WKKEI
     C                     END
     C                     END
      *
     C           WKKEI     DIV  43        WKSHO   20
     C                     MVR            WAMARI  20
      *
     C                     SETOF                     75
     C           WAMARI    LOKUPTABX2     TABY2          75
     C           *IN75     IFEQ '1'
     C                     MOVE TABY2     CHKD2   1
     C                     END
     C                     MOVE BARCD2    BAR2   10
     C                     ENDSR
     C*================================================================
**  COM
EX-IAF
DELIVERED TO THE CUSTOMER
**     TABX1,TABY1
000101202303404505606707808909A10
B11C12D13E14F15G16H17I18J19K20L21
M22N23O24P25Q26R27S28T29U30V31W32
X33Y34Z35-36.37 38\39/40+41%42
**     TABX2,TABY2
00001102203304405506607708809910A
11B12C13D14E15F16G17H18I19J20K21L
22M23N24O25P26Q27R28S29T30U31V32W
33X34Y35Z36-37.38 39\40/41+42%
