     H            Y.
     F** DFAR02 *******************************************
     F* 指示かんばん工程納期遅れ照会・対象データ抽出    *
     F*  2024.09.20   M.OKUMURA                           *
     F*****************************************************
     F*         ファイル定義                            *
     F*****************************************************
      *A-PICS2 ORDER FILE
     FCA#PL04 IF  E           K        DISK
      *PART MASTER
     FFCEPL07 IF  E           K        DISK
      *A-PICS2 KANBAN M/F
     FCADPL05 IF  E           K        DISK
      *A-PICS2 DELAY NO COVER
     FCA#PP91 IF  E           K        DISK
      *WORKFILE
     FDFAWP02 O   E                    DISK
      *
     E                    @KOT       10  3               工程
     E                    @BMN       10 16               部門
     E                    @HAK       10  1               箱色
     E                    @KIB       10  3               機番
     E                    @NDT       10  8 0             納期
     E                    @KDT       10  8 0             完成日
      *
     I           SDS
     I                                     *PROGRAM @@PGM
     I                                      244 253 @@WSID
     I                                      254 263 @@USER
     I                                      264 269 @@JBNO
     I            DS
     I                                        1  30 @KOT
     I                                        1   3 C6KOT1
     I                                        4   6 C6KOT2
     I                                        7   9 C6KOT3
     I                                       10  12 C6KOT4
     I                                       13  15 C6KOT5
     I                                       16  18 C6KOT6
     I                                       19  21 C6KOT7
     I                                       22  24 C6KOT8
     I                                       25  27 C6KOT9
     I                                       28  30 C6KOTA
     I            DS
     I                                        1 160 @BMN
     I                                        1  16 C6BMN1
     I                                       17  32 C6BMN2
     I                                       33  48 C6BMN3
     I                                       49  64 C6BMN4
     I                                       65  80 C6BMN5
     I                                       81  96 C6BMN6
     I                                       97 112 C6BMN7
     I                                      113 128 C6BMN8
     I                                      129 144 C6BMN9
     I                                      145 160 C6BMNA
     I            DS
     I                                        1  30 @KIB
     I                                        1   3 C6KBN1
     I                                        4   6 C6KBN2
     I                                        7   9 C6KBN3
     I                                       10  12 C6KBN4
     I                                       13  15 C6KBN5
     I                                       16  18 C6KBN6
     I                                       19  21 C6KBN7
     I                                       22  24 C6KBN8
     I                                       25  27 C6KBN9
     I                                       28  30 C6KBNA
     I            DS
     I                                        1  10 @HAK
     I                                        1   1 C6HAK1
     I                                        2   2 C6HAK2
     I                                        3   3 C6HAK3
     I                                        4   4 C6HAK4
     I                                        5   5 C6HAK5
     I                                        6   6 C6HAK6
     I                                        7   7 C6HAK7
     I                                        8   8 C6HAK8
     I                                        9   9 C6HAK9
     I                                       10  10 C6HAKA
     I            DS
     I                                        1  800@NDT
     I                                        1   80C6NYD1
     I                                        9  160C6NYD2
     I                                       17  240C6NYD3
     I                                       25  320C6NYD4
     I                                       33  400C6NYD5
     I                                       41  480C6NYD6
     I                                       49  560C6NYD7
     I                                       57  640C6NYD8
     I                                       65  720C6NYD9
     I                                       73  800C6NYDA
     I            DS
     I                                        1  800@KDT
     I                                        1   80C6KND1
     I                                        9  160C6KND2
     I                                       17  240C6KND3
     I                                       25  320C6KND4
     I                                       33  400C6KND5
     I                                       41  480C6KND6
     I                                       49  560C6KND7
     I                                       57  640C6KND8
     I                                       65  720C6KND9
     I                                       73  800C6KNDA
     I            DS
     I                                        1   7 A2MEKC
     I                                        1   4 A2MEK1
     I                                        5   6 A2MEK2
     I                                        7   7 A2MEK3
      **************************************************************************
     C           *ENTRY    PLIST
      *                  ( IN )
     C                     PARM           P@NDTF  80       工程納期(FROM)
     C                     PARM           P@NDTT  80       工程納期(TO)
      *                  ( OUT )
     C                     PARM           P@CNTR  70        ﾛﾃｰnﾞ件数
      *
     C                     EXSR #MAIN
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
      **************************************************************************
      * MAIN PROCESS
     C           #MAIN     BEGSR
      *
     C                     READ CA#PL04                  90
     C           *IN90     DOWEQ'0'
      *
     C           C6SKJY    IFEQ *BLANK
     C           C6FFLG    ANDEQ*BLANK                     NOT FINISHED
      *
     C                     EXSR #CA#91
     C           W91FLG    IFEQ *BLANK
      *
     C                     Z-ADD1         X       20
     C                     DO   10
     C           @KOT,X    IFNE *BLANK
     C           @NDT,X    ANDGEP@NDTF
     C           @NDT,X    ANDLEP@NDTT
     C                     EXSR #DWRT
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     C                     ENDIF
      *
     C                     ENDIF
     C                     READ CA#PL04                  90
     C                     ENDDO
      *
     C           EMAIN     ENDSR
      **************************************************************************
      * WRITE
     C           #DWRT     BEGSR
     C                     CLEARDFAWP021
      *
     C                     MOVELC6ZETI    W2THI1
     C                     MOVELC6RTNO    W2THI2
     C                     MOVELC6HIN1    W2SHN1
     C                     MOVELC6HIN2    W2SHN2
     C                     MOVELC6HIN3    W2SHN3
     C                     MOVELC6TKR1    W2BAN1
     C                     MOVELC6TKR2    W2BAN2
     C                     MOVELC6TKR3    W2BAN3
     C                     MOVELC6TKR4    W2BAN4
     C                     Z-ADDX         W2KTNO
     C                     MOVEL@KOT,X    W2KTEI
     C                     MOVEL@BMN,X    W2KBNM
      *
     C                     MOVEL@KIB,X    W2MSNO
     C                     Z-ADD@NDT,X    W2KNHZ
     C                     Z-ADD@KDT,X    W2COHZ
     C                     MOVEL@BMN,X    W2TOKU
     C                     MOVELW2KBNM    W2TKNM
     C                     MOVEL*BLANK    W2UHN1
     C                     MOVEL*BLANK    W2UHN2
     C                     MOVEL*BLANK    W2UHN3
     C                     MOVEL*BLANK    W2UHN4
     C                     Z-ADD@KDT,X    W2NOHZ
     C                     Z-ADD0         W2THSU
     C           C6MAIS    MULT C6SYOS    W2SISU
     C                     Z-ADDC6SYOS    W2SSYS
     C                     Z-ADDC6MAIS    W2HKSU
     C                     Z-ADD1         W2ILOT
      * FCEPP01
     C           C6ZETI    CHAINFCEPL07              91
     C           *IN91     IFEQ '0'
     C                     MOVELA2TEHI    W2TEHI
     C                     Z-ADDA2KUBI    W2KUBI
     C                     Z-ADDA2TUSZ    W2TUSZ
     C                     Z-ADDA2KIKI    W2KIKI
     C                     Z-ADDA2SOZI    W2SOZI
     C                     Z-ADDA2KASI    W2KASI
     C                     MOVELA2ZANM    W2ZANM
     C                     Z-ADDA2KAZI    W2KAZI
     C                     MOVELA2MEKC    W2MEKA
     C                     MOVELA2MMEI    W2MME1
     C                     ENDIF
      *
     C                     MOVEL*BLANK    W2DVNM
     C                     MOVEL*BLANK    W2DPNM
     C                     MOVEL*BLANK    W2ZAN2
     C                     MOVEL*BLANK    W2MME2
      * CADPP01
     C           C6ZETI    SETGTCADPL05
     C           C6ZETI    REDPECADPL05                  93
     C           *IN93     DOWEQ'0'
     C           C2UKHZ    IFLE *DATE
     C           C2STHZ    ANDGT*DATE
     C                     MOVELC2SET1    W2SETR
     C                     LEAVE
     C                     ENDIF
     C           C6ZETI    REDPECADPL05                  93
     C                     ENDDO
      *
     C                     MOVEL*BLANK    W2BHN1
     C                     MOVEL*BLANK    W2BHN2
     C                     MOVEL*BLANK    W2BHN3
     C                     MOVEL*BLANK    W2KH11
     C                     MOVEL*BLANK    W2KH12
     C                     MOVEL*BLANK    W2KH13
     C                     Z-ADD0         W2KH1D
     C                     MOVEL*BLANK    W2KH21
     C                     MOVEL*BLANK    W2KH22
     C                     MOVEL*BLANK    W2KH23
     C                     Z-ADD0         W2KH2D
     C                     Z-ADD0         W2KTHZ
     C                     Z-ADD0         W2ZRHZ
     C                     MOVEL*BLANK    W2STTS
     C                     Z-ADD0         W2CPNO
     C                     MOVEL*BLANK    W2CTEI
     C                     Z-ADD0         W2MPNO
     C                     MOVEL*BLANK    W2MTEI
     C                     WRITEDFAWP021
      *
     C                     ADD  1         P@CNTR            ﾛﾃｰnﾞ件数
      *
     C           EDWRT     ENDSR
      *-------------------------------------------------------------------------
      *          #CA#91    CA#PP91 CHECK
      *-------------------------------------------------------------------------
     C           #CA#91    BEGSR
      *
     C           STKEY4    KLIST
     C                     KFLD           C6ZETI           *手配№　絶対番号
     C                     KFLD           C6RTNO           *手配№　連番
     C                     KFLD           C6HKDT           *発行日
      *
     C                     MOVE *BLANK    W91FLG  1
     C           STKEY4    CHAINCA#PP91              90
     C           *IN90     IFEQ '0'
     C           S9GSJY    ANDEQ*BLANK
     C                     MOVE '*'       W91FLG
     C                     ENDIF
      *
     C           ECA#91    ENDSR
