     H            Y.
     F** DGAR32 ********************************
     F*工場コード指定で機番の選択サブルーチン*
     F*          M-OKUDA      2001.02.28       *
     F******************************** DGAR32 **
     FDGAPW32 CF  E                    WORKSTN
     F                                              KINFDS CRM
     FFGBPL01 IF  E           K        DISK
     FMZAPL23 IF  E           K        DISK
     E*********
     E                    KB         17  5               Gﾌﾞ]
     E                    KG         17  3               GHﾞ]
     E                    KT         17  3               ﾃCMB
     E                    CS         17  8               ﾃﾇNﾈ]Jｰ
     E                    KE         17 10               IBﾆG
     E                    KS         17 10               ﾆﾅ]O]ﾌﾞｰ
     E                    KBM       340  5               Gﾌﾞ]
     E                    KGM       340  3               GHﾞ]
     E                    KTM       340  3               ﾃCMB
     E                    CSM       340  8               ﾃﾇNﾈ]Jｰ
     E                    KEM       340 10               IBﾆG
     E                    KSM       340 10               ﾆﾅ]O]ﾌﾞｰ
     ICRM         DS
     I                                    B 370 3710COL
      *機番
     I            DS
     I                                        1  85 KB
     I                                        1   5 KB01
     I                                        6  10 KB02
     I                                       11  15 KB03
     I                                       16  20 KB04
     I                                       21  25 KB05
     I                                       26  30 KB06
     I                                       31  35 KB07
     I                                       36  40 KB08
     I                                       41  45 KB09
     I                                       46  50 KB10
     I                                       51  55 KB11
     I                                       56  60 KB12
     I                                       61  65 KB13
     I                                       66  70 KB14
     I                                       71  75 KB15
     I                                       76  80 KB16
     I                                       81  85 KB17
      *工程
     I            DS
     I                                        1  51 KT
     I                                        1   3 KT01
     I                                        4   6 KT02
     I                                        7   9 KT03
     I                                       10  12 KT04
     I                                       13  15 KT05
     I                                       16  18 KT06
     I                                       19  21 KT07
     I                                       22  24 KT08
     I                                       25  27 KT09
     I                                       28  30 KT10
     I                                       31  33 KT11
     I                                       34  36 KT12
     I                                       37  39 KT13
     I                                       40  42 KT14
     I                                       43  45 KT15
     I                                       46  48 KT16
     I                                       49  51 KT17
      *機群
     I            DS
     I                                        1  51 KG
     I                                        1   3 KG01
     I                                        4   6 KG02
     I                                        7   9 KG03
     I                                       10  12 KG04
     I                                       13  15 KG05
     I                                       16  18 KG06
     I                                       19  21 KG07
     I                                       22  24 KG08
     I                                       25  27 KG09
     I                                       28  30 KG10
     I                                       31  33 KG11
     I                                       34  36 KG12
     I                                       37  39 KG13
     I                                       40  42 KG14
     I                                       43  45 KG15
     I                                       46  48 KG16
     I                                       49  51 KG17
      *コストセンター
     I            DS
     I                                        1 136 CS
     I                                        1   8 CS01
     I                                        9  16 CS02
     I                                       17  24 CS03
     I                                       25  32 CS04
     I                                       33  40 CS05
     I                                       41  48 CS06
     I                                       49  56 CS07
     I                                       57  64 CS08
     I                                       65  72 CS09
     I                                       73  80 CS10
     I                                       81  88 CS11
     I                                       89  96 CS12
     I                                       97 104 CS13
     I                                      105 112 CS14
     I                                      113 120 CS15
     I                                      121 128 CS16
     I                                      129 136 CS17
      *機械形式
     I            DS
     I                                        1 170 KE
     I                                        1  10 KE01
     I                                       11  20 KE02
     I                                       21  30 KE03
     I                                       31  40 KE04
     I                                       41  50 KE05
     I                                       51  60 KE06
     I                                       61  70 KE07
     I                                       71  80 KE08
     I                                       81  90 KE09
     I                                       91 100 KE10
     I                                      101 110 KE11
     I                                      111 120 KE12
     I                                      121 130 KE13
     I                                      131 140 KE14
     I                                      141 150 KE15
     I                                      151 160 KE16
     I                                      161 170 KE17
      *資産番号
     I            DS
     I                                        1 170 KS
     I                                        1  10 KS01
     I                                       11  20 KS02
     I                                       21  30 KS03
     I                                       31  40 KS04
     I                                       41  50 KS05
     I                                       51  60 KS06
     I                                       61  70 KS07
     I                                       71  80 KS08
     I                                       81  90 KS09
     I                                       91 100 KS10
     I                                      101 110 KS11
     I                                      111 120 KS12
     I                                      121 130 KS13
     I                                      131 140 KS14
     I                                      141 150 KS15
     I                                      151 160 KS16
     I                                      161 170 KS17
      *  機番の編集
     I            DS
     I                                        1   5 KIBN
     I                                        1   3 MXKBCD
     I                                        4   4 F4
     I                                        5   5 MXKHCD
      *コストセンター
     I            DS
     I                                        1   8 COST
     I                                        1   2 MXCST1
     I                                        3   3 F1
     I                                        4   5 MXCST2
     I                                        6   6 F2
     I                                        7   8 MXCST3
      *資産番号の編集
     I            DS
     I                                        1  10 SISN
     I                                        1   4 MXSIN1
     I                                        5   5 F3
     I                                        6   9 MXSIN2
     I                                       10  10 AKI
      *  機番の編集2
     I            DS
     I                                        1   5 KBAN
     I                                        1   3 KBN1
     I                                        4   4 XX8
     I                                        5   5 KBN2
      *資産番号の編集
     I            DS
     I                                        1   9 SISAN
     I                                        1   4 SYS1
     I                                        5   5 XX1
     I                                        6   9 SYS2
      *コストセンター
     I            DS
     I                                        1   8 COSTO
     I                                        1   2 COS1
     I                                        3   3 XX2
     I                                        4   5 COS2
     I                                        6   6 XX3
     I                                        7   8 COS3
      *
     I            DS
     I                                        1   80MXKAHZ
     I                                        1   40MXKADY
     I                                        5   60MXKADM
     I                                        7   80MXKADD
      *
     I            DS
     I                                        1   80MXSIHZ
     I                                        1   40MXSIKY
     I                                        5   60MXSIKM
     I                                        7   80MXSIKD
     C           *ENTRY    PLIST
     C                     PARM           PKOJY   4
     C                     PARM           PKBN1   3
     C                     PARM           PKBN2   1
     C                     PARM           PKOTE   3
     C                     PARM           PSYS1   4
     C                     PARM           PSYS2   4
     C                     PARM           PKEIS  10
     C                     PARM           PKGUN   3
     C                     PARM           PCOS1   2
     C                     PARM           PCOS2   2
     C                     PARM           PCOS3   2
     C                     MOVE PKOJY     BMON    40
     C                     MOVE PKOJY     KOJY    40
     C                     SETOF                     05
     C                     MOVE *BLANK    KMEI   16
     C           BMON      CHAINFGBPL011             05
     C           *IN05     IFEQ '0'
     C                     MOVE B2KEMI    KMEI   16
     C                     END
     C                     MOVE '-'       F1
     C                     MOVE '-'       F2
     C                     MOVE '-'       F3
     C                     MOVE '-'       F4
     C                     MOVE *BLANK    AKI
     C           SKEY      KLIST
     C                     KFLD           BMON
     C                     KFLD           WKBN1   3
     C                     KFLD           WKBN2   1
     C           SKEYR     KLIST
     C                     KFLD           BMON
     C                     MOVE *BLANK    WKBN1
     C                     MOVE *BLANK    WKBN2
      * UﾇJｰ READ *
     C           STEP00    TAG
     C                     Z-ADD1         X       30
     C                     SETOF                     04
     C           SKEY      SETLLMZAPL231
     C           1         DO   *HIVAL    X
     C           STEP01    TAG
     C           SKEYR     READEMZAPL231                 04
     C           *IN04     CABEQ'1'       STEP02
     C           MXSAKJ    CABEQ'D'       STEP01
     C           MXSBKB    CABNE'1'       STEP01
     C           MXJTKB    CABNE'1'       STEP01
     C           MXOKKB    CABNE'A'       STEP01
     C           MXKBCD    CABEQ*BLANK    STEP01
     C           MXSIHZ    CABNE99999999  STEP01
      *
     C           *DATE     IFGE MXKAHZ
     C           *DATE     ANDLEMXSIHZ
     C                     ELSE
     C                     GOTO STEP01
     C                     END
      *
     C           X         CABGT340       STEP02
     C                     MOVE KIBN      KBM,X
     C                     MOVE MXKGCD    KGM,X
     C                     MOVELMXKOTE    KTM,X
     C                     MOVE MXKKNO    KEM,X
     C                     MOVE COST      CSM,X
     C                     MOVE SISN      KSM,X
     C                     END
     C           STEP02    TAG
     C                     Z-ADD0         D       30
     C           STEP03    TAG
     C                     Z-ADD1         X       30
     C                     Z-ADD1         Y       30
     C           1         DO   17        X
     C                     ADD  1         D
     C                     MOVE KBM,D     KB,X
     C                     MOVE KGM,D     KG,X
     C                     MOVE KTM,D     KT,X
     C                     MOVE KEM,D     KE,X
     C                     MOVE CSM,D     CS,X
     C                     MOVE KSM,D     KS,X
     C                     END
      *************************************************
     C                     Z-ADD3         @LI
     C                     Z-ADD2         @CL
     C           STEP11    TAG
     C                     SETOF                     0102
     C                     WRITEDGAPW321
     C                     EXFMTDGAPW322
      *ＲＯＬＬＤＯＷＮ*
     C           *IN02     IFEQ '1'
     C           D         IFGE 34
     C           D         SUB  34        D
     C                     GOTO STEP03
     C                     ELSE
     C                     GOTO STEP11
     C                     END
     C                     END
      *ＲＯＬＬーＵＰ*
     C           *IN01     IFEQ '1'
     C           KB,17     IFNE *BLANK
     C           D         IFLT 340
     C                     GOTO STEP03
     C                     ELSE
     C                     GOTO STEP11
     C                     END
     C                     ELSE
     C                     GOTO STEP11
     C                     END
     C                     END
     C           COL       DIV  256       L       20
     C                     MVR            C       20
     C           L         SUB  4         P       20
     C           P         IFLE 0
     C                     Z-ADD1         P
     C                     END
     C           P         IFGT 17
     C                     Z-ADD17        P
     C                     END
     C                     MOVE KB,P      KBAN
     C                     MOVE KBN1      PKBN1   3
     C                     MOVE KBN2      PKBN2   1
     C                     MOVE KT,P      PKOTE   3
     C                     MOVE KG,P      PKGUN   3
     C                     MOVE KS,P      SISAN
     C                     MOVE KE,P      PKEIS  10
     C                     MOVE SYS1      PSYS1   4
     C                     MOVE SYS2      PSYS2   4
     C                     MOVE CS,P      COSTO
     C                     MOVE COS1      PCOS1
     C                     MOVE COS2      PCOS2
     C                     MOVE COS3      PCOS3
     C                     SETON                     LR
     C                     RETRN
