     H            Y.
     F** DGAR21 ********************************************
     F*  AS400 MENU INQ BY PROGRAM ID                      *
     F*  J.WATANABE  2025.04.28                            *
     F******************************************************
     FDGAPW21 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN   KSFILE SFL01
     FEGBPL11 IF  E           K        DISK
      *
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
     I           SDS
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *****************************************************
      * MAIN ROUTINE                                      *
      *****************************************************
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT
     C           @STEP     CASEQ'#CTL01  '#CTL01
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C*  INITIAL SET
     C*===============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $USER  10
      *
     C           $USER     IFEQ *BLANK
     C                     MOVEL#USER     KUSER  10
     C                     ELSE
     C                     MOVEL$USER     KUSER
     C                     ENDIF
      * GET USER NAME
     C                     MOVELKUSER     D1USR
     C                     MOVELKUSER     $USER
     C                     CALL 'UTLR31'
     C                     PARM           $USER  10
     C                     PARM           $NAME  15
     C                     MOVEL$NAME     D1NAM
      * SET SFL01
     C                     MOVE *BLANK    D1PGM
     C                     EXSR #SFL01
      *
     C           RRN       IFEQ 0
     C                     MOVE '#END    '@STEP
     C                     ELSE
     C                     MOVE '#CTL01  '@STEP
     C                     ENDIF
     C                     ENDSR
     C*===============================================================
      *  DISPLAY SREEN
     C*===============================================================
     C           #CTL01    BEGSR
     C                     SETON                     71
     C                     WRITEDSP99
     C                     EXFMTCTL01
     C                     SETOF                     71
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD$$RRN     DSPRRN
      *
     C                     SELEC
      * F3: END
     C           *INKA     WHEQ *ON
     C           *INKC     OREQ *ON
     C           *INKL     OREQ *ON
     C                     MOVE '#END    '@STEP
      * ENTER
     C                     OTHER
     C           D1PGM     IFEQ SVPGM
     C                     ELSE
     C                     EXSR #SFL01
     C           RRN       IFEQ 0
     C                     MOVE *BLANK    S1OPT
     C                     MOVE *BLANK    S1PGM
     C                     MOVEL'NO DATA!'S1TXT     P
     C                     ADD  1         RRN
     C                     WRITESFL01
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
     C*===============================================================
      * SET SFL01
     C*===============================================================
     C           #SFL01    BEGSR
     C* CLEAR SFL01
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
     C                     Z-ADD0         RRN     40
      *
     C           KUSER     SETLLEGBPL11
     C                     DO   *HIVAL
     C           KUSER     READEEGBPL11                  98
     C   98                LEAVE
      * SELECT
     C           M1SKJY    IFEQ 'D'
     C           M1PGMN    OREQ ' '
     C           M1PGMN    ORLT D1PGM
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELM1PGMN    S1PGM
     C                     MOVELM1MNNO    S1OPT
     C                     MOVE M1MNDN    S1OPT
     C                     MOVELM1TEXT    S1TXT
      *
     C                     ADD  1         RRN
     C                     WRITESFL01
     C                     ENDDO
      *
     C                     Z-ADD1         DSPRRN
     C                     MOVELD1PGM     SVPGM   6
      *
     C                     ENDSR
