     H            Y.
     F** DGAR00 ************************************
     F* ..WORK STATION NO OUTQ-NAME INPUT .. *
     F* I-HASADA                     87.11.20      *
     F************************************ DGAR00 **
     FAJEPL01 IF  E           K        DISK
     I            DS
     I                                        1  10 UWS
     I                                        1   2 UKEY
     I                                        1   1 UKEY1
     C           *ENTRY    PLIST
     C                     PARM           WSID   10
     C                     PARM           PRT     7
     C                     MOVE WSID      UWS
     C/SPACE 1
     C           KPARM     PLIST
     C                     PARM           PKINO   1
     C/SPACE 1
     C           KEY1      KLIST
     C                     KFLD           PKINO
     C                     KFLD           UKEY
     C/SPACE 1
     C                     CALL 'AJEC06'  KPARM
     C/SPACE 1
     C                     SETOF                     01
     C           KEY1      CHAINAJEPL011             01
     C           *IN01     IFEQ '0'
     C                     MOVE H4SPLF    PRT
     C                     MOVE H4WSTY    WTYPE   1
     C                     ELSE
     C/SPACE 1
     C           PKINO     IFEQ '1'
     C                     MOVE 'QPRINT ' PRT
     C                     MOVE 'G'       WTYPE
     C                     ELSE
     C                     MOVE 'QPRINTJ' PRT
     C                     MOVE 'G'       WTYPE
     C                     END
     C                     END
     C/SPACE 1
     C                     CALL 'AJEC10'
     C                     PARM           WTYPE
     C                     SETON                     LR
     C                     RETRN
