     H            Y
     F**AJSR1Z ********************************************************
     F*<IN>品番＋手配番号＋発行日--> <OUT>計量日＋計量時刻        *
     F*                                                               *
     F*  14.06.23 KIRI                                                *
     F*****************************************************************
      * JC UNLOADING                    RESULTS FILES. *
     FAJHPL26 IF  E           K        DISK                           UC
      *===============================================================
     I****************************
     I*プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     **かんばん発行日
     I            DS
     I                                        1   80W$HTHZ
     I                                        1   40W$HTYY
     I                                        5   60W$HTMM
     I                                        7   80W$HTDD
     **計量日
     I            DS
     I                                        1   80JDKEHZ
     I                                        1   40JDKEIY
     I                                        5   60JDKEIM
     I                                        7   80JDKEID
     **計量時刻
     I            DS
     I                                        1   60JDKETM
     I                                        1   20JDKEIJ
     I                                        3   40JDKEIF
     I                                        5   60JDKEIB
     **
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
      *===============================================================
     C           *ENTRY    PLIST
     C*                                IN ------
     C                     PARM           P@HIN1  5        PART NUMBER 1
     C                     PARM           P@HIN2  5        PART NUMBER 2
     C                     PARM           P@HIN3  2        PART NUMBER 3
     C                     PARM           P@THAI  3        PRODUCTION ORDER
     C                     PARM           P@HTHZ  80       KANBAN PUBLICATION
     C*                               OUT ------
     C                     PARM           P@KEHZ  80       WEIGHING DATE
     C                     PARM           P@KETM  60       WEIGHING TIME
     C                     PARM           P#OPN   1
     C*------------------------*
     C*   KLIST の作成       *
     C*------------------------*
      *
     C           P#OPN     IFEQ '9'
     C           OPNFL     IFEQ '1'
     C                     CLOSEAJHPL26
     C                     ENDIF
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
     C           OPNFL     IFEQ *BLANK
     C                     MOVEL'1'       OPNFL   1
     C                     OPEN AJHPL26
     C                     ENDIF
     C           #KEY1     KLIST
     C                     KFLD           P@HIN1  5        PART NUMBER 1
     C                     KFLD           P@HIN2  5        PART NUMBER 2
     C                     KFLD           P@HIN3  2        PART NUMBER 3
     C                     KFLD           P@THAI  3        PRODUCTION ORDER
     C                     KFLD           W$HTYY  40       KANBAN PUBLICATION Y
     C                     KFLD           W$HTMM  20       KANBAN PUBLICATION M
     C                     KFLD           W$HTDD  20       KANBAN PUBLICATION D
     C           #KEY11    KLIST
     C                     KFLD           P@HIN1  5        PART NUMBER 1
     C                     KFLD           P@HIN2  5        PART NUMBER 2
     C                     KFLD           P@HIN3  2        PART NUMBER 3
     C                     KFLD           P@THAI  3        PRODUCTION ORDER
      *===============================================================
     C                     Z-ADDP@HTHZ    W$HTHZ           KANBAN PUBLICATION
     C                     Z-ADD0         P@KEHZ  80       WEIGHING DATE
     C                     Z-ADD0         P@KETM  60       WEIGHING TIME
     C           #KEY1     SETLLAJHPL26
     C*
     C           #KEY11    READEAJHPL26                  90
     C*
     C           *IN90     IFEQ *OFF
     C                     Z-ADDJDKEHZ    P@KEHZ  80       WEIGHING DATE
     C                     Z-ADD0         JDKEIB
     C                     Z-ADDJDKETM    P@KETM  60       WEIGHING TIME
     C                     ENDIF
     C*
     C********             SETON                     LR
     C                     RETRN
      *===============================================================
