     H            Y
     F** ALCRS2 *******************************************************
     F*                                                               *
     F*                                                               *
     F*  19.02.06
     F*****************************************************************
     FALCPL06 IF  E           K        DISK                           UC
      *
      *
     I              'SRT            '     C         @SRT
     I              'SHIPPING       '     C         @SHIP
      *
     C           *ENTRY    PLIST
     C*                                IN ------
     C                     PARM           P@CHYU  1
     C                     PARM           P@ZETI  4
     C                     PARM           P@PAGE  3
     C                     PARM           P@HTHZ  80       KANBAN PUBLICATION
     C*                               OUT ------
     C                     PARM           P@FLG   1
     C                     PARM           P#OPN   1
      *
     C           P#OPN     IFEQ '9'
     C           OPNFL     IFEQ '1'
     C                     CLOSEALCPL06
     C                     ENDIF
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
     C           OPNFL     IFEQ *BLANK
     C                     MOVEL'1'       OPNFL   1
     C                     OPEN ALCPL06
     C                     ENDIF
     C*
     C                     MOVE P@CHYU    K@CHYU
     C                     MOVE P@ZETI    K@ZETI
     C                     MOVE P@PAGE    K@PAGE
     C*
     C                     MOVE *BLANK    P@FLG   1
     C*
     C           ALCKEY    KLIST
     C                     KFLD           K@CHYU  1
     C                     KFLD           K@ZETI  4
     C                     KFLD           K@PAGE  3
     C*
     C           ALCKEY    SETGTALCPL06
      *-------------------------
      *-------------------------
     C                     DO   *HIVAL
     C           ALCKEY    REDPEALCPL06                  88
     C   88                LEAVE
     C           A8DATE    IFLT P@HTHZ
     C                     LEAVE
     C                     END
     C*
     C           A8ERR     IFEQ 'E'
     C                     ITER
     C                     ENDIF
     C*
     C           A8BRC2    IFEQ @SRT
     C           A8BRC2    OREQ @SHIP
     C                     ITER
     C                     ENDIF
     C           A8BRC3    IFNE *BLANK
     C                     ITER
     C                     ENDIF
     C*
     C                     MOVE '*'       P@FLG
     C                     LEAVE
     C                     ENDDO
      *-------------------------
      *-------------------------
     C*
     C*********            SETON                     LR
     C                     RETRN
