     H            Y.
     F*** EACR51 *************************
     F* HOSHINO STEEL MACHINE LABEL PUBLICATION *
     F* A:N.HAYAKAWA 83.01.19 *
     F*************** COPY FROM EACR50 ***
     FDACWP12 IP  F     200            DISK
     FFCEPL01 IF  E           K        DISK
     FEAEPL60 IF  E           K        DISK
     FEACPR51 O   E             50     PRINTER                        UC
     E                    HHIN        2 11               ﾍ]ﾌﾞ]
     E                    HMEI        2 20               ﾍ]xb
     E                    SYUY        2  5 0             ﾆｬcﾑcﾇc
     E                    HTKR        2  9               nﾃﾜﾌﾞ]k
     E                    HNBN        2  7               ﾉcﾌﾞ]
     IDACWP12 AA  01
     I                                        3   60ATOKU
     I                                        7   7 ATKOJ
     I                                        8  11 ATUKE
     I                                       12  150ANONY
     I                                       16  16 ANKOJ
     I                                       17  17 ANUK1
     I                                       17  20 ANUKE
     I                                       21  25 ASHN1
     I                                       26  30 ASHN2
     I                                       31  32 ASHN3
     I                                       33  42 AMHIN
     I                                       33  37 AMHN1
     I                                       38  42 AMHN2
     I                                       43  47 AMHN3
     I                                       65  71 ANBAN
     I                                    P  72  750ASRYO
     I                                      102 1050ANOMD
     I                                      102 1030ANOMM
     I                                      104 1050ANODD
     I                                      121 140 AHMEI
     I                                      172 177 ATKRO
     I            DS
     I                                        1  22 HHIN
     I                                        1  11 HHIN1
     I                                        6   6 H1
     I                                       12  22 HHIN2
     I                                       17  17 H3
     I            DS
     I                                        1  40 HMEI
     I                                        1  20 HMEI1
     I                                       21  40 HMEI2
     I            DS
     I                                        1  100SYUY
     I                                        1   50SYUY1
     I                                        6  100SYUY2
     I            DS
     I                                        1  18 HTKR
     I                                        1   9 HTKR1
     I                                        2   2 H5
     I                                        5   5 H6
     I                                        8   8 H7
     I                                       10  18 HTKR2
     I                                       11  11 H8
     I                                       14  14 H9
     I                                       17  17 H0
     I            DS
     I                                        1  14 HNBN
     I                                        1   7 HNBN1
     I                                        8  14 HNBN2
     I            DS
     I                                        1   80A2SKHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   9 A2KTRO
     I                                        1   1 A2KTRK
     I                                        2   2 T0
     I                                        3   4 A2KTRT
     I                                        5   5 T1
     I                                        6   7 A2KTRR
     I                                        8   8 T2
     I                                        9   9 A2KTRD
     I            DS
     I                                        1   9 A2STRO
     I                                        1   1 A2STRK
     I                                        2   2 T3
     I                                        3   4 A2STRT
     I                                        5   5 T4
     I                                        6   7 A2STRR
     I                                        8   8 T5
     I                                        9   9 A2STRD
     I            DS
     I                                        1  11 CMHIN
     I                                        1   5 CMHN1
     I                                        6   6 T6
     I                                        7  11 CMHN2
     I            DS
     I                                        1  10 BMHIN
     I                                        1   5 BMHN1
     I                                        6  10 BMHN2
     I            DS
     I                                        1   7 BBB
     I                                        1   1 B1
     I                                        2   2 B2
     I                                        3   3 B3
     I                                        4   4 B4
     I                                        5   5 B5
     I                                        6   6 B6
     I                                        7   7 B7
      *梱包番地*
     I            DS
     I                                        1   9 EBBANC
     I                                        1   1 EBBAN1
     I                                        2   2 T7
     I                                        3   4 EBBAN2
     I                                        5   5 T8
     I                                        6   7 EBBAN3
     I                                        8   8 T9
     I                                        9   9 EBBAN4
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     C/SPACE 1
     C                     SETON                     60
     C           *IN10     IFEQ '0'
     C                     SETON                     1020
     C                     Z-ADD0         B       20
     C                     EXSR SUB1
     C                     END
     C           ANONY     IFNE 4154
     C                     GOTO END
     C                     END
     C           ANKOJ     IFNE '1'
     C                     GOTO END
     C                     END
     C           ANUKE     IFNE '00  '
     C                     GOTO END
     C                     END
     C/SPACE 1
     C**  ﾎﾞﾍ]uﾇjｰ ･ﾑ]mﾞ ﾆﾞｬcﾒｭc.ﾍ]xb.nﾃﾜﾌﾞ]k ･ y[c  **
     C                     SETOF                     30
     C           KEY1      KLIST
     C                     KFLD           ASHN1
     C                     KFLD           ASHN2
     C                     KFLD           ASHN3
     C           KEY1      CHAINFCEPL011             30
     C   30                GOTO END
     C           A2GSKD    IFEQ 'D'
     C           A2SKHZ    ANDLEUDATE
     C                     GOTO END
     C                     END
      *収容数入力*
     C           A2SYHZ    IFGT UDATE
     C                     Z-ADDA2KSYS    WSYUYO  50
     C                     ELSE
     C                     Z-ADDA2SSYS    WSYUYO
     C                     END
     C*
     C                     Z-ADDANOMM     ANOM1   20
     C                     Z-ADDANOMM     ANOM2   20
     C                     Z-ADDANODD     ANOD1   20
     C                     Z-ADDANODD     ANOD2   20
     C                     ADD  1         B
     C                     Z-ADDWSYUYO    SYUY,B
     C                     MOVE AMHIN     BMHIN
     C                     MOVE BMHN1     CMHN1
     C                     MOVE BMHN2     CMHN2
     C                     MOVE CMHIN     HHIN,B
     C                     MOVE ANBAN     HNBN,B
      *荷姿条件マスター*
     C           KEY2      KLIST
     C                     KFLD           ATOKU
     C                     KFLD           ANONY
     C                     KFLD           ANKOJ
     C                     KFLD           ANUKE
     C                     KFLD           AMHN1
     C                     KFLD           AMHN2
     C                     KFLD           AMHN3
      *
     C                     SETOF                     31
     C           KEY2      CHAINEAEPL601             31
     C           *IN31     IFEQ '0'
     C           EBSKJY    IFEQ 'D'
     C           EBSKHZ    ANDLEUDATE
     C                     SETON                     31
     C                     END
     C                     END
      *
     C           *IN31     IFEQ '0'
     C           EBBANC    ANDNE*BLANK
     C                     MOVE EBBANC    HTKR,B
     C                     ELSE
     C           A2TRHZ    IFGT UDATE
     C                     MOVE A2KTRO    HTKR,B
     C                     ELSE
     C                     MOVE A2STRO    HTKR,B
     C                     END
     C                     END
      *
     C**部品マスター品名から受注データ品名に変更**93.02.25 MURAKAMI
     C                     MOVELAHMEI     HMEI,B
     C/SPACE 1
     C**  ﾌｮﾃcubﾇc ﾉ ibﾅ]  **
     C                     SETOF                     40
     C                     Z-ADD0         CCC     50
     C                     Z-ADD0         DDD     50
     C                     Z-ADDASRYO     BSRYO   70
     C           BSRYO     DIV  SYUY,B    CCC
     C                     MVR            DDD
     C           DDD       IFNE 0
     C                     SETON                     40
     C                     ADD  1         CCC
     C                     END
     C/SPACE 1
     C           *IN90     IFEQ '0'
     C                     OPEN EACPR51
     C                     SETON                     90
     C                     END
     C/SPACE 1
     C           CCC       IFEQ 0
     C                     GOTO END
     C                     END
     C           CCC       DIV  2         EEE     50
     C                     MVR            FFF     50
     C                     SETOF                     414243
     C                     Z-ADDWSYUYO    SYUY,1
     C                     Z-ADDWSYUYO    SYUY,2
     C                     MOVE CMHIN     HHIN,1
     C                     MOVE CMHIN     HHIN,2
     C                     MOVE ANBAN     HNBN,1
     C                     MOVE ANBAN     HNBN,2
      *
     C           *IN31     IFEQ '0'
     C           EBBANC    ANDNE*BLANK
     C                     MOVE EBBANC    HTKR,1
     C                     ELSE
     C           A2TRHZ    IFGT UDATE
     C                     MOVE A2KTRO    HTKR,1
     C                     ELSE
     C                     MOVE A2STRO    HTKR,1
     C                     END
     C                     END
      *
     C                     MOVE HTKR,1    HTKR,2
     C                     MOVE AHMEI     HMEI,1
     C                     MOVE AHMEI     HMEI,2
     C                     Z-ADD1         HHH     50
      * ubﾇc fc]n
     C                     MOVE '/'       BAR1    1
     C                     MOVE '/'       BAR2    1
     C                     Z-ADDCCC       SMI1    30
     C                     Z-ADDCCC       SMI2    30
     C                     Z-ADD1         TKNT    30
      *
     C           1         DO   EEE       HHH
     C           EEE       IFEQ HHH
     C           FFF       ANDEQ0
     C           *IN,40    ANDEQ'1'
     C                     Z-ADDDDD       SYUY,2
     C                     SETON                     4243
     C                     END
     C                     EXSR SUB3
     C                     Z-ADDTKNT      MI1
     C           1         ADD  MI1       MI2
     C                     ADD  2         TKNT
     C                     WRITEEACPR511
     C                     END
     C           *IN,40    IFEQ '1'
     C           *IN,43    ANDEQ'1'
     C                     SETOF                     40
     C                     END
     C           FFF       IFEQ 0
     C                     Z-ADD0         B
     C                     EXSR SUB1
     C                     GOTO END
     C                     ELSE
     C           *IN,40    IFEQ '1'
     C                     Z-ADDDDD       SYUY,1
     C                     SETON                     41
     C                     END
     C                     SETOF                     60
     C                     Z-ADD0         B
     C                     MOVE *BLANK    HHIN,2
     C                     MOVE *BLANK    HMEI,2
     C                     MOVE *BLANK    HTKR,2
     C                     MOVE *BLANK    HNBN,2
     C                     MOVE *BLANK    SYUY,2
     C                     MOVE *BLANK    BAR2
     C                     Z-ADD0         SMI2
     C                     MOVE '-'       H0
     C                     MOVE '-'       H1
     C                     MOVE '-'       H3
     C                     MOVE '-'       H5
     C                     MOVE '-'       H6
     C                     MOVE '-'       H7
     C                     MOVE '-'       H8
     C                     MOVE '-'       H9
     C                     MOVE '-'       T0
     C                     MOVE '-'       T1
     C                     MOVE '-'       T2
     C                     MOVE '-'       T3
     C                     MOVE '-'       T4
     C                     MOVE '-'       T5
     C                     MOVE '-'       T6
     C                     MOVE '-'       T7
     C                     MOVE '-'       T8
     C                     MOVE '-'       T9
     C                     EXSR SUB3
     C                     Z-ADDTKNT      MI1
     C                     Z-ADD0         MI2
     C                     WRITEEACPR511
     C                     END
     C           END       TAG
     C**  ﾌbﾛl ﾉ hﾒaｰ  **
     C           SUB1      BEGSR
     C                     MOVE *BLANK    HHIN
     C                     MOVE *BLANK    HMEI
     C                     Z-ADD0         SYUY
     C                     MOVE *BLANK    HTKR
     C                     MOVE *BLANK    HNBN
     C                     MOVE '-'       H1
     C                     MOVE '-'       H3
     C                     MOVE '-'       H5
     C                     MOVE '-'       H6
     C                     MOVE '-'       H7
     C                     MOVE '-'       H8
     C                     MOVE '-'       H9
     C                     MOVE '-'       H0
     C                     MOVE '-'       T0
     C                     MOVE '-'       T1
     C                     MOVE '-'       T2
     C                     MOVE '-'       T3
     C                     MOVE '-'       T4
     C                     MOVE '-'       T5
     C                     MOVE '-'       T6
     C                     MOVE '-'       T7
     C                     MOVE '-'       T8
     C                     MOVE '-'       T9
     C                     ENDSR
     C/SPACE 1
     C**  ﾍ]ﾌﾞ] hgﾞﾒ b]ﾅl  **
     C           SUB3      BEGSR
     C           *IN77     IFEQ '1'
     C           KGHN      IFNE HHIN1
     C           KGNO      ORNE HNBN1
     C                     MOVE *ALL'*'   BODA  100
     C                     ELSE
     C                     MOVE *BLANK    BODA
     C                     END
     C                     END
     C                     MOVE HHIN1     KGHN   11
     C                     MOVE HNBN1     KGNO    7
     C                     SETON                     77
     C                     ENDSR
