     H            Y.
     F*** EACR54 *************************
     F* PUBLICATION OF ISUZU LABEL(HIGASHIOOGIJIMA)
     F*        K.OKAHI 96.09.23 *
     F************************* EACR54 ***
     FDACWP12 IP  F     200            DISK
     FFCEPL01 IF  E           K        DISK
     FEAEPL60 IF  E           K        DISK
     FEACPR50 O   E             50     PRINTER                        UC
     E                    HUKE    1   7  4   HFUK    2 0 cibﾛ - ﾎhﾜbﾒﾇc
     E                    SHIN    1   5 10               社内品番
     E                    HHIN        2 11               ﾍ]ﾌﾞ]
     E                    HMEI        2 20               ﾍ]xb
     E                    HIRI        2  2 0             ﾎhﾜﾉbﾒﾇc
     E                    HJRY        2  8               ﾆﾞｬcﾒｭc
     E                    HTKR        2  9               nﾃﾜﾌﾞ]k
     E                    HNBN        2  7               ﾉcﾌﾞ]
     E                    UKE         2  4               cibﾛ
     E                    XA          2  1               ﾆﾞｬcﾒｭc(ud2ij)
     E                    XB          3  1               ﾆﾞｬcﾒｭc(an3ij)
     IDACWP12 AA  01
     I                                        3   60ATOKU
     I                                        7   7 ATKOJ
     I                                        8  11 ATUKE
     I                                       12  150ANONY
     I                                       16  16 ANKOJ
     I                                       17  17 ANUK1
     I                                       17  20 ANUKE
     I                                       21  30 ASHN
     I                                       21  25 ASHN1
     I                                       26  30 ASHN2
     I                                       31  32 ASHN3
     I                                       33  42 AMHIN
     I                                       33  37 AMHN1
     I                                       38  42 AMHN2
     I                                       43  47 AMHN3
     I                                       65  71 ANBAN
     I                                    P  72  750ASRYO
     I                                      104 1070ANOMD
     I                                      104 1050ANOMM
     I                                      106 1070ANODD
     I                                      121 140 AHMEI
     I                                      172 177 ATKRO
     I            DS
     I                                        1  22 HHIN
     I                                        1  11 HHIN1
     I                                        7   7 H1
     I                                       12  22 HHIN2
     I                                       18  18 H3
     I            DS
     I                                        1  40 HMEI
     I                                        1  20 HMEI1
     I                                       21  40 HMEI2
     I            DS
     I                                        1   40HIRI
     I                                        1   20HIRI1
     I                                        3   40HIRI2
     I            DS
     I                                        1  16 HJRY
     I                                        1   8 HJRY1
     I                                        9  16 HJRY2
     I            DS
     I                                        1  18 HTKR
     I                                        1   9 HTKR1
     I                                        2   2 H5
     I                                        5   5 H6
     I                                        8   8 H7
     I                                       10  18 HTKR2
     I                                       11  11 H8
     I                                       14  14 H9
     I                                       17  17 H0
     I            DS
     I                                        1   8 UKE
     I                                        1   4 UKE1
     I                                        5   8 UKE2
     I            DS
     I                                        1  14 HNBN
     I                                        1   7 HNBN1
     I                                        8  14 HNBN2
     I            DS
     I                                        1   80A2SKHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   9 A2KTRO
     I                                        1   1 A2KTRK
     I                                        2   2 T0
     I                                        3   4 A2KTRT
     I                                        5   5 T1
     I                                        6   7 A2KTRR
     I                                        8   8 T2
     I                                        9   9 A2KTRD
     I            DS
     I                                        1   9 A2STRO
     I                                        1   1 A2STRK
     I                                        2   2 T3
     I                                        3   4 A2STRT
     I                                        5   5 T4
     I                                        6   7 A2STRR
     I                                        8   8 T5
     I                                        9   9 A2STRD
     I            DS
     I                                        1  11 CMHIN
     I                                        1   6 CMHN1
     I                                        7   7 T6
     I                                        8  11 CMHN2
     I            DS
     I                                        1  10 BMHIN
     I                                        1   6 BMHN1
     I                                        7  10 BMHN2
     I            DS
     I                                        1   7 BBB
     I                                        1   1 B1
     I                                        2   2 B2
     I                                        3   3 B3
     I                                        4   4 B4
     I                                        5   5 B5
     I                                        6   6 B6
     I                                        7   7 B7
     I            DS
     I                                        1   8 XXX
     I                                        1   2 XA
     I                                        1   1 X1
     I                                        2   2 X2
     I                                        3   3 X3
     I                                        4   4 X4
     I                                        5   5 X5
     I                                        6   8 XB
     I                                        6   6 X6
     I                                        7   7 X7
     I                                        8   8 X8
      *梱包番地*
     I            DS
     I                                        1   9 EBBANC
     I                                        1   1 EBBAN1
     I                                        2   2 T7
     I                                        3   4 EBBAN2
     I                                        5   5 T8
     I                                        6   7 EBBAN3
     I                                        8   8 T9
     I                                        9   9 EBBAN4
     C/SPACE 1
     C                     SETON                     60
     C           *IN10     IFEQ '0'
     C                     SETON                     1020
     C                     Z-ADD0         B       20
     C                     EXSR SUB1
     C                     END
     C           ANONY     IFNE 6688
     C                     GOTO END
     C                     END
     C                     SETOF                     30
     C                     Z-ADD1         A       20
     C           ANUKE     LOKUPHUKE,A                   30
     C           *IN30     IFEQ '0'
     C                     GOTO END
     C                     END
     C                     SETOF                     31
     C                     Z-ADD1         Z       20
     C           ASHN      LOKUPSHIN,Z                   31
     C           *IN31     IFEQ '0'
     C                     GOTO END
     C                     END
     C/SPACE 1
     C**  ﾎﾞﾍ]uﾇjｰ ･ﾑ]mﾞ ﾆﾞｬcﾒｭc.ﾍ]xb.nﾃﾜﾌﾞ]k ･ y[c  **
     C                     SETOF                     30
     C           KEY1      KLIST
     C                     KFLD           ASHN1
     C                     KFLD           ASHN2
     C                     KFLD           ASHN3
     C           KEY1      CHAINFCEPL011             30
     C   30                GOTO END
     C           A2GSKD    IFEQ 'D'
     C           A2SKHZ    ANDLE*DATE
     C                     GOTO END
     C                     END
     C/SPACE 1
     C                     Z-ADDANOMM     ANOM1   20
     C                     Z-ADDANOMM     ANOM2   20
     C                     Z-ADDANODD     ANOD1   20
     C                     Z-ADDANODD     ANOD2   20
     C                     ADD  1         B
     C                     Z-ADDHFUK,A    HIRI,B
     C                     MOVE AMHIN     BMHIN
     C                     MOVE BMHN1     CMHN1
     C                     MOVE BMHN2     CMHN2
     C                     MOVE CMHIN     HHIN,B
     C                     MOVE ANBAN     HNBN,B
     C                     MOVE ANUKE     UKE,B
      *荷姿条件マスター*
     C           KEY2      KLIST
     C                     KFLD           ATOKU
     C                     KFLD           ANONY
     C                     KFLD           ANKOJ
     C                     KFLD           ANUKE
     C                     KFLD           AMHN1
     C                     KFLD           AMHN2
     C                     KFLD           AMHN3
      *
     C                     SETOF                     31
     C           KEY2      CHAINEAEPL601             31
     C           *IN31     IFEQ '0'
     C           EBSKJY    IFEQ 'D'
     C           EBSKHZ    ANDLE*DATE
     C                     SETON                     31
     C                     END
     C                     END
      *
     C           *IN31     IFEQ '0'
     C           EBBANC    ANDNE*BLANK
     C                     MOVE EBBANC    HTKR,B
     C                     ELSE
     C           A2TRHZ    IFGT *DATE
     C                     MOVE A2KTRO    HTKR,B
     C                     ELSE
     C                     MOVE A2STRO    HTKR,B
     C                     END
     C                     END
      *
     C                     MOVE A2SMEI    HMEI,B
     C                     EXSR SUB2
     C/SPACE 1
     C**  ﾌｮﾃcubﾇc ﾉ ibﾅ]  **
     C                     SETOF                     40
     C                     Z-ADD0         CCC     50
     C                     Z-ADD0         DDD     50
     C                     Z-ADDASRYO     BSRYO   70
     C           BSRYO     DIV  HIRI,B    CCC
     C                     MVR            DDD
     C           DDD       IFNE 0
     C                     SETON                     40
     C                     ADD  1         CCC
     C                     END
     C/SPACE 1
     C           *IN90     IFEQ '0'
     C                     OPEN EACPR50
     C                     SETON                     90
     C                     END
     C/SPACE 1
     C           CCC       IFEQ 0
     C                     GOTO END
     C                     END
     C           CCC       DIV  2         EEE     50
     C                     MVR            FFF     50
     C                     SETOF                     414243
     C                     Z-ADDHFUK,A    HIRI,1
     C                     Z-ADDHFUK,A    HIRI,2
     C                     MOVE CMHIN     HHIN,1
     C                     MOVE CMHIN     HHIN,2
     C                     MOVE ANBAN     HNBN,1
     C                     MOVE ANBAN     HNBN,2
     C                     MOVE ANUKE     UKE,1
     C                     MOVE ANUKE     UKE,2
      *
     C           *IN31     IFEQ '0'
     C           EBBANC    ANDNE*BLANK
     C                     MOVE EBBANC    HTKR,1
     C                     ELSE
     C           A2TRHZ    IFGT *DATE
     C                     MOVE A2KTRO    HTKR,1
     C                     ELSE
     C                     MOVE A2STRO    HTKR,1
     C                     END
     C                     END
      *
     C                     MOVE HTKR,1    HTKR,2
     C                     MOVE A2SMEI    HMEI,1
     C                     MOVE A2SMEI    HMEI,2
     C                     MOVE XXX       HJRY,1
     C                     MOVE XXX       HJRY,2
     C                     Z-ADD1         HHH     50
      * ubﾇc fc]n
     C                     MOVE '/'       BAR1    1
     C                     MOVE '/'       BAR2    1
     C                     Z-ADDCCC       SMI1    30
     C                     Z-ADDCCC       SMI2    30
     C                     Z-ADD1         TKNT    30
      *
     C           1         DO   EEE       HHH
     C           EEE       IFEQ HHH
     C           FFF       ANDEQ0
     C           *IN,40    ANDEQ'1'
     C                     Z-ADDDDD       HIRI,2
     C                     EXSR SUB2
     C                     SETON                     4243
     C                     END
     C                     EXSR SUB3
     C                     Z-ADDTKNT      MI1
     C           1         ADD  MI1       MI2
     C                     ADD  2         TKNT
     C                     WRITEEACPR501
     C                     END
     C           *IN,40    IFEQ '1'
     C           *IN,43    ANDEQ'1'
     C                     SETOF                     40
     C                     END
     C           FFF       IFEQ 0
     C                     Z-ADD0         B
     C                     EXSR SUB1
     C                     GOTO END
     C                     ELSE
     C           *IN,40    IFEQ '1'
     C                     Z-ADDDDD       HIRI,1
     C                     EXSR SUB2
     C                     SETON                     41
     C                     END
     C                     SETOF                     60
     C                     Z-ADD0         B
     C                     MOVE *BLANK    HHIN,2
     C                     MOVE *BLANK    HMEI,2
     C                     MOVE *BLANK    HTKR,2
     C                     MOVE *BLANK    HNBN,2
     C                     MOVE *BLANK    HIRI,2
     C                     MOVE *BLANK    HJRY,2
     C                     MOVE *BLANK    UKE,2
     C                     MOVE *BLANK    BAR2
     C                     Z-ADD0         SMI2
     C                     MOVE '-'       H0
     C                     MOVE '-'       H1
     C                     MOVE '-'       H3
     C                     MOVE '-'       H5
     C                     MOVE '-'       H6
     C                     MOVE '-'       H7
     C                     MOVE '-'       H8
     C                     MOVE '-'       H9
     C                     MOVE '-'       T0
     C                     MOVE '-'       T1
     C                     MOVE '-'       T2
     C                     MOVE '-'       T3
     C                     MOVE '-'       T4
     C                     MOVE '-'       T5
     C                     MOVE '-'       T6
     C                     MOVE '-'       T7
     C                     MOVE '-'       T8
     C                     MOVE '-'       T9
     C                     MOVE '.'       X4
     C                     EXSR SUB3
     C                     Z-ADDTKNT      MI1
     C                     Z-ADD0         MI2
     C                     WRITEEACPR501
     C                     END
     C           END       TAG
     C**  ﾌbﾛl ﾉ hﾒaｰ  **
     C           SUB1      BEGSR
     C                     MOVE *BLANK    HHIN
     C                     MOVE *BLANK    HMEI
     C                     Z-ADD0         HIRI
     C                     MOVE *BLANK    HJRY
     C                     MOVE *BLANK    HTKR
     C                     MOVE *BLANK    HNBN
     C                     MOVE '-'       H1
     C                     MOVE '-'       H3
     C                     MOVE '-'       H5
     C                     MOVE '-'       H6
     C                     MOVE '-'       H7
     C                     MOVE '-'       H8
     C                     MOVE '-'       H9
     C                     MOVE '-'       H0
     C                     MOVE '-'       T0
     C                     MOVE '-'       T1
     C                     MOVE '-'       T2
     C                     MOVE '-'       T3
     C                     MOVE '-'       T4
     C                     MOVE '-'       T5
     C                     MOVE '-'       T6
     C                     MOVE '-'       T7
     C                     MOVE '-'       T8
     C                     MOVE '-'       T9
     C                     MOVE '.'       X4
     C                     ENDSR
     C/SPACE 1
     C**  ﾆﾞｬcﾒｭc ﾉ ibﾅ] & 0hﾒaｰ  **
     C           SUB2      BEGSR
     C                     Z-ADDA2KASI    AKASI   72
     C           AKASI     DIV  1000      AAA     86
     C           AAA       MULT HIRI,B    GGG     74
     C                     MOVE GGG       BBB
     C                     MOVE B1        X1
     C                     MOVE B2        X2
     C                     MOVE B3        X3
     C                     MOVE B4        X5
     C                     MOVE B5        X6
     C                     MOVE B6        X7
     C                     MOVE B7        X8
     C                     Z-ADD1         O       20
     C           1         DO   2         O
     C           XA,O      IFEQ '0'
     C                     MOVE *BLANK    XA,O
     C                     ELSE
     C                     GOTO STPA
     C                     END
     C                     END
     C           STPA      TAG
     C                     Z-ADD1         O
     C                     Z-ADD4         P       20
     C           1         DO   3         O
     C                     SUB  1         P
     C           XB,P      IFEQ '0'
     C                     MOVE *BLANK    XB,P
     C                     ELSE
     C                     GOTO STPB
     C                     END
     C                     END
     C           STPB      TAG
     C                     MOVE XXX       HJRY,B
     C                     ENDSR
     C/SPACE 1
     C**  ﾍ]ﾌﾞ] hgﾞﾒ b]ﾅl  **
     C           SUB3      BEGSR
     C           *IN77     IFEQ '1'
     C           KGHN      IFNE HHIN1
     C           KGNO      ORNE HNBN1
     C                     MOVE *ALL'*'   BODA  100
     C                     ELSE
     C                     MOVE *BLANK    BODA
     C                     END
     C                     END
     C                     MOVE HHIN1     KGHN   11
     C                     MOVE HNBN1     KGNO    7
     C                     SETON                     77
     C                     ENDSR
**  RECEIVING / NUMBER OF PACKAGEING
W-2330
W-3930
W-4H30
W-9230
W-4630
W-4010
W-4910
**  INTRAL COMPANY PART NO
9513616022
8944017291
8971018650
0911501140
8970884820
