     H            Y.
     F*** EACR52 ***********************************
     F* CREATE LABEL DATA FOR ISUZU(HIGASHIOOGIJIMA)
     F*                                            *
     F* DATE (CODING):1996.07.26          K.OKACHI *
     F*********************************** EACR52 ***
     FDACWP12 IP  F     200            DISK
     FFCEPL01 IF  E           K        DISK
     FEAEPL60 IF  E           K        DISK
     FEACWP52 O   F     100            DISK
     E                    HUKE    1   7  4   HFUK    2 0 cibﾛ - ﾎhﾜbﾒﾇc
     E                    SHIN    1   5 10               社内品番
     E                    XA          2  1               ﾆﾞｬcﾒｭc(ud2ij)
     E                    XB          3  1               ﾆﾞｬcﾒｭc(an3ij)
     E                    WH          8  1
     IDACWP12 AA  01
     I                                        3   60ATOKU
     I                                        7   7 ATKOJ
     I                                        8  11 ATUKE
     I                                       12  150ANONY
     I                                       16  16 ANKOJ
     I                                       17  17 ANUK1
     I                                       17  20 ANUKE
     I                                       21  30 ASHN
     I                                       21  25 ASHN1
     I                                       26  30 ASHN2
     I                                       31  32 ASHN3
     I                                       33  42 AMHIN
     I                                       33  37 AMHN1
     I                                       38  42 AMHN2
     I                                       43  47 AMHN3
     I                                       65  71 ANBAN
     I                                    P  72  750ASRYO
     I                                       85  860ASAMM
     I                                    P  87  890ARENO
     I                                      104 1070ANOMD
     I                                      104 1050ANOMM
     I                                      106 1070ANODD
     I                                      121 140 AHMEI
     I                                      172 177 ATKRO
     I            DS
     I                                        1  11 HHIN
     I                                        1  11 HHIN1
     I                                        7   7 H1
     I            DS
     I                                        1   9 HTKR
     I                                        1   9 HTKR1
     I                                        2   2 H5
     I                                        5   5 H6
     I                                        8   8 H7
     I            DS
     I                                        1   80A2SKHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   9 A2KTRO
     I                                        1   1 A2KTRK
     I                                        2   2 T0
     I                                        3   4 A2KTRT
     I                                        5   5 T1
     I                                        6   7 A2KTRR
     I                                        8   8 T2
     I                                        9   9 A2KTRD
     I            DS
     I                                        1   9 A2STRO
     I                                        1   1 A2STRK
     I                                        2   2 T3
     I                                        3   4 A2STRT
     I                                        5   5 T4
     I                                        6   7 A2STRR
     I                                        8   8 T5
     I                                        9   9 A2STRD
     I            DS
     I                                        1  11 CMHIN
     I                                        1   6 CMHN1
     I                                        7   7 T6
     I                                        8  11 CMHN2
     I            DS
     I                                        1  10 BMHIN
     I                                        1   6 BMHN1
     I                                        7  10 BMHN2
     I            DS
     I                                        1   7 BBB
     I                                        1   1 B1
     I                                        2   2 B2
     I                                        3   3 B3
     I                                        4   4 B4
     I                                        5   5 B5
     I                                        6   6 B6
     I                                        7   7 B7
     I            DS
     I                                        1   8 XXX
     I                                        1   2 XA
     I                                        1   1 X1
     I                                        2   2 X2
     I                                        3   3 X3
     I                                        4   4 X4
     I                                        5   5 X5
     I                                        6   8 XB
     I                                        6   6 X6
     I                                        7   7 X7
     I                                        8   8 X8
      *梱包番地*
     I            DS
     I                                        1   9 EBBANC
     I                                        1   1 EBBAN1
     I                                        2   2 T7
     I                                        3   4 EBBAN2
     I                                        5   5 T8
     I                                        6   7 EBBAN3
     I                                        8   8 T9
     I                                        9   9 EBBAN4
     I            DS
     I                                        1   8 WH
     I                                        1   8 DH
     I            DS
     I                                        1   8 HJRY
     I                                        1   8 HJRY1
     I                                        2   8 HJRY2
     I                                        3   8 HJRY3
     I                                        4   8 HJRY4
     I                                        5   8 HJRY5
     I                                        6   8 HJRY6
     I                                        7   8 HJRY7
     I                                        8   8 HJRY8
     C/SPACE 1
     C                     SETON                     60
     C           *IN10     IFEQ '0'
     C                     SETON                     1020
     C                     EXSR SUB1
     C                     END
     C           ANONY     IFNE 6688
     C                     GOTO END
     C                     END
     C                     SETOF                     30
     C                     Z-ADD1         A       20
     C           ANUKE     LOKUPHUKE,A                   30
     C           *IN30     IFEQ '0'
     C                     GOTO END
     C                     END
     C                     SETOF                     31
     C                     Z-ADD1         Z       20
     C           ASHN      LOKUPSHIN,Z                   31
     C           *IN31     IFEQ '1'
     C                     GOTO END
     C                     END
     C/SPACE 1
     C**  ﾎﾞﾍ]uﾇjｰ ･ﾑ]mﾞ ﾆﾞｬcﾒｭc.ﾍ]xb.nﾃﾜﾌﾞ]k ･ y[c  **
     C                     SETOF                     30
     C           KEY1      KLIST
     C                     KFLD           ASHN1
     C                     KFLD           ASHN2
     C                     KFLD           ASHN3
     C           KEY1      CHAINFCEPL011             30
     C   30                GOTO END
     C           A2GSKD    IFEQ 'D'
     C           A2SKHZ    ANDLE*DATE
     C                     GOTO END
     C                     END
     C/SPACE 1
     C                     Z-ADDARENO     HRENO
     C                     Z-ADDASAMM     HSAMM
     C                     Z-ADDANOMM     ANOM1   20
     C                     Z-ADDANODD     ANOD1   20
     C                     Z-ADDHFUK,A    HIRI    20
     C                     MOVE AMHIN     BMHIN
     C                     MOVE BMHN1     CMHN1
     C                     MOVE BMHN2     CMHN2
     C                     MOVE CMHIN     HHIN   11
     C                     MOVE ANBAN     HNBN    7
     C                     MOVE ANUKE     UKE     4
      *荷姿条件マスター*
     C           KEY2      KLIST
     C                     KFLD           ATOKU
     C                     KFLD           ANONY
     C                     KFLD           ANKOJ
     C                     KFLD           ANUKE
     C                     KFLD           AMHN1
     C                     KFLD           AMHN2
     C                     KFLD           AMHN3
      *
     C                     SETOF                     31
     C           KEY2      CHAINEAEPL601             31
     C           *IN31     IFEQ '0'
     C           EBSKJY    IFEQ 'D'
     C           EBSKHZ    ANDLE*DATE
     C                     SETON                     31
     C                     END
     C                     END
      *
     C           *IN31     IFEQ '0'
     C           EBBANC    ANDNE*BLANK
     C                     MOVE EBBANC    HTKR
     C                     ELSE
     C           A2TRHZ    IFGT *DATE
     C                     MOVE A2KTRO    HTKR
     C                     ELSE
     C                     MOVE A2STRO    HTKR
     C                     END
     C                     END
      *
     C                     MOVELA2SMEI    HMEI   20
     C                     MOVELXXX       HJRY
     C                     EXSR SUB2
     C/SPACE 1
     C**  ﾌｮﾃcubﾇc ﾉ ibﾅ]  **
     C                     SETOF                     40
     C                     MOVE '0'       HKB
     C                     Z-ADD0         HASU    50
     C                     Z-ADD0         CCC     50
     C                     Z-ADD0         DDD     50
     C                     Z-ADDASRYO     BSRYO   70
     C           BSRYO     DIV  HIRI      CCC
     C                     MVR            DDD
     C           DDD       IFNE 0
     C                     SETON                     40
     C                     MOVE '1'       HKB     1
     C                     Z-ADDDDD       HASU
     C                     ADD  1         CCC
     C                     END
     C                     Z-ADDCCC       SMI     30
      *********
     C                     MOVE HJRY      DH
     C                     MOVE *BLANK    WHJRY   8
     C                     Z-ADD1         X       10
     C                     Z-ADD2         Y       10
     C           HJRY      IFEQ *BLANK
     C                     MOVELHJRY      WHJRY
     C                     ELSE
     C                     DO   8         X
     C           WH,X      IFNE *BLANK
     C           X         IFEQ 1
     C                     MOVELHJRY      WHJRY
     C                     GOTO ETAG
     C                     END
     C           X         IFEQ 2
     C                     MOVELHJRY2     WHJRY
     C                     GOTO ETAG
     C                     END
     C           X         IFEQ 3
     C                     MOVELHJRY3     WHJRY
     C                     GOTO ETAG
     C                     END
     C           X         IFEQ 4
     C                     MOVELHJRY4     WHJRY
     C                     GOTO ETAG
     C                     END
     C           X         IFEQ 5
     C                     MOVELHJRY5     WHJRY
     C                     GOTO ETAG
     C                     END
     C           X         IFEQ 6
     C                     MOVELHJRY6     WHJRY
     C                     GOTO ETAG
     C                     END
     C           X         IFEQ 7
     C                     MOVELHJRY7     WHJRY
     C                     GOTO ETAG
     C                     END
     C           X         IFEQ 8
     C                     MOVELHJRY8     WHJRY
     C                     GOTO ETAG
     C                     END
     C                     END
     C                     ENDDO
     C                     END
     C           ETAG      TAG
     C                     EXCPTDT
     C           END       TAG
     C**  ﾌbﾛl ﾉ hﾒaｰ  **
     C           SUB1      BEGSR
     C                     Z-ADD0         HRENO   50
     C                     Z-ADD0         HSAMM   20
     C                     MOVE *BLANK    HHIN
     C                     MOVE *BLANK    HMEI
     C                     Z-ADD0         HIRI
     C                     MOVE *BLANK    HJRY
     C                     MOVE *BLANK    HTKR
     C                     MOVE *BLANK    HNBN
     C                     MOVE *BLANK    SMI     30
     C                     MOVE '-'       H1
     C                     MOVE '-'       H5
     C                     MOVE '-'       H6
     C                     MOVE '-'       H7
     C                     MOVE '-'       T0
     C                     MOVE '-'       T1
     C                     MOVE '-'       T2
     C                     MOVE '-'       T3
     C                     MOVE '-'       T4
     C                     MOVE '-'       T5
     C                     MOVE '-'       T6
     C                     MOVE '-'       T7
     C                     MOVE '-'       T8
     C                     MOVE '-'       T9
     C                     MOVE '.'       X4
     C                     ENDSR
     C/SPACE 1
     C**  ﾆﾞｬcﾒｭc ﾉ ibﾅ] & 0hﾒaｰ  **
     C           SUB2      BEGSR
     C                     Z-ADDA2KASI    AKASI   72
     C           AKASI     DIV  1000      AAA     86
     C           AAA       MULT HIRI      GGG     74
     C                     MOVE GGG       BBB
     C                     MOVE B1        X1
     C                     MOVE B2        X2
     C                     MOVE B3        X3
     C                     MOVE B4        X5
     C                     MOVE B5        X6
     C                     MOVE B6        X7
     C                     MOVE B7        X8
     C                     Z-ADD1         O       20
     C           1         DO   2         O
     C           XA,O      IFEQ '0'
     C                     MOVE *BLANK    XA,O
     C                     ELSE
     C                     GOTO STPA
     C                     END
     C                     END
     C           STPA      TAG
     C                     Z-ADD1         O
     C                     Z-ADD4         P       20
     C           1         DO   3         O
     C                     SUB  1         P
     C           XB,P      IFEQ '0'
     C                     MOVE *BLANK    XB,P
     C                     ELSE
     C                     GOTO STPB
     C                     END
     C                     END
     C           STPB      TAG
     C                     MOVELXXX       HJRY    8
     C                     ENDSR
     OEACWP52 E                DT
     O                         HSAMM      2
     O                         HRENO      7
     O                         HHIN      18
     O                         HMEI      38
     O                         HIRI      40
     O                         WHJRY     48
     O                         SMI   Z   51
     O                         HTKR      60
     O                         HNBN      67
     O                         UKE       71
     O                         HKB       72
     O                         HASU  Z   77
     O                         ANOM1 Z   79
     O                                   80 '.'
     O                         ANOD1 Z   82
**  RECEIVING /IF CHANGE NUMBER OF PACKAGE, IT CHANGES LABEL PUBLICATION SYSTEM
W-2330
W-3930
W-4H30
W-9230
W-4630
W-4010
W-4910
**  INTRAL COMPANY PART NO
9513616022
8944017291
8971018650
0911501140
8970884820
