     H            Y.
     F** EADR25 **********************************
     F*  UNDELIVERED ANALYSIS LIST BY USER FACTORY *
     F* PROGRAM ID. : EADR25. <RPG> *
     F* CREATE DATE. : MAR.02,'88.               *
     F* AUTHOR.         : G.B.C. <E.KAWASHIMA> *
     F********************************** EADR25 **
     FEADWP26 IP  F     200            DISK
     FAGDPL11 IF  E           K        DISK
     FAB#PL03 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    HNB       500 12               ﾍ]ﾌﾞ] m]ﾇc
     IEADWP26 AA  01
     I                                        1   40@NONY L3
     I                                        5  19 @KONM L2
     I                                       20  35 @NONM
     I                                       36  39 @NUKE L1
     I                                       40  51 @HINB L1
     I                                       40  44 @HIN1
     I                                       45  49 @HIN2
     I                                       50  51 @HIN3
     I                                       52  590@MIHZXL1
     I                                       54  590@MIHZ L1
     I                                       52  550@MIYY
     I                                       56  570@MIMM
     I                                       58  590@MIDD
     I                                       60  630@MMIS
     I                                       64  680@SYOS
     I                                       69  710@STEI
     I                                       72  770NYMD1
     I                                       78  830NYMD2
     I                                       84  890NYMD3
     I                                       90  980NAISU1
     I                                       99 1070NAISU2
     I                                      108 1160NAISU3
     I                                      117 125 BNCHI
     I                                      126 1280XXX1
     I                                      129 1310XXX2
     I                                      132 1340XXX3
     I                                      135 1420@STHZ
     I                                      143 1500@ENHZ
     I            DS
     I                                        1  14 #HIN
     I                                        1   5 @HIN1
     I                                        6   6 #HINA
     I                                        7  11 @HIN2
     I                                       12  12 #HINB
     I                                       13  14 @HIN3
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     C           KEY1      KLIST
     C                     KFLD           @MIYY
     C                     KFLD           @MIMM
     C                     KFLD           @MIDD
     C/SPACE 1
     C           KEY2      KLIST
     C                     KFLD           @HIN1
     C                     KFLD           @HIN2
     C                     KFLD           @HIN3
     C/SPACE 1
     C  N01                GOTO @END
     C/SPACE 1
     C           *INL3     IFEQ '1'
     C                     Z-ADD0         X       30
     C                     MOVE *BLANK    HNB
     C                     END
     C/SPACE 1
     C           *INL2     IFEQ '1'
     C                     MOVE *BLANK    XXKNM
     C                     MOVE *BLANK    XXHIN
     C                     MOVE *BLANK    PPHIN
     C                     END
     C/SPACE 1
     C           *INOF     IFEQ '1'
     C                     MOVE *BLANK    XXKNM
     C                     MOVE *BLANK    XXHIN
     C                     END
     C/SPACE 1
     C                     TIME           WTIME   60
     C                     ADD  1         TRECD   40
     C                     ADD  1         LRECD   40
     C                     ADD  @MMIS     WMAIS   40
     C                     ADD  @MMIS     TMAIS   40
     C                     ADD  @MMIS     LMAIS   40
     C/SPACE 1
     C           @END      TAG
     C/SPACE 1
     CL1                   EXSR SUB
     C/SPACE 1
     C           SUB       BEGSR
     C/SPACE 1
     C                     MOVE *BLANK    #HINA
     C                     MOVE *BLANK    #HINB
     C           @HIN2     IFNE *BLANK
     C                     MOVEL'-'       #HINA
     C                     END
     C           @HIN3     IFNE *BLANK
     C                     MOVEL'-'       #HINB
     C                     END
     C/SPACE 1
     C                     SETOF                     1112
     C           @KONM     IFNE XXKNM
     C                     SETON                     11
     C                     MOVE @KONM     XXKNM  15
     C                     END
     C           @HINB     IFNE XXHIN
     C                     SETON                     12
     C                     MOVE @HINB     XXHIN  12
     C                     END
     C/SPACE 1
     C           @HINB     IFNE PPHIN
     C                     MOVE @HINB     PPHIN  12
     C                     ADD  1         THRED   40
     C                     SETOF                     10
     C                     Z-ADD1         Y       30
     C           @HINB     LOKUPHNB,Y                    10
     C           *IN10     IFEQ '0'
     C                     ADD  1         X
     C                     ADD  1         LHRED   40
     C                     MOVE @HINB     HNB,X
     C                     END
     C                     END
     C/SPACE 1
     C*
     C*  10 f ud / fnﾞcﾍﾞ
     C*
     C/SPACE 1
     C           KEY1      SETLLAGDPL111
     C                     Z-ADD0         CNT     20
     C                     Z-ADD0         WYMD    80
     C                     DO   10        I       20
     C                     SETOF                     10
     C                     READPAGDPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDF8KAHZ    WYMD
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
     C                     ADD  1         CNT
     C                     END
     C                     END
     C  N10                END
     C/SPACE 1
     C*
     C*  c ﾆﾞｮﾈgﾇc
     C*
     C           KEY2      SETLLAB#PL031
     C                     Z-ADD0         WSRYO
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY2      READEAB#PL031                 10
     C           *IN10     IFEQ '0'
     C           B1SKJY    IFEQ 'D'
     C           B1SKHZ    ANDLE*DATE
     C                     ELSE
     C           B1NOHZ    IFGE WYMD
     C           B1NOHZ    ANDLE@MIHZX
     C                     ADD  B1SRYO    WSRYO   80
     C                     END
     C                     END
     C                     END
     C  N10                END
     C/SPACE 1
     C                     Z-ADD0         WORK    80
     C           CNT       IFNE 0
     C           WSRYO     DIV  CNT       WORK
     C                     END
     C/SPACE 1
     C                     Z-ADD0         WNONU   30
     C           @SYOS     IFNE 0
     C           WORK      DIV  @SYOS     WNONU
     C                     MVR            AMARI   30
     C           AMARI     IFNE 0
     C                     ADD  1         WNONU
     C                     END
     C                     END
     C/SPACE 1
     C                     ENDSR
     OQPRINT  H  103   L3
     O       OR        OFNL3
     O                                    7 'PERIOD'
     O                         @STHZ   +  1 '    /  /  '
     O                                 +  1 '-'
     O                         @ENHZ   +  1 '    /  /  '
     O        H  1     L3
     O       OR        OFNL3
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O        H  2     L3
     O       OR        OFNL3
     O                                   12 'PGM-EADR25'
     O                                   57 '** UNDELIVERED ANALYSIS'
     O                                   81 'LIST BY USER FACTORY **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O        H  1     L3
     O       OR        OFNL3
     O                                   49 'UNDELVD'
     O                                   59 'UNDELVD'
     O                                   76 'ACTUAL UNDELVD'
     O                         NYMD1   +  1 '    .  '
     O                         NYMD2   +  2 '    .  '
     O                         NYMD3   +  2 '    .  '
     O        H  2     L3
     O       OR        OFNL3
     O                                   13 'FACTORY NAME'
     O                                   24 'RCV.'
     O                                   41 'INTRAL CO.PART NO'
     O                                   48 'DATE'
     O                                   59 'SHEETS'
     O                                   73 '10 DAYS'
     O                                   85 'SETTING NBR'
     O                                   98 'P.D.F.'
     O                                  109 'P.D.F.'
     O                                  120 'P.D.F.'
     O                                  132 'CMPLT.LOC.'
     O        H  2     L3
     O       OR        OFNL3
     O                                   10 'USER'
     O                         @NONM     31
     O        T  1     L1
     O                 11      @KONM     19
     O                         @NUKE     25
     O                 12      #HIN      41
     O                         @MIHZ Y   51
     O                         WMAIS 2B  60
     O                 12      WNONU 2   66
     O                 12                74 'BOX/DAY'
     O                 12      @STEI 2   78
     O                 12                86 'BOX/DAY'
     O                 12      NAISU12   97
     O                 12      NAISU22  108
     O                 12      NAISU32  119
     O                 12      BNCHI    130
     O        T  2     L1
     O                 12      XXX1  2   90
     O                 12                98 'BOX/DAY'
     O                 12      XXX2  2  101
     O                 12               109 'BOX/DAY'
     O                 12      XXX3  2  112
     O                 12               120 'BOX/DAY'
     O        T  1     L2 L3
     O       OR  3     L2NL3
     O                                   18 'CNT TTL'
     O                         TRECD 2B  24
     O                                   40 'PART NO CNT'
     O                         THRED 2B  46
     O                                   58 'UNDELVD'
     O                                   76 'SHEETS TTL'
     O                         TMAIS 2B  82
     O        T  3     L3
     O                                   18 'ALL TTL'
     O                         LRECD 2B  24
     O                                   40 'ALL PART NO CNT'
     O                         LHRED 2B  46
     O                                   58 'ALL UNDELVD'
     O                                   76 'SHEETS TTL'
     O                         LMAIS 2B  82
