     H            Y.
     F** EADR21 **********************************
     F* UNDELIVERED ANALYSIS LIST BY UNDELIVERED FREQUENCY <I> *
     F* PROGRAM ID. : EADR21. <RPG> *
     F* CREATE DATE. : FEB.27,'89.               *
     F* AUTHOR.         : E.KAWASHIMA <G.B.C> *
     F********************************** EADR21 **
     FDAGPL03 IF  E           K        DISK
     FEADWP21 O   F     100            DISK
     I            DS
     I                                        1   80E4SKHZ
     I                                        1   40E4SKYY
     I                                        5   60E4SKMM
     I                                        7   80E4SKDD
     I            DS
     I                                        1   80STHZ
     I                                        1   40STYY
     I                                        5   60STMM
     I                                        7   80STDD
     I            DS
     I                                        1   80ENHZ
     I                                        1   40ENYY
     I                                        5   60ENMM
     I                                        7   80ENDD
     I            DS
     I                                        1   80E4MIHZ
     I                                        1   40E4MIYY
     I                                        5   60E4MIMM
     I                                        7   80E4MIDD
     C******************************************************
     C*  START  PROGRAM  <EADR21>                          *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           #STHZ   8
     C                     PARM           #ENHZ   8
     C                     MOVEL#STHZ     STHZ    80
     C                     MOVEL#ENHZ     ENHZ    80
      *
     C           KEYA      KLIST
     C                     KFLD           STYY
     C                     KFLD           STMM
     C                     KFLD           STDD
      *
     C           KEYA      SETLLDAGPL031
     C                     DO   *HIVAL
     C                     READ DAGPL031                 10
      *
     C           *IN,10    IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
      *
     C           *IN,10    IFEQ '0'
     C           E4SKJY    IFEQ 'D'
     C           E4SKHZ    ANDLE*DATE
     C                     GOTO @END
     C                     END
      *
     C           E4MIHZ    IFGT ENHZ
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
      *
     C                     MOVELE4SHN1    @HIN1   5
     C                     MOVELE4SHN2    @HIN2   5
     C                     MOVELE4SHN3    @HIN3   2
     C                     Z-ADD1         @SRY    40
     C                     Z-ADDSTHZ      @STHZ   80
     C                     Z-ADDENHZ      @ENHZ   80
      *
     C                     SETON                     U1
     C                     EXCPTF01
      *
     C                     END
     C           @END      TAG
     C  N10                END
      *
     OEADWP21 E                F01
     O                         @HIN1      5
     O                         @HIN2     10
     O                         @HIN3     12
     O                         @SRY      16
     O                         @STHZ     24
     O                         @ENHZ     32
