     H            Y.
     F** EADR28 ************************************
     F* ..  UNDELIVERED ANALYSIS LIST BY UNDELIVERED FREQUENCY <III>.. *
     F*        I-HASADA            90.02.26        *
     F************************************ EADR28 **
     FEADWP28 IP  F     110            DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TB1     1   8  4 0 TB2    16
     IEADWP28 AA  01
     I                                        1   40ICODO L2
     I                                        5   9 #HIN1
     I                                       10  14 #HIN2
     I                                       15  16 #HIN3
     I                                       17  200#SRY
     I                                       21  36 MKNM
     I                                       37  37 RAIN
     I                                       38  40 KOT@
     I                                       41  56 KOUNM L1
     I                                       57  66 NAME1
     I                                       67  76 NAME2
     I                                       77  86 NAME3
     I                                       87 106 WKNM
     C           *ENTRY    PLIST
     C                     PARM           PHIZ1   8
     C                     PARM           PHIZ2   8
     C                     MOVE PHIZ1     WHIZ1   80
     C                     MOVE PHIZ2     WHIZ2   80
      **
     C                     TIME           WTIME   60
      **
     C           *INL1     IFEQ '1'
     C                     SETOF                     02
     C                     Z-ADD1         A       20
     C                     MOVE *BLANK    WKJNM  16
     C           ICODO     LOKUPTB1,A                    02
     C           *IN02     IFEQ '1'
     C                     MOVE TB2,A     WKJNM
     C                     END
     C                     END
      **
     C                     ADD  #SRY      WSRY    50
     C                     ADD  1         WRECD   50
     C                     ADD  #SRY      TSRY    50
     C                     ADD  1         TRECD   50
     OQPRINT  H  102   L2
     O       OR        OFNL2
     O                                    6 'PERIOD'
     O                         WHIZ1   +  2 '    /  /  '
     O                                 +  1 '-'
     O                         WHIZ2   +  1 '    /  /  '
     O        H  1     L2
     O       OR        OFNL2
     O                                   10 'EADR28-1'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O        H  2     L2
     O       OR        OFNL2
     O                         WKJNM     17
     O                                   47 '** UNDELIVERED ANALYSIS'
     O                                   62 'BY UNDELIVERED'
     O                                   80 'FREQUENCY LIST **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O        H  2     L2
     O       OR        OFNL2
     O                                   14 'INT.CO.PART NO'
     O                                   29 'UNDELVD FRQNCY'
     O                                   43 'PLATING MAKER'
     O                                   49 'LINE'
     O                                   63 'PRECED.PROC.'
     O                                   94 '2 PROCESSING CONTENTS'
     O                                  120 'KANBAN KIND'
     O        H  2     L1
     O       OR        OFNL1
     O                         KOUNM     17
     O        D  1     01
     O                         #HIN1      7
     O                                    8 '-'
     O                         #HIN2     13
     O                                   14 '-'
     O                         #HIN3     16
     O                         #SRY  2   25
     O                         MKNM      44
     O                         RAIN      48
     O                         KOT@      54
     O                                   55 '-'
     O                         KOUNM     71
     O                         NAME1     83
     O                         NAME2     95
     O                         NAME3    107
     O                         WKNM     129
     O        T  1     L1 L2
     O       OR  2     L1NL2
     O                         WSRY  2B  25
     O                                   41 '* SUBTTL CNT'
     O                         WRECD 2B  48
     O        T  2     L1 L2
     O                         TSRY  2B  25
     O                                   41 '***  TTL CNT'
     O                         TRECD 2B  48
**  TB1.TB2
8974ENA FACTORY
8982GIFU FACTORY
9032KANI F1
9040KANI F2
9024GOJYOGAWA FACTRY
8888OGUCHI FACTORY
9999PURCHASE
9431KUMAMOTO FACTORY
