     H            Y.
     F** EADR23 **********************************
     F*  UNDELIVERED ANALYSIS LIST BY UNDELIVERED FREQUENCY <III> *
     F* PROGRAM ID. : EADR23. <RPG> *
     F* CREATE DATE. : FEB.27,'89.               *
     F* AUTHOR.         : E.KAWASHIMA <G.B.C> *
     F********************************** EADR23 **
     FEADWP24 IP  F     100            DISK
     FAAFPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FGCMPL31 IF  E           K        DISK
     FEADWP25 O   F     110            DISK
     FEADWP3X O   F     100            DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    KAK         3  2               fﾃcmbﾑc ..n]rﾓ..
     E                    KOT        15  3               ﾃcmb CD
     E                    BUM        15  4 0             ﾎﾞy] CD
     E                    KTY        15  1               f]ﾌﾞ]ﾆｬﾓb
     E                    TKR        15  6               nﾃﾜ ﾌﾞ]k
     E                    HIZ        15 10 0             ﾍﾇﾞi
     E                    CKKO       15  3               ﾃcmb (NEW)
     E                    CKQK       15  3               ﾃcmb (OLD)
     E                    CKBM       15  4 0             ﾎﾞy] (NEW)
     E                    CKQB       15  4 0             ﾎﾞy] (OLD)
     E                    CKTY       15  1               f]ﾌﾞ] ﾆｬﾓb (NEW)
     E                    CKQS       15  1               f]ﾌﾞ] ﾆｬﾓb (OLD)
     E                    CKNB       15  6               nﾃﾜ ﾌﾞ]k (NEW)
     E                    CKQT       15  6               nﾃﾜ ﾌﾞ]k (OLD)
     E                    CKHZ       15 10 0             gﾒfdﾍﾞ
     E                    HMA       300  4 0             xｮgxｰfｰ
     E                    HMB       300  8 0D            xｮgxｰfｰ
     E                    HM1       300  5               xｮgxｰfｰ
     E                    HM2       300  9  D            xｮgxｰfｰ
     E                    HKA       300  4 0             udﾃcmb
     E                    HKB       300  8 0D            udﾃcmb
     E                    HK1       300  7               udﾃcmb
     E                    HK2       300 11  D            udﾃcmb
     E                    HNA       300  1               f]ﾌﾞ]
     E                    HNB       300  5  D            f]ﾌﾞ]
     E                    HN1       300  2               f]ﾌﾞ]
     E                    HN2       300  6  D            f]ﾌﾞ]
     E                    HTA       300 10               pﾆﾞfﾃc obﾑc
     E                    HTB       300 14  D            pﾆﾞfﾃc obﾑc
     E                    HT1       300 14               pﾆﾞfﾃc obﾑc
     E                    HT2       300 18  D            pﾆﾞfﾃc obﾑc
     E                    TRA         4  1               [b]
     E                    TSU         4  4 0             vﾉc i]ﾇc
     E                    TKT         4  3               ﾃcmb
     E                    TNM         3 10               pﾆﾞfﾃc obﾑc
     E                    TSM         3 16               ﾅbyhxb
     E                    TKA         2 20               f]ﾌﾞ]ﾆｬﾓbxb
     E                    TK1     1  20  1   TK2    20   f]ﾌﾞ]ﾆｬﾓbxb
     E                    TB1     1  22  4 0             fﾞbkｬcxｰfｰ
     E                    TL1     1   2  1   TL2    12
     IEADWP24 NS  01
     I                                        1   5 #HIN1
     I                                        6  10 #HIN2
     I                                       11  12 #HIN3
     I                                       13  160#SRY
     I                                       17  240#STHZ
     I                                       25  320#ENHZ
     I            DS
     I                                        1  45 CKKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  45 CKQK
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600CKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  600CKQB
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  15 CKTY
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  15 CKQS
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I            DS
     I                                        1  90 CKNB
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  90 CKQT
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1 1500CKHZ
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80A3SKHZ
     I                                        1   40A3SKYY
     I                                        5   60A3SKMM
     I                                        7   80A3SKDD
     I            DS
     I                                        1   80O4SKHZ
     I                                        1   40O4SKYY
     I                                        5   60O4SKMM
     I                                        7   80O4SKDD
     I            DS
     I                                        1   80L6SKHZ
     I                                        1   40L6SKYY
     I                                        5   60L6SKMM
     I                                        7   80L6SKDD
     I            DS
     I                                        1   80L5SKHZ
     I                                        1   40L5SKYY
     I                                        5   60L5SKMM
     I                                        7   80L5SKDD
     I            DS
     I                                        1   6 @TKR
     I                                        1   1 @TKR1
     I                                        2   3 @TKR2
     I                                        4   5 @TKR3
     I                                        6   6 @TKR4
     I            DS
     I                                        1  100@HIZ
     I                                        1   40@HIZYY
     I                                        5   60@HIZMM
     I                                        7   80@HIZDD
     I                                        9  100@HIZBB
     I            DS
     I                                        1   80A5SKHZ
     I                                        1   40A5SKYY
     I                                        5   60A5SKMM
     I                                        7   80A5SKDD
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   7 A2MEK
     I                                        1   4 A2MEK1
     I                                        5   6 A2MEK2
     I                                        7   7 A2MEK3
     I            DS
     I                                        1   80HMAKY
     I                                        5   80HMAKCD
     I                                        1   40HMAKSU
     I            DS
     I                                        1   9 HM1KY
     I                                        1   40HM1KSU
     I                                        5   9 H1KY
     I                                        5   80HM1KCD
     I                                        9   9 HM1KRA
     I            DS
     I                                        1   5 KEY
     I                                        1   40MEKA
     I                                        5   5 RAIN
     I            DS
     I                                        1  11 HK1KY
     I                                        1   40HK1KSU
     I                                        5  11 HKYE
     I                                        5   80HK1KCD
     I                                        9  11 HK1KTI
     I            DS
     I                                        1   7 KY
     I                                        1   40KOU
     I                                        5   7 KOT@
     I            DS
     I                                        1   5 HNAKY
     I                                        1   40HNAKSU
     I                                        5   5 HNAKAN
     I            DS
     I                                        1   6 HN1KY
     I                                        1   40HN1KSU
     I                                        5   6 HN1KAN
     I                                        5   5 HN1KAD
     I                                        6   6 HN1KAS
     I            DS
     I                                        1  14 TNAKY
     I                                        1   40TNAKSU
     I                                        5  14 TNATNM
     I            DS
     I                                        1  18 TN1KY
     I                                        1   40TN1KSU
     I                                        5  18 TN1KEY
     I                                        5   80TN1KOU
     I                                        9  18 TN1NAM
     I            DS
     I                                        1   6 KAK
     I                                        1   2 O4KAK1
     I                                        3   4 O4KAK2
     I                                        5   6 O4KAK3
     C  N01                GOTO @END
      **
     C           *IN90     IFEQ '0'
     C           *ENTRY    PLIST
     C                     PARM           PNO     1
     C                     PARM           PGOU1   4
     C                     PARM           PGOU2   4
     C                     PARM           PGOU3   4
     C                     PARM           PSTHZ   8
     C                     PARM           PENHZ   8
      **
     C                     Z-ADD0         TNGOU   40
     C                     Z-ADD0         MGOU    40
     C                     Z-ADD0         @GT1    40
     C                     Z-ADD0         GOUA    40
     C                     Z-ADD0         GOU1    40
     C                     Z-ADD0         GOU2    40
     C                     Z-ADD0         MKSRY   40
     C                     Z-ADD0         TNSRY   40
     C                     MOVEL'1'       *INOF
     C                     MOVEA'1'       *IN,90
     C                     Z-ADD0         CNT     40
     C                     Z-ADD0         HMA
     C                     Z-ADD0         HMB
     C                     MOVE *BLANK    HM1
     C                     MOVE *BLANK    HM2
     C                     Z-ADD0         HKA
     C                     Z-ADD0         HKB
     C                     MOVE *BLANK    HK1
     C                     MOVE *BLANK    HK2
     C                     MOVE *BLANK    TRA
     C                     Z-ADD0         TSU
     C                     MOVE *BLANK    TKT
     C                     Z-ADD0         MKSRY   40       xｮg ﾇcﾒｭc
     C                     Z-ADD0         TNSRY   40       n]rﾓ ﾇcﾒｭc
     C                     Z-ADD0         HSR1    40       ﾈ]ﾆﾞｭcﾍ]
     C                     Z-ADD0         HSR2    40       ﾍgnﾒﾍ]
     C                     Z-ADD0         KSR     40       f]ﾈbﾍ]
      **
     C                     SETOF                     99
     C                     Z-ADD1         LA      10
     C                     MOVE *BLANK    WLSTN  12
     C           PNO       LOKUPTL1,LA                   99
     C           *IN99     IFEQ '1'
     C                     MOVE TL2,LA    WLSTN
     C                     END
     C                     END
      **
     C           *INOF     IFEQ '1'
     C                     MOVE *BLANK    @@@@@   4
     C           #ENHZ     IFNE 0
     C                     MOVEL' -  '    @@@@@
     C                     END
     C                     TIME           TIME    60
     C                     Z-ADD*DATE     DAY     80
     C                     ADD  1         CNT
     C                     EXCPTHED
     C                     MOVEL'0'       *INOF
     C                     END
      **
     C           KEY1      KLIST
     C                     KFLD           #HIN1
     C                     KFLD           #HIN2
     C                     KFLD           #HIN3
      **
     C                     MOVEA'0'       *IN,10
     C           KEY1      CHAINAAMPL111             10
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,10
     C                     END
      **
     C                     MOVE *BLANK    KOT
     C                     Z-ADD0         BUM
     C                     MOVE *BLANK    KTY
     C                     MOVE *BLANK    TKR
     C                     Z-ADD0         HIZ
      **
     C           *IN10     IFEQ '0'
     C                     Z-ADD1         I       20
     C                     Z-ADD0         X       20
     C                     DO   15        I
     C                     MOVELCKHZ,I    Z06     80
     C           *DATE     IFLT Z06
     C           CKQK,I    IFNE *BLANK
     C                     ADD  1         X
     C                     MOVE CKQK,I    KOT,X
     C                     Z-ADDCKQB,I    BUM,X
     C                     MOVE CKQS,I    KTY,X
     C                     MOVE CKQT,I    TKR,X
     C                     Z-ADDCKHZ,I    HIZ,X
     C                     END
     C                     ELSE
      **
     C           CKKO,I    IFNE *BLANK
     C                     ADD  1         X
     C                     MOVE CKKO,I    KOT,X
     C                     Z-ADDCKBM,I    BUM,X
     C                     MOVE CKTY,I    KTY,X
     C                     MOVE CKNB,I    TKR,X
     C                     Z-ADDCKHZ,I    HIZ,X
     C                     END
     C                     END
     C                     END
     C                     END
      **
     C                     MOVE *BLANK    KAN     1
     C                     MOVE *BLANK    KANDS   2
     C                     MOVE *BLANK    @TKR
     C                     Z-ADD0         @HIZ
     C                     Z-ADD16        L       20
     C                     DO   15        K       20
     C           L         SUB  K         P       20
     C           KOT,P     IFNE *BLANK
     C           KTY,P     IFEQ 'C'
     C           KTY,P     OREQ 'D'
     C           KTY,P     OREQ 'E'
     C           KTY,P     OREQ '0'
     C                     MOVELKTY,P     KAN
     C                     MOVE TKR,P     @TKR
     C                     Z-ADDHIZ,P     @HIZ
     C                     GOTO EXIT
     C                     END
     C                     END
     C                     END
      **
     C                     Z-ADD16        L
     C                     DO   15        K
     C           L         SUB  K         P
     C           KOT,P     IFNE *BLANK
     C           KTY,P     IFNE *BLANK
     C                     MOVELKTY,P     KAN
     C                     GOTO EXIT
     C                     END
     C                     END
     C                     END
      **
     C           EXIT      TAG
      **
     C           KEY2      KLIST
     C                     KFLD           @TKR1
     C                     KFLD           @TKR2
     C                     KFLD           @TKR3
     C                     KFLD           @TKR4
     C                     KFLD           @HIZYY
     C                     KFLD           @HIZMM
     C                     KFLD           @HIZDD
     C                     KFLD           @HIZBB
      **
     C                     Z-ADD0         MEKA    40       xｰfｰ CD
     C                     MOVE *BLANK    MKNM   16        xｰfｰ NAME
     C                     MOVE *BLANK    RAIN    1        [b]
     C                     MOVE *BLANK    KOT@    3        ud ﾃcmb CD
     C                     Z-ADD0         KOU     40       ud BMON CD
     C                     Z-ADD0         KBMON   40
     C                     MOVE *BLANK    KOUNM  16        ﾃcmb NAME
     C                     MOVE *BLANK    KAKOU1  2        2ﾆﾞ fﾃc 1
     C                     MOVE *BLANK    KAKOU2  2        2ﾆﾞ fﾃc 2
     C                     MOVE *BLANK    KAKOU3  2        2ﾆﾞ fﾃc 3
     C                     MOVE *BLANK    NAME1  10        2ﾆﾞ fﾃc 1
     C                     MOVE *BLANK    NAME2  10        2ﾆﾞ fﾃc 2
     C                     MOVE *BLANK    NAME3  10        2ﾆﾞ fﾃc 3
     C                     MOVEA'0'       *IN,20
     C                     MOVEA'0'       *IN,30
     C                     MOVEA'0'       *IN,40
     C                     MOVEA'0'       *IN,50
     C                     MOVEA'0'       *IN,60
      **
     C*---------------------------------*
     C*  ..メッキかんばんマスター..   *
     C*---------------------------------*
     C           KAN       IFEQ 'C'
     C           KEY2      CHAINAAFPL031             20
     C           *IN,20    IFEQ '0'
     C           A3SKJY    ANDEQ'D'
     C           A3SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
      **
     C           *IN,20    IFEQ '0'
     C                     Z-ADDA3ATOB    MEKA             xｮg xｰfｰ
     C           MEKA      CHAINFGBPL011             30
     C           *IN,30    IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,30
     C                     END
      **
     C           *IN,30    IFEQ '0'
     C                     MOVELB2SMEI    MKNM
     C                     END
      **
     C                     MOVELA3RAIN    RAIN             [b]
     C                     MOVELA3MAEK    KOT@             ud ﾃcmb CD
     C                     Z-ADDA3MAKB    KOU              ud BMON CD
     C                     MOVELA3KCD1    KANDS
     C                     MOVE A3KCD2    KANDS
     C           KOU       CHAINFGBPL011             40
     C           *IN,40    IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,40
     C                     END
      **
     C           *IN,40    IFEQ '0'
     C                     MOVELB2SMEI    KOUNM
     C                     END
      **
     C                     ADD  #SRY      MKSRY            xｮg ﾇcﾒｭc
     C                     ADD  #SRY      GOU1             ﾃﾞcib
      **
     C                     MOVE 'A'       @MKUM   1
     C                     MOVE '3'       @KOMK   1
     C                     Z-ADD#SRY      @KNS1   40
     C                     Z-ADDA3ATOB    @BMON   40
     C                     Z-ADD#SRY      @KNS2   40
     C                     MOVE *BLANK    @KOTI   3
     C                     Z-ADD0         @KNS3   40
     C                     EXCPTMDT
      **
     C                     END
     C                     END
      **
     C*-----------------------------------*
     C*  ..トンネルかんばんマスター..   *
     C*-----------------------------------*
     C           KAN       IFEQ 'D'
     C           KEY2      CHAINAAGPL031             20
     C           *IN,20    IFEQ '0'
     C           O4SKJY    ANDEQ'D'
     C           O4SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
      **
     C           *IN,20    IFEQ '0'
     C                     Z-ADDO4BMON    KBMON
     C                     Z-ADDO4KOCD    MEKA             xｮg xｰfｰ
     C           MEKA      CHAINFGBPL011             30
     C           *IN,30    IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,30
     C                     END
      **
     C           *IN,30    IFEQ '0'
     C                     MOVELB2SMEI    MKNM
     C                     END
      **
     C                     MOVELO4RAIN    RAIN             [b]
     C                     MOVELO4MAEK    KOT@             ud ﾃcmb CD
     C                     Z-ADDO4MAKB    KOU              ud BMON CD
     C                     MOVELO4KCD1    KANDS
     C                     MOVE O4KCD2    KANDS
     C           KOU       CHAINFGBPL011             40
     C           *IN,40    IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,40
     C                     END
      **
     C           *IN,40    IFEQ '0'
     C                     MOVELB2SMEI    KOUNM
     C                     END
      **
     C                     MOVELO4KAK1    KAKOU1           2ﾆﾞ fﾃc 1
     C                     MOVELO4KAK2    KAKOU2           2ﾆﾞ fﾃc 2
     C                     MOVELO4KAK3    KAKOU3           2ﾆﾞ fﾃc 3
     C                     MOVEL'D'       CODE    1
      **
     C*---------------------------*
     C*  ..２次加工内容　１..   *
     C*---------------------------*
     C*  2ﾆﾞ fﾃc obﾑc 1
     C           KEY3      KLIST
     C                     KFLD           KAKOU1
     C                     KFLD           CODE
      **
     C           KEY3      CHAINAAAPL011             50
     C           *IN,50    IFEQ '0'
     C           A5SKJY    ANDEQ'D'
     C           A5SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,50
     C                     END
      **
     C           *IN,50    IFEQ '0'
     C                     MOVELA5JOKM    NAME1
     C                     END
      **
     C*---------------------------*
     C*  ..２次加工内容　２..   *
     C*---------------------------*
     C           KEY4      KLIST
     C                     KFLD           KAKOU2
     C                     KFLD           CODE
      **
     C                     MOVEA'0'       *IN,50
     C           KEY4      CHAINAAAPL011             50
     C           *IN,50    IFEQ '0'
     C           A5SKJY    ANDEQ'D'
     C           A5SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,50
     C                     END
      **
     C           *IN,50    IFEQ '0'
     C                     MOVELA5JOKM    NAME2
     C                     END
      **
     C*---------------------------*
     C*  ..２次加工内容　３..   *
     C*---------------------------*
     C           KEY5      KLIST
     C                     KFLD           KAKOU3
     C                     KFLD           CODE
      **
     C                     MOVEA'0'       *IN,50
     C           KEY5      CHAINAAAPL011             50
     C           *IN,50    IFEQ '0'
     C           A5SKJY    ANDEQ'D'
     C           A5SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,50
     C                     END
      **
     C           *IN,50    IFEQ '0'
     C                     MOVELA5JOKM    NAME3
     C                     END
      **
     C                     ADD  #SRY      TNSRY            n]rﾓ ﾇcﾒｭc
     C                     ADD  #SRY      GOU1             ﾃﾞcib
      **
     C                     Z-ADD1         W       20
     C           1         DO   3         W
     C           KAK,W     IFNE *BLANK
     C                     MOVE 'A'       @MKUM
     C                     MOVE '1'       @KOMK
     C                     Z-ADD#SRY      @KNS1
     C                     Z-ADDO4BMON    @BMON
     C                     Z-ADD#SRY      @KNS2
     C                     MOVELKAK,W     @KOTI
     C                     Z-ADD#SRY      @KNS3
     C                     EXCPTMDT
     C                     END
     C                     END
      **
     C                     MOVE 'A'       @MKUM
     C                     MOVE '2'       @KOMK
     C                     Z-ADD#SRY      @KNS1
     C                     Z-ADDO4KOCD    @BMON
     C                     Z-ADD#SRY      @KNS2
     C                     MOVE *BLANK    @KOTI
     C                     Z-ADD0         @KNS3
     C                     EXCPTMDT
      **
     C           NAME1     IFEQ *BLANK
     C           NAME2     ANDEQ*BLANK
     C           NAME3     ANDEQ*BLANK
     C                     ELSE
      **
     C*-------------------------*
     C*  ..２次加工　配列..   *
     C*-------------------------*
     C                     MOVE NAME1     TNM,1
     C                     MOVE NAME2     TNM,2
     C                     MOVE NAME3     TNM,3
     C                     DO   3         J       30
     C           TNM,J     IFNE *BLANK
     C                     SETOF                     70
     C                     Z-ADD1         A
     C                     MOVE TNM,J     TNAM   10
     C           TNAM      LOKUPHTA,A                    70
     C           *IN70     IFEQ '1'
     C                     MOVE HTB,A     TNAKY
     C                     ADD  #SRY      TNAKSU
     C                     MOVE TNAKY     HTB,A
     C                     ELSE
     C                     ADD  1         H       30
     C                     MOVE TNAM      HTA,H
     C                     Z-ADD0         TNAKSU
     C                     MOVE TNAM      TNATNM
     C                     Z-ADD#SRY      TNAKSU
     C                     MOVE TNAKY     HTB,H
     C                     END
      **
     C                     SETOF                     70
     C                     Z-ADD1         A
     C                     Z-ADDKBMON     TN1KOU
     C                     MOVE TNAM      TN1NAM
     C           TN1KEY    LOKUPHT1,A                    70
     C           *IN70     IFEQ '1'
     C                     MOVE HT2,A     TN1KY
     C                     ADD  #SRY      TN1KSU
     C                     MOVE TN1KY     HT2,A
     C                     ELSE
     C                     ADD  1         Y       30
     C                     MOVE TN1KEY    HT1,Y
     C                     Z-ADD0         TN1KSU
     C                     Z-ADD#SRY      TN1KSU
     C                     MOVE TN1KY     HT2,Y
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      **
     C*-------------------------------*
     C*  ..引取かんばんマスター..   *
     C*-------------------------------*
     C           KAN       IFEQ 'E'
     C           KEY2      CHAINAAHPL031             20
     C           *IN,20    IFEQ '0'
     C           L6SKJY    ANDEQ'D'
     C           L6SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
      **
     C           *IN,20    IFEQ '0'
     C                     MOVELL6MAEK    KOT@             ud ﾃcmb CD
     C                     Z-ADDL6MAKB    KOU              ud BMON CD
     C           KOU       CHAINFGBPL011             40
     C           *IN,40    IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,40
     C                     END
      **
     C           *IN,40    IFEQ '0'
     C                     MOVELB2SMEI    KOUNM
     C                     END
      **
     C           KEY1      CHAINFCEPL011             60
     C           *IN,60    IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,60
     C                     END
      **
     C           *IN,60    IFEQ '0'
     C           A2MEK     IFEQ '.......'
     C                     ADD  #SRY      HSR1    40       ﾈ]ﾆﾞｭc
      **
     C                     MOVE 'B'       @MKUM
     C                     MOVE '4'       @KOMK
     C                     Z-ADD#SRY      @KNS1
     C                     Z-ADDL6MAKB    @BMON
     C                     Z-ADD#SRY      @KNS2
     C                     MOVELL6MAEK    @KOTI
     C                     Z-ADD#SRY      @KNS3
     C                     EXCPTMDT
      **
     C                     ELSE
      **
     C           A2MEK     IFNE *BLANK
     C                     ADD  #SRY      HSR2    40       ﾍgnﾒﾍ]
      **
     C                     MOVE 'B'       @MKUM
     C                     MOVE '5'       @KOMK
     C                     Z-ADD#SRY      @KNS1
     C                     Z-ADDL6MAKB    @BMON
     C                     Z-ADD#SRY      @KNS2
     C                     MOVELL6MAEK    @KOTI
     C                     Z-ADD#SRY      @KNS3
     C                     EXCPTMDT
      **
     C                     END
     C                     END
     C                     END
      **
     C                     ADD  #SRY      GOU2             ﾃﾞcib
     C                     END
     C                     END
      **
     C*-------------------------------------*
     C*  ..完成半製品かんばんマスター..   *
     C*-------------------------------------*
     C           KAN       IFEQ '0'
      **
     C                     Z-ADDBUM,P     @BMON
     C                     MOVE *BLANK    @KOTI
     C                     Z-ADD0         @KNS3
      **
     C                     DO   *HIVAL
     C                     SETOF                     74
     C                     SUB  1         P
     C           P         IFLE 0
     C                     SETON                     74
     C                     MOVE KOT,1     KOT@             ud ﾃcmb CD
     C                     Z-ADDBUM,1     KOU              ud BMON CD
     C                     ELSE
     C           TKR,P     IFNE '------'
     C           TKR,P     ANDNE'++++++'
     C                     SETON                     74
     C                     MOVE KOT,P     KOT@             ud ﾃcmb CD
     C                     Z-ADDBUM,P     KOU              ud BMON CD
     C                     END
     C                     END
     C  N74                END
      **
     C                     SETOF                     40
     C           KOU       CHAINFGBPL011             40
     C           *IN,40    IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,40
     C                     END
      **
     C           *IN,40    IFEQ '0'
     C                     MOVELB2SMEI    KOUNM
     C                     END
      **
     C                     ADD  #SRY      KSR              f]ﾈbﾌ]ﾈb
     C                     ADD  #SRY      GOU2             ﾃﾞcib
      **
     C                     MOVE 'B'       @MKUM
     C                     MOVE '6'       @KOMK
     C                     Z-ADD#SRY      @KNS1
     C                     Z-ADD#SRY      @KNS2
     C                     EXCPTMDT
      **
     C                     END
      **
     C                     MOVE '0'       *IN74
     C                     Z-ADD1         X       20
     C                     MOVE *BLANK    WKNM   20
     C           KAN       LOKUPTK1,X                    74
     C           *IN74     IFEQ '1'
     C                     MOVE TK2,X     WKNM
     C                     END
      **
     C                     ADD  1         TNGOU
     C                     ADD  #SRY      MGOU
      **
     C           KOU       IFNE 0
     C                     Z-ADDKOU       XCODO   40
     C           XCODO     IFNE 8974
     C           XCODO     ANDNE8982
     C           XCODO     ANDNE9032
     C           XCODO     ANDNE9040
     C           XCODO     ANDNE9024
      **
     C           XCODO     IFEQ 8958
     C           XCODO     OREQ 8931
     C           XCODO     OREQ 8923
     C           XCODO     OREQ 8915
     C                     Z-ADD8888      XCODO
     C                     ELSE
      **
     C                     SETOF                     40
     C           XCODO     LOKUPTB1                      40
     C           *IN40     IFEQ '0'
     C                     Z-ADD9999      XCODO
     C                     ELSE
     C                     Z-ADD0         XCODO
     C                     END
     C                     END
     C                     END
      **
     C           XCODO     IFNE 0
     C                     EXCPTFDT
     C                     END
     C                     END
      **
     C                     EXCPTDET
      **
     C*-------------------------------*
     C*  ..メッキメーカー　配列..   *
     C*-------------------------------*
     C           MEKA      IFNE 0
     C                     MOVEA'0'       *IN,70
     C                     Z-ADD1         A       30
     C           MEKA      LOKUPHMA,A                    70
     C           *IN,70    IFEQ '1'
     C                     Z-ADDHMB,A     HMAKY
     C                     ADD  #SRY      HMAKSU
     C                     Z-ADDHMAKY     HMB,A
     C                     ELSE
     C                     ADD  1         B       30
     C                     Z-ADDMEKA      HMA,B
     C                     Z-ADD0         HMAKSU
     C                     Z-ADDMEKA      HMAKCD
     C                     Z-ADD#SRY      HMAKSU
     C                     Z-ADDHMAKY     HMB,B
     C                     END
      **
     C                     MOVEA'0'       *IN,70
     C                     Z-ADD1         A
     C           KEY       LOKUPHM1,A                    70
     C           *IN,70    IFEQ '1'
     C                     MOVE HM2,A     HM1KY
     C                     ADD  #SRY      HM1KSU
     C                     MOVE HM1KY     HM2,A
     C                     ELSE
     C                     ADD  1         C       30
     C                     MOVE KEY       HM1,C
     C                     Z-ADD0         HM1KSU
     C                     MOVELKEY       H1KY
     C                     Z-ADD#SRY      HM1KSU
     C                     MOVE HM1KY     HM2,C
     C                     END
     C                     END
      **
     C*-----------------------*
     C*  ..前工程　配列..   *
     C*-----------------------*
     C           KOU       IFNE 0
     C                     MOVEA'0'       *IN,70
     C                     Z-ADD1         A
     C           KOU       LOKUPHKA,A                    70
     C           *IN,70    IFEQ '1'
     C                     Z-ADDHKB,A     HMAKY
     C                     ADD  #SRY      HMAKSU
     C                     ADD  #SRY      GOUA
     C                     Z-ADDHMAKY     HKB,A
     C                     ELSE
     C                     ADD  1         D       30
     C                     Z-ADDKOU       HKA,D
     C                     Z-ADD0         HMAKY
     C                     Z-ADDKOU       HMAKCD
     C                     Z-ADD#SRY      HMAKSU
     C                     ADD  #SRY      GOUA
     C                     Z-ADDHMAKY     HKB,D
     C                     END
      **
     C                     MOVEA'0'       *IN,70
     C                     Z-ADD1         A
     C           KY        LOKUPHK1,A                    70
     C           *IN,70    IFEQ '1'
     C                     MOVE HK2,A     HK1KY
     C                     ADD  #SRY      HK1KSU
     C                     MOVE HK1KY     HK2,A
     C                     ELSE
     C                     ADD  1         E       30
     C                     MOVE KY        HK1,E
     C                     Z-ADD0         HK1KSU
     C                     MOVE KY        HKYE
     C                     Z-ADD#SRY      HK1KSU
     C                     MOVE HK1KY     HK2,E
     C                     END
     C                     END
      **
     C*-------------------------*
     C*  ..かんばん　配列..   *
     C*-------------------------*
     C           KAN       IFNE *BLANK
     C                     SETOF                     70
     C                     Z-ADD1         A
     C           KAN       LOKUPHNA,A                    70
     C           *IN70     IFEQ '1'
     C                     MOVE HNB,A     HNAKY
     C                     ADD  #SRY      HNAKSU
     C                     MOVE HNAKY     HNB,A
     C                     ELSE
     C                     ADD  1         F       30
     C                     MOVE KAN       HNA,F
     C                     Z-ADD0         HNAKSU
     C                     MOVE KAN       HNAKAN
     C                     Z-ADD#SRY      HNAKSU
     C                     MOVE HNAKY     HNB,F
     C                     END
      **
     C           KAN       IFEQ 'C'
     C           KAN       OREQ 'D'
     C           KANDS     IFNE *BLANK
     C                     SETOF                     70
     C                     Z-ADD1         A
     C           KANDS     LOKUPHN1,A                    70
     C           *IN70     IFEQ '1'
     C                     MOVE HN2,A     HN1KY
     C                     ADD  #SRY      HN1KSU
     C                     MOVE HN1KY     HN2,A
     C                     ELSE
     C                     ADD  1         G       30
     C                     MOVE KANDS     HN1,G
     C                     Z-ADD0         HN1KSU
     C                     MOVE KANDS     HN1KAN
     C                     Z-ADD#SRY      HN1KSU
     C                     MOVE HN1KY     HN2,G
     C                     END
     C                     END
     C                     END
     C                     END
     C           @END      TAG
      **
     CLR                   EXSR SUB
     CLR         GOU1      ADD  GOU2      GOU3    40
     CLR                   MOVE GOU3      PGOU3
     CLR                   MOVE GOU1      PGOU1
     CLR                   MOVE GOU2      PGOU2
     CLR                   MOVE #STHZ     PSTHZ
     CLR                   MOVE #ENHZ     PENHZ
      **
     C*----------------------------------------*
     C           SUB       BEGSR
     C*----------------------------------------*
     C                     EXCPTKEI1
      **
     C                     TIME           TIME
     C                     Z-ADD*DATE     DAY
     C                     ADD  1         CNT
     C                     EXCPTHED
     C                     MOVE '0'       *INOF
      **
     C                     EXCPTKEI2
      **
     C                     SORTAHMB
     C                     SORTAHM2
     C                     SORTAHKB
     C                     SORTAHK2
     C                     SORTAHNB
     C                     SORTAHN2
     C                     SORTAHTB
     C                     SORTAHT2
      **
     C*-------------------------------*
     C*  ..メッキメーカー　配列..   *
     C*-------------------------------*
     C                     DO   300       A
     C                     Z-ADD0         C
     C                     Z-ADD0         WSU
     C                     MOVEA'0000000' *IN,70
     C           HMB,A     IFEQ 0
     C                     MOVEA'1'       *IN,70
     C                     ELSE
      **
     C                     MOVEA'1'       *IN,73           NAME
     C                     Z-ADDHMB,A     HMAKY
     C                     MOVE *BLANK    TKEMI  16
     C           HMAKCD    CHAINFGBPL011             74
     C  N74                MOVELB2SMEI    TKEMI
     C           HMAKSU    DIV  GOU1      TPS1    53H
     C           TPS1      MULT 100       TPS     41
      **
     C                     DO   300       B
     C           HM2,B     IFEQ *BLANK
     C                     MOVEA'1'       *IN,71
     C                     ELSE
      **
     C                     MOVE HM2,B     HM1KY
     C           HMAKCD    IFEQ HM1KCD
     C                     MOVEA'1'       *IN,72
     C                     ADD  1         C
     C                     MOVE HM1KRA    TRA,C
     C                     Z-ADDHM1KSU    TSU,C
     C                     ADD  HM1KSU    WSU     40
      **
     C           WSU       IFEQ HMAKSU
     C                     MOVEA'1'       *IN,75
     C                     END
      **
     C           C         IFEQ 4
     C                     MOVEA'0'       *IN,72
     C                     MOVEA'0'       *IN,76           xｰfｰ
      **
     C                     EXSR SOF
     C           *IN,77    IFEQ '0'
     C                     MOVEA'11'      *IN,76
     C                     END
      **
     C                     MOVE *BLANK    #R1     3
     C                     MOVE *BLANK    #R2     3
     C                     MOVE *BLANK    #R3     3
     C                     MOVE *BLANK    #R4     3
     C                     MOVE *BLANK    #SU1    4
     C                     MOVE *BLANK    #SU2    4
     C                     MOVE *BLANK    #SU3    4
     C                     MOVE *BLANK    #SU4    4
      **
     C           TRA,1     IFNE *BLANK
     C                     MOVEL'LIN'     #R1
     C                     END
      **
     C           TRA,2     IFNE *BLANK
     C                     MOVEL'LIN'     #R2
     C                     END
      **
     C           TRA,3     IFNE *BLANK
     C                     MOVEL'LIN'     #R3
     C                     END
      **
     C           TRA,4     IFNE *BLANK
     C                     MOVEL'LIN'     #R4
     C                     END
      **
     C           TSU,1     IFNE 0
     C                     MOVEL'CNT '    #SU1
     C                     END
      **
     C           TSU,2     IFNE 0
     C                     MOVEL'CNT '    #SU2
     C                     END
      **
     C           TSU,3     IFNE 0
     C                     MOVEL'CNT '    #SU3
     C                     END
      **
     C           TSU,4     IFNE 0
     C                     MOVEL'CNT '    #SU4
     C                     END
      **
     C           *IN73     IFEQ '1'
     C                     EXCPTKEI3
     C                     ELSE
     C                     EXCPTKE3
     C                     END
      **
     C                     MOVEA'0'       *IN,73
     C                     MOVEA'0'       *IN,76
     C                     Z-ADD0         C
     C                     MOVE *BLANK    TRA
     C                     Z-ADD0         TSU
     C                     END
     C                     END
     C                     END
     C  N71                END
      **
     C           *IN,72    IFEQ '1'
     C                     MOVEA'1'       *IN,75
     C                     MOVE '0'       *IN76
     C                     EXSR SOF
     C           *IN77     IFEQ '0'
     C                     MOVEA'11'      *IN,76
     C                     END
      **
     C                     MOVE *BLANK    #R1
     C                     MOVE *BLANK    #R2
     C                     MOVE *BLANK    #R3
     C                     MOVE *BLANK    #R4
     C                     MOVE *BLANK    #SU1
     C                     MOVE *BLANK    #SU2
     C                     MOVE *BLANK    #SU3
     C                     MOVE *BLANK    #SU4
      **
     C           TRA,1     IFNE *BLANK
     C                     MOVEL'LIN'     #R1
     C                     END
      **
     C           TRA,2     IFNE *BLANK
     C                     MOVEL'LIN'     #R2
     C                     END
      **
     C           TRA,3     IFNE *BLANK
     C                     MOVEL'LIN'     #R3
     C                     END
      **
     C           TRA,4     IFNE *BLANK
     C                     MOVEL'LIN'     #R4
     C                     END
      **
     C           TSU,1     IFNE 0
     C                     MOVEL'CNT '    #SU1
     C                     END
      **
     C           TSU,2     IFNE 0
     C                     MOVEL'CNT '    #SU2
     C                     END
      **
     C           TSU,3     IFNE 0
     C                     MOVEL'CNT '    #SU3
     C                     END
      **
     C           TSU,4     IFNE 0
     C                     MOVEL'CNT '    #SU4
     C                     END
      **
     C           *IN73     IFEQ '1'
     C                     EXCPTKEI3
     C                     ELSE
     C                     EXCPTKE3
     C                     END
      **
     C                     Z-ADD0         TSU
     C                     MOVE *BLANK    TRA
     C                     END
     C                     END
     C  N70                END
      **
     C*-----------------------*
     C*  ..前工程　配列..   *
     C*-----------------------*
     C                     MOVEA'0'       *IN,77
     C                     DO   300       A
     C                     Z-ADD0         C
     C                     Z-ADD0         WSU
     C                     MOVEA'0000000' *IN,70
     C           HKB,A     IFEQ 0
     C                     MOVEA'1'       *IN,70
     C                     ELSE
      **
     C                     MOVEA'1'       *IN,73
     C                     Z-ADDHKB,A     HMAKY
     C                     MOVE *BLANK    TKEMI
     C           HMAKCD    CHAINFGBPL011             74
     C  N74                MOVELB2SMEI    TKEMI
     C           HMAKSU    DIV  GOUA      TPS1      H
     C           TPS1      MULT 100       TPS
      **
     C                     MOVE '0'       *IN74
     C           HMAKCD    LOKUPTB1                      74
     C           *IN74     IFEQ '0'
     C                     MOVE '1'       *IN78
     C                     ADD  HMAKSU    @GT1
     C                     END
      **
     C                     DO   300       B
     C           HK2,B     IFEQ *BLANK
     C                     MOVEA'1'       *IN,71
     C                     ELSE
      **
     C                     MOVE HK2,B     HK1KY
     C           HMAKCD    IFEQ HK1KCD
     C                     MOVEA'1'       *IN,72
     C                     ADD  1         C
     C                     MOVE HK1KTI    TKT,C
     C                     Z-ADDHK1KSU    TSU,C
     C                     ADD  HK1KSU    WSU
      **
     C           WSU       IFEQ HMAKSU
     C                     MOVEA'1'       *IN,75
     C                     END
      **
     C           C         IFEQ 4
     C                     MOVEA'0'       *IN,72
     C                     MOVEA'0'       *IN,76
      **
     C                     EXSR SOF
     C           *IN,77    IFEQ '0'
     C                     MOVEA'11'      *IN,76
     C                     END
      **
     C                     MOVE *BLANK    #SU1
     C                     MOVE *BLANK    #SU2
     C                     MOVE *BLANK    #SU3
     C                     MOVE *BLANK    #SU4
      **
     C           TSU,1     IFNE 0
     C                     MOVEL'CNT '    #SU1
     C                     END
      **
     C           TSU,2     IFNE 0
     C                     MOVEL'CNT '    #SU2
     C                     END
      **
     C           TSU,3     IFNE 0
     C                     MOVEL'CNT '    #SU3
     C                     END
      **
     C           TSU,4     IFNE 0
     C                     MOVEL'CNT '    #SU4
     C                     END
      **
     C           *IN73     IFEQ '1'
     C                     EXCPTKEI4
     C                     ELSE
     C                     EXCPTKE4
     C                     END
      **
     C                     MOVEA'0'       *IN,73
     C                     MOVEA'0'       *IN,76
     C                     Z-ADD0         C
     C                     MOVE *BLANK    TKT
     C                     Z-ADD0         TSU
     C                     END
     C                     END
     C                     END
     C  N71                END
      **
     C           *IN,72    IFEQ '1'
     C                     MOVEA'1'       *IN,75
     C                     MOVE '0'       *IN76
     C                     EXSR SOF
     C           *IN77     IFEQ '0'
     C                     MOVEA'11'      *IN,76
     C                     END
      **
     C                     MOVE *BLANK    #SU1
     C                     MOVE *BLANK    #SU2
     C                     MOVE *BLANK    #SU3
     C                     MOVE *BLANK    #SU4
      **
     C           TSU,1     IFNE 0
     C                     MOVEL'CNT '    #SU1
     C                     END
      **
     C           TSU,2     IFNE 0
     C                     MOVEL'CNT '    #SU2
     C                     END
      **
     C           TSU,3     IFNE 0
     C                     MOVEL'CNT '    #SU3
     C                     END
      **
     C           TSU,4     IFNE 0
     C                     MOVEL'CNT '    #SU4
     C                     END
      **
     C           *IN73     IFEQ '1'
     C                     EXCPTKEI4
     C                     ELSE
     C                     EXCPTKE4
     C                     END
      **
     C                     Z-ADD0         TSU
     C                     MOVE *BLANK    TKT
     C                     END
     C                     END
     C  N70                END
      **
     C           *IN78     IFEQ '1'
     C           @GT1      DIV  GOUA      TPS1      H
     C           TPS1      MULT 100       TPS
     C                     EXCPTKE41
     C                     END
      **
     C*-----------------------------*
     C*  ..２次加工内容　配列..   *
     C*-----------------------------*
     C                     MOVEA'00'      *IN,77
     C                     DO   300       A
     C                     Z-ADD0         C
     C                     Z-ADD0         WSU
     C                     MOVEA'0000000' *IN,70
      **
     C           HTB,A     IFEQ *BLANK
     C                     MOVEA'1'       *IN,70
     C                     ELSE
     C                     MOVEA'1'       *IN,73
     C                     MOVE HTB,A     TNAKY
      **
     C                     DO   300       B
     C           HT2,B     IFEQ *BLANK
     C                     MOVEA'1'       *IN,71
     C                     ELSE
      **
     C                     MOVE HT2,B     TN1KY
     C           TNATNM    IFEQ TN1NAM
     C                     MOVEA'1'       *IN,72
     C                     MOVE '0'       *IN74
     C                     MOVE *BLANK    TKEMI
     C           TN1KOU    CHAINFGBPL011             74
     C  N74                MOVELB2SMEI    TKEMI
     C                     ADD  1         C
     C                     MOVE TKEMI     TSM,C
     C                     Z-ADDTN1KSU    TSU,C
     C                     ADD  TN1KSU    WSU
      **
     C           WSU       IFEQ TNAKSU
     C                     MOVEA'1'       *IN,75
     C                     END
      **
     C           C         IFEQ 3
     C                     MOVEA'0'       *IN,72
     C                     MOVEA'0'       *IN,76
      **
     C                     EXSR SOF
     C           *IN,77    IFEQ '0'
     C                     MOVEA'11'      *IN,76
     C                     END
      **
     C                     MOVE *BLANK    #SU1
     C                     MOVE *BLANK    #SU2
     C                     MOVE *BLANK    #SU3
     C                     MOVE *BLANK    #SU4
      **
     C           TSU,1     IFNE 0
     C                     MOVEL'CNT '    #SU1
     C                     END
      **
     C           TSU,2     IFNE 0
     C                     MOVEL'CNT '    #SU2
     C                     END
      **
     C           TSU,3     IFNE 0
     C                     MOVEL'CNT '    #SU3
     C                     END
      **
     C           *IN73     IFEQ '1'
     C                     EXCPTKEI5
     C                     ELSE
     C                     EXCPTKE5
     C                     END
      **
     C                     MOVEA'0'       *IN,73
     C                     MOVEA'0'       *IN,76
     C                     Z-ADD0         C
     C                     MOVE *BLANK    TSM
     C                     Z-ADD0         TSU
     C                     END
     C                     END
     C                     END
     C  N71                END
      **
     C           *IN,72    IFEQ '1'
     C                     MOVEA'1'       *IN,75
     C                     MOVE '0'       *IN76
     C                     EXSR SOF
     C           *IN77     IFEQ '0'
     C                     MOVEA'11'      *IN,76
     C                     END
      **
     C                     MOVE *BLANK    #SU1
     C                     MOVE *BLANK    #SU2
     C                     MOVE *BLANK    #SU3
     C                     MOVE *BLANK    #SU4
      **
     C           TSU,1     IFNE 0
     C                     MOVEL'CNT '    #SU1
     C                     END
      **
     C           TSU,2     IFNE 0
     C                     MOVEL'CNT '    #SU2
     C                     END
      **
     C           TSU,3     IFNE 0
     C                     MOVEL'CNT '    #SU3
     C                     END
      **
     C           *IN73     IFEQ '1'
     C                     EXCPTKEI5
     C                     ELSE
     C                     EXCPTKE5
     C                     END
      **
     C                     MOVE *BLANK    TSM
     C                     Z-ADD0         TSU
     C                     END
     C                     END
     C  N70                END
      **
     C*-------------------------*
     C*  ..かんばん　配列..   *
     C*-------------------------*
     C                     MOVEA'0'       *IN,77
     C                     MOVE *BLANK    #SU1
     C                     MOVE *BLANK    #SU2
     C                     MOVE *BLANK    #SU3
     C                     MOVE *BLANK    #SU4
     C                     DO   300       A
     C                     Z-ADD0         C
     C                     MOVEA'0000000' *IN,70
      **
     C           HNB,A     IFEQ *BLANK
     C                     MOVEA'1'       *IN,70
     C                     ELSE
      **
     C                     MOVEA'11'      *IN,72
     C                     MOVE HNB,A     HNAKY
     C                     MOVE '0'       *IN74
     C                     Z-ADD1         X
     C                     MOVE *BLANK    WKNM
     C           HNAKAN    LOKUPTK1,X                    74
     C           *IN74     IFEQ '1'
     C                     MOVE TK2,X     WKNM
     C                     END
      **
     C                     DO   300       B
     C           HN2,B     IFEQ *BLANK
     C                     MOVEA'1'       *IN,71
     C                     ELSE
      **
     C                     MOVE HN2,B     HN1KY
     C           HN1KAS    IFNE *BLANK
     C           HNAKAN    IFEQ HN1KAD
     C                     MOVEA'1'       *IN,72
      **
     C           TKEY      KLIST
     C                     KFLD           HN1KAD
     C                     KFLD           HN1KAS
     C                     MOVE '0'       *IN74
     C                     MOVE *BLANK    TKAM   20
     C           TKEY      CHAINGCMPL311             74
     C  N74                MOVELT3NAMN    TKAM
      **
     C                     ADD  1         C
     C                     MOVE TKAM      TKA,C
     C                     Z-ADDHN1KSU    TSU,C
      **
     C           C         IFEQ 2
     C                     MOVEA'0'       *IN,72
     C                     MOVEA'0'       *IN,76
      **
     C                     EXSR SOF
     C           *IN,77    IFEQ '0'
     C                     MOVEA'11'      *IN,76
     C                     END
      **
     C                     MOVE *BLANK    #SU1
     C                     MOVE *BLANK    #SU2
     C                     MOVE *BLANK    #SU3
     C                     MOVE *BLANK    #SU4
      **
     C           TSU,1     IFNE 0
     C                     MOVEL'CNT '    #SU1
     C                     END
      **
     C           TSU,2     IFNE 0
     C                     MOVEL'CNT '    #SU2
     C                     END
      **
     C           *IN73     IFEQ '1'
     C                     EXCPTKEI6
     C                     ELSE
     C                     EXCPTKE6
     C                     END
      **
     C                     MOVEA'0'       *IN,73
     C                     MOVEA'0'       *IN,76
     C                     Z-ADD0         C
     C                     MOVE *BLANK    TKA
     C                     Z-ADD0         TSU
     C                     END
     C                     END
     C                     END
     C                     END
     C  N71                END
      **
     C           *IN,72    IFEQ '1'
     C                     MOVE '0'       *IN76
     C                     EXSR SOF
     C           *IN77     IFEQ '0'
     C                     MOVEA'11'      *IN,76
     C                     END
      **
     C                     MOVE *BLANK    #SU1
     C                     MOVE *BLANK    #SU2
     C                     MOVE *BLANK    #SU3
     C                     MOVE *BLANK    #SU4
      **
     C           TSU,1     IFNE 0
     C                     MOVEL'CNT '    #SU1
     C                     END
      **
     C           TSU,2     IFNE 0
     C                     MOVEL'CNT '    #SU2
     C                     END
      **
     C           *IN73     IFEQ '1'
     C                     EXCPTKEI6
     C                     ELSE
     C                     EXCPTKE6
     C                     END
      **
     C                     MOVE *BLANK    TKA
     C                     Z-ADD0         TSU
     C                     END
     C                     END
     C  N70                END
      **
     C                     ENDSR
      **
     C*----------------------------------------*
     C           SOF       BEGSR
     C*----------------------------------------*
     C           *INOF     IFEQ '1'
     C                     MOVEA'1'       *IN,73
     C                     MOVEA'0'       *IN,77
     C                     TIME           TIME
     C                     Z-ADD*DATE     DAY
     C                     ADD  1         CNT
     C                     EXCPTHED
     C                     MOVEL'0'       *INOF
     C                     END
     C                     ENDSR
     OEADWP25 E                FDT
     O                         XCODO      4
     O                         #HIN1      9
     O                         #HIN2     14
     O                         #HIN3     16
     O                         #SRY  2   20
     O                         MKNM      36
     O                         RAIN      37
     O                         KOT@      40
     O                         KOUNM     56
     O                         NAME1     66
     O                         NAME2     76
     O                         NAME3     86
     O                         WKNM     106
      **
     OEADWP3X E                MDT
     O                         @MKUM      1
     O                         @KOMK      2
     O                         @KNS1      6
     O                         @BMON     10
     O                         @KNS2     14
     O                         @KOTI     17
     O                         @KNS3     21
      **
     OQPRINT  E   03           HED
     O                                    7 'PERIOD'
     O                         #STHZ   +  2 '    /  /  '
     O                         @@@@@   +  1
     O                         #ENHZ   +  1 '    /  /  '
     O        E   04           HED
     O                                   89 'TIME'
     O                         TIME      98 '  :  :  '
     O        E   05           HED
     O                                   10 'EADR23-1'
     O                                   41 '**'
     O                         WLSTN     55
     O                                   76 'UNDELIVERED ANALYSIS'
     O                                   84 'LIST **'
     O                                   89 'DATE'
     O                         DAY      100 '    /  /  '
     O                                  106 'PAGE'
     O                         CNT   Z  110
     O        E   0709         HED
     O                                   17 'INTRAL CO.PART NO'
     O                                   29 'UNDELVD FRQ'
     O                                   43 'PLATING MAKER'
     O                                   49 'LINE'
     O                                   67 'PRECEDING PROCESS'
     O                                   90 '2 PROCESSING CONTENTS'
     O                                  120 'KANBAN KIND'
     O        E  1             DET
     O                         #HIN1      7
     O                                    8 '-'
     O                         #HIN2     13
     O                                   14 '-'
     O                         #HIN3     16
     O                         #SRY  2   25
     O                         MKNM      44
     O                         RAIN      48
     O                         KOT@      54
     O                                   55 '-'
     O                         KOUNM     71
     O                         NAME1     83
     O                         NAME2     95
     O                         NAME3    107
     O                         WKNM     129
     O        E  2             KEI1
     O                                   10 'COUNT TTL'
     O                         TNGOU 2   16
     O                         MGOU  2   25
     O        E 1              KEI2
     O                                   11 'PLATING'
     O                                   14 '-->'
     O                                   26 '2 PROCES.'
     O                         TNSRY 2   32
     O                                   50 'NO 2 PROCES.'
     O                         MKSRY 2   56
     O                                   85 '....................'
     O                                   90 'TOTAL'
     O                         GOU1  2   96
     O        E 11             KEI2
     O                                   11 'NO PLATING'
     O                                   14 '-->'
     O                                   26 'WASHING'
     O                         HSR1  2   32
     O                                   50 'PICK-UP'
     O                         HSR2  2   56
     O                                   72 'CMPLT.'
     O                         KSR   2   78
     O                                   85 '...'
     O                                   90 'TOTAL'
     O                         GOU2  2   96
     O        E 2              KEI3
     O                 76                15 'PLATING MAKER->'
     O                 73      TKEMI     32
     O                         TRA,1     34
     O                         #R1       37
     O                         TSU,1 2   43
     O                         #SU1      47
     O                         TRA,2     51
     O                         #R2       54
     O                         TSU,2 2   60
     O                         #SU2      64
     O                         TRA,3     68
     O                         #R3       71
     O                         TSU,3 2   77
     O                         #SU3      81
     O                         TRA,4     85
     O                         #R4       88
     O                         TSU,4 2   94
     O                         #SU4      98
     O                 75               101 '...'
     O                 75               107 'TOTAL'
     O                 75      HMAKSU4  112
     O                 75               116 'CNT'
     O                 75      TPS   3  122
     O                 75               123 '%'
     O        E 1              KE3
     O                         TRA,1     34
     O                         #R1       37
     O                         TSU,1 2   43
     O                         #SU1      47
     O                         TRA,2     51
     O                         #R2       54
     O                         TSU,2 2   60
     O                         #SU2      64
     O                         TRA,3     68
     O                         #R3       71
     O                         TSU,3 2   77
     O                         #SU3      81
     O                         TRA,4     85
     O                         #R4       88
     O                         TSU,4 2   94
     O                         #SU4      98
     O                 75               101 '...'
     O                 75               107 'TOTAL'
     O                 75      HMAKSU4  112
     O                 75               116 'CNT'
     O                 75      TPS   3  122
     O                 75               123 '%'
     O        E 2              KEI4
     O                 76                15 'PRECED.PROC.-->'
     O                 73      TKEMI     32
     O                         TKT,1     36
     O                         TSU,1 2   43
     O                         #SU1      47
     O                         TKT,2     53
     O                         TSU,2 2   60
     O                         #SU2      64
     O                         TKT,3     70
     O                         TSU,3 2   77
     O                         #SU3      81
     O                         TKT,4     87
     O                         TSU,4 2   94
     O                         #SU4      98
     O                 75               101 '...'
     O                 75               107 'TOTAL'
     O                 75      HMAKSU4  112
     O                 75               116 'CNT'
     O                 75      TPS   3  122
     O                 75               123 '%'
     O        E 1              KE4
     O                         TKT,1     36
     O                         TSU,1 2   43
     O                         #SU1      47
     O                         TKT,2     53
     O                         TSU,2 2   60
     O                         #SU2      64
     O                         TKT,3     70
     O                         TSU,3 2   77
     O                         #SU3      81
     O                         TKT,4     87
     O                         TSU,4 2   94
     O                         #SU4      98
     O                 75               101 '...'
     O                 75               107 'TOTAL'
     O                 75      HMAKSU4  112
     O                 75               116 'CNT'
     O                 75      TPS   3  122
     O                 75               123 '%'
     O        E 2              KE41
     O                                  107 'SUPPLIER TOTAL'
     O                         @GT1  4  112
     O                                  116 'CNT'
     O                         TPS   3  122
     O                                  123 '%'
     O        E 2              KEI5
     O                 76                15 '2 PROCESSING-->'
     O                 73      TNATNM    27
     O                         TSM,1     44
     O                         TSU,1 2   50
     O                         #SU1      54
     O                         TSM,2     72
     O                         TSU,2 2   78
     O                         #SU2      82
     O                         TSM,3    100
     O                         TSU,3 2  106
     O                         #SU3     110
     O                 75               113 '...'
     O                 75               119 'TOTAL'
     O                 75      TNAKSU4  124
     O                 75               128 'CNT'
     O        E 1              KE5
     O                         TSM,1     44
     O                         TSU,1 2   50
     O                         #SU1      54
     O                         TSM,2     72
     O                         TSU,2 2   78
     O                         #SU2      82
     O                         TSM,3    100
     O                         TSU,3 2  106
     O                         #SU3     110
     O                 75               113 '...'
     O                 75               119 'TOTAL'
     O                 75      TNAKSU4  124
     O                 75               128 'CNT'
     O        E 2              KEI6
     O                 76                15 'KANBAN-->'
     O                 73      WKNM      36
     O                 73      HNAKSU2   42
     O                 73                46 'CNT'
     O                         TKA,1     67
     O                         TSU,1 2   73
     O                         #SU1      77
     O                         TKA,2     98
     O                         TSU,2 2  104
     O                         #SU2     108
     O        E 1              KE6
     O                         TKA,1     67
     O                         TSU,1 2   73
     O                         #SU1      77
     O                         TKA,2     98
     O                         TSU,2 2  104
     O                         #SU2     108
**  TK1 TK2
AINTRA-PROCESS KANBAN
BQUENCHING KANBAN
CPLATING KANBAN
DTUNNEL KANBAN
EPART WITHDRAWAL KNBN
FINSTRUCTION KANBAN
GS KANBAN
HTUNNEL 2 KANBAN
JWASHING KANBAN
KSHOT KANBAN
LTORQUE PATCH KANBAN
MLIMITATION KANBAN
NWAX KANBAN
ZKANBAN NO EXIST
0CMPLT.HALF-FIN KNBN
1S PROC.KANBAN
2S PROC.QUENCH' KNBN
3COMPONENTS KANBAN
4FLOW KANBAN
5FLOW HEAT TRTM.KNBN
**  TB1
8249
8230
8753
8826
8729
8184
2682
6297
8974
8982
8966
8885
9008
8923
8931
8915
8958
9024
9032
9040
8478
9431
**  TL1.TL2
1BY PART NO
2BY UNDELV FR
