     H            Y.
     F** EADR39 **********************************
     F*         UNDELIVERED ANALYSIS LIST.     *
     F* PROGRAM ID. : EADR39. <RPG> *
     F* CREATE DATE. : DEC.20,'90.               *
     F* AUTHOR.         : KOHHY.                 *
     F********************************** EADR39 **
     FEADWP36 IP  E           K        DISK
     FEADWP37 IF  E           K        DISK
     FEADWP38 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TB1     1   6  1   TB2    14   ﾃcyhxb
     E                    TY      1   2 12               xｮg aﾒ/oﾆ
     E*  xｮg aﾒ
     E                    XKK       100  4 0             ﾃﾞcib
     E                    XKJ       100 18               xｰfｰ
     E                    XAR       100  4 0             2ﾆﾞ aﾒ
     E                    XNS       100  4 0             2ﾆﾞ oﾆ
     E                    XJN       100 30  D            ﾃcﾆﾞｭc/i]ﾇc
     E*  xｮg oﾆ
     E                    YKK       100  4 0             ﾃﾞcib
     E                    YKJ       100 18               udﾃcmb
     E                    YK1       100  4 0             ﾈ]ﾆﾞｭcﾍ]
     E                    YK2       100  4 0             ﾍgnﾒﾍ]
     E                    YK3       100  4 0             f]ﾈbﾍ]
     E                    YJN       100 34  D            ﾃﾞcib ﾃcﾆﾞｭc/i]ﾇc
     E*  cﾃﾞcib
     E                    ZKK       100  4 0             ﾃﾞcib
     E                    ZMK       100 18               xｰfｰ
     E                    ZKT       100 18               udﾃcmb
     E                    ZAR       100  4 0             2ﾆﾞ aﾒ
     E                    ZNS       100  4 0             2ﾆﾞ oﾆ
     E                    ZK1       100  4 0             ﾈ]ﾆﾞｭcﾍ]
     E                    ZK2       100  4 0             ﾍgnﾒﾍ]
     E                    ZK3       100  4 0             f]ﾈbﾍ]
     E                    ZJN       100 60  D            ﾃﾞcib ﾃcﾆﾞｭc/i]ﾇc
     IEADWP361    01
     I                                              EAMKBNL1
     I                                              EASKBN
     I                                              EASKNS
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1  30 @XJN
     I                                        1   40@XKK
     I                                        5  22 @XJN1
     I                                       23  260@XJN2
     I                                       27  300@XJN3
     I            DS
     I                                        1  34 @YJN
     I                                        1   40@YKK
     I                                        5  22 @YJN1
     I                                       23  260@YJN2
     I                                       27  300@YJN3
     I                                       31  340@YJN4
     I            DS
     I                                        1  60 @ZJN
     I                                        1   40@ZKK
     I                                        5  22 @ZJN1
     I                                       23  40 @ZJN2
     I                                       41  440@ZJN3
     I                                       45  480@ZJN4
     I                                       49  520@ZJN5
     I                                       53  560@ZJN6
     I                                       57  600@ZJN7
     C******************************************************
     C*  START  PROGRAM  <EADR39>                          *
     C******************************************************
     C           KEY1      KLIST
     C                     KFLD           EBSKBN
     C                     KFLD           EBBMON
     C*
     C           *ENTRY    PLIST
     C                     PARM           @MKARI  4
     C                     PARM           @MKNAS  4
     C                     PARM           @SOKEI  4
     C                     PARM           @STHZ   8
     C                     PARM           @ENHZ   8
     C*
     C                     MOVEL@MKARI    MKARI   40
     C                     MOVEL@MKNAS    MKNAS   40
     C                     MOVEL@SOKEI    SOKEI   40
     C                     MOVEL@STHZ     STHZ    80
     C                     MOVEL@ENHZ     ENHZ    80
     C*
B001 C           *IN90     IFEQ '0'
     C                     MOVEL'1'       *INOF
     C                     MOVEA'1'       *IN,90
     C                     MOVE *BLANK    @BMNM  18
     C                     MOVE *BLANK    @KMNAM 14
     C                     Z-ADD*ZERO     XAR
     C                     Z-ADD*ZERO     XNS
     C                     Z-ADD*ZERO     XKK
     C                     MOVEA*BLANK    XJN
     C                     MOVEA*BLANK    YKJ
     C                     Z-ADD*ZERO     YK1
     C                     Z-ADD*ZERO     YK2
     C                     Z-ADD*ZERO     YK3
     C                     Z-ADD*ZERO     YKK
     C                     MOVEA*BLANK    YJN
     C                     MOVEA*BLANK    ZMK
     C                     MOVEA*BLANK    ZKT
     C                     Z-ADD*ZERO     ZAR
     C                     Z-ADD*ZERO     ZNS
     C                     Z-ADD*ZERO     ZK1
     C                     Z-ADD*ZERO     ZK2
     C                     Z-ADD*ZERO     ZK3
     C                     Z-ADD*ZERO     ZKK
     C                     MOVEA*BLANK    ZJN
     C                     MOVE *BLANK    @XJN1
     C                     Z-ADD0         @XJN2
     C                     Z-ADD0         @XJN3
     C                     Z-ADD0         @XKK
     C                     MOVE *BLANK    @YJN1
     C                     Z-ADD0         @YJN2
     C                     Z-ADD0         @YJN3
     C                     Z-ADD0         @YJN4
     C                     Z-ADD0         @YKK
     C                     MOVE *BLANK    @ZJN1
     C                     MOVE *BLANK    @ZJN2
     C                     Z-ADD0         @ZJN3
     C                     Z-ADD0         @ZJN4
     C                     Z-ADD0         @ZJN5
     C                     Z-ADD0         @ZJN6
     C                     Z-ADD0         @ZJN7
     C                     Z-ADD0         @ZKK
     C                     Z-ADD0         B       50
     C                     Z-ADD0         C       50
     C                     Z-ADD0         D       50
E001 C                     END
     C*
B001 C           *INOF     IFEQ '1'
     C                     EXSR #OF
E001 C                     END
     C*
     C                     MOVE *BLANK    NAME   14
     C                     Z-ADD1         Q       50
     C           EASKBN    LOKUPTB1,Q                    25
     C   25                MOVELTB2,Q     NAME
     C*
     C                     Z-ADD0         XPAR
B001 C           MKKEN     IFNE 0
     C           EASKNS    DIV  MKKEN     @XPAR   83H
     C           @XPAR     MULT 100       XPAR    41H
E001 C                     END
     C*
     C           EASKBN    SETLLEADWP371
B001 C                     DO   *HIVAL
     C           EASKBN    READEEADWP371                 10
B002 C           *IN,10    IFEQ '0'
     C                     MOVE *BLANK    BMNM   18
     C           EBBMON    CHAINFGBPL011             11
B003 C           *IN,11    IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,11
E003 C                     END
     C*
     C  N11                MOVELB2SMEI    BMNM
B2ME C*
     C           EASKNS    IFNE 0
     C           EBBKNS    DIV  EASKNS    @YPAR   83H
     C           @YPAR     MULT 100       YPAR    41H
     C                     END
     C*
B003 C           EBSKBN    IFNE '1'
B004 C           EAMKBN    IFEQ 'A'
     C                     Z-ADD1         A       50
B005 C           BMNM      IFNE *BLANK
     C           BMNM      LOKUPXKJ,A                    12
B006 C           *IN,12    IFEQ '0'
     C                     ADD  1         B
     C                     MOVELBMNM      XKJ,B
B007 C           EBSKBN    IFEQ '2'
     C                     Z-ADDEBBKNS    XAR,B
E007 C                     END
     C*
B007 C           EBSKBN    IFEQ '3'
     C                     Z-ADDEBBKNS    XNS,B
E007 C                     END
     C*
     C                     MOVELXKJ,B     @XJN1
     C                     Z-ADDXAR,B     @XJN2
     C                     Z-ADDXNS,B     @XJN3
     C           @XJN2     ADD  @XJN3     @XKK
     C                     MOVEL@XJN      XJN,B
X006 C                     ELSE
B007 C           EBSKBN    IFEQ '2'
     C                     ADD  EBBKNS    XAR,A
E007 C                     END
     C*
B007 C           EBSKBN    IFEQ '3'
     C                     ADD  EBBKNS    XNS,A
E007 C                     END
     C                     MOVELXKJ,A     @XJN1
     C                     Z-ADDXAR,A     @XJN2
     C                     Z-ADDXNS,A     @XJN3
     C           @XJN2     ADD  @XJN3     @XKK
     C                     MOVEL@XJN      XJN,A
E006 C                     END
E005 C                     END
X004 C                     ELSE
     C                     Z-ADD1         A
B005 C           BMNM      IFNE *BLANK
     C           BMNM      LOKUPYKJ,A                    13
B006 C           *IN,13    IFEQ '0'
     C                     ADD  1         C
     C                     MOVELBMNM      YKJ,C
B007 C           EBSKBN    IFEQ '4'
     C                     Z-ADDEBBKNS    YK1,C
E007 C                     END
     C*
B007 C           EBSKBN    IFEQ '5'
     C                     Z-ADDEBBKNS    YK2,C
E007 C                     END
     C*
B007 C           EBSKBN    IFEQ '6'
     C                     Z-ADDEBBKNS    YK3,C
E007 C                     END
     C                     MOVELYKJ,C     @YJN1
     C                     Z-ADDYK1,C     @YJN2
     C                     Z-ADDYK2,C     @YJN3
     C                     Z-ADDYK3,C     @YJN4
     C           @YJN2     ADD  @YJN3     @YKK
     C                     ADD  @YJN4     @YKK
     C                     MOVEL@YJN      YJN,C
X006 C                     ELSE
B007 C           EBSKBN    IFEQ '4'
     C                     ADD  EBBKNS    YK1,A
E007 C                     END
     C*
B007 C           EBSKBN    IFEQ '5'
     C                     ADD  EBBKNS    YK2,A
E007 C                     END
     C*
B007 C           EBSKBN    IFEQ '6'
     C                     ADD  EBBKNS    YK3,A
E007 C                     END
     C                     MOVELYKJ,A     @YJN1
     C                     Z-ADDYK1,A     @YJN2
     C                     Z-ADDYK2,A     @YJN3
     C                     Z-ADDYK3,A     @YJN4
     C           @YJN2     ADD  @YJN3     @YKK
     C                     ADD  @YJN4     @YKK
     C                     MOVEL@YJN      YJN,A
E006 C                     END
E005 C                     END
E004 C                     END
     C*
     C                     Z-ADD1         A
B004 C           BMNM      IFNE *BLANK
     C           BMNM      LOKUPZMK,A                    14
B005 C           *IN,14    IFEQ '0'
     C                     ADD  1         D
     C                     MOVELBMNM      ZMK,D
B006 C           EBSKBN    IFEQ '2'
     C                     Z-ADDEBBKNS    ZAR,D
E006 C                     END
     C*
B006 C           EBSKBN    IFEQ '3'
     C                     Z-ADDEBBKNS    ZNS,D
E006 C                     END
     C*
B006 C           EBSKBN    IFEQ '4'
     C                     Z-ADDEBBKNS    ZK1,D
E006 C                     END
     C*
B006 C           EBSKBN    IFEQ '5'
     C                     Z-ADDEBBKNS    ZK2,D
E006 C                     END
     C*
B006 C           EBSKBN    IFEQ '6'
     C                     Z-ADDEBBKNS    ZK3,D
E006 C                     END
     C                     MOVELZMK,D     @ZJN1
     C**                                  @ZJN2
     C                     Z-ADDZAR,D     @ZJN3
     C                     Z-ADDZNS,D     @ZJN4
     C                     Z-ADDZK1,D     @ZJN5
     C                     Z-ADDZK2,D     @ZJN6
     C                     Z-ADDZK3,D     @ZJN7
     C           @ZJN3     ADD  @ZJN4     @ZKK
     C                     ADD  @ZJN5     @ZKK
     C                     ADD  @ZJN6     @ZKK
     C                     ADD  @ZJN7     @ZKK
     C                     MOVEL@ZJN      ZJN,D
X005 C                     ELSE
B006 C           EBSKBN    IFEQ '2'
     C                     ADD  EBBKNS    ZAR,A
E006 C                     END
     C*
B006 C           EBSKBN    IFEQ '3'
     C                     ADD  EBBKNS    ZNS,A
E006 C                     END
     C*
B006 C           EBSKBN    IFEQ '4'
     C                     ADD  EBBKNS    ZK1,A
E006 C                     END
     C*
B006 C           EBSKBN    IFEQ '5'
     C                     ADD  EBBKNS    ZK2,A
E006 C                     END
     C*
B006 C           EBSKBN    IFEQ '6'
     C                     ADD  EBBKNS    ZK3,A
E006 C                     END
     C                     MOVELZMK,A     @ZJN1
     C**                                  @ZJN2
     C                     Z-ADDZAR,A     @ZJN3
     C                     Z-ADDZNS,A     @ZJN4
     C                     Z-ADDZK1,A     @ZJN5
     C                     Z-ADDZK2,A     @ZJN6
     C                     Z-ADDZK3,A     @ZJN7
     C           @ZJN3     ADD  @ZJN4     @ZKK
     C                     ADD  @ZJN5     @ZKK
     C                     ADD  @ZJN6     @ZKK
     C                     ADD  @ZJN7     @ZKK
     C                     MOVEL@ZJN      ZJN,A
E005 C                     END
E004 C                     END
E003 C                     END
     C*
     C           KEY1      SETLLEADWP381
     C                     MOVE *BLANK    SW      1
     C                     MOVE *BLANK    KOTE    3
     C                     Z-ADD0         KKENS   40
     C                     MOVE *BLANK    KNKNJ   4
B003 C                     DO   *HIVAL
     C           KEY1      READEEADWP381                 20
B004 C           *IN,20    IFEQ '0'
     C*
     C                     MOVEL'*'       SW
     C                     MOVELECKOTE    KOTE
     C                     Z-ADDECKKNS    KKENS
     C*
     C                     MOVE *BLANK    KNKNJ
B005 C           KKENS     IFNE 0
     C                     MOVEL'CNT '    KNKNJ
E005 C                     END
     C*
B005 C           *INOF     IFEQ '1'
     C                     EXSR #OF
E005 C                     END
     C*
     C           NAME      COMP @KMNAM                   80
     C           BMNM      COMP @BMNM                    81
     C                     EXCPTDET
     C                     MOVELNAME      @KMNAM
     C                     MOVELBMNM      @BMNM
     C*
E004 C                     END
E003 C  N20                END
B003 C           *IN,20    IFEQ '1'
B004 C           SW        IFEQ *BLANK
     C                     MOVE *BLANK    KOTE
     C                     Z-ADD0         KKENS
     C                     MOVE *BLANK    KNKNJ
     C*
B005 C           *INOF     IFEQ '1'
     C                     EXSR #OF
E005 C                     END
     C*
     C           NAME      COMP @KMNAM                   80
     C           BMNM      COMP @BMNM                    81
     C                     EXCPTDET
     C                     MOVELNAME      @KMNAM
     C                     MOVELBMNM      @BMNM
E004 C                     END
E003 C                     END
E002 C                     END
E001 C  N10                END
     C*
     CL1                   EXSR #TL1
     CL1                   MOVEL'1'       *INOF
     CLR                   EXSR #TLR
     C******************************************************
     C           #TL1      BEGSR                           *
     C******************************************************
B001 C           EAMKBN    IFEQ 'A'
B002 C           *INOF     IFEQ '1'
     C                     EXSR #OF
     C                     EXCPTTOT11
X002 C                     ELSE
     C                     EXCPTTOT11
E002 C                     END
     C*
     C                     SORTAXJN
     C                     Z-ADD1         A
B002 C                     DO   100       A
B003 C           XJN,A     IFNE *BLANK
     C                     MOVE XJN,A     @XJN
     C                     MOVEL@XJN1     #XJN1  18
     C                     Z-ADD@XJN2     #XJN2   40
     C                     Z-ADD@XJN3     #XJN3   40
     C                     Z-ADD@XKK      #XJN4   40
     C*
B003 C           *INOF     IFEQ '1'
     C                     EXSR #OF
     C                     EXCPTTOT11
E003 C                     END
     C*
     C                     EXCPTTOT12
     C                     MOVE *BLANK    #XJN1
     C                     Z-ADD0         #XJN2
     C                     Z-ADD0         #XJN3
     C                     Z-ADD0         #XJN4
E003 C                     END
E002 C                     END
     C                     MOVEA*BLANK    XKJ
     C                     Z-ADD*ZERO     XAR
     C                     Z-ADD*ZERO     XNS
     C                     Z-ADD*ZERO     XKK
     C                     MOVEA*BLANK    XJN
     C                     MOVE *BLANK    @XJN
E001 C                     END
     C*
B001 C           EAMKBN    IFEQ 'B'
B002 C           *INOF     IFEQ '1'
     C                     EXSR #OF
     C                     EXCPTTOT21
X002 C                     ELSE
     C                     EXCPTTOT21
E002 C                     END
     C*
     C                     SORTAYJN
     C                     Z-ADD1         A
B002 C                     DO   100       A
B003 C           YJN,A     IFNE *BLANK
     C                     MOVE YJN,A     @YJN
     C                     MOVEL@YJN1     #YJN1  18
     C                     Z-ADD@YJN2     #YJN2   40
     C                     Z-ADD@YJN3     #YJN3   40
     C                     Z-ADD@YJN4     #YJN4   40
     C                     Z-ADD@YKK      #YJN5   40
     C*
B003 C           *INOF     IFEQ '1'
     C                     EXSR #OF
     C                     EXCPTTOT21
E003 C                     END
     C*
     C                     EXCPTTOT22
     C                     MOVE *BLANK    #YJN1
     C                     Z-ADD0         #YJN2
     C                     Z-ADD0         #YJN3
     C                     Z-ADD0         #YJN4
     C                     Z-ADD0         #YJN5
E003 C                     END
E002 C                     END
     C                     MOVEA*BLANK    YKJ
     C                     Z-ADD*ZERO     YK1
     C                     Z-ADD*ZERO     YK2
     C                     Z-ADD*ZERO     YK3
     C                     Z-ADD*ZERO     YKK
     C                     MOVEA*BLANK    YJN
     C                     MOVE *BLANK    @YJN
E001 C                     END
     C*
     C                     ENDSR
     C******************************************************
     C           #TLR      BEGSR                           *
     C******************************************************
B001 C           *INOF     IFEQ '1'
     C                     EXSR #OF
     C                     EXCPTTOT31
X001 C                     ELSE
     C                     EXCPTTOT31
E001 C                     END
     C*
     C                     SORTAZJN
     C                     Z-ADD1         A
B001 C                     DO   100       A
B002 C           ZJN,A     IFNE *BLANK
     C                     MOVE ZJN,A     @ZJN
     C                     MOVEL@ZJN1     #ZJN1  18
     C                     MOVEL@ZJN2     #ZJN2  18
     C                     Z-ADD@ZJN3     #ZJN3   40
     C                     Z-ADD@ZJN4     #ZJN4   40
     C                     Z-ADD@ZJN5     #ZJN5   40
     C                     Z-ADD@ZJN6     #ZJN6   40
     C                     Z-ADD@ZJN7     #ZJN7   40
     C                     Z-ADD@ZKK      #ZJN8   40
     C*
B002 C           *INOF     IFEQ '1'
     C                     EXSR #OF
     C                     EXCPTTOT31
E002 C                     END
     C*
     C                     EXCPTTOT32
     C                     MOVE *BLANK    #ZJN1
     C                     MOVE *BLANK    #ZJN2
     C                     Z-ADD0         #ZJN3
     C                     Z-ADD0         #ZJN4
     C                     Z-ADD0         #ZJN5
     C                     Z-ADD0         #ZJN6
     C                     Z-ADD0         #ZJN7
     C                     Z-ADD0         #ZJN8
E002 C                     END
E001 C                     END
     C                     ENDSR
     C******************************************************
     C           #OF       BEGSR                           *
     C******************************************************
     C                     MOVEL'1'       *INOF
     C                     MOVE *BLANK    MKAS   12
B001 C           EAMKBN    IFEQ 'A'
     C                     MOVELTY,1      MKAS
     C                     Z-ADDMKARI     MKKEN   40
X001 C                     ELSE
     C                     MOVELTY,2      MKAS
     C                     Z-ADDMKNAS     MKKEN
E001 C                     END
     C*
     C           SOKEI     IFNE 0
     C           MKKEN     DIV  SOKEI     @MKPAR  83H
     C           @MKPAR    MULT 100       MKPAR   41H
     C                     END
     C*
     C                     MOVE *BLANK    @KMNAM
     C                     MOVE *BLANK    @BMNM
     C                     TIME           TIME    60
     C*
     C                     MOVEL*ALL'-'   LINE   43
     C                     EXCPTHED
     C                     MOVEL'0'       *INOF
     C*
     C                     ENDSR
     C*
     C*
     C*
     OQPRINT  E   03           HED
     O                                   10 'PGM-EADR39'
     O                                   89 'TIME'
     O                         TIME      98 '  :  :  '
     O        E   04           HED
     O                                    6 'PERIOD'
     O                         STHZ      17 '    .  .  '
     O                                   20 '-'
     O                         ENHZ      29 '    .  .  '
     O                                   63 '** UNDELIVERED ANALYSIS'
     O                                   71 'LIST **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O        E   06           HED
     O                         MKAS      12
     O                         MKKEN 2   19
     O                                   23 'CNT'
     O                         MKPAR 4   28
     O                                   29 '%'
     O        E   0709         HED
     O                         LINE      83
     O        E  1    N81      DET
     O                N81                10 ' '
     O        E  1             DET
     O                N80      NAME      14
     O                N80      EASKNS2   22
     O                N80                26 'CNT'
     O                N80      XPAR  4   31
     O                N80                32 '%'
     O                N81      BMNM      53
     O                N81      EBBKNS2   60
     O                N81                64 'CNT'
     O                N81      YPAR  4   69
     O                N81                70 '%'
     O                         KOTE      77
     O                         KKENS 2   85
     O                         KNKNJ     89
     O        E  2             TOT11
     O                                   33 '* * TOTAL-------'
     O        E 11             TOT11
     O                                   40 'PLATING MAKER'
     O                                   57 '2 PROCES.'
     O                                   70 'NO 2 PROCES.'
     O                                   79 'TOTAL'
     O        E  1             TOT12
     O                         #XJN1     45
     O                         #XJN2 2   53
     O                         #XJN3 2   66
     O                         #XJN4 2   79
     O        E  2             TOT21
     O                                   33 '* * TOTAL-------'
     O        E 11             TOT21
     O                                   44 'PRECEDING PROCESS'
     O                                   52 'WASH.'
     O                                   62 'PKUP'
     O                                   73 'CMPLT.'
     O                                   84 'TOTAL'
     O        E  1             TOT22
     O                         #YJN1     45
     O                         #YJN2 2   52
     O                         #YJN3 2   62
     O                         #YJN4 2   73
     O                         #YJN5 2   84
     O        E  1             TOT31
     O                                   24 '* *TOTAL OF ALL-------'
     O        E  1             TOT31
     O                                   30 'PRECED.PROC./'
     O                                   52 'NO 2'
     O        E  1             TOT31
     O                                   30 'PLATING MAKER'
     O                                   45 '2 PROCES.'
     O                                   54 'PROCES.'
     O                                   63 'WASH.'
     O                                   74 'PKUP'
     O                                   85 'CMPLT.'
     O                                   96 'TOTAL'
     O        E  1             TOT32
     O                         #ZJN1     35
     O                         #ZJN3 2   41
     O                         #ZJN4 2   52
     O                         #ZJN5 2   63
     O                         #ZJN6 2   74
     O                         #ZJN7 2   85
     O                         #ZJN8 2   96
**  <TAB1/TAB2>
12 PROCES.SEC.
22 PROCESSING
3NO 2 PROCES.
4WASHING PART
5PICK-UP PART
6COMPLET.PART
**  TY
PLATING
NO PLATING
