     H            Y.
      *********************************************************
      *   dﾎ､iﾞ]ﾍﾟ]ﾍｭc ﾝｰh mﾞｰj ﾆｬlﾒｭh                        *
      *   1997.02.18                                          *
      *********************************************************
      * ﾆﾞﾏkﾏcﾓbﾈg    ﾎabﾓ
     FDA#PP11 UF  E                    DISK
      * dﾎ､iﾞ]ﾍﾟ]ﾍｭc ﾝｰh ﾎabﾓ
     FDC#WP11 IF  E                    DISK                      A
      *================================================================
      * dﾎﾉcﾍ]ﾆﾑﾌlﾃcﾍﾞ
     I            DS
     I                                        1   40B8FNYY
     I                                        5   60B8FNMM
     I                                        7   80B8FNDD
     I                                        1   80B8FYMD
      * ﾆﾏlfmﾌbﾍﾞ
     I            DS
     I                                        1   40B8TEYY
     I                                        5   60B8TEMM
     I                                        7   80B8TEDD
     I                                        7   80B8TYMD
      * P@YMD
     I            DS
     I                                        1   20P@MM
     I                                        3   40P@DD
     I                                        5   80P@YY
     I                                        1   8 P@YMDX
     I            DS
     I                                        1   40P@YY1
     I                                        5   60P@MM1
     I                                        7   80P@DD1
     I                                        1   80P@YMD1
     I            DS
     I                                        1  140WTIME
     I                                        1   20WJI
     I                                        3   40WFN
     I                                        7  100WYY
     I                                       11  120WMM
     I                                       13  140WDD
      *================================================================
     C           *ENTRY    PLIST
     C                     PARM           P@YMD   8        IS THIS DELIVER
      *================================================================
     C                     MOVE P@YMD     P@YMDX
     C                     Z-ADDP@YY      P@YY1
     C                     Z-ADDP@MM      P@MM1
     C                     Z-ADDP@DD      P@DD1
     C                     TIME           WTIME
      *--------------------
     C                     DO   *HIVAL
     C                     READ DA#PP11                  90
     C   90                LEAVE
      * dﾎﾉcﾍ]ﾆﾑﾌlﾃcﾍﾞ
     C           B8FYMD    IFNE 0
     C                     ITER
     C                     ENDIF
      * ﾆﾏlfmﾌbﾍﾞ
     C           B8TYMD    IFGT P@YMD1
     C                     ITER
     C                     ENDIF
      *
      * dﾎ､iﾞ]ﾍﾟ]ﾍｭc ﾝｰh ﾎabﾓ
     C                     WRITEDC#WP111
      * ﾆﾞﾏkﾏcﾓbﾈg    ﾎabﾓ
     C                     Z-ADDWYY       B8FNYY           dﾎ ﾉcﾍ]ﾆｭ ﾌｮﾃc
     C                     Z-ADDWMM       B8FNMM                  MM
     C                     Z-ADDWDD       B8FNDD                  DD
     C                     UPDATDA#PP111
     C                     ENDDO
      *--------------------
     C                     SETON                     LR
     C                     RETRN
      * DUMMY READ
     C                     READ DC#WP11                  90
      *================================================================
