     H            Y.                    1
     F**EAER02**********************************************
     F* DATA FOR DELIVERY INSTRUCTION TAG CREATE   *
     F*          ---FOR SORT PERSON IN CHARGE CODE ADD ---               *
     F*          PROGRAM ID. : EAER02.                     *
     F*          CREATE DATE. : FEB.23,'91.                *
     F*          AUTHOR.        : K.NAKAMURA               *
     F**********************************************EAER02**
     FDACWP12 IP  F     200            DISK
     FGADPL11 IF  E           K        DISK
     FEAEWP03 O   F     200            DISK
     IDACWP12 AA  01
     I                                        3   60TOKUM L2
     I                                        7   7 TKOJM
     I                                        8  11 TUKEM
     I                                       12  20 KEYNUYL1
     I                                       12  150NONYM
     I                                       16  16 NKOJM
     I                                       17  20 NUKEM
     I                                        1 181 IDATA
     C******************************************************
     C* M-NO               1ﾅbhﾓ ﾉ ﾆﾑﾒ                     *
     C******************************************************
     C           SKEY      KLIST
     C                     KFLD           TOKUM
     C                     KFLD           NONYM
     C                     KFLD           NKOJM
     C                     KFLD           NUKEM
     C******************************************************
     C* M-NO               ﾆﾏlfuﾇj- f[ ﾉcﾍ]f j]ncﾆｫ INPUT  *
     C******************************************************
     C           *INL1     IFEQ '1'
     C                     Z-ADD0         STANT   40
     C                     SETOF                     06
     C           SKEY      CHAINGADPL111             06
     C           *IN06     IFEQ '0'
     C***                  Z-ADDB5TANT    STANT   40
     C                     END
     C                     END
     C                     EXCPTPUT
     OEAEWP03 E                PUT
     O                         IDATA    181
     O                         STANT    185
