     H            Y.
     F** EB#R0F *************************************************
     F*  SET 862 BATCH# TO ABF2P01 BY AB#EP50S                  *
     F*  JW   2023.11.13                                        *
     F***********************************************************
     FABF2L0B UF  E           K        DISK
     FAB#EL52SIF  E           K        DISK
     FABF2P10 IF  E           K        DISK                      A
      ****************************************************
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        9  140TODAY6
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ****************************************************
     C                     EXSR #INIT
      *
     C**         TODAY6    SETLLABF2L0B
     C           231016    SETLLABF2L0B
     C                     DO   *HIVAL
     C                     READ ABF2L0B                  98
     C   98                LEAVE
      *
     C           AFEQMT    IFNE *BLANK
     C                     ITER
     C                     ENDIF
      *
     C           AFDATE    IFNE SVDATE
     C           AFSTID    ORNE SVSTID
     C           AFPOR#    ORNE SVPOR#
     C           AFPART    ORNE SVPART
     C                     EXSR #EQMT
     C                     MOVELAFDATE    SVDATE
     C                     MOVELAFSTID    SVSTID
     C                     MOVELAFPOR#    SVPOR#
     C                     MOVELAFPART    SVPART
     C                     ENDIF
      *
     C           @BATCH    IFNE *BLANK
     C                     MOVEL@BATCH    AFEQMT
     C                     UPDATABF2P011
     C                     EXSR #2P10
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C***********************************************************
     C* GET BATCH#
     C***********************************************************
     C           #EQMT     BEGSR
      *
     C           AFDATE    ADD  20000000  K5SVDT  80
     C                     MOVELAFSTID    K5STID  5
     C                     MOVELAFPOR#    K5POR#  6
     C                     MOVELAFPART    K5PART 40
     C           KEY1      CHAINAB#EL52S             99
     C           *IN99     IFEQ *OFF
     C                     MOVELA5EQMT    @BATCH 10
     C                     ELSE
     C                     MOVE *BLANK    @BATCH
     C                     ENDIF
      *
     C                     ENDSR
     C***********************************************************
     C* ADD 2P10 (HEADER)
     C***********************************************************
     C           #2P10     BEGSR
      *
     C           @BATCH    CHAINABF2P10              99
     C           *IN99     IFEQ *ON
     C                     MOVE AFDATE    P2DATE
     C                     MOVEL'20'      P2DATE
     C                     MOVELAFTIME    P2TIME
     C                     MOVELAFEQMT    P2EQMT
     C                     MOVELAFSTID    P2STID
     C                     MOVELAFPOR#    P2POR#
     C                     MOVELAFSIDT    P2SIDT
     C                     MOVELAFPKCD    P2NONY
     C                     MOVELAFDOCK    P2DOCK
     C                     MOVELAFICCD    P2ICCD
     C                     Z-ADDTODAY     P2CRHZ
     C                     Z-ADDNOW       P2CRTM
     C                     MOVEL#PGM      P2CRPG
     C                     WRITEABF2P101
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------
      * INITIALIZE
      *--------------------------------------------------
     C           #INIT     BEGSR
      *
     C           KEY1      KLIST
     C                     KFLD           K5SVDT  80
     C                     KFLD           K5STID  5
     C                     KFLD           K5POR#  6
     C                     KFLD           K5PART 40
      *
     C           *LIKE     DEFN AFDATE    SVDATE
     C           *LIKE     DEFN AFSTID    SVSTID
     C           *LIKE     DEFN AFPOR#    SVPOR#
     C           *LIKE     DEFN AFPART    SVPART
     C                     CLEARSVDATE
     C                     CLEARSVSTID
     C                     CLEARSVPOR#
     C                     CLEARSVPART
      *
     C                     TIME           SDATE
      *
     C                     ENDSR
