     H            Y.
     F** EB#R0E *************************************************
     F*   EDI(862 FORD) ORDER PROCESSING 1 (B2B)                *
     F*       T.SAKAKI     06/07/2017                           *
JW1  F*   JW  2020.11.25 ADD LOG FILE                           *
JW2  F*   JW  2023.10.11 ADD AFEQMT AS A BATCH#                 *
     F************************************* ORIGINAL:AB#R0E *****
     FEB#EP50 IP  E                    DISK
     FABFAP01 UF  E           K        DISK                      A
     FABFAL01 IF  E           K        DISK
     FABF1L01 UF  E           K        DISK                      A
     FAB#PPCT UF  E           K        DISK                      A
JW1  FABFAP02 O   E           K        DISK
      ****************************************************
     E                    IPAR       30  1
     E                    OPAR       20  1
      ****************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  140WTMDT
     I                                        1   60WTIME
     I                                        1   20WTIHH
     I                                        3   40WTIMM
     I                                        5   60WTISS
     I                                        7  100WDAY4
     I                                        7  140WDAT8
     I                                        9  100WDAYY
     I                                        9  140WDATE
     I                                       11  120WDAMM
     I                                       13  140WDADD
      ****************************************************
     C                     MOVE A5REF#    K@REF#
 JW1  * EDIT DOCK CODE
  |  C           A5DOCK    IFNE *BLANK
  |  C           A5DOCK    ANDNE'__'
  |  C                     MOVELA5DOCK    K@DOCK  4
  |  C                     ELSE
  |  C                     MOVEL'00  '    K@DOCK
 JW1 C                     ENDIF
      *
     C           KEY2      CHAINABF1P011             94
     C   94                CLEARABF1P011
      *
     C                     Z-ADDWTIME     AFTIME
     C                     Z-ADDWDATE     AFDATE
     C                     MOVELA5PART    AFPART           BUYER PART #
     C* FORD PART  --> NO BLANK PART
     C                     MOVEAA5PART    IPAR
     C                     MOVE *BLANK    OPAR
     C                     Z-ADD0         M       20
     C*
     C           1         DO   30        N       20
     C           IPAR,N    IFNE *BLANK
     C                     ADD  1         M
     C                     MOVE IPAR,N    OPAR,M
     C                     ENDIF
     C                     ENDDO
     C*
     C                     MOVEAOPAR      AFIPAR
     C                     MOVE A5REF#    AFREF#
     C                     MOVE A5SPCD    AFSPCD
     C                     Z-ADDA5SIDT    AFSIDT
     C                     Z-ADDA5HSDT    AFHSDT
     C                     Z-ADDA5HEDT    AFHEDT
     C                     MOVELA5POR#    AFPOR#
     C                     MOVE A5STIQ    AFSTIQ
     C                     MOVE A5STID    AFSTID
     C                     MOVE A5IDCD    AFIDCD
     C                     MOVE A5TSID    AFTSID
     C                     MOVE A5TPCD    AFTPCD
     C                     MOVE A5PKCD    AFPKCD
     C*** UNT
     C                     MOVE A5UBM1    AFUBM1           UNIT OF BASIS CODE
     C           A5DOCK    IFNE *BLANK
     C           A5DOCK    ANDNE'__'
     C                     MOVELA5DOCK    AFDOCK           DOCK CODE
     C                     ELSE
     C                     MOVEL'00  '    AFDOCK
     C                     ENDIF
      *
      *
     C                     MOVELA5ALFL    AFALFL           ASB. LINE FEED LOC
     C                     MOVELA5RALF    AFRALF           RESERVE ASB. LIN FED
     C                     MOVELA5EXCD    AFEXCD           CONTACT CODE(EX)
     C                     MOVELA5RDCD    AFRDCD           CONTACT CODE(RD)
     C                     Z-ADDA5LSDT    AFLSDT           LAST SHIP DATE
     C                     Z-ADDA5LSQY    AFLSQY           LAST SHIP QTY
     C                     Z-ADDA5YSDT    AFYSDT           YTD CUM SHIP DATE
     C                     Z-ADDA5YSQY    AFYSQY           YTD CUM SHIP QTY
     C                     Z-ADDA5YRDT    AFYRDT           YTD CUM RECE DATE
     C                     Z-ADDA5YRQY    AFYRQY           YTD CUM RECE QTY
     C                     Z-ADDA5DLDT    AFDLDT
     C                     Z-ADDA5QTY2    AFQTY2
     C                     MOVELA5STFC    AFICCD           IC CODE / STORAGE FAC
     C**                   MOVEL#USER     AFUSER
JW2  C                     MOVEL#PGM      AFUSER           PGM
JW2  C                     MOVELA5EQMT    AFEQMT    P      BATCH#
      *
     C   94                WRITEABF1P011
     C  N94                UPDATABF1P011
     C           *IN01     IFEQ *OFF
     C           KEY3      CHAINAB#PPCT              90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDWDAT8     CTNBR1
     C                     Z-ADDWTIME     CTNBR2
     C                     UPDATAB#PPCT1
     C                     ELSE
     C                     CLEARAB#PPCT1
     C                     MOVELK@KWD1    CTKEY1
     C                     MOVELK@KWD2    CTKEY2
     C                     Z-ADDWDAT8     CTNBR1
     C                     Z-ADDWTIME     CTNBR2
     C                     WRITEAB#PPCT1
     C                     ENDIF
     C                     MOVE *ON       *IN01
     C                     ENDIF
     C** WRITE KEY FILE
     C                     MOVELAFSTID    KDOCK
     C                     MOVELAFDOCK    KDOC2
     C                     MOVELAFIPAR    KPART
     C           KEY1      CHAINABFAP01R             91
B01  C           *IN91     IFEQ '0'
JW1   * LOG
 .   C                     MOVEL'BEFORE'  C2UPST
 .   C                     EXSR #LOGU
     C*
     C                     Z-ADDWDAY4     CFUPDY
     C                     Z-ADDWDAMM     CFUPDM
     C                     Z-ADDWDADD     CFUPDD
     C                     Z-ADDWTIHH     CFUPTH
     C                     Z-ADDWTIMM     CFUPTM
     C*
     C                     SELEC
B02  C           AFSIDT    WHGT CFSIDT
     C                     MOVELAFREF#    CFREF#           REFERENCE #
     C                     MOVELAFPOR#    CFPOR#           RELEASE #
     C                     Z-ADDAFSIDT    CFSIDT           SCHEDULE DATE
     C                     Z-ADDAFHSDT    CFHSDT           START DATE
     C                     Z-ADDWDATE     CFCDAT           CREATE DATE
     C                     UPDATABFAP01R
JW1   * LOG
 .   C                     MOVEL'AFTER '  C2UPST
 .   C                     EXSR #LOGU
     C*
     C*
B02  C           AFSIDT    WHEQ CFSIDT
     C           AFREF#    ANDGTCFREF#
     C                     MOVELAFREF#    CFREF#           REFERENCE #
     C                     MOVELAFPOR#    CFPOR#           RELEASE #
     C                     Z-ADDAFSIDT    CFSIDT           SCHEDULE DATE
     C                     Z-ADDAFHSDT    CFHSDT           START DATE
     C                     Z-ADDWDATE     CFCDAT           CREATE DATE
     C                     UPDATABFAP01R
JW1   * LOG
 .   C                     MOVEL'AFTER '  C2UPST
 .   C                     EXSR #LOGU
     C                     ENDSL
     C*
     C                     ELSE
     C                     Z-ADD*ZERO     @@CAMT  90
     C                     Z-ADD*ZERO     @@CAMN  90
     C           KEY4      SETLLABFAL01
     C           *IN90     DOUEQ*ON
     C           KEY4      READEABFAL01                  90
     C           *IN90     IFEQ *OFF
     C           CFDLCD    ANDEQ*BLANK
     C                     Z-ADDCFCAMT    @@CAMT
     C                     Z-ADDCFCAMN    @@CAMN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     CLEARABFAP01R
     C                     Z-ADDWDAY4     CFUPDY
     C                     Z-ADDWDAMM     CFUPDM
     C                     Z-ADDWDADD     CFUPDD
     C                     Z-ADDWTIHH     CFUPTH
     C                     Z-ADDWTIMM     CFUPTM
      *
     C                     MOVELAFREF#    CFREF#           REFERENCE #
     C                     MOVELAFSTID    CFDOCK           DOCK CODE
     C                     MOVELAFDOCK    CFDOC2           DOCK CODE
     C                     MOVELAFIPAR    CFPART           PART
     C                     MOVELAFPOR#    CFPOR#           RELEASE #
     C                     Z-ADDAFSIDT    CFSIDT           SCHEDULE DATE
     C                     Z-ADDAFHSDT    CFHSDT           START DATE
     C                     Z-ADDWDATE     CFCDAT           CREATE DATE
     C                     Z-ADD@@CAMT    CFCAMT
     C                     Z-ADD@@CAMN    CFCAMN
     C                     WRITEABFAP01R
JW1   * LOG
 .   C                     EXSR #LOGC
      *
E01  C                     ENDIF
     C*
JW1  C***********************************************************
 .   C* LOG FILE - UPDATE
 .   C***********************************************************
 .   C           #LOGU     BEGSR
      *
     C                     MOVE *BLANK    C2DLCD
     C                     Z-ADD0         C2DLHZ
     C                     Z-ADD0         C2DLTM
     C                     MOVE *BLANK    C2DLUS
     C                     Z-ADDWDAT8     C2UPHZ
     C                     Z-ADDWTIME     C2UPTM
     C                     MOVEL#USER     C2UPUS
     C                     Z-ADD0         C2CRHZ
     C                     Z-ADD0         C2CRTM
     C                     MOVEL#PGM      C2CRUS
     C                     WRITEABFAP02R
      *
     C                     ENDSR
JW1  C***********************************************************
 .   C* LOG FILE - CREATE
 .   C***********************************************************
 .   C           #LOGC     BEGSR
      *
     C                     MOVE *BLANK    C2DLCD
     C                     Z-ADD0         C2DLHZ
     C                     Z-ADD0         C2DLTM
     C                     MOVE *BLANK    C2DLUS
     C                     Z-ADD0         C2UPHZ
     C                     Z-ADD0         C2UPTM
     C                     MOVE *BLANK    C2UPUS
     C                     MOVE *BLANK    C2UPST
     C                     Z-ADDWDAT8     C2CRHZ
     C                     Z-ADDWTIME     C2CRTM
     C                     MOVEL#PGM      C2CRUS
     C                     WRITEABFAP02R
      *
     C                     ENDSR
      *--------------------------------------------------
      * INITIALIZE
      *--------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           KEY1      KLIST
     C                     KFLD           KDOCK   5
     C                     KFLD           KDOC2   4
     C                     KFLD           KPART  12
     C*
     C           KEY2      KLIST
     C                     KFLD           A5STID
     C                     KFLD           K@DOCK
     C                     KFLD           A5PART
     C                     KFLD           A5SIDT
     C                     KFLD           A5POR#
     C                     KFLD           K@REF# 10
     C                     KFLD           A5DLDT
      *
     C           KEY3      KLIST
     C                     KFLD           K@KWD1  8
     C                     KFLD           K@KWD2  8
     C           KEY4      KLIST
     C                     KFLD           KDOCK   5
     C                     KFLD           KPART  12
      *
     C                     MOVEL'FORD'    K@KWD1    P
     C                     MOVEL'862GNTRN'K@KWD2    P
      *
     C                     TIME           WTMDT
      *
     C                     ENDSR
