     H            Y.
     F** EB#R0G *************************************************
     F*  SET 862 BATCH# TO ABF2P01 BY AB#EP50S                  *
     F*  JW   2023.11.13                                        *
     F***********************************************************
     FABF2L0B IF  E           K        DISK
     FABF2P10 IF  E           K        DISK                      A
      ****************************************************
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        9  140TODAY6
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ****************************************************
     C                     EXSR #INIT
      *
     C**         TODAY6    SETLLABF2L0B
     C           231010    SETLLABF2L0B
     C                     DO   *HIVAL
     C                     READ ABF2L0B                  98
     C   98                LEAVE
      *
     C           AFEQMT    IFEQ *BLANK
     C                     ITER
     C                     ENDIF
      *
     C           AFEQMT    IFNE SVEQMT
     C                     EXSR #2P10
     C                     MOVELAFEQMT    SVEQMT
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C***********************************************************
     C* ADD 2P10 (HEADER)
     C***********************************************************
     C           #2P10     BEGSR
      *
     C           AFEQMT    CHAINABF2P10              99
     C           *IN99     IFEQ *ON
     C                     MOVE AFDATE    P2DATE
     C                     MOVEL'20'      P2DATE
     C                     MOVELAFTIME    P2TIME
     C                     MOVELAFEQMT    P2EQMT
     C                     MOVELAFSTID    P2STID
     C                     MOVELAFPOR#    P2POR#
     C                     MOVELAFSIDT    P2SIDT
     C                     MOVELAFPKCD    P2NONY
     C                     MOVELAFDOCK    P2DOCK
     C                     MOVELAFICCD    P2ICCD
     C                     Z-ADDTODAY     P2CRHZ
     C                     Z-ADDNOW       P2CRTM
     C                     MOVEL#PGM      P2CRPG
     C                     WRITEABF2P101
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------
      * INITIALIZE
      *--------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *LIKE     DEFN AFEQMT    SVEQMT
     C                     CLEARSVEQMT
      *
     C                     TIME           SDATE
      *
     C                     ENDSR
