     H            Y.
     F** ECNR15 ********************************
     F* ...BY INTRA-PROCESS MACHINE         *
     F*            GET GROSS WEIGHT KG .. *.
     F* I-HASADA                 87.04.01      *
     F******************************** ECNR15 **
     FECNWP06 IP  F      40            DISK
     FECNTP15 IF  E           K        DISK
     FECNTP03 O   E                    DISK
     IECNWP06 AA  01
     I                                        1   20DBUBU L2
     I                                        3   40DBUKA L1
     I                                        5   50DBURI
     I                                        6   60DBUHN
     I                                        7   90DFURY
     I                                       10  153DSOGI
     I                                       16  190DRECD
     I                                       20  24 DKINO
     C           KEY       KLIST
     C                     KFLD           DBUBU
     C                     KFLD           DBUKA
     C                     KFLD           DKINO
     C                     KFLD           CFURY
     C                     KFLD           CFUGI
      *
     C                     SETON                     03
     C                     Z-ADD0         CFURY   30
     C                     Z-ADD0         CFUGI   63
     C           KEY       SETLLECNTP151
     C           STP1      TAG
     C                     SETOF                     0204
     C                     READ ECNTP151                 02
     C   02                SETON                     04
     C   02                GOTO END
     C           STP2      TAG
      *
     C           DBUKA     CABNEN2BUKA    END        0404
     C           DKINO     CABNEN2KINO    END        0404
     C   03                MOVE N2FURY    WFURY   20
     C   03                SETOF                     03
     C           WFURY     CABNEN2FURY    END        0404
     C                     ADD  N2FUGI    N2SOGI
     C                     GOTO STP1
     C           END       TAG
     C                     Z-ADDN2FURY    WFURY
     C  N04                GOTO STP2
      *
     CL1                   Z-ADDDBUBU     N2BUBU
     CL1                   Z-ADDDBUKA     N2BUKA
     CL1                   Z-ADDDBURI     N2BURI
     CL1                   Z-ADDDBUHN     N2BUHN
     CL1                   WRITEECNTP031
     CL1                   Z-ADD0         N2SOGI
