     H            Y.
      ** ECNR02 ********************************
      * ...INTRA-PROCESS NON-CONFORMING PRODUCT LIST          *
      *                * ONLY CONDITION  WRITE...
      * I-HASADA                 87.04.01      *
      ******************************** ECNR02 **
     FECNPP01 IP  E                    DISK
     FECNTP02 O   E                    DISK
      *****************************************************************
     E                    HRT         5  3 0             ﾎﾒﾑcNO.
      *****************************************************************
     I            DS
     I                                        1   80N2SKHZ
     I                                        1   40N2SKYY
     I                                        5   60N2SKMM
     I                                        7   80N2SKDD
     I            DS
     I                                        1   60WHIZ1
     I            DS
     I                                        1   80WHIZ2
     I                                        1   60WH2YM
     I                                        1   40WH2YY
     I                                        5   60WH2MM
     I                                        7   80WH2DD
     I            DS
     I                                        1   80WHIZ3
     I                                        1   60WH3YM
     I                                        1   40WH3YY
     I                                        5   60WH3MM
     I                                        7   80WH3DD
     I            DS
     I                                        1   80N2HAHZ
     I                                        1   60N2HAYM
     I                                        1   40N2HAYY
     I                                        5   60N2HAMM
     I                                        7   80N2HADD
      *****************************************************************
     C           *ENTRY    PLIST
     C                     PARM           PKUBN   1
     C                     PARM           PJUN    1
     C                     PARM           PHIZ1   6
     C                     PARM           PHIZ2   8
     C                     PARM           PHIZ3   8
     C                     PARM           PJRYO   63
     C                     PARM           PFRNO   3
     C                     PARM           PKINO   5
     C                     PARM           PBUKA   2
     C                     PARM           PBMON   4
      *
     C                     MOVE PHIZ1     WHIZ1
     C                     MOVE PHIZ2     WHIZ2
     C                     MOVE PHIZ3     WHIZ3
     C                     MOVE PFRNO     WFRNO   30
     C                     MOVE PBUKA     UBUKA   20
     C                     MOVE PBMON     WBMON   40
      *
     C           WFRNO     COMP *ZERO                0101
     C           PKINO     COMP *BLANK               0202
     C           UBUKA     COMP *ZERO                0303
      *
     C           PKUBN     CABEQ'1'       @STP1
     C           PKUBN     CABEQ'3'       @STP2
      *
     C                     Z-ADDWHIZ1     WH2YM
     C                     Z-ADDWHIZ1     WH3YM
      *
     C           PJUN      CABEQ'1'       @STP3
     C           PJUN      CABEQ'2'       @STP4
      *
     C                     Z-ADD21        WH2DD
     C                     Z-ADD31        WH3DD
     C                     GOTO @STP2
      *
     C           @STP3     TAG
     C                     Z-ADD01        WH2DD
     C                     Z-ADD10        WH3DD
     C                     GOTO @STP2
      *
     C           @STP4     TAG
     C                     Z-ADD11        WH2DD
     C                     Z-ADD20        WH3DD
      *
     C           @STP2     TAG
     C           N2SKJY    IFEQ 'D'
     C           N2SKHZ    IFLE *DATE
     C                     GOTO @END
     C                     END
     C                     END
      *
     C           N2BMON    CABNEWBMON     @END
     C           N2HAHZ    CABLTWHIZ2     @END
     C           N2HAHZ    CABGTWHIZ3     @END
     C   03      N2BUKA    CABNEUBUKA     @END
      *
     C                     GOTO @STP5
      *
     C           @STP1     TAG
     C           N2SKJY    IFEQ 'D'
     C           N2SKHZ    IFLE *DATE
     C                     GOTO @END
     C                     END
     C                     END
      *
     C           N2BMON    CABNEWBMON     @END
     C           N2HAYM    CABNEWHIZ1     @END
     C   03      N2BUKA    CABNEUBUKA     @END
      *
     C           @STP5     TAG
     C           N2FUGI    CABLTPJRYO     @END
     C   02      PKINO     CABNEN2KINO    @END
      *
     C                     Z-ADDN2FUR1    HRT,1
     C                     Z-ADDN2FUR2    HRT,2
     C                     Z-ADDN2FUR3    HRT,3
     C                     Z-ADDN2FUR4    HRT,4
     C                     Z-ADDN2FUR5    HRT,5
     C                     Z-ADD1         I       10
     C   01      WFRNO     CABNEHRT,I     @STP9
     C                     Z-ADDHRT,I     N2FURY
     C                     SETON                     U1
     C                     WRITEECNTP021
      *
     C           @STP9     TAG
     C                     ADD  1         I
      *
     C           @STP6     TAG
     C           I         CABEQ6         @END
     C           HRT,I     CABEQ*ZERO     @END
      *
     C   01      WFRNO     CABNEHRT,I     @STP10
     C                     Z-ADDHRT,I     N2FURY
     C                     SETON                     U1
     C                     WRITEECNTP021
      *
     C           @STP10    TAG
     C                     ADD  1         I
     C                     GOTO @STP6
      *
     C           @END      TAG
