     H            Y.
     F** ECQR50 ********************************************
     F* TOLL REPORT CREATE                                 *
     F*                                                    *
     F* TCHK1 05/20/09 CREATE                              *
     F******************************************************
     FECQPW50 CF  E                    WORKSTN
     F                                              KINFDS @INFDS
     F*
     FGCQPL13 IF  E           K        DISK
     FECSPL05 IF  E           K        DISK
     FECSPL10 IF  E           K        DISK
     F*
     FECQWP50 UF  E           K        DISK                      A
     F*
     E                    MSG     1   5 60
     I*
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME(6) + DATE(6)
     I            DS
     I                                        1  140WSSDAT
     I                                        1   60WSTIM6
     I                                        1   40WSTIM4
     I                                        1   20WSTIMH
     I                                        3   40WSTIMM
     I                                        5   60WSTIMS
     I                                        7  140WSCYMD
     I                                        7  120WSCYM6
     I                                        9  120WSYM4
     I                                        9  120WSYMD
     I                                        7  100WSYY
     I                                       11  120WSMM
     I                                       13  140WSDD
     I            DS
     I                                        1   60D@YYMM
     I                                        1   40D@YY
     I                                        5   60D@MM
     I            DS
     I                                        1   60W@YYMM
     I                                        1   40W@YY
     I                                        5   60W@MM
     I            DS
     I                                        1   60EQYOYM
     I                                        1   40EQYOYY
     I                                        5   60EQYOMM
     I            DS
     I                                        1   7 W@KAT
     I                                        1   6 W@KAT6
     I                                        1   2 W@KAT1
     I                                        3   6 W@KAT2
     I                                        7   7 W@KAT3
     I* ----------------------------------------------------
     C*
     C           STP0      TAG
     C                     SETOF                     0299
     C                     MOVE *BLANK    ERR
     C                     TIME           WSSDAT
     C                     Z-ADDWSCYM6    D@YYMM
      *
     C******************************************************
     C*  EXFMT  <fﾞx] 1>                                   *
     C******************************************************
     C           STP1      TAG
     C                     EXFMTFMT010
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     SETOF                     0299
     C                     MOVE *BLANK    ERR
     C*
     C           D@YYMM    IFNE *ZERO
     C           D@YY      IFLT 1988
     C           D@MM      ORGT 12
     C           D@MM      ORLT 01
     C                     SETON                     0299
     C                     MOVELMSG,5     ERR
     C                     GOTO STP1
     C                     END
     C                     ELSE
     C                     Z-ADDWSCYM6    D@YYMM
     C                     END
      *
     C           *INKE     IFEQ *ON
     C                     EXSR #SET#A
     C                     EXSR #SET#B
     C                     EXSR #SET#C
     C                     EXSR #SET#D
     C                     ELSE
     C                     GOTO STP1
     C                     END
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C*-----------------------------------------------------
     C*
     C*-----------------------------------------------------
     C           #SET#A    BEGSR
      *
     C                     Z-ADDD@YYMM    W@YYMM
     C*
     C           W@MM      SUB  5         W@MM
     C           W@MM      IFLE *ZERO
     C                     ADD  12        W@MM
     C           W@YY      SUB  1         W@YY
     C                     END
     C*
     C                     MOVEL*LOVAL    W@KAT
     C*
     C           *LOVAL    SETLLGCQPL131
     C*
     C                     DO   *HIVAL
     C*
     C                     READ GCQPL131                 98
     C   98                LEAVE
     C*
     C           T6SKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C           T6KAT3    IFNE *BLANK
     C                     ITER
     C                     END
      *
     C           T6KAT1    IFNE W@KAT1
     C           T6KAT2    ORNE W@KAT2
     C                     CLEARECQWP501
     C                     Z-ADDWSCYMD    E5CDAT
     C                     Z-ADDWSTIM6    E5CTIM
     C                     MOVEL#USER     E5COME
     C                     MOVEL#PGM      E5CPGM
     C                     Z-ADDD@YYMM    E5YYMM
     C                     MOVELT6KAT1    E5KAT1
     C                     MOVELT6KAT2    E5KAT2
     C                     MOVELT6KAT3    E5KAT3
     C                     Z-ADDT6SRYO    E5SETS
     C                     WRITEECQWP501
     C                     MOVELT6KAT1    W@KAT1
     C                     MOVELT6KAT2    W@KAT2
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C* ----------------------------------------------------
     C*
     C* ----------------------------------------------------
     C           #SET#B    BEGSR
     C*
     C           *LOVAL    SETLLECSPL05
     C*
     C                     DO   *HIVAL
     C*
     C                     READ ECSPL05                  97
     C   97                LEAVE
     C           EQSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           EQBMON    IFNE 0111
     C                     ITER
     C                     END
     C           EQYOYM    IFLT W@YYMM
     C           EQYOYM    ORGT D@YYMM
     C                     ITER
     C                     END
     C           EQKOSU    IFEQ *ZERO
     C                     ITER
     C                     END
     C*
     C           K#STB1    KLIST
     C                     KFLD           EQKAT1
     C                     KFLD           EQKAT2
     C                     KFLD           EQKAT3
     C           K#STB1    CHAINECQWP50              96
     C           *IN96     IFEQ *OFF
     C                     ADD  EQKOSU    E5UQTY
     C                     UPDATECQWP501
     C                     ITER
     C                     END
     C*
     C                     CLEARECQWP501
     C                     Z-ADDWSCYMD    E5CDAT
     C                     Z-ADDWSTIM6    E5CTIM
     C                     MOVEL#USER     E5COME
     C                     MOVEL#PGM      E5CPGM
     C                     Z-ADDD@YYMM    E5YYMM
     C                     MOVELEQKAT1    E5KAT1
     C                     MOVELEQKAT2    E5KAT2
     C                     MOVELEQKAT3    E5KAT3
     C                     Z-ADDEQKOSU    E5UQTY
     C           K#STB2    KLIST
     C                     KFLD           EQKAT1
     C                     KFLD           EQKAT2
     C                     KFLD           K@KAT3  1
     C                     MOVEL*BLANK    K@KAT3
     C           K#STB2    SETLLGCQPL13
     C                     DO   *HIVAL
     C           K#STB2    READEGCQPL13                  95
     C   95                LEAVE
     C           T6SKJY    IFEQ *BLANK
     C                     Z-ADDT6SRYO    E5SETS
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     WRITEECQWP501
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*
     C* ----------------------------------------------------
     C*
     C* ----------------------------------------------------
     C           #SET#C    BEGSR
     C*
     C           *LOVAL    SETLLECSPL10
     C*
     C                     DO   *HIVAL
     C*
     C                     READ ECSPL10                  97
     C   97                LEAVE
     C           E1SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           E1SQTY    IFEQ *ZERO
     C                     ITER
     C                     END
     C*
     C           K#STC1    KLIST
     C                     KFLD           E1KAT1
     C                     KFLD           E1KAT2
     C                     KFLD           E1KAT3
     C           K#STC1    CHAINECQWP50              96
     C           *IN96     IFEQ *OFF
     C                     ADD  E1SQTY    E5INVT
     C                     UPDATECQWP501
     C                     ITER
     C                     END
     C*
     C                     CLEARECQWP501
     C                     Z-ADDWSCYMD    E5CDAT
     C                     Z-ADDWSTIM6    E5CTIM
     C                     MOVEL#USER     E5COME
     C                     MOVEL#PGM      E5CPGM
     C                     Z-ADDD@YYMM    E5YYMM
     C                     MOVELE1KAT1    E5KAT1
     C                     MOVELE1KAT2    E5KAT2
     C                     MOVELE1KAT3    E5KAT3
     C                     Z-ADDE1SQTY    E5INVT
     C           K#STC2    KLIST
     C                     KFLD           E1KAT1
     C                     KFLD           E1KAT2
     C                     KFLD           K@KAT3  1
     C                     MOVEL*BLANK    K@KAT3
     C           K#STC2    SETLLGCQPL13
     C                     DO   *HIVAL
     C           K#STC2    READEGCQPL13                  95
     C   95                LEAVE
     C           T6SKJY    IFEQ *BLANK
     C                     Z-ADDT6SRYO    E5SETS
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     WRITEECQWP501
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*
     C* ----------------------------------------------------
     C*
     C* ----------------------------------------------------
     C           #SET#D    BEGSR
     C*
     C           *LOVAL    SETLLECQWP50
     C*
     C                     DO   *HIVAL
     C*
     C                     READ ECQWP50                  97
     C   97                LEAVE
     C*
     C           E5UQTY    DIV  6         E5AQTY    H
     C*
     C                     UPDATECQWP501
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*
**  MSG (ERROR MESSAGE )
E-01 PLEASE SIGNOFF WHEN DOESN'T USE IT LONG TIME.
E-02 INPUT FACTORY CODE.
E-03 FACTORY CODE ISN'T RIGHT.
E-04 INPUT DIE NO
E-05 DATE ISN'T RIGHT
