     H            Y.
     F** ECQR11 ********************************************
     F*  12 MONTHS DIE USED/SHIPPED QTY FOR PC(GP)         *
     F*                                                    *
     F* TCHK1 07/20/07 CREATE                              *
     F******************************************************
     FECQPW11 CF  E                    WORKSTN
     F*
     FECSPL05 IF  E           K        DISK
     FGCQTL31 IF  E           K        DISK
     FGCQTL32 IF  E           K        DISK
     FFCQPL31 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     FECQWP11 UF  E           K        DISK                      A
     E*
     E                    E1K        12  7 0
     E                    E1S        12 11 0
     E                    YM         12  6 0
     E*
     E                    NUKH       15 10 0
     E                    OKOT       15  3
     E                    OKBM       15  4 0
     E                    NKOT       15  3
     E                    NKBM       15  4 0
     E                    HKT        15  3
     E                    HBM        15  4 0
     E                    I6S        12  9 0
     I*
     IGCQTL321
     I              DFSKJY                          ##SKJY
     I              DFSKHZ                          ##SKHZ
     I              DFSKYY                          ##SKYY
     I              DFSKMM                          ##SKMM
     I              DFSKDD                          ##SKDD
     I              DFKOHZ                          ##KOHZ
     I              DFKOYY                          ##KOYY
     I              DFKOMM                          ##KOMM
     I              DFKODD                          ##KODD
     I              DFKOPN                          ##KOPN
     I              DFKOHH                          ##KOHH
     I              DFKOSS                          ##KOSS
     I              DFKOME                          ##KOME
     I              DFSHIN                          ##SHIN
     I              DFSHN1                          ##SHN1
     I              DFSHN2                          ##SHN2
     I              DFSHN3                          ##SHN3
     I              DFKOTI                          ##KOTI
     I              DFKSEI                          ##KSEI
     I              DFKATA                          ##KATA
     I              DFKOSU                          ##KOSU
     I              DFKUBN                          ##KUBN
     I              DFKSKB                          ##KSKB
     I*
     I            DS
     I                                        1  840E1K
     I                                        1   70E1KO01
     I                                        8  140E1KO02
     I                                       15  210E1KO03
     I                                       22  280E1KO04
     I                                       29  350E1KO05
     I                                       36  420E1KO06
     I                                       43  490E1KO07
     I                                       50  560E1KO08
     I                                       57  630E1KO09
     I                                       64  700E1KO10
     I                                       71  770E1KO11
     I                                       78  840E1KO12
     I            DS
     I                                        1 1320E1S
     I                                        1  110E1SO01
     I                                       12  220E1SO02
     I                                       23  330E1SO03
     I                                       34  440E1SO04
     I                                       45  550E1SO05
     I                                       56  660E1SO06
     I                                       67  770E1SO07
     I                                       78  880E1SO08
     I                                       89  990E1SO09
     I                                      100 1100E1SO10
     I                                      111 1210E1SO11
     I                                      122 1320E1SO12
     I*
     I            DS
     I                                        1  45 OKOT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600OKBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  45 NKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600NKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1 1500NUKH
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1 1080I6S
     I                                        1   90I6SRO1
     I                                       10  180I6SRO2
     I                                       19  270I6SRO3
     I                                       28  360I6SRO4
     I                                       37  450I6SRO5
     I                                       46  540I6SRO6
     I                                       55  630I6SRO7
     I                                       64  720I6SRO8
     I                                       73  810I6SRO9
     I                                       82  900I6SROA
     I                                       91  990I6SROB
     I                                      100 1080I6SROC
     I            DS
     I                                        1  15 DFKATA
     I                                        1   2 #KAT1
     I                                        3   3 #AAA
     I                                        4   7 #KAT2
     I                                        8   8 #BBB
     I                                        9   9 #KAT3
     I                                       10  15 #CCC
     I*
     I            DS
     I                                        1   60EQHZ
     I                                        1   40EQYOYY
     I                                        5   60EQYOMM
     I*
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I*
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     I                                        7  120WSSYM
     I            DS
     I                                        1   60W@YYMM
     I                                        1   40W@YYYY
     I                                        5   60W@MMMM
     C******************************************************
     C* MAIN
     C******************************************************
     C                     SETOF                     6199
     C*
     C                     DO   *HIVAL
     C*
     C                     EXFMTDSP01
     C*
     C   KA                LEAVE
     C*
     C                     EXSR #CHK
     C   99                ITER
     C* F5: CREATE
     C           *INKE     IFEQ *ON
     C                     EXSR @SETYM
     C                     EXSR @HEAD
     C                     EXSR @USAGE
     C                     EXSR @SQTY
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     MOVE *ON       *INLR
     C                     RETRN
     C*-----------------------------------------------------
     C           #CHK      BEGSR
     C*-----------------------------------------------------
     C                     SETOF                     6199
     C                     Z-ADDD@YYMM    W@YYMM
     C           W@YYYY    IFEQ *ZERO
     C                     SETON                     6199
     C                     END
     C           W@MMMM    IFLT 01
     C           W@MMMM    ORGT 12
     C                     SETON                     6199
     C                     END
     C*
     C                     ENDSR
     C******************************************************
     C* INITIAL
     C******************************************************
     C           *INZSR    BEGSR
     C*
     C                     TIME           WSDT
     C                     Z-ADDWSSYM     D@YYMM
     C*
     C                     ENDSR
     C******************************************************
     C* SET 12 MONTH YYMM
     C******************************************************
     C           @SETYM    BEGSR
     C*
     C                     Z-ADD*ZERO     YM
     C                     Z-ADDD@YYMM    W@YYMM
     C                     Z-ADDW@YYMM    YM,12
     C                     Z-ADD12        I       20
     C*
     C                     DO   11
     C                     SUB  1         W@MMMM
     C           W@MMMM    IFLT 1
     C                     Z-ADD12        W@MMMM
     C                     SUB  1         W@YYYY
     C                     END
     C                     SUB  1         I
     C                     MOVELW@YYMM    YM,I
     C                     ENDDO
     C*
     C                     ENDSR
     C******************************************************
     C* CREATE HEADER
     C******************************************************
     C           @HEAD     BEGSR
     C*
     C                     CLEARECQWP111
     C*
     C           1         DO   12        I
     C                     Z-ADDYM,I      E1K,I
     C                     Z-ADDYM,I      E1S,I
     C                     ENDDO
     C*
     C                     WRITEECQWP111
     C*
     C                     ENDSR
     C******************************************************
     C* GET & SUMMARY USAGE COUNT                          *
     C******************************************************
     C           @USAGE    BEGSR
     C*
     C           *LOVAL    SETLLECQPL051
     C*
     C                     DO   *HIVAL
      *
     C                     READ ECQPL051                 99
     C   99                LEAVE
     C*
     C           EQSKJY    IFEQ 'D'
     C           EQSKHZ    ANDLE*DATE
     C                     ITER
     C                     END
      *
     C           EQBMON    IFNE 0111
     C                     ITER
     C                     END
     C           EQHZ      IFLT YM,1
     C           EQHZ      ORGT YM,12
     C                     ITER
     C                     END
      *
     C           K#P11A    KLIST
     C                     KFLD           EQKAT1
     C                     KFLD           EQKAT2
     C                     KFLD           EQKAT3
     C           K#P11A    CHAINECQWP11              98
     C           *IN98     IFEQ *ON
     C                     CLEARECQWP111
     C                     MOVELEQKAT1    E1KAT1
     C                     MOVELEQKAT2    E1KAT2
     C                     MOVELEQKAT3    E1KAT3
     C                     END
      *
     C                     Z-ADD1         I
     C           EQHZ      LOKUPYM,I                     82
     C   82                ADD  EQKOSU    E1K,I
      *
     C  N98                UPDATECQWP111
     C   98                WRITEECQWP111
      *
     C                     ENDDO
      *
     C                     ENDSR
     C******************************************************
     C* GET & SUMMARY SHIPPED QTY                          *
     C******************************************************
     C           @SQTY     BEGSR
     C*
     C           *LOVAL    SETLLGCQTL311
     C                     MOVE *BLANK    X@KAT  15
     C                     MOVE *BLANK    X@HIN  12
     C*
     C                     DO   *HIVAL
     C*
     C                     READ GCQTL311                 99
     C   99                LEAVE
     C*
     C           DFKATA    IFEQ X@KAT
     C           DFSHIN    ANDEQX@HIN
     C                     ITER
     C                     END
     C*
     C                     MOVELDFKATA    X@KAT
     C                     MOVELDFSHIN    X@HIN
     C                     Z-ADD0         #SKHZ   80
     C*
     C           K#L32     KLIST
     C                     KFLD           DFKATA
     C                     KFLD           DFSHN1
     C                     KFLD           DFSHN2
     C                     KFLD           DFSHN3
     C           K#L32     SETLLGCQTL321
     C*
     C                     DO   *HIVAL
     C           K#L32     READEGCQTL321                 98
     C   98                LEAVE
     C           ##SKJY    IFEQ 'D'
     C           ##SKHZ    ANDLE*DATE
     C           ##SKHZ    IFGT #SKHZ
     C                     Z-ADD##SKHZ    #SKHZ
     C                     END
     C                     ELSE
     C                     Z-ADD0         #SKHZ
     C                     LEAVE
     C                     END
     C                     ENDDO
     C*
     C           #SKHZ     IFNE 0
     C           K#L31     KLIST
     C                     KFLD           #KAT1
     C                     KFLD           #KAT2
     C           K#L31     CHAINFCQPL311             97
     C           *IN97     IFEQ *ON
     C                     ITER
     C                     END
     C           #SKHZ     IFLT *DATE
     C                     ITER
     C                     END
     C                     END
     C*
     C           K#AMPL    KLIST
     C                     KFLD           DFSHN1
     C                     KFLD           DFSHN2
     C                     KFLD           DFSHN3
     C           K#AMPL    CHAINAAMPL111             96
     C           *IN96     IFEQ *OFF
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     96
     C                     END
     C*
     C   96                ITER
     C*
     C                     Z-ADD1         V       20
     C                     Z-ADD0         C       20
     C                     Z-ADD*ZERO     HBM
     C                     DO   15        V
     C                     MOVELNUKH,V    VUKH    80
     C           *DATE     IFLT VUKH
     C           OKOT,V    IFNE *BLANK
     C                     ADD  1         C
     C                     MOVE OKOT,V    HKT,C
     C                     Z-ADDOKBM,V    HBM,C
     C                     END
     C                     ELSE
     C           NKOT,V    IFNE *BLANK
     C                     ADD  1         C
     C                     MOVE NKOT,V    HKT,C
     C                     Z-ADDNKBM,V    HBM,C
     C                     END
     C                     END
     C                     ENDDO
     C*
     C                     SETOF                     81
     C           0111      LOKUPHBM                      81
     C           *IN81     IFEQ *OFF
     C                     ITER
     C                     END
     C*
     C           K#P11B    KLIST
     C                     KFLD           #KAT1
     C                     KFLD           #KAT2
     C                     KFLD           #KAT3
     C           K#P11B    CHAINECQWP11              95
     C           *IN95     IFEQ *ON
     C                     CLEARECQWP111
     C                     MOVEL#KAT1     E1KAT1
     C                     MOVEL#KAT2     E1KAT2
     C                     MOVEL#KAT3     E1KAT3
     C                     END
     C*
     C           K#MBEP    KLIST
     C                     KFLD           WYY     40
     C                     KFLD           DFSHN1
     C                     KFLD           DFSHN2
     C                     KFLD           DFSHN3
     C*
     C                     DO   12        I
     C                     Z-ADDYM,I      W@YYMM
     C                     Z-ADDW@YYYY    WYY
     C           K#MBEP    CHAINMBEPL051             94
     C           *IN94     IFEQ '0'
     C                     Z-ADDW@MMMM    J       20
     C                     ADD  I6S,J     E1S,I
     C                     END
     C                     ENDDO
     C*
     C*
     C  N95                UPDATECQWP111
     C   95                WRITEECQWP111
      *
     C                     ENDDO
     C*
     C                     ENDSR
