     H            Y.
     F** ECQR45 ********************************************
     F*  DIE USAGE INQUIRY(DAILY ONLY + BREAK REASON)
     F*
     F* TCHK  06/23/11 CREATE(COPY FROM ECQR15)
     F******************************************************
     FECQPW45 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                        RRN2  KSFILE SFL02
     F                                              KINFDS @INFDS
     FECSPL08 IF  E           K        DISK
     FGCQTL31 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FGCQPL12 IF  E           K        DISK
     FMFAPL25 IF  E           K        DISK
     FECQPP01 UF  E           K        DISK                      A
     FAB#PPCT UF  E           K        DISK                      A
     FECQWP45 O   E                    DISK                           UC
     FECQWW45 IF  E           K        DISK                      A    UC
      *-----------------------------------------------------------
     E                    CMD     1   3 78
     E                    KWD     1   2 70
     E                    MSG     1   2 78
     E                    TAB1    1  10  1   TAB2   21
     E                    I6S        12  9 0
      *-----------------------------------------------------------
     I@INFDS      DS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I            DS
     I                                        1 1080I6S
     I                                        1   90I6SRO1
     I                                       10  180I6SRO2
     I                                       19  270I6SRO3
     I                                       28  360I6SRO4
     I                                       37  450I6SRO5
     I                                       46  540I6SRO6
     I                                       55  630I6SRO7
     I                                       64  720I6SRO8
     I                                       73  810I6SRO9
     I                                       82  900I6SROA
     I                                       91  990I6SROB
     I                                      100 1080I6SROC
     I            DS
     I                                        1  12 DFHIN
     I                                        1   5 DFSHN1
     I                                        6  10 DFSHN2
     I                                       11  12 DFSHN3
     I            DS
     I                                        1   6 @@CNTR
     I                                        1   2 M@COS1
     I                                        3   4 M@COS2
     I                                        5   6 M@COS3
     I            DS
     I                                        1   40D@MMYY
     I                                        1   20D@MM
     I                                        3   40D@YY
     I            DS
     I                                        1   80WYMD
     I                                        1   60WYYMM
     I                                        1   40WYY
     I                                        5   60WMM
     I                                        7   80WDD
     I            DS
     I                                        1   80KYMD
     I                                        1   40KYY
     I                                        5   60KMM
     I                                        7   80KDD
     I            DS
     I                                        1   60EQHZ
     I                                        1   40EQYOYY
     I                                        5   60EQYOMM
     I            DS
     I                                        1   60DFHZ
     I                                        1   40DFKOYY
     I                                        5   60DFKOMM
     I            DS
     I                                        1  15 DFKATA
     I                                        1   2 #KAT1
     I I            '-'                       3   3 #AAA
     I                                        4   7 #KAT2
     I                                        8   8 #BBB
     I                                        9   9 #KAT3
     I            DS
     I                                        1  54 QTY
     I                                        1   90EQQTY1
     I                                       10  180EQQTY2
     I                                       19  270EQQTY3
     I                                       28  360EQQTY4
     I                                       37  450EQQTY5
     I                                       46  540EQQTY6
     I            DS
     I                                        1   60F8YYMM
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I            DS
     I                                        1  15 T6LOCT
     I                                        1   1 T6TKR1
     I I            '-'                       2   2 #AA
     I                                        3   4 T6TKR2
     I I            '-'                       5   5 #BB
     I                                        6   7 T6TKR3
     I I            '-'                       8   8 #CC
     I                                        9   9 T6TKR4
     I            DS
     I                                        1   80WTO3
     I                                        1   40GKEDYY
     I                                        5   60GKEDMM
     I                                        7   80GKEDDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  10 W@DATE
     I                                        1   40W@DAT1
     I I            '/'                       5   5 W@DATA
     I                                        6   70W@DAT2
     I I            '/'                       8   8 W@DATB
     I                                        9  100W@DAT3
      *--------------------------------------------------
      *  MAIN ROUTINE
      *--------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C           W@ID      CASEQ'02'      #SCRN2
     C           W@ID      CASEQ'03'      #SCRN3
     C           W@ID      CASEQ'04'      #SCRN4
     C                     ENDCS
     C                     ENDDO
      *  LOCK CHECK
     C                     MOVEL'ECQR45'  K@KWD1
     C           K#ABCT    CHAINAB#PPCT              90
     C           *IN90     IFEQ *OFF
     C                     MOVE *BLANK    CTCHR1
     C                     UPDATAB#PPCT1
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *------------------------------------------------------
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
      *
     C           KATKEP    KLIST
     C                     KFLD           WYY
     C                     KFLD           WMM
     C                     KFLD           WDD
      *
     C           KEY1      KLIST
     C                     KFLD           D@DIE1
     C                     KFLD           D@DIE2
     C                     KFLD           D@DIE3
      *
     C           KEY       KLIST
     C                     KFLD           WYY
     C                     KFLD           DFSHN1
     C                     KFLD           DFSHN2
     C                     KFLD           DFSHN3
     C           K#ECQ     KLIST
     C                     KFLD           S@KAT1
     C                     KFLD           S@KAT2
     C                     KFLD           S@KAT3
     C                     KFLD           K@KAT4  1
     C           K#ECQX    KLIST
     C                     KFLD           S@KAT1
     C                     KFLD           S@KAT2
     C                     KFLD           S@KAT3
     C                     KFLD           K@KAT4  1
     C                     KFLD           KYMD
     C           K#MFA     KLIST
     C                     KFLD           K@FACT  40
     C                     KFLD           K@MCHN  3
      *
     C           K#AGP     KLIST
     C                     KFLD           WYY
     C                     KFLD           WMM
     C                     KFLD           WDD
     C           K#AGX     KLIST
     C                     KFLD           KYY
     C                     KFLD           KMM
     C                     KFLD           KDD
     C           K#ABCT    KLIST
     C                     KFLD           K@KWD1  8
      *
     C                     Z-ADD0111      K@FACT
      *  LOCK CHECK
     C                     MOVEL'ECQR45'  K@KWD1
     C           K#ABCT    CHAINAB#PPCT              90
     C           *IN90     IFEQ *OFF
     C           CTCHR1    IFNE *BLANK
JW   C                     MOVELCTCHR1    D@USR
     C                     EXFMTDSP04
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     ELSE
     C                     MOVEL#USER     CTCHR1
     C                     UPDATAB#PPCT1
     C                     ENDIF
     C                     ELSE
     C                     CLEARAB#PPCT1
     C                     MOVELK@KWD1    CTKEY1
     C                     MOVEL#USER     CTCHR1
     C                     WRITEAB#PPCT1
     C                     ENDIF
      *
     C                     MOVELKWD,1     P@CMD
     C                     Z-ADD70        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
      *
     C                     OPEN ECQWP45
      *
     C                     MOVELKWD,2     P@CMD
     C                     Z-ADD70        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
      *
     C                     OPEN ECQWW45
     C*
     C                     MOVE '01'      W@ID    2
     C                     TIME           WSDT
     C                     Z-ADDWSSYYY    D@YY
     C                     Z-ADDWSSMMM    D@MM
     C                     Z-ADDWSSDDD    D@DD
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #SCRN1    BEGSR
      *-----------------------------------------------------
     C                     MOVELCMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     OTHER
     C                     EXSR #CHK
     C           *IN99     IFEQ *OFF
     C                     MOVE *BLANK    D@DIE1
     C                     MOVE *BLANK    D@DIE2
     C                     MOVE *BLANK    D@DIE3
     C                     Z-ADD*ZERO     ZRRN    40
     C                     EXSR #SET0
     C                     EXSR #SET1
     C           RRN1      IFNE *ZERO
     C                     MOVE '02'      W@ID
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #CHK      BEGSR
      *-----------------------------------------------------
     C                     SETOF                     6199
     C           2000      ADD  D@YY      WYY
     C                     Z-ADDD@MM      WMM
     C                     Z-ADDD@DD      WDD
     C           K#AGP     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C                     SETON                     6199
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #SET0     BEGSR
      *-----------------------------------------------------
     C           KATKEP    SETLLECSPL08
     C*
     C                     DO   *HIVAL
     C*
     C           KATKEP    READEECSPL08                  97
     C   97                LEAVE
     C           EQSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           EQBMON    IFNE 0111
     C                     ITER
     C                     END
     C*
     C                     CLEARECQWW45R
     C                     MOVELEQKAT1    W4KAT1
     C                     MOVELEQKAT2    W4KAT2
     C                     MOVELEQKAT3    W4KAT3
     C                     MOVELEQKINO    W4KINO
     C                     MOVE EQKINO    K@MCHN
     C           K#MFA     CHAINMFAPL25              95
     C           *IN95     IFEQ *OFF
     C                     MOVE @@CNTR    W4WCTR
     C                     END
     C                     Z-ADDEQKOSU    W4KOSU
     C                     MOVELEQHSON    W4HSON
      * UNIT PRICE
     C           K#ECQ1    KLIST
     C                     KFLD           W4KAT1
     C                     KFLD           W4KAT2
     C                     KFLD           W4KAT3
     C                     KFLD           K@KAT4  1
     C                     MOVEL*BLANK    K@KAT4
     C           K#ECQ1    SETGTECQPP01
     C*
     C                     DO   *HIVAL
     C*
     C           K#ECQ1    REDPEECQPP01                  94
     C   94                LEAVE
     C           ECSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           ECVALD    IFLE WSSDAT
     C                     Z-ADDECUPRC    W4UPRC
     C           W4KAT3    IFNE *BLANK
     C           W4KAT3    ANDNE'1'
     C           W4UPRC    DIV  100       W4UPRC
     C                     END
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     WRITEECQWW45R
     C*
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #SET1     BEGSR
      *-----------------------------------------------------
     C                     Z-ADD*ZERO     RRN1    40
     C                     Z-ADD*ZERO     @RRN1   40
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
      *
     C                     MOVE *OFF      *IN80
     C           KEY1      SETLLECQWW45
     C                     EXSR #SET11
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #SET11    BEGSR
      *-----------------------------------------------------
      *
     C                     Z-ADD@RRN1     RRN1
     C                     Z-ADD*ZERO     X       30
     C*
     C           KEY1      SETLLECQWW45
     C*
     C                     DO   *HIVAL
     C*
     C                     READ ECQWW45                  80
     C   80                LEAVE
     C*
     C                     CLEARSFL01
     C                     MOVELW4KAT1    S@KAT1
     C                     MOVELW4KAT2    S@KAT2
     C                     MOVELW4KAT3    S@KAT3
     C                     MOVELW4KINO    S@KINO
     C                     MOVELW4WCTR    S@WCTR
     C                     Z-ADDW4KOSU    S@CONT
     C                     Z-ADDW4UPRC    S@UPRC
     C           S@CONT    MULT S@UPRC    S@AMNT
     C*
     C           W4HSON    LOKUPTAB1      TAB2           93
     C   93                MOVELTAB2      S@RSN2
     C*
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C*
     C                     ENDDO
     C*
     C                     MOVE D@DIE1    W@DIE1  2
     C                     MOVE D@DIE2    W@DIE2  4
     C                     MOVE D@DIE3    W@DIE3  1
     C                     Z-ADDRRN1      @RRN1
     C                     Z-ADD1         #RCNO1
     C*
     C                     ENDSR
      *------------------------------------------------------
      *   2ND SCREEN
      *------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVELCMD,3     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     Z-ADD@@REC     #RCNO1
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C           *INKL     WHEQ *ON
     C                     MOVEL'01'      W@ID
     C           *INKE     WHEQ *ON
     C                     MOVE *ON       *IN50
     C                     MOVE MSG,1     D@MSG
     C                     WRITEDSP99
     C                     EXSR #PRT
     C                     MOVEL'99'      W@ID
      * SEARCH
     C           D@DIE1    WHNE W@DIE1
     C           D@DIE2    ORNE W@DIE2
     C           D@DIE3    ORNE W@DIE3
     C                     Z-ADD*ZERO     ZRRN    40
     C                     EXSR #SET1
      *
     C                     OTHER
     C                     EXSR #CHK2
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #CHK2     BEGSR
      *-----------------------------------------------------
     C                     Z-ADD*ZERO     WRRN    40
     C                     Z-ADD*ZERO     ZRRN    40
     C                     MOVE '02'      W@ID
     C           *IN90     DOUEQ*ON
     C                     ADD  1         WRRN
     C           WRRN      CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@SLCT    IFEQ 'X'
     C           S@SLCT    OREQ 'P'
      *
     C           S@SLCT    IFEQ 'X'
     C                     EXSR #SET2
     C                     MOVE '03'      W@ID
     C                     ELSE
     C                     Z-ADDWRRN      ZRRN
     C                     EXSR #SET3
     C           WRRN      SUB  1         @ANS    40
     C           @ANS      DIV  17        @ANS
     C                     MVR            @MVR    30
     C           @MVR      IFLE 8
     C                     Z-ADD13        DLIN
     C                     ELSE
     C                     Z-ADD1         DLIN
     C                     ENDIF
     C                     Z-ADD10        DCOL
      *
     C                     MOVE '04'      W@ID
     C                     ENDIF
      *
     C                     MOVE *BLANK    S@SLCT
     C                     UPDATSFL01
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA FOR 3RD SCREEN
      *------------------------------------------------------
     C           #SET2     BEGSR
      *
     C                     Z-ADD*ZERO     RRN2    40
     C                     MOVE *ON       *IN54
     C                     WRITECTL02
     C                     MOVE *OFF      *IN54
     C                     MOVE S@KAT1    D@KAT1
     C                     MOVE S@KAT2    D@KAT2
     C                     MOVE S@KAT1    #KAT1
     C                     MOVE S@KAT2    #KAT2
     C                     Z-ADDD@MM      M       20
      *
     C           DFKATA    SETLLGCQTL311
     C           *IN95     DOUEQ*ON
     C           DFKATA    READEGCQTL311                 95
     C           *IN95     IFEQ *OFF
     C                     CLEARSFL02
      *
     C           KEY       CHAINMBEPL051             65
     C           *IN65     IFEQ *OFF
     C                     SETON                     40
     C                     Z-ADDI6S,M     S@QTY
     C                     ENDIF
     C           S@QTY     IFEQ *ZERO
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         RRN2
     C                     MOVE DFSHN1    S@PRT1
     C                     MOVE DFSHN2    S@PRT2
     C                     MOVE DFSHN3    S@PRT3
     C                     WRITESFL02
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           RRN2      IFEQ *ZERO
     C                     ADD  1         RRN2
     C                     WRITESFL02
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   3RD SCREEN
      *------------------------------------------------------
     C           #SCRN3    BEGSR
      *
     C                     MOVELCMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN53
     C                     EXFMTCTL02
     C                     MOVE *OFF      *IN53
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C           *INKL     WHEQ *ON
     C                     EXSR #CHK2
      *
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #SET3     BEGSR
      *-----------------------------------------------------
      * UNIT PRICE
      *
     C                     MOVE S@KAT1    D@DIEA
     C                     MOVE S@KAT2    D@DIEB
     C                     MOVE S@KAT3    D@DIEC
     C                     Z-ADD*ZERO     D@UPRC
     C                     Z-ADD*ZERO     D@VALD
     C           K#ECQ     SETGTECQPP01
     C           *IN20     DOUEQ*ON
     C           K#ECQ     REDPEECQPP01                  20
     C           *IN20     IFEQ *OFF
     C           ECVALD    ANDLEWSSDAT
     C                     Z-ADDECUPRC    D@UPRC
     C                     Z-ADDECVALD    D@VALD
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   4TH SCREEN
      *------------------------------------------------------
     C           #SCRN4    BEGSR
      *
     C                     EXFMTDSP03
      *
     C                     SELEC
     C           *INKL     WHEQ *ON
     C                     MOVE '02'      W@ID
     C                     OTHER
     C                     EXSR #CHK4
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD
     C                     EXSR #SET1
     C                     MOVE '2'       W@ID
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #CHK4     BEGSR
      *-----------------------------------------------------
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00'      *IN,61
     C                     Z-ADDD@VALD    KYMD
     C           K#AGX     CHAINAGDPL12              96
     C           *IN96     IFEQ *ON
     C                     SETON                     6199
     C                     ENDIF
      *
     C           D@UPRC    IFEQ *ZERO
     C                     SETON                     6299
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #UPD      BEGSR
      *-----------------------------------------------------
     C           K#ECQX    CHAINECQPP01              96
     C           *IN96     IFEQ *OFF
     C                     Z-ADDD@UPRC    ECUPRC
     C                     Z-ADD*DATE     ECKODT
     C                     TIME           ECKOTM
     C                     MOVEL#USER     ECKOME
     C                     UPDATECQPP011
     C                     ELSE
     C                     CLEARECQPP011
     C                     MOVELD@DIEA    ECKAT1
     C                     MOVELD@DIEB    ECKAT2
     C                     MOVELD@DIEC    ECKAT3
     C                     Z-ADDD@UPRC    ECUPRC
     C                     Z-ADDD@VALD    ECVALD
     C                     Z-ADD*DATE     ECKODT
     C                     TIME           ECKOTM
     C                     MOVEL#USER     ECKOME
     C                     WRITEECQPP011
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   PRINT
      *------------------------------------------------------
     C           #PRT      BEGSR
     C*
     C           *LOVAL    SETLLECQWW45
     C*
     C                     DO   *HIVAL
     C*
     C                     READ ECQWW45                  80
     C   80                LEAVE
     C*
     C                     CLEARECQWP451
     C*
     C                     MOVELW4KAT1    EQDIE1
     C                     MOVELW4KAT2    EQDIE2
     C                     MOVELW4KAT3    EQDIE3
      *
     C           K#DIE1    KLIST
     C                     KFLD           W4KAT1
     C                     KFLD           W4KAT2
     C                     KFLD           W4KAT3
     C           K#DIE1    CHAINGCQPL12              95
     C           *IN95     IFEQ *OFF
     C                     MOVELT6LOCT    EQLOCT
     C                     END
     C                     Z-ADDW4UPRC    EQUPRC
     C                     Z-ADDW4KOSU    EQUSGE
     C                     MOVELW4KINO    EQMCHN
     C           W4KOSU    MULT W4UPRC    EQAMNT
     C*
     C                     MOVELW4WCTR    EQWCTR
     C           W4HSON    LOKUPTAB1      TAB2           93
     C   93                MOVELTAB2      EQRSN2
     C*
     C                     Z-ADDWYY       W@DAT1
     C                     Z-ADDWMM       W@DAT2
     C                     Z-ADDWDD       W@DAT3
     C                     MOVELW@DATE    EQDATE
     C*
     C                     WRITEECQWP451
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*
** CMD   1         2         3         4         5         6         7
  F1:END
  F1:END     F12:GO BACK
OPT:P=UNIT PRICE ENTRY X=PART INF.    F1:END    F5:CREATE DATA    F12:BACK
** KWD
CLRPFM ECQWP45
CLRPFM ECQWW45
** MSG
Please be patient while making the data.
Please be patient while updating prices.
** RSN
1LIFE(WEAR)
2LIFE(CRACK)
3LIFE(CHIP)
4UNUSUALLY(WEAR)
5UNUSUALLY(CRACK)
6UNUSUALLY(CHIP)
7SETUP MISTAKE
8MACHINE FAILURE
9TRIAL DIE
SNEW ESTABLISHMENT DIE
