     H            Y.
     F** ECQR14 **************************************************
     F* DIE USAGE INQUIRY (REGRIND)                              *
     F* PROGRAM ID. : ECQR15. <RPG>                              *
     F* CREATE DATE. : 04/01/05                                  *
     F* AUTHOR.         : TCH   FOR REGRIDN                      *
     F*-------------------------------------------               *
     F*   SEPT/10/02           ADD WORK CENTER                   *
JW1  F* J.WATANABE 05/12/2016 CHG MAX SIZE                       *
JW2  F* J.WATANABE 09/11/2017 CHG DSP04 TO DISPLAY USER ID       *
JW3  F* J.WATANABE 08/20/2024 ADD DATE  TO DOWNLOADED DATA       *
     F************************************************************
     FECQPW14ACF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                        RRN2  KSFILE SFL02
     F                                              KINFDS @INFDS
     FECSPL05 IF  E           K        DISK
     FGCQTL31 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FGCQPL12 IF  E           K        DISK
     FMFAPL25 IF  E           K        DISK
     FECQPP01 UF  E           K        DISK                      A
JW   F**AB#PPCT UF  E         K        DISK                      A
TCH56FECQWP16 O   E                    DISK                           UC
TCH52FGCQPL36 UF  E           K        DISK                      A
TCH52FFCEPL01 IF  E           K        DISK
TCH52FFCQPP32 IF  E           K        DISK                      A
      *-----------------------------------------------------------
     E                    CMD     1   4 78
     E                    KWD     1   1 70
     E                    MSG     1   2 78
TCH52E                    MSX     1   4 30
     E                    I6S        12  9 0
     E                    MCN         8  3
JW1  E                    HMC        25  3
JW1  E                    CNT        25  3 0
JW1  E                    DAY        25  2 0
      *-----------------------------------------------------------
     I@INFDS      DS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I            DS
     I                                        1 1080I6S
     I                                        1   90I6SRO1
     I                                       10  180I6SRO2
     I                                       19  270I6SRO3
     I                                       28  360I6SRO4
     I                                       37  450I6SRO5
     I                                       46  540I6SRO6
     I                                       55  630I6SRO7
     I                                       64  720I6SRO8
     I                                       73  810I6SRO9
     I                                       82  900I6SROA
     I                                       91  990I6SROB
     I                                      100 1080I6SROC
     I            DS
     I                                        1  12 DFHIN
     I                                        1   5 DFSHN1
     I                                        6  10 DFSHN2
     I                                       11  12 DFSHN3
     I            DS
     I                                        1   6 @@CNTR
     I                                        1   2 M@COS1
     I                                        3   4 M@COS2
     I                                        5   6 M@COS3
     I            DS
     I                                        1   40D@MMYY
     I                                        1   20D@MM
     I                                        3   40D@YY
     I            DS
     I                                        1   60WYYMM
     I                                        1   40WYY
     I                                        5   60WMM
     I            DS
     I                                        1   80KYMD
     I                                        1   40KYY
     I                                        5   60KMM
     I                                        7   80KDD
     I            DS
     I                                        1   60EQHZ
     I                                        1   40EQYOYY
     I                                        5   60EQYOMM
     I                                        7   80EQYODD
     I            DS
     I                                        1   60DFHZ
     I                                        1   40DFKOYY
     I                                        5   60DFKOMM
     I            DS
     I                                        1  15 DFKATA
     I                                        1   2 #KAT1
     I I            '-'                       3   3 #AAA
     I                                        4   7 #KAT2
     I                                        8   8 #BBB
     I                                        9   9 #KAT3
     I            DS
     I                                        1  54 QTY
     I                                        1   90EQQTY1
     I                                       10  180EQQTY2
     I                                       19  270EQQTY3
     I                                       28  360EQQTY4
     I                                       37  450EQQTY5
     I                                       46  540EQQTY6
     I            DS
     I                                        1   60F8YYMM
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I            DS
     I                                        1  15 T6LOCT
     I                                        1   1 T6TKR1
     I I            '-'                       2   2 #AA
     I                                        3   4 T6TKR2
     I I            '-'                       5   5 #BB
     I                                        6   7 T6TKR3
     I I            '-'                       8   8 #CC
     I                                        9   9 T6TKR4
     I            DS
     I                                        1  24 MCN
     I                                        1   3 S@MC01
     I                                        4   6 S@MC02
     I                                        7   9 S@MC03
     I                                       10  12 S@MC04
     I                                       13  15 S@MC05
     I                                       16  18 S@MC06
     I                                       19  21 S@MC07
     I                                       22  24 S@MC08
     I            DS
     I                                        1  75 HMC
     I                                        1   3 H@MC01
     I                                        4   6 H@MC02
     I                                        7   9 H@MC03
     I                                       10  12 H@MC04
     I                                       13  15 H@MC05
     I                                       16  18 H@MC06
     I                                       19  21 H@MC07
     I                                       22  24 H@MC08
     I                                       25  27 H@MC09
     I                                       28  30 H@MC10
     I                                       31  33 H@MC11
     I                                       34  36 H@MC12
     I                                       37  39 H@MC13
     I                                       40  42 H@MC14
     I                                       43  45 H@MC15
     I                                       46  48 H@MC16
     I                                       49  51 H@MC17
     I                                       52  54 H@MC18
     I                                       55  57 H@MC19
     I                                       58  60 H@MC20
JW1  I                                       61  63 H@MC21
JW1  I                                       64  66 H@MC22
JW1  I                                       67  69 H@MC23
JW1  I                                       70  72 H@MC24
JW1  I                                       73  75 H@MC25
     I            DS
     I                                        1  75 CNT
     I                                        1   30H@CT01
     I                                        4   60H@CT02
     I                                        7   90H@CT03
     I                                       10  120H@CT04
     I                                       13  150H@CT05
     I                                       16  180H@CT06
     I                                       19  210H@CT07
     I                                       22  240H@CT08
     I                                       25  270H@CT09
     I                                       28  300H@CT10
     I                                       31  330H@CT11
     I                                       34  360H@CT12
     I                                       37  390H@CT13
     I                                       40  420H@CT14
     I                                       43  450H@CT15
     I                                       46  480H@CT16
     I                                       49  510H@CT17
     I                                       52  540H@CT18
     I                                       55  570H@CT19
     I                                       58  600H@CT20
JW1  I                                       61  630H@CT21
JW1  I                                       64  660H@CT22
JW1  I                                       67  690H@CT23
JW1  I                                       70  720H@CT24
JW1  I                                       73  750H@CT25
     I            DS
     I                                        1   80WTO3
     I                                        1   40GKEDYY
     I                                        5   60GKEDMM
     I                                        7   80GKEDDD
TCH52I            DS
     I                                        1   60HMS
     I                                        1   20HH
     I                                        3   40MM
TCH52I                                        5   60SS
TCH52I            DS
     I                                        1   9 KATA7
     I                                        1   2 TTKAT1
     I                                        4   7 TTKAT2
TCH52I                                        9   9 TTKAT3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
%0001I            DS
     I                                        1  10 W@DATE
     I                                        1   40W@DAT1
     I I            '/'                       5   5 W@DATA
     I                                        6   70W@DAT2
     I I            '/'                       8   8 W@DATB
     I                                        9  100W@DAT3
      *--------------------------------------------------
      *  MAIN ROUTINE
      *--------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C           W@ID      CASEQ'02'      #SCRN2
     C           W@ID      CASEQ'03'      #SCRN3
     C           W@ID      CASEQ'04'      #SCRN4
     C                     ENDCS
     C                     ENDDO
      *  LOCK CHECK
     C**                   MOVEL'ECQR14'  K@KWD1
     C**         K#ABCT    CHAINAB#PPCT              90
     C**         *IN90     IFEQ *OFF
     C**                   MOVE *BLANK    CTCHR1
     C**                   UPDATAB#PPCT1
     C**                   ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *------------------------------------------------------
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
      *
     C           DFKEY     KLIST
     C                     KFLD           DFSHN1
     C                     KFLD           DFSHN2
     C                     KFLD           DFSHN3
      *
     C           K#DIE     KLIST
     C                     KFLD           S@KAT1
     C                     KFLD           S@KAT2
      *
     C           KATKEY    KLIST
     C                     KFLD           Q4KAT1
     C                     KFLD           Q4KAT2
     C                     KFLD           K@KAT3  1
      *
     C           KATKEX    KLIST
     C                     KFLD           Q4KAT1
     C                     KFLD           Q4KAT2
     C                     KFLD           Q4KAT3
     C                     KFLD           WYY
     C                     KFLD           WMM
      *
TCHK3C           KATKEP    KLIST
TCHK3C                     KFLD           Q4KAT1
TCHK3C                     KFLD           Q4KAT2
TCHK3C                     KFLD           Q4KAT3
TCHK3C                     KFLD           WYY
TCHK3C                     KFLD           WMM
TCHK3C                     KFLD           WDD
      *
     C           KEY1      KLIST
     C                     KFLD           D@DIE1
     C                     KFLD           D@DIE2
     C                     KFLD           D@DIE3
      *
     C           KEY       KLIST
     C                     KFLD           WYY
     C                     KFLD           DFSHN1
     C                     KFLD           DFSHN2
     C                     KFLD           DFSHN3
     C           K#ECQ     KLIST
     C                     KFLD           S@KAT1
     C                     KFLD           S@KAT2
     C                     KFLD           S@KAT3
     C                     KFLD           K@KAT4  1
     C           K#GKG     KLIST
     C                     KFLD           S@KAT1
     C                     KFLD           S@KAT2
     C                     KFLD           S@KAT3
     C           K#ECQX    KLIST
     C                     KFLD           S@KAT1
     C                     KFLD           S@KAT2
     C                     KFLD           S@KAT3
     C                     KFLD           K@KAT4  1
     C                     KFLD           KYMD
     C           K#MFA     KLIST
     C                     KFLD           K@FACT  40
     C                     KFLD           K@MCHN  3
      *
     C           K#AGD     KLIST
     C                     KFLD           WYY
     C                     KFLD           WMM
TCHK3C           K#AGP     KLIST
TCHK3C                     KFLD           WYY
TCHK3C                     KFLD           WMM
TCHK3C                     KFLD           WDD
     C           K#AGX     KLIST
     C                     KFLD           KYY
     C                     KFLD           KMM
     C                     KFLD           KDD
     C           K#ABCT    KLIST
     C                     KFLD           K@KWD1  8
TCH52C           KEY5      KLIST
     C                     KFLD           D@DPA1
     C                     KFLD           D@DPA2
TCH52C                     KFLD           D@DPA3
TCH56C           KEY7      KLIST
     C                     KFLD           TTKAT1
     C                     KFLD           TTKAT2
TCH56C                     KFLD           TTKAT3
TCH56C           KEY9      KLIST
     C                     KFLD           EQKAT1
     C                     KFLD           EQKAT2
TCH56C                     KFLD           EQKAT3
      *
     C                     Z-ADD0111      K@FACT
      *  LOCK CHECK
     C**                   MOVEL'ECQR14'  K@KWD1
     C**         K#ABCT    CHAINAB#PPCT              90
     C**         *IN90     IFEQ *OFF
     C**         CTCHR1    IFNE *BLANK
JW2  C**                   MOVELCTCHR1    XUSER
     C**                   EXFMTDSP04
      *
     C**                   MOVE *ON       *INLR
     C**                   RETRN
     C**                   ELSE
     C**                   MOVEL#USER     CTCHR1
     C**                   UPDATAB#PPCT1
     C**                   ENDIF
      *
     C**                   ELSE
     C**                   CLEARAB#PPCT1
     C**                   MOVELK@KWD1    CTKEY1
     C**                   MOVEL#USER     CTCHR1
     C**                   WRITEAB#PPCT1
     C**                   ENDIF
      * CLEAR ECQWP16
     C                     MOVELKWD,1     P@CMD
     C                     Z-ADD70        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
      *
TCH56C                     OPEN ECQWP16
      *
     C                     MOVE '01'      W@ID    2
     C                     Z-ADD*YEAR     D@YY
     C                     Z-ADD*MONTH    D@MM
     C                     SUB  1         D@MM
     C           D@MM      IFLE 0
     C                     ADD  12        D@MM
     C                     SUB  1         D@YY
     C                     ENDIF
TCHK3C                     Z-ADD*ZERO     D@DD
      *
TCH52C                     TIME           HMS
     C                     ENDSR
      *-----------------------------------------------------
     C           #SCRN1    BEGSR
      *-----------------------------------------------------
     C                     MOVE *BLANK    D@OPT
     C                     MOVELCMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
      * F3: END
 S0  C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
      * F6: CREATE MASTER
TCH52C           *INKF     WHEQ *ON
     C                     Z-ADD10        DLIN
     C                     Z-ADD10        DCOL
     C                     MOVE '1'       FSCREN  1
     C                     EXSR #SCRN5
     C                     MOVE ' '       FSCREN
TCH52C                     MOVE '01'      W@ID
      * F8: DOWLOAD
TCH52C           *INKH     WHEQ *ON
     C                     Z-ADD10        DLIN
     C                     Z-ADD10        DCOL
     C                     EXFMTDSP06
     C                     MOVE '0'       *IN21
      * OUTPUT FCQPP32 (DIE SPEC)
     C           *LOVAL    SETLLECSPL05
 B0  C           *IN21     DOUEQ*ON
     C                     READ ECSPL05                  21
 B1  C           *IN21     IFEQ *OFF
     C           EQSKJY    ANDEQ*BLANK
 B2  C           EQKAT3    IFEQ 'I'
     C           EQKAT3    OREQ 'U'
     C           EQKAT3    OREQ 'R'
TCHK1C           EQKAT3    OREQ 'Z'
TCHK1C           EQKAT3    OREQ '1'
TCHK5C           EQKAT3    OREQ '5'
     C           KEY9      CHAINFCQPP321             78
 B3  C           *IN78     IFEQ '1'
     C                     MOVE EQKAT1    Q4KAT1
     C                     MOVE EQKAT2    Q4KAT2
     C                     MOVE EQKAT3    Q4KAT3
     C                     WRITEFCQPP321
E3   C                     ENDIF
E2   C                     ENDIF
E1   C                     ENDIF
E0   C                     ENDDO
      *
TCH52C                     MOVE '01'      W@ID
      * F10: UPDATE PRICE
     C           *INKJ     WHEQ *ON
     C                     MOVE *ON       *IN50
     C                     MOVE MSG,2     D@MSG
     C                     WRITEDSP99
     C                     CALL 'ECQR35'
     C                     MOVE *OFF      *IN50
TCHK2C                     MOVE *BLANK    D@MSG
TCHK2C                     WRITEDSP99
      * ENTR
     C                     OTHER
     C                     EXSR #CHK
     C           *IN99     IFEQ *OFF
     C                     MOVE *BLANK    D@DIE1
     C                     MOVE *BLANK    D@DIE2
     C                     MOVE *BLANK    D@DIE3
     C                     Z-ADD*ZERO     D@TOTL 110
     C                     Z-ADD*ZERO     ZRRN    40
     C                     EXSR #SET1
     C           RRN1      IFNE *ZERO
     C                     MOVE '02'      W@ID
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #CHK      BEGSR
      *-----------------------------------------------------
     C                     SETOF                     6199
     C           2000      ADD  D@YY      WYY
     C                     Z-ADDD@MM      WMM
     C           K#AGD     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C                     SETON                     6199
     C                     ENDIF
TCHK3 *
TCHK3C                     Z-ADD0         WDD
TCHK3C           D@DD      IFNE 0
TCHK3C                     Z-ADDD@DD      WDD     20
TCHK3C           K#AGP     CHAINAGDPL12              90
TCHK3C           *IN90     IFEQ *ON
TCHK3C                     SETON                     6199
TCHK3C                     ENDIF
TCHK3C                     ENDIF
TCHK3 *
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #SET1     BEGSR
      *-----------------------------------------------------
     C                     Z-ADD*ZERO     RRN1    40
     C                     Z-ADD*ZERO     @RRN1   40
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
      *
     C                     MOVE *OFF      *IN80
     C           KEY1      SETLLFCQPP32
     C                     EXSR #SET11
      *
     C                     ENDSR
      *-----------------------------------------------------
      * SET DATA IN SFL01
      *-----------------------------------------------------
     C           #SET11    BEGSR
      *
     C                     Z-ADD@RRN1     RRN1
     C                     Z-ADD*ZERO     X       30
      *
 B0  C           *IN80     DOWEQ*OFF
     C                     READ FCQPP32                  80
 B1  C           *IN80     IFEQ *OFF
     C           Q4SKJY    ANDEQ*BLANK
      *
     C                     CLEARSFL01
     C                     MOVE Q4KAT1    S@KAT1
     C                     MOVE Q4KAT2    S@KAT2
     C                     MOVE Q4KAT3    S@KAT3
      *
     C                     EXSR #USG
 B2  C           S@CONT    IFEQ *ZERO
     C                     ITER
 E2  C                     ENDIF
      *
     C                     EXSR #PRC
     C           S@CONT    MULT S@UPRC    S@AMNT
     C                     ADD  1         RRN1
     C                     WRITESFL01
      *
     C                     ADD  1         X
 B2  C           X         IFEQ 1
     C                     Z-ADDRRN1      #RCNO1
 E2  C                     ENDIF
 B2  C           X         IFEQ 17
 B3  C           RRN1      IFGE ZRRN
     C                     LEAVE
     C                     ELSE
     C                     Z-ADD*ZERO     X
 E3  C                     ENDIF
 E2  C                     ENDIF
      *
 E1  C                     ENDIF
 E0  C                     ENDDO
      *
     C                     MOVE D@DIE1    W@DIE1  2
     C                     MOVE D@DIE2    W@DIE2  4
     C                     MOVE D@DIE3    W@DIE3  1
     C                     Z-ADDRRN1      @RRN1
      *
     C                     ENDSR
      *-----------------------------------------------------
      * SETTING USAGE
      *-----------------------------------------------------
     C           #USG      BEGSR
      *
     C                     Z-ADD*ZERO     CNT
     C                     MOVE *BLANK    HMC
     C                     Z-ADD*ZERO     DAY
     C                     Z-ADD*ZERO     Q       20
      *
TCHK3C           WDD       IFEQ 0
     C           KATKEX    SETLLECSPL05
TCHK3C                     ELSE
TCHK3C           KATKEP    SETLLECSPL05
TCHK3C                     ENDIF
      *
     C           *IN20     DOUEQ*ON
TCHK3C           WDD       IFEQ 0
     C           KATKEX    READEECSPL05                  20
TCHK3C                     ELSE
TCHK3C           KATKEP    READEECSPL05                  20
TCHK3C                     ENDIF
      *
     C           *IN20     IFEQ *OFF
     C           EQSKJY    ANDEQ*BLANK
     C           EQBMON    ANDEQ0111
      *
     C                     Z-ADD1         P       20
     C           EQKINO    LOKUPHMC,P                    10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         Q
     C                     MOVE EQKINO    HMC,Q
     C           Q         IFEQ 1
     C                     MOVE EQKINO    K@MCHN
     C           K#MFA     CHAINMFAPL25              95
     C           *IN95     IFEQ *OFF
     C                     MOVE @@CNTR    S@WCTR
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDQ         P
     C                     ENDIF
      *
     C                     ADD  EQKOSU    S@CONT
     C                     ADD  EQKOSU    CNT,P
     C                     Z-ADDEQYODD    DAY,P
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEAHMC       MCN
      *
     C                     ENDSR
      *-----------------------------------------------------
      * GET UNIT PRICE
      *-----------------------------------------------------
     C           #PRC      BEGSR
      *
     C           K#ECQ     SETGTECQPP01
     C           *IN20     DOUEQ*ON
     C           K#ECQ     REDPEECQPP01             N    20
     C           *IN20     IFEQ *OFF
     C           ECVALD    ANDLE*DATE
     C           ECSKJY    ANDNE'D'
     C                     Z-ADDECUPRC    S@UPRC
TCHK1C           S@KAT3    IFNE '1'
TCHK5C           S@KAT3    ANDNE'5'
TCH56C           S@UPRC    DIV  100       S@UPRC
TCHK1C                     END
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   2ND SCREEN
      *------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVELCMD,3     D@OPT
     C                     MOVELCMD,4     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     Z-ADD@@REC     #RCNO1
      *
     C                     SELEC
      * F3: END
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
      * F12: BACK
     C           *INKL     WHEQ *ON
     C                     MOVEL'01'      W@ID
      * F5: DOWNLOAD
     C           *INKE     WHEQ *ON
     C                     MOVE *ON       *IN50
     C                     MOVE MSG,1     D@MSG
     C                     WRITEDSP99
     C                     EXSR #DOWN
     C                     MOVEL'99'      W@ID
      * CSV INTO K DRIVE
JW   C                     CALL 'ECQC14D'
      *
      * F6: CREATE DIE MASTER
TCH52C           *INKF     WHEQ *ON
     C                     Z-ADD10        DLIN
     C                     Z-ADD10        DCOL
     C                     MOVE ' '       FSCREN
     C                     EXSR #SCRN5
TCH52C                     MOVEL'02'      W@ID
      * ROLL UP
     C           *IN38     WHEQ *ON
     C           *IN80     ANDEQ*OFF
     C                     EXSR #SET11
      * SEARCH
     C           D@DIE1    WHNE W@DIE1
     C           D@DIE2    ORNE W@DIE2
     C           D@DIE3    ORNE W@DIE3
     C                     Z-ADD*ZERO     ZRRN    40
     C                     EXSR #SET1
      *
     C                     OTHER
     C                     EXSR #CHK2
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
      * CHECK 2
      *-----------------------------------------------------
     C           #CHK2     BEGSR
      *
     C                     Z-ADD*ZERO     WRRN    40
     C                     Z-ADD*ZERO     ZRRN    40
     C                     MOVE '02'      W@ID
     C           *IN90     DOUEQ*ON
     C                     ADD  1         WRRN
     C           WRRN      CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@SLCT    IFEQ 'X'
     C           S@SLCT    OREQ 'P'
      *
     C           S@SLCT    IFEQ 'X'
     C                     EXSR #SET2
     C                     MOVE '03'      W@ID
     C                     ELSE
     C                     Z-ADDWRRN      ZRRN
     C                     EXSR #SET3
     C           WRRN      SUB  1         @ANS    40
     C           @ANS      DIV  17        @ANS
     C                     MVR            @MVR    30
     C           @MVR      IFLE 8
     C                     Z-ADD13        DLIN
     C                     ELSE
     C                     Z-ADD1         DLIN
     C                     ENDIF
     C                     Z-ADD10        DCOL
      *
     C                     MOVE '04'      W@ID
     C                     ENDIF
      *
     C                     MOVE *BLANK    S@SLCT
     C                     UPDATSFL01
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA FOR 3RD SCREEN
      *------------------------------------------------------
     C           #SET2     BEGSR
      *
     C                     Z-ADD*ZERO     RRN2    40
     C                     MOVE *ON       *IN54
     C                     WRITECTL02
     C                     MOVE *OFF      *IN54
     C                     MOVE S@KAT1    D@KAT1
     C                     MOVE S@KAT2    D@KAT2
     C                     MOVE S@KAT3    D@KAT3
     C                     MOVE S@KAT1    #KAT1
     C                     MOVE S@KAT2    #KAT2
     C                     Z-ADDD@MM      M       20
      *
     C           DFKATA    SETLLGCQTL311
     C           *IN95     DOUEQ*ON
     C           DFKATA    READEGCQTL311                 95
     C           *IN95     IFEQ *OFF
     C                     CLEARSFL02
      *
     C           KEY       CHAINMBEPL051             65
     C           *IN65     IFEQ *OFF
     C                     SETON                     40
     C                     Z-ADDI6S,M     S@QTY
     C                     ENDIF
     C           S@QTY     IFEQ *ZERO
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         RRN2
     C                     MOVE DFSHN1    S@PRT1
     C                     MOVE DFSHN2    S@PRT2
     C                     MOVE DFSHN3    S@PRT3
     C                     WRITESFL02
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           RRN2      IFEQ *ZERO
     C                     ADD  1         RRN2
     C                     WRITESFL02
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  DISPLAY 3RD SCREEN
      *------------------------------------------------------
     C           #SCRN3    BEGSR
      *
     C                     MOVE *BLANK    D@OPT
     C                     MOVELCMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN53
     C                     EXFMTCTL02
     C                     MOVE *OFF      *IN53
      *
     C                     SELEC
      * F1: END
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
      * F12: BACK
     C           *INKL     WHEQ *ON
     C                     EXSR #CHK2
      *
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #SET3     BEGSR
      *-----------------------------------------------------
      * UNIT PRICE
      *
     C                     MOVE S@KAT1    D@DIEA
     C                     MOVE S@KAT2    D@DIEB
     C                     MOVE S@KAT3    D@DIEC
     C                     Z-ADD*ZERO     D@UPRC
     C                     Z-ADD*ZERO     D@VALD
     C           K#ECQ     SETGTECQPP01
     C           *IN20     DOUEQ*ON
     C           K#ECQ     REDPEECQPP01             N    20
     C           *IN20     IFEQ *OFF
     C           ECVALD    ANDLE*DATE
     C           ECSKJY    ANDNE'D'
     C                     Z-ADDECUPRC    D@UPRC
     C                     Z-ADDECVALD    D@VALD
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      * DISPLAY 4TH SCREEN
      *------------------------------------------------------
     C           #SCRN4    BEGSR
      *
     C                     EXFMTDSP03
      *
     C                     SELEC
      * F12: BACK
     C           *INKL     WHEQ *ON
     C                     MOVE '02'      W@ID
     C                     OTHER
     C                     EXSR #CHK4
      * F5: UPDATE
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD
     C                     EXSR #SET1
     C                     MOVE '2'       W@ID
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
      * CHECK 4
      *-----------------------------------------------------
     C           #CHK4     BEGSR
      *
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00'      *IN,61
     C                     Z-ADDD@VALD    KYMD
     C           K#AGX     CHAINAGDPL12              96
     C           *IN96     IFEQ *ON
     C                     SETON                     6199
     C                     ENDIF
      *
     C           D@UPRC    IFEQ *ZERO
     C                     SETON                     6299
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------
      * CHECK 5
      *-----------------------------------------------------
     C           #CHK5     BEGSR
      *
     C                     CLEARDIE15
     C                     CLEARD@MSGX
     C                     MOVE *OFF      *IN99
     C                     MOVEA'000'     *IN,61
     C                     MOVELD@DIXX    DIE15  15
      * DIE EXISTS
     C           DIE15     CHAINGCQPL361             96
B0   C           *IN96     IFEQ *OFF
     C                     SETON                     6199
     C                     MOVELMSX,1     D@MSGX
E0   C                     ENDIF
      * NEW DIE CAN'T BE BLANK
B0   C           D@DIXX    IFEQ *BLANKS
     C                     SETON                     6199
     C                     MOVELMSX,4     D@MSGX
E0   C                     ENDIF
      * CUST. WANTS COPY
B0   C           D@DICC    IFNE *BLANKS
     C                     CLEARDIE16
     C                     MOVELD@DICC    DIE16  15
     C           DIE16     CHAINGCQPL361             96
B1   C           *IN96     IFEQ *ON
     C                     SETON                     6399
     C                     MOVELMSX,2     D@MSGX
E1   C                     ENDIF
B0   C                     ENDIF
      * CUST. DOESN'T WNAT COPY
B0   C           D@DICC    IFEQ *BLANKS
     C           KEY5      CHAINFCEPL011             96
B1   C           *IN96     IFEQ *ON
     C                     SETON                     6299
     C                     MOVELMSX,3     D@MSGX
E1   C                     ENDIF
E0   C                     ENDIF
   |  *
TCH52C                     ENDSR
      *-----------------------------------------------------
      * UPDATE PRICE MASTER (ECQPP01)
      *-----------------------------------------------------
     C           #UPD      BEGSR
      *
     C           K#ECQX    CHAINECQPP01              96
     C           *IN96     IFEQ *OFF
     C           ECSKJY    ANDNE'D'
     C                     Z-ADDD@UPRC    ECUPRC
     C                     Z-ADD*DATE     ECKODT
     C                     TIME           ECKOTM
     C                     MOVEL#USER     ECKOME
     C                     UPDATECQPP011
     C                     ELSE
     C                     CLEARECQPP011
     C                     MOVELD@DIEA    ECKAT1
     C                     MOVELD@DIEB    ECKAT2
     C                     MOVELD@DIEC    ECKAT3
     C                     Z-ADDD@UPRC    ECUPRC
     C                     Z-ADDD@VALD    ECVALD
     C                     Z-ADD*DATE     ECKODT
     C                     TIME           ECKOTM
     C                     MOVEL#USER     ECKOME
     C                     WRITEECQPP011
     C                     ENDIF
      *
     C                     ENDSR
TCH52 *-----------------------------------------------------
      * UPDATE DIE ALLOTMENT MASTER (GCQPP31)
      *-----------------------------------------------------
     C           #UPD5     BEGSR
      * NO COPY
B0   C           D@DICC    IFEQ *BLANKS
      *
     C* WRITE TO GCQPP31
     C           DIE15     CHAINGCQPL361             96
B1   C           *IN96     IFEQ *OFF
     C                     MOVEL#USER     DFKOME
     C                     UPDATGCQPL361
X1   C                     ELSE
     C                     CLEARGCQPL361
     C                     Z-ADD*YEAR     DFKOYY
     C                     Z-ADDUMONTH    DFKOMM
     C                     Z-ADDUDAY      DFKODD
     C                     Z-ADDHH        DFKOHH
     C                     Z-ADDMM        DFKOSS
     C                     MOVEL#USER     DFKOME
     C                     MOVELD@DIXX    DFKATA
     C                     MOVELD@DPA1    DFSHN1
     C                     MOVELD@DPA2    DFSHN2
     C                     MOVELD@DPA3    DFSHN3
     C                     MOVELD@DPRO    DFKOTI
     C                     Z-ADDD@DCMP    DFKSEI
     C                     Z-ADD1         DFKOSU
     C                     MOVEL'0'       DFKSKB
     C                     WRITEGCQPL361
     C* WRITE TO FCQPP32
     C                     MOVELDFKATA    KATA7
     C           KEY7      CHAINFCQPP321             78
     C           *IN78     IFEQ '1'
     C                     CLEARFCQPP321
     C                     MOVE TTKAT1    Q4KAT1
     C                     MOVE TTKAT2    Q4KAT2
     C                     MOVE TTKAT3    Q4KAT3
     C                     WRITEFCQPP321
     C                     ENDIF
      *
E1   C                     ENDIF
      *
X0   C                     ELSE
      * COPY FROM GCQPP31
     C* WRITE TO GCQPP31
     C                     CLEARGCQPL361
     C                     MOVE '0'       *IN94
     C           DIE16     SETLLGCQPL361
B1   C           *IN94     DOWEQ'0'
     C           DIE16     READEGCQPL361                 94
B2   C           *IN94     IFEQ *OFF
     C                     Z-ADD*YEAR     DFKOYY
     C                     Z-ADDUMONTH    DFKOMM
     C                     Z-ADDUDAY      DFKODD
     C                     Z-ADDHH        DFKOHH
     C                     Z-ADDMM        DFKOSS
     C                     MOVEL#USER     DFKOME
     C                     MOVELDIE15     DFKATA
     C                     MOVELDFSHN1    DFSHN1
     C                     MOVELDFSHN2    DFSHN2
     C                     MOVELDFSHN3    DFSHN3
     C                     MOVELDFKOTI    DFKOTI
     C                     Z-ADDDFKSEI    DFKSEI
     C                     Z-ADDDFKOSU    DFKOSU
     C                     MOVELDFKSKB    DFKSKB
     C                     WRITEGCQPL361
     C* WRITE TO FCQPP32
     C                     MOVELDFKATA    KATA7
     C           KEY7      CHAINFCQPP321             78
     C           *IN78     IFEQ '1'
     C                     CLEARFCQPP321
     C                     MOVE TTKAT1    Q4KAT1
     C                     MOVE TTKAT2    Q4KAT2
     C                     MOVE TTKAT3    Q4KAT3
     C                     WRITEFCQPP321
     C                     ENDIF
      *
E2   C                     ENDIF
E1   C                     ENDDO
      *
E0   C                     ENDIF
   |  *
TCH52C                     ENDSR
      *------------------------------------------------------
      * OUTPUT ECQWP16
      *------------------------------------------------------
     C           #DOWN     BEGSR
      *
     C                     MOVE *OFF      *IN98
     C                     MOVE *OFF      *IN80
     C                     TIME           @@TIM   60
     C                     Z-ADD*ZERO     D@TOTL
      *
     C           *LOVAL    SETLLFCQPP32
      *-----------------------------------------XXX
B0   C           *IN80     DOWEQ*OFF
     C                     READ FCQPP32                  80
B1   C           *IN80     IFEQ *OFF
     C           Q4SKJY    ANDEQ*BLANK
      *
     C                     EXSR #OUT
      *
E1   C                     ENDIF
E0   C                     ENDDO
      *-----------------------------------------XXX
      *
     C**         *IN98     IFEQ *ON
     C**                   CLEARECQWP161
     C**                   MOVEL'TOT'     EQDIE2
     C**                   Z-ADDD@TOTL    EQAMNT
     C**                   WRITEECQWP161
     C**                   ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      * DOWNLOAD FILE ECQWP16
      *------------------------------------------------------
     C           #OUT      BEGSR
      *
     C           WDD       IFEQ 0
     C           KATKEX    SETLLECSPL05
     C                     ELSE
     C           KATKEP    SETLLECSPL05
     C                     ENDIF
      *
     C                     DO   *HIVAL
     C           WDD       IFEQ 0
     C           KATKEX    READEECSPL05                  20
     C                     ELSE
     C           KATKEP    READEECSPL05                  20
     C                     ENDIF
     C   20                LEAVE
      *
     C           EQSKJY    IFNE *BLANK
     C           EQBMON    ORNE 0111
     C                     ITER
     C                     ENDIF
      *
     C                     CLEARECQWP161
     C                     MOVELEQYOHZ    EQDATE
     C                     MOVELEQKAT1    EQDIE1
     C                     MOVELEQKAT2    EQDIE2
     C                     MOVELEQKAT3    EQDIE3
      * LOCATION
     C                     MOVELEQKAT1    S@KAT1
     C                     MOVELEQKAT2    S@KAT2
     C                     MOVELEQKAT3    S@KAT3
     C           K#DIE     CHAINGCQPL12              95
     C           *IN95     IFEQ *OFF
     C                     MOVELT6LOCT    EQLOCT
     C                     ENDIF
      *
     C                     MOVELEQKINO    EQMCHN
      * WORK CENTER
     C                     MOVE EQMCHN    K@MCHN
     C           K#MFA     CHAINMFAPL25              95
     C           *IN95     IFEQ *OFF
     C                     MOVE @@CNTR    EQWCTR
     C                     ENDIF
      *
     C                     Z-ADDEQKOSU    EQUSGE
      *
     C                     MOVE *BLANK    K@KAT4
     C                     Z-ADD*ZERO     S@UPRC
     C                     EXSR #PRC
     C                     Z-ADDS@UPRC    EQUPRC
     C           EQUSGE    MULT S@UPRC    EQAMNT
      *
     C                     WRITEECQWP161
      *
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      * DIDPLAY 5TH SCREEN
      *------------------------------------------------------
     C           #SCRN5    BEGSR
      *
     C                     CLEARD@DIXX
     C                     CLEARD@DICC
     C                     CLEARD@DPRO
     C                     CLEARD@DCMP
     C                     CLEARD@DPA1
     C                     CLEARD@DPA2
     C                     CLEARD@DPA3
     C                     MOVE '0'       *IN77
     C           *IN77     DOWEQ'0'
     C                     EXFMTDSP05
      *
     C                     SELEC
      * F12: BACK
     C           *INKL     WHEQ *ON
     C                     MOVE '02'      W@ID
     C                     LEAVE
     C                     OTHER
     C                     EXSR #CHK5
     C           *IN99     IFEQ *OFF
      * F5: UPDATE
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD5
      *
     C           ' '       IFEQ FSCREN
     C                     EXSR #SET1
     C                     ENDIF
      *
     C                     MOVE '2'       W@ID
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDSL
     C                     ENDDO
   |  *
TCH52C                     ENDSR
      *------------------------------------------------------
** CMD
  F1:END,  F10:UPDATE PRICE BY ASJ DATA,  F6:CREATE M/F,  F8:DOWNLOAD TO M/F
  F1:END,    F12:BACK
OPT:P=UNIT PRICE ENTRY, X=PART INFO)
  F1:END,  F5:DOWNLOAD DATA,  F6:CREATE M/F,  F12:BACK
** KWD
CLRPFM ECQWP16
** MSG
Please be patient while making the data...
Please be patient while updating prices...
** MSX ..1.........2.........3
DIE# EXISTS
DIE# DOES NOT EXIST
PART# DOES NOT EXIST
NEW DIE# CAN NOT BE BLANK
