     H            Y.
     F** ECQR20 ****************************************************
     F* REFERENCE TO TRACK RECORD AND SAND OF DIE FOR HALF A YEAR  *
     F*   I-HASADA                                     87.02.24    *
     F*
     F* TCHK1 05/22/09 BUG FIX
     F* TCHK2 09/14/10 ADD DIE DTL SCROLL FUNCTION
     F**************************************************** ECQR20 **
     FECQPW2A CF  E                    WORKSTN
     F                                        RRN   KSFILE DSP2R
     FECSPL05 IF  E           K        DISK
     FGCQTL31 IF  E           K        DISK
     FGCQTL32 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     FGCQPL13 IF  E           K        DISK
     FGCAPL01 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FFCQPL31 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FEL#PL06 IF  E           K        DISK
     E                    MSG     1   5 60               d[ｰxｮﾈｰﾆﾞ
     E                    COM     1   1 12               ﾃx]n
     E                    TB1     1   1  4 0
     E                    OKOT       15  3               gｬc ﾃcmb
     E                    OKBM       15  4 0             gｬc ﾎﾞy]
     E                    NKOT       15  3               ﾆ] ﾃcmb
     E                    NKBM       15  4 0             ﾆ] ﾎﾞy]
     E                    NUKH       15 10 0             f]ﾌﾞ] gﾒfdﾍﾞ
     E                    HKT        15  3               ﾃcmb
     E                    HBM        15  4 0             ﾎﾞy]
     E                    @YM         6  6 0             ﾌ]nﾆ ﾍlﾞi
     E                    KOS         6  7 0             ﾃﾇc
     E                    SOU         6  6 1             c ﾇcﾒｭc
     E                    HEI         6  6 1             sbg]
     E                    MAI         6  6 0             ubﾇc
     E                    ZIS         6  7 0             ﾆﾞｮﾈg (fﾞx])
     E                    I6S        12  9 0             ﾆﾞｮﾈg ﾎｦbﾓ
     E                    SRY        12  9 0             ﾆﾞｮﾈg ﾎｦbﾓ
     E                    WOK         6 10 0             ﾆﾞｮﾈg A-PICS
     E                    TBM         8  4 0
     E                    CBM         8  4 0
     E                    KT1         5  9               fjﾌﾞ]
     E                    KS1         5  7 0             ﾃﾇc1
     E                    KS2         5  7 0             ﾃﾇc2
     E                    KS3         5  7 0             ﾃﾇc3
     E                    KS4         5  7 0             ﾃﾇc4
     E                    KS5         5  7 0             ﾃﾇc5
     E                    KS6         5  7 0             ﾃﾇc6
     E                    KS7         5  7 0             ﾃﾇc7
     E                    KS8         5  7 0             ﾃﾇc8
TCHK2E                    TT1        40  9
TCHK2E                    TS1        40  7 0
TCHK2E                    TS2        40  7 0
TCHK2E                    TS3        40  7 0
TCHK2E                    TS4        40  7 0
TCHK2E                    TS5        40  7 0
TCHK2E                    TS6        40  7 0
TCHK2E                    TS7        40  7 0
TCHK2E                    TS8        40  7 0
     IGCQTL321
     I              DFSKJY                          ##SKJY
     I              DFSKHZ                          ##SKHZ
     I              DFSKYY                          ##SKYY
     I              DFSKMM                          ##SKMM
     I              DFSKDD                          ##SKDD
     I              DFKOHZ                          ##KOHZ
     I              DFKOYY                          ##KOYY
     I              DFKOMM                          ##KOMM
     I              DFKODD                          ##KODD
     I              DFKOPN                          ##KOPN
     I              DFKOHH                          ##KOHH
     I              DFKOSS                          ##KOSS
     I              DFKOME                          ##KOME
     I              DFSHIN                          ##SHIN
     I              DFSHN1                          ##SHN1
     I              DFSHN2                          ##SHN2
     I              DFSHN3                          ##SHN3
     I              DFKOTI                          ##KOTI
     I              DFKSEI                          ##KSEI
     I              DFKATA                          ##KATA
     I              DFKOSU                          ##KOSU
     I              DFKUBN                          ##KUBN
     I              DFKSKB                          ##KSKB
     I            DS
     I                                        1  45 OKOT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600OKBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  45 NKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600NKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1 1500NUKH
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1  360@YM
     I                                        1   60YM1
     I                                        7  120YM2
     I                                       13  180YM3
     I                                       19  240YM4
     I                                       25  300YM5
     I                                       31  360YM6
     I            DS
     I                                        1  420KOS
     I                                        1   70KOS1
     I                                        8  140KOS2
     I                                       15  210KOS3
     I                                       22  280KOS4
     I                                       29  350KOS5
     I                                       36  420KOS6
     I            DS
     I                                        1  361SOU
     I                                        1   61SOU1
     I                                        7  121SOU2
     I                                       13  181SOU3
     I                                       19  241SOU4
     I                                       25  301SOU5
     I                                       31  361SOU6
     I            DS
     I                                        1  361HEI
     I                                        1   61HEI1
     I                                        7  121HEI2
     I                                       13  181HEI3
     I                                       19  241HEI4
     I                                       25  301HEI5
     I                                       31  361HEI6
     I            DS
     I                                        1  360MAI
     I                                        1   60MAI1
     I                                        7  120MAI2
     I                                       13  180MAI3
     I                                       19  240MAI4
     I                                       25  300MAI5
     I                                       31  360MAI6
     I            DS
     I                                        1  420ZIS
     I                                        1   70ZIS01
     I                                        8  140ZIS02
     I                                       15  210ZIS03
     I                                       22  280ZIS04
     I                                       29  350ZIS05
     I                                       36  420ZIS06
     I            DS
     I                                        1 1080I6S
     I                                        1   90I6SRO1
     I                                       10  180I6SRO2
     I                                       19  270I6SRO3
     I                                       28  360I6SRO4
     I                                       37  450I6SRO5
     I                                       46  540I6SRO6
     I                                       55  630I6SRO7
     I                                       64  720I6SRO8
     I                                       73  810I6SRO9
     I                                       82  900I6SROA
     I                                       91  990I6SROB
     I                                      100 1080I6SROC
     I            DS
     I                                        1 1080SRY
     I                                        1   90AESU01
     I                                       10  180AESU02
     I                                       19  270AESU03
     I                                       28  360AESU04
     I                                       37  450AESU05
     I                                       46  540AESU06
     I                                       55  630AESU07
     I                                       64  720AESU08
     I                                       73  810AESU09
     I                                       82  900AESU10
     I                                       91  990AESU11
     I                                      100 1080AESU12
     I            DS
     I                                        1  10 KAT
     I                                        1   2 KAT1
     I                                        3   3 AAA
     I                                        4   7 KAT2
     I                                        8   8 BBB
     I                                        9   9 KAT3
     I            DS
     I                                        1   60YYMM
     I                                        1   40YY
     I                                        5   60MM
     I            DS
     I                                        1   60@YYMM
     I                                        1   40@YY
     I                                        5   60@MM
     I            DS
     I                                        1   60WYYMM
     I                                        1   40WYY
     I                                        5   60WMM
     I            DS
     I                                        1   60EQHZ
     I                                        1   40EQYOYY
     I                                        5   60EQYOMM
     I            DS
     I                                        1   60DFHZ
     I                                        1   40DFKOYY
     I                                        5   60DFKOMM
     I            DS
     I                                        1  15 @@KEY
     I                                        1   2 #KAT1
     I                                        3   3 #AAA
     I                                        4   7 #KAT2
     I                                        8   8 #BBB
     I                                        9   9 #KAT3
     I                                       10  15 #CCC
     I            DS
     I                                        1  12 XHIN
     I                                        1   5 HIN1
     I                                        6  10 HIN2
     I                                       11  12 HIN3
     I            DS
     I                                        1   60YYMMKK
     I                                        1   40YYKK
     I                                        5   60MMKK
     I            DS
     I                                        1   80E#SKHZ
     I                                        1   40E#SKYY
     I                                        5   60E#SKMM
     I                                        7   80E#SKDD
     I            DS
     I                                        1   80XYMD
     I                                        1   40XYY
     I                                        5   60XMM
     I                                        7   80XDD
     I            DS
     I                                        1   80XASKHZ
     I                                        1   40XASKYY
     I                                        5   60XASKMM
     I                                        7   80XASKDD
     I            DS
     I                                        1   80XAKAHZ
     I                                        1   40XAKAYY
     I                                        5   60XAKAMM
     I                                        7   80XAKADD
     I            DS
     I                                        1   80XASUHZ
     I                                        1   40XASUYY
     I                                        5   60XASUMM
     I                                        7   80XASUDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I******明細用型番５行分******************
     I            DS
     I                                        1  45 KT1
     I                                        1   9 KAT11
     I                                       10  18 KAT12
     I                                       19  27 KAT13
     I                                       28  36 KAT14
     I                                       37  45 KAT15
     I******明細用型個数１，５行分******************
     I            DS
     I                                        1  350KS1
     I                                        1   70KOS11
     I                                        8  140KOS12
     I                                       15  210KOS13
     I                                       22  280KOS14
     I                                       29  350KOS15
     I******明細用型個数２，５行分******************
     I            DS
     I                                        1  350KS2
     I                                        1   70KOS21
     I                                        8  140KOS22
     I                                       15  210KOS23
     I                                       22  280KOS24
     I                                       29  350KOS25
     I******明細用型個数３，５行分******************
     I            DS
     I                                        1  350KS3
     I                                        1   70KOS31
     I                                        8  140KOS32
     I                                       15  210KOS33
     I                                       22  280KOS34
     I                                       29  350KOS35
     I******明細用型個数４，５行分******************
     I            DS
     I                                        1  350KS4
     I                                        1   70KOS41
     I                                        8  140KOS42
     I                                       15  210KOS43
     I                                       22  280KOS44
     I                                       29  350KOS45
     I******明細用型個数５，５行分******************
     I            DS
     I                                        1  350KS5
     I                                        1   70KOS51
     I                                        8  140KOS52
     I                                       15  210KOS53
     I                                       22  280KOS54
     I                                       29  350KOS55
     I******明細用型個数６，５行分******************
     I            DS
     I                                        1  350KS6
     I                                        1   70KOS61
     I                                        8  140KOS62
     I                                       15  210KOS63
     I                                       22  280KOS64
     I                                       29  350KOS65
     I******明細用型個数７，５行分******************
     I            DS
     I                                        1  350KS7
     I                                        1   70KOS71
     I                                        8  140KOS72
     I                                       15  210KOS73
     I                                       22  280KOS74
     I                                       29  350KOS75
     I******明細用型個数８，５行分******************
     I            DS
     I                                        1  350KS8
     I                                        1   70KOS81
     I                                        8  140KOS82
     I                                       15  210KOS83
     I                                       22  280KOS84
     I                                       29  350KOS85
      *
     I            DS
     I                                        1   6 WKAT6
     I                                        1   7 WKAT
     I                                        1   2 WKAT1
     I                                        3   6 WKAT2
     I                                        7   7 WKAT3
     I            DS
     I                                        1   7 ZKAT
     I                                        1   6 ZKAT6
     I                                        1   2 ZKAT1
     I                                        3   6 ZKAT2
     I                                        7   7 ZKAT3
     I            DS
     I                                        1   7 EKAT
     I                                        1   6 EKAT6
     I                                        1   2 EQKAT1
     I                                        3   6 EQKAT2
     I                                        7   7 EQKAT3
     I            DS
     I                                        1   9 HKAT
     I                                        1   2 HKAT1
     I                                        3   3 HF1
     I                                        4   7 HKAT2
     I                                        8   8 HF2
     I                                        9   9 HKAT3
      *
     C           *ENTRY    PLIST
     C                     PARM           PPKAT1  2
     C                     PARM           PPKAT2  4
      *
     C           DFKEY     KLIST
     C                     KFLD           DFSHN1
     C                     KFLD           DFSHN2
     C                     KFLD           DFSHN3
      *
     C           KATKEY    KLIST
     C                     KFLD           @KAT1
     C                     KFLD           @KAT2
     C                     KFLD           @KAT3
      *
     C           KKEY      KLIST
     C                     KFLD           WKAT1
     C                     KFLD           WKAT2
     C                     KFLD           WKAT3
      *
     C           KEY1      KLIST
     C                     KFLD           #KAT1
     C                     KFLD           #KAT2
      *
     C           KEY2      KLIST
     C                     KFLD           KAT1
     C                     KFLD           KAT2
     C                     KFLD           KAT3
     C                     KFLD           WMKCD
      *
     C           KEYKK     KLIST
     C                     KFLD           #XKOU
     C                     KFLD           KAT1
     C                     KFLD           KAT2
     C                     KFLD           KAT3
     C                     KFLD           YYKK
     C                     KFLD           MMKK
      *
     C           KEY       KLIST
     C                     KFLD           WYY
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
      *
     C           KEYADD    KLIST
     C                     KFLD           #KOU
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
     C                     KFLD           WYY
      *
     C           #KEY1     KLIST
     C                     KFLD           DFKATA
     C                     KFLD           DFSHN1
     C                     KFLD           DFSHN2
     C                     KFLD           DFSHN3
      *
     C           STP0      TAG
     C                     SETOF                     010203
     C                     SETOF                     99
     C                     SETON                     77
     C                     MOVE '0111'    KOU
     C                     MOVE *BLANK    KAT1
     C                     MOVE *BLANK    KAT2
     C                     MOVE *BLANK    KAT3
     C                     MOVE PPKAT1    KAT1
     C                     MOVE PPKAT2    KAT2
     C                     Z-ADD0         YYMM
     C                     MOVE *BLANK    ERR
     C                     Z-ADD*DATE     XYMD
     C                     SUB  1         XYY
      *
     C******************************************************
     C*  EXFMT  <fﾞx] 1>                                   *
     C******************************************************
     C           STP1      TAG
     C                     WRITEECQPW2A1
     C                     READ ECQPW2A                9999<TIME eｰﾌﾞｰ>
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     SETOF                     010203
     C                     SETOF                     99
     C                     MOVE *BLANK    ERR
      *
     C           *IN99     IFEQ '1'
     C                     MOVELMSG,1     ERR
     C                     GOTO STP1
     C                     END
      *
     C******************************************************
     C*  <fﾞx] 1 ﾉ kｩｮh>                                   *
     C******************************************************
      *
     C*  ﾃcﾆﾞｭc kｩｮh
     C*
     C           KOU       IFEQ 0
     C                     SETON                     0399
     C                     MOVELMSG,2     ERR
     C                     GOTO STP1
     C                     END
      *
     C           KOU       IFNE 0111
     C           KOU       ANDNE9999
     C                     SETON                     0399
     C                     MOVELMSG,3     ERR
     C                     GOTO STP1
     C                     END
      *
     C*  ﾃcﾆﾞｭc hﾎﾞ]
     C           KOU       IFEQ 0111
     C                     MOVEL'1'       XXX     1
     C                     ELSE
     C                     MOVEL'0'       XXX
     C                     END
      *
     C*  fjﾌﾞ] kｩｮh
     C*
     C           KAT1      IFEQ *BLANK
     C           KAT2      ANDEQ*BLANK
     C           KAT3      ANDEQ*BLANK
     C                     SETON                     019977
     C                     MOVELMSG,4     ERR
     C                     GOTO STP1
     C                     END
      *
     C                     MOVELKAT1      @KAT1   2
     C                     MOVELKAT2      @KAT2   4
     C                     MOVELKAT3      @KAT3   1
     C                     MOVELKAT1      #KAT1
     C                     MOVELKAT2      #KAT2
     C                     MOVELKAT3      #KAT3
     C                     MOVELKAT1      WKAT1
     C                     MOVELKAT2      WKAT2
     C                     MOVE *BLANK    WKAT3
      *
     C*  ﾍlﾞi kｩｮh
     C           YYMM      IFNE 0
     C           YY        IFLT 1988
     C           MM        ORGT 12
     C           MM        ORLT 01
     C                     SETON                     0299
     C                     MOVELMSG,5     ERR
     C                     GOTO STP1
     C                     END
     C                     ELSE
     C                     Z-ADD*YEAR     YY
     C                     Z-ADDUMONTH    MM
     C                     END
      *
     C                     EXSR #SET
      *
     C******************************************************
     C*  EXFMT  (fﾞx] 2)                                   *
     C******************************************************
     C           STP2      TAG
     C                     WRITEDSP2X
     C                     SETON                     91
     C                     EXFMTDSP2C
     C                     SETOF                     91
      *
     C                     SETOF                     010299
     C                     MOVE *BLANK    ERR
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *INKB     IFEQ '1'
     C                     GOTO STP0
     C                     END
      * F9
     C           *INKI     IFEQ '1'
     C                     Z-ADD0         P1DATE
     C                     MOVELYYMM      P1DATE
     C                     MOVE 01        P1DATE
     C                     MOVELKAT1      P1KAT1
     C                     MOVELKAT2      P1KAT2
     C                     Z-ADDKOU       P1BMON
     C                     CALL 'ECQR21'
     C                     PARM           P1DATE  80
     C                     PARM           P1KAT1  2
     C                     PARM           P1KAT2  4
     C                     PARM           P1BMON  40
     C                     GOTO STP0
     C                     END
TCHK2C*
TCHK2C           *INKG     IFEQ *ON
TCHK2C           N         IFGT 5
TCHK2C                     SUB  10        N
TCHK2C                     EXSR #SET#A
TCHK2C                     GOTO STP2
TCHK2C                     END
TCHK2C                     END
TCHK2C*
TCHK2C           *INKH     IFEQ *ON
TCHK2C           N         IFLT 40
TCHK2C                     EXSR #SET#A
TCHK2C                     GOTO STP2
TCHK2C                     END
TCHK2C                     END
      *
     C           *INKG     IFEQ '0'
     C           *INKH     ANDEQ'0'
     C                     GOTO STP0
     C                     ENDIF
     C                     GOTO STP2
      *
     C******************************************************
     C*  SET                                               *
     C******************************************************
     C           #SET      BEGSR
      *
     C*  ﾌ]nﾆ ﾍlﾞi
     C                     Z-ADD0         @YM
     C                     Z-ADDYYMM      @YYMM
     C                     DO   5         I       50
     C           MM        SUB  I         @MM
     C           @MM       IFEQ 0
     C                     Z-ADD12        @MM
     C           YY        SUB  1         @YY
     C                     END
      *
     C           @MM       IFEQ -1
     C                     Z-ADD11        @MM
     C           YY        SUB  1         @YY
     C                     END
      *
     C           @MM       IFEQ -2
     C                     Z-ADD10        @MM
     C           YY        SUB  1         @YY
     C                     END
      *
     C           @MM       IFEQ -3
     C                     Z-ADD09        @MM
     C           YY        SUB  1         @YY
     C                     END
      *
     C           @MM       IFEQ -4
     C                     Z-ADD08        @MM
     C           YY        SUB  1         @YY
     C                     END
      *
     C           I         ADD  4         W       50
      *
     C           W         IFEQ 6
     C                     Z-ADD4         W
     C                     END
      *
     C           W         IFEQ 7
     C                     Z-ADD3         W
     C                     END
      *
     C           W         IFEQ 8
     C                     Z-ADD2         W
     C                     END
      *
     C           W         IFEQ 9
     C                     Z-ADD1         W
     C                     END
      *
     C                     Z-ADD@YYMM     @YM,W
     C                     END
      *
     C                     Z-ADDYYMM      @YM,6
      *
     C                     MOVE *BLANK    AAA
     C                     MOVE *BLANK    BBB
      *
     C           KAT2      IFNE *BLANK
     C                     MOVE '-'       AAA
     C                     END
      *
     C           KAT3      IFNE *BLANK
     C                     MOVE '-'       BBB
     C                     END
      *
     C                     Z-ADD0         F       20
     C                     Z-ADD0         X       20
     C                     Z-ADD0         TBM
     C                     Z-ADD0         CBM
      *
     C*  ﾍgam ﾍ]ﾌﾞ] i]ﾇc
     C                     MOVE *BLANK    #AAA
     C                     MOVE *BLANK    #BBB
     C                     MOVE *BLANK    #CCC
      *
     C           #KAT2     IFNE *BLANK
     C                     MOVE '-'       #AAA
     C                     END
      *
     C           #KAT3     IFNE *BLANK
     C                     MOVE '-'       #BBB
     C                     END
      *
     C           @@KEY     SETLLGCQTL311
     C                     SETOF                     12
     C                     Z-ADD0         KENS
     C                     MOVE *BLANK    @HIN   12
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           @@KEY     READEGCQTL311                 10
     C           *IN10     IFEQ '0'
      *
     C           DFSKJY    IFEQ 'D'
     C           DFSKHZ    ANDLE*DATE
      *
     C                     SETOF                     41
     C           KEY1      CHAINFCQPL311             41
     C           *IN41     IFEQ '1'
     C                     GOTO @END
     C                     END
      *
     C           DFSKHZ    IFLT XYMD
     C                     GOTO @END
     C                     END
     C                     END
      *
     C           DFSHIN    IFNE @HIN
     C                     SETOF                     41
     C           DFKEY     CHAINAAMPL111             41
     C           *IN41     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     41
     C                     END
     C           *IN41     IFEQ '0'
      *
     C                     Z-ADD1         A       20
     C                     Z-ADD0         B       20
     C                     Z-ADD*ZERO     HBM
     C                     DO   15        A
     C                     MOVELNUKH,A    WUKH    80
     C           *DATE     IFLT WUKH
     C           OKOT,A    IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE OKOT,A    HKT,B
     C                     Z-ADDOKBM,A    HBM,B
     C                     END
     C                     ELSE
     C           NKOT,A    IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE NKOT,A    HKT,B
     C                     Z-ADDNKBM,A    HBM,B
     C                     END
     C                     END
     C                     END
      *
     C           KOU       IFEQ 9999
     C                     SETON                     12
     C                     ADD  1         KENS
     C                     MOVELDFSHIN    @HIN
      *
     C                     Z-ADD1         A
     C           1         DO   8         A
     C                     SETOF                     40
     C           TB1,A     LOKUPHBM                      40
     C           *IN40     IFEQ '1'
     C           TB1,A     LOKUPTBM                      40
     C           *IN40     IFEQ '0'
     C                     ADD  1         X
     C                     Z-ADDTB1,A     TBM,X
     C                     END
     C                     END
     C                     END
     C                     ELSE
      *
     C                     SETOF                     53
     C           KOU       LOKUPHBM                      53
     C           *IN53     IFEQ '1'
     C                     SETON                     12
     C                     ADD  1         KENS
     C                     MOVELDFSHIN    @HIN
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           @END      TAG
     C  N10                END
      *
     C*  f]ﾌﾞ] ubﾇc ､ ﾈｮmbﾇc ､ ﾆｬcﾑcﾇc
     C*
     C                     SETOF                     22
     C                     Z-ADD0         $MKOCD  40
     C                     Z-ADD0         WMKCD
     C                     MOVE *BLANK    $TKR1   1
     C                     Z-ADD0         MAIS
     C                     Z-ADD0         SETS
     C                     Z-ADD0         SYUS
     C                     Z-ADD0         WLTIM
     C           KATKEY    SETLLGCQPL131
     C                     DO   *HIVAL
     C                     SETOF                     20
     C           KATKEY    READEGCQPL131                 20
     C           *IN20     IFEQ '0'
      *
     C           T6SKJY    IFEQ 'D'
     C           T6SKHZ    ANDLE*DATE
     C                     GOTO KTP1
     C                     END
      *
     C*  f]ﾌﾞ] ubﾇc ､ ﾈｮmbﾇc
     C           T6KOCD    IFEQ $MKOCD
     C           T6TKR1    ANDEQ$TKR1
     C                     ELSE
     C                     Z-ADDT6KOCD    $MKOCD
     C                     MOVE T6TKR1    $TKR1
     C                     Z-ADDT6KOCD    WMKCD
     C                     ADD  T6MAIS    MAIS
     C                     ADD  T6SRYO    SETS
     C                     Z-ADDT6SYOS    SYUS
     C                     Z-ADDT6LTIM    WLTIM
     C           KTP1      TAG
     C                     END
     C                     END
     C  N20                END
      *
     C                     SETOF                     30
     C                     MOVE *BLANK    WMKNM
     C           WMKCD     CHAINFGBPL011             30
     C           *IN30     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVELB2SMEI    WMKNM
     C                     END
      *
     C*  fjj]f
     C                     Z-ADD0         WTANK
     C           KEY2      SETLLGCAPL011
     C                     DO   *HIVAL
     C                     SETOF                     11
     C           KEY2      READEGCAPL011                 11
     C           *IN11     IFEQ '0'
     C           XASKJY    IFEQ 'D'
     C           XASKHZ    ANDLE*DATE
     C                     ELSE
     C           XAKTKB    IFEQ 'K'
     C           *DATE     IFGE XAKAHZ
     C           *DATE     ANDLEXASUHZ
     C           XATANK    IFGT WTANK
     C                     Z-ADDXATANK    WTANK
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C  N11                END
      *
     C*  ﾃﾇc
     C*
     C                     Z-ADD*ZERO     KOS
TCHK2C                     MOVE *BLANK    TT1
TCHK2C                     Z-ADD*ZERO     TS1
TCHK2C                     Z-ADD*ZERO     TS2
TCHK2C                     Z-ADD*ZERO     TS3
TCHK2C                     Z-ADD*ZERO     TS4
TCHK2C                     Z-ADD*ZERO     TS5
TCHK2C                     Z-ADD*ZERO     TS6
TCHK2C                     Z-ADD*ZERO     TS7
TCHK2C                     Z-ADD*ZERO     TS8
TCHK2C*                    MOVE *BLANK    KT1
TCHK2C*                    Z-ADD*ZERO     KS1
TCHK2C*                    Z-ADD*ZERO     KS2
TCHK2C*                    Z-ADD*ZERO     KS3
TCHK2C*                    Z-ADD*ZERO     KS4
TCHK2C*                    Z-ADD*ZERO     KS5
TCHK2C*                    Z-ADD*ZERO     KS6
TCHK2C*                    Z-ADD*ZERO     KOS71
TCHK2C*                    Z-ADD*ZERO     KOS81
TCHK2C*                    Z-ADD*ZERO     KOS72
TCHK2C*                    Z-ADD*ZERO     KOS82
TCHK2C*                    Z-ADD*ZERO     KOS73
TCHK2C*                    Z-ADD*ZERO     KOS83
TCHK2C*                    Z-ADD*ZERO     KOS74
TCHK2C*                    Z-ADD*ZERO     KOS84
TCHK2C*                    Z-ADD*ZERO     KOS75
TCHK2C*                    Z-ADD*ZERO     KOS85
     C                     SETOF                     71
TCHK2C*                    Z-ADD1         M       10
TCHK2C                     Z-ADD1         M       20
     C                     MOVE *BLANK    ZKAT
      *
     C           KKEY      SETLLECQPL051
     C                     DO   *HIVAL
     C                     SETOF                     30
     C                     READ ECQPL051                 30
     C           *IN30     IFEQ '1'
     C           *IN71     ANDEQ'1'
     C                     EXSR #MOVE
     C                     END
     C           *IN30     IFEQ '0'
     C           *IN71     IFEQ '0'
     C           WKAT6     IFEQ EKAT6
     C                     MOVE EKAT      ZKAT
     C                     SETON                     71
     C                     ELSE
     C                     GOTO STEP77
     C                     END
     C                     END
      *
     C           EQSKJY    IFEQ 'D'
     C           EQSKHZ    ANDLE*DATE
     C                     GOTO @END2
     C                     END
      *
     C           KOU       IFNE 9999
     C           EQBMON    IFNE KOU
     C                     GOTO @END2
     C                     END
     C                     END
      *
     C           EKAT      IFEQ ZKAT
     C                     SETOF                     40
     C                     Z-ADD1         J       50
     C           EQHZ      LOKUP@YM,J                    40
     C           *IN40     IFEQ '1'
     C                     ADD  EQKOSU    KOS,J
     C                     END
     C                     ELSE
     C                     EXSR #MOVE
TCHK1C                     SETOF                     40
TCHK1C                     Z-ADD1         J       50
TCHK1C           EQHZ      LOKUP@YM,J                    40
TCHK1C           *IN40     IFEQ '1'
TCHK1C                     ADD  EQKOSU    KOS,J
TCHK1C                     END
     C           EKAT6     IFNE ZKAT6
     C                     SETON                     30
     C                     GOTO @END2
     C                     END
     C                     MOVE EKAT      ZKAT
     C           M         ADD  1         M
TCHK2C*          M         IFGT 5
TCHK2C           M         IFGT 40
     C                     SETON                     30
     C                     GOTO @END2
     C                     END
     C                     END
     C                     END
      *
     C           @END2     TAG
     C  N30                END
      *
     C           STEP77    TAG
TCHK2C*                    Z-ADD*ZERO     KOS71
TCHK2C*                    Z-ADD*ZERO     KOS81
TCHK2C*                    Z-ADD*ZERO     KOS72
TCHK2C*                    Z-ADD*ZERO     KOS82
TCHK2C*                    Z-ADD*ZERO     KOS73
TCHK2C*                    Z-ADD*ZERO     KOS83
TCHK2C*                    Z-ADD*ZERO     KOS74
TCHK2C*                    Z-ADD*ZERO     KOS84
TCHK2C*                    Z-ADD*ZERO     KOS75
TCHK2C*                    Z-ADD*ZERO     KOS85
TCHK2C*          KOS11     ADD  KOS21     KOS71
TCHK2C*          KOS31     ADD  KOS71     KOS71
TCHK2C*          KOS41     ADD  KOS71     KOS71
TCHK2C*          KOS51     ADD  KOS71     KOS71
TCHK2C*          KOS61     ADD  KOS71     KOS71
TCHK2C*          KOS71     DIV  6         KOS81     H
TCHK2C*          KOS12     ADD  KOS22     KOS72
TCHK2C*          KOS32     ADD  KOS72     KOS72
TCHK2C*          KOS42     ADD  KOS72     KOS72
TCHK2C*          KOS52     ADD  KOS72     KOS72
TCHK2C*          KOS62     ADD  KOS72     KOS72
TCHK2C*          KOS72     DIV  6         KOS82     H
TCHK2C*          KOS13     ADD  KOS23     KOS73
TCHK2C*          KOS33     ADD  KOS73     KOS73
TCHK2C*          KOS43     ADD  KOS73     KOS73
TCHK2C*          KOS53     ADD  KOS73     KOS73
TCHK2C*          KOS63     ADD  KOS73     KOS73
TCHK2C*          KOS73     DIV  6         KOS83     H
TCHK2C*          KOS14     ADD  KOS24     KOS74
TCHK2C*          KOS34     ADD  KOS74     KOS74
TCHK2C*          KOS44     ADD  KOS74     KOS74
TCHK2C*          KOS54     ADD  KOS74     KOS74
TCHK2C*          KOS64     ADD  KOS74     KOS74
TCHK2C*          KOS74     DIV  6         KOS84     H
TCHK2C*          KOS15     ADD  KOS25     KOS75
TCHK2C*          KOS35     ADD  KOS75     KOS75
TCHK2C*          KOS45     ADD  KOS75     KOS75
TCHK2C*          KOS55     ADD  KOS75     KOS75
TCHK2C*          KOS65     ADD  KOS75     KOS75
TCHK2C*          KOS75     DIV  6         KOS85     H
      *
TCHK2C                     Z-ADD*ZERO     N       20
TCHK2C                     EXSR #SET#A
     C                     Z-ADD0         KOS
     C                     Z-ADD0         KOS7
     C                     Z-ADD0         KOS8
TCHK2C*                    XFOOTKS1       KOS1
TCHK2C*                    XFOOTKS2       KOS2
TCHK2C*                    XFOOTKS3       KOS3
TCHK2C*                    XFOOTKS4       KOS4
TCHK2C*                    XFOOTKS5       KOS5
TCHK2C*                    XFOOTKS6       KOS6
TCHK2C                     XFOOTTS1       KOS1
TCHK2C                     XFOOTTS2       KOS2
TCHK2C                     XFOOTTS3       KOS3
TCHK2C                     XFOOTTS4       KOS4
TCHK2C                     XFOOTTS5       KOS5
TCHK2C                     XFOOTTS6       KOS6
     C                     XFOOTKOS       KOS7    70
     C           KOS7      DIV  6         KOS8    70H
     C*  ﾍgam ﾍ]ﾌﾞ]cﾇcﾒｭc
     C*
     C                     Z-ADD*ZERO     SOU
     C                     Z-ADD*ZERO     SOU7
     C                     Z-ADD*ZERO     SOU8
     C                     Z-ADD*ZERO     WOK
      *
     C           @@KEY     SETLLGCQTL311
     C                     MOVE *BLANK    XHIN
     C                     DO   *HIVAL
     C                     SETOF                     25
     C           @@KEY     READEGCQTL311                 25
     C           *IN25     IFEQ '0'
      *
     C           DFSHIN    IFNE XHIN
     C                     MOVELDFSHIN    XHIN
      *
     C                     MOVE *BLANK    HKBN
     C                     Z-ADD0         #SKHZ   60
     C           #KEY1     SETLLGCQTL321
      *
     C                     DO   *HIVAL
     C                     SETOF                     42
     C           #KEY1     READEGCQTL321                 42
     C           *IN42     IFEQ '0'
     C           ##SKJY    IFEQ 'D'
     C           ##SKHZ    ANDLE*DATE
     C           ##SKHZ    IFGT #SKHZ
     C                     Z-ADD##SKHZ    #SKHZ
     C                     END
     C                     ELSE
     C                     SETON                     42
     C                     Z-ADD0         #SKHZ
     C                     END
     C                     END
     C  N42                END
      *
     C           #SKHZ     IFNE 0
     C                     SETOF                     42
     C           KEY1      CHAINFCQPL311             42
     C           *IN42     IFEQ '1'
     C                     GOTO @@END
     C                     END
     C           #SKHZ     IFLT XYMD
     C                     GOTO @@END
     C                     END
     C                     MOVE '*'       HKBN
     C                     END
      *
     C                     SETOF                     42
     C           DFKEY     CHAINAAMPL111             42
     C           *IN42     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     42
     C                     END
     C           *IN42     IFEQ '0'
     C                     Z-ADD1         V       20
     C                     Z-ADD0         C       20
     C                     Z-ADD*ZERO     HBM
     C                     DO   15        V
     C                     MOVELNUKH,V    VUKH    80
     C           *DATE     IFLT VUKH
     C           OKOT,V    IFNE *BLANK
     C                     ADD  1         C
     C                     MOVE OKOT,V    HKT,C
     C                     Z-ADDOKBM,V    HBM,C
     C                     END
     C                     ELSE
     C           NKOT,V    IFNE *BLANK
     C                     ADD  1         C
     C                     MOVE NKOT,V    HKT,C
     C                     Z-ADDNKBM,V    HBM,C
     C                     END
     C                     END
     C                     END
      *
     C           KOU       IFNE 9999
     C                     SETOF                     54
     C           KOU       LOKUPHBM                      54
     C           *IN54     IFEQ '0'
     C                     GOTO @@END
     C                     END
     C                     END
     C                     MOVELDFSHIN    HIN
      *
     C                     Z-ADD*ZERO     ZIS
     C                     Z-ADD*ZERO     ZIS07
     C                     Z-ADD*ZERO     ZIS08
      *
     C           KOU       IFNE 9999
      *
     C                     DO   6         U       50
     C                     SETOF                     65
     C                     Z-ADD@YM,U     WYYMM
     C           KEY       CHAINMBEPL051             65
     C           *IN65     IFEQ '0'
     C                     Z-ADDI6S,WMM   ZIS,U
     C                     ADD  ZIS,U     WOK,U
     C                     END
     C                     END
     C                     ELSE
      *
     C                     SETOF                     40
     C                     Z-ADD1         A
     C                     Z-ADD0         #KOU    40
     C           1         DO   8         A
     C           TBM,A     IFNE 0
     C                     Z-ADDTBM,A     #KOU
      *
     C                     DO   6         U
     C                     SETOF                     65
     C                     Z-ADD@YM,U     WYYMM
     C           KEY       CHAINMBEPL051             65
     C           *IN65     IFEQ '0'
     C                     SETON                     40
     C                     Z-ADDI6S,WMM   ZIS,U
     C                     ADD  ZIS,U     WOK,U
     C                     END
     C                     END
      *
     C           *IN40     IFEQ '1'
     C                     GOTO $XTP1
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C           $XTP1     TAG
      *
     C                     XFOOTZIS       ZIS07
     C           ZIS07     DIV  6         ZIS08     H
      *
     C                     END
     C                     END
     C                     END
      *
     C           @@END     TAG
     C  N25                END
      *
     C                     DO   6         H       50
     C           WOK,H     DIV  10000     SOU,H     H
     C                     END
      *
     C                     XFOOTSOU       SOU7
     C           SOU7      DIV  6         SOU8      H
      *
     C*  sbg]
     C*
     C                     Z-ADD*ZERO     HEI
     C                     Z-ADD*ZERO     HEI7
     C                     Z-ADD*ZERO     HEI8
      *
     C                     DO   6         P       50
     C           KOS,P     IFNE 0
     C           SOU,P     DIV  KOS,P     HEI,P     H
     C                     END
     C                     END
      *
     C           KOS7      IFNE 0
     C           SOU7      DIV  KOS7      HEI7      H
     C                     END
      *
     C           KOS8      IFNE 0
     C           SOU8      DIV  KOS8      HEI8      H
     C                     END
      *
     C*  ubﾇc
     C*
     C                     Z-ADD*ZERO     MAI
     C                     Z-ADD*ZERO     MAI7
     C                     Z-ADD*ZERO     MAI8
      *
     C           *IN12     IFEQ '1'
     C           KOU       IFNE 9999
     C                     Z-ADDKOU       #XKOU   40
      *
     C                     SETOF                     86
     C                     Z-ADD1         Q
     C           #XKOU     LOKUPCBM,Q                    86
     C           *IN86     IFEQ '0'
     C                     ADD  1         F
     C                     Z-ADD#XKOU     CBM,F
      *
     C                     DO   6         Q       50
     C                     Z-ADD@YM,Q     YYMMKK
      *
     C           KEYKK     SETLLEL#PL061
     C                     DO   *HIVAL
     C                     SETOF                     86
     C           KEYKK     READEEL#PL061                 86
     C           *IN86     IFEQ '0'
     C           E#SKJY    IFEQ 'D'
     C           E#SKHZ    ANDLE*DATE
     C                     GOTO @@EXIT
     C                     END
      *
     C           E#NOBN    IFEQ 0
     C           E#SYOS    IFEQ 0
     C                     Z-ADD1         E#SYOS
     C                     END
     C                     ADD  E#NOKS    MAI,Q
     C                     END
      *
     C                     END
     C           @@EXIT    TAG
     C  N86                END
     C                     END
     C                     END
     C                     ELSE
      *
     C                     Z-ADD1         A
     C           1         DO   8         A
     C           TBM,A     IFNE 0
     C                     Z-ADDTBM,A     #XKOU
      *
     C                     SETOF                     86
     C                     Z-ADD1         Q
     C           #XKOU     LOKUPCBM,Q                    86
     C           *IN86     IFEQ '0'
     C                     ADD  1         F
     C                     Z-ADD#XKOU     CBM,F
      *
     C                     DO   6         Q
     C                     Z-ADD@YM,Q     YYMMKK
      *
     C           KEYKK     SETLLEL#PL061
     C                     DO   *HIVAL
     C                     SETOF                     86
     C           KEYKK     READEEL#PL061                 86
     C           *IN86     IFEQ '0'
     C           E#SKJY    IFEQ 'D'
     C           E#SKHZ    ANDLE*DATE
     C                     GOTO @@TP2
     C                     END
      *
     C           E#NOBN    IFEQ 0
     C           E#SYOS    IFEQ 0
     C                     Z-ADD1         E#SYOS
     C                     END
     C                     ADD  E#NOKS    MAI,Q
     C                     END
      *
     C                     END
     C           @@TP2     TAG
     C  N86                END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     XFOOTMAI       MAI7
     C           MAI7      DIV  6         MAI8
     C                     END
      *
     C                     Z-ADD0         RRN     50
     C                     SETON                     92
     C                     WRITEDSP2C
     C                     SETOF                     92
      *
     C           @@KEY     SETLLGCQTL311
     C                     MOVE *BLANK    XHIN   12
     C                     DO   *HIVAL
     C                     SETOF                     70
     C           @@KEY     READEGCQTL311                 70
     C           *IN70     IFEQ '0'
      *
     C           DFSHIN    IFNE XHIN
     C                     MOVELDFSHIN    XHIN
      *
     C                     MOVE *BLANK    HKBN
     C                     Z-ADD0         #SKHZ
     C           #KEY1     SETLLGCQTL321
      *
     C                     DO   *HIVAL
     C                     SETOF                     43
     C           #KEY1     READEGCQTL321                 43
     C           *IN43     IFEQ '0'
     C           ##SKJY    IFEQ 'D'
     C           ##SKHZ    ANDLE*DATE
     C           ##SKHZ    IFGT #SKHZ
     C                     Z-ADD##SKHZ    #SKHZ
     C                     END
     C                     ELSE
     C                     SETON                     43
     C                     Z-ADD0         #SKHZ
     C                     END
     C                     END
     C  N43                END
      *
     C           #SKHZ     IFNE 0
     C                     SETOF                     43
     C           KEY1      CHAINFCQPL311             43
     C           *IN43     IFEQ '1'
     C                     GOTO @END4
     C                     END
     C           #SKHZ     IFLT XYMD
     C                     GOTO @END4
     C                     END
     C                     MOVE '*'       HKBN
     C                     END
      *
     C                     SETOF                     43
     C           DFKEY     CHAINAAMPL111             43
     C           *IN43     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     43
     C                     END
     C           *IN43     IFEQ '0'
     C                     Z-ADD1         R       20
     C                     Z-ADD0         E       20
     C                     Z-ADD*ZERO     HBM
     C                     DO   15        R
     C                     MOVELNUKH,R    RUKH    80
     C           *DATE     IFLT RUKH
     C           OKOT,R    IFNE *BLANK
     C                     ADD  1         E
     C                     MOVE OKOT,R    HKT,E
     C                     Z-ADDOKBM,R    HBM,E
     C                     END
     C                     ELSE
     C           NKOT,R    IFNE *BLANK
     C                     ADD  1         E
     C                     MOVE NKOT,R    HKT,E
     C                     Z-ADDNKBM,R    HBM,E
     C                     END
     C                     END
     C                     END
      *
     C           KOU       IFNE 9999
     C                     SETOF                     64
     C           KOU       LOKUPHBM                      64
     C           *IN64     IFEQ '0'
     C                     GOTO @END4
     C                     END
     C                     END
     C                     ADD  1         RRN
     C                     MOVELDFSHIN    HIN
      *
     C                     Z-ADD*ZERO     ZIS
     C                     Z-ADD*ZERO     ZIS07
     C                     Z-ADD*ZERO     ZIS08
     C                     Z-ADD*ZERO     WOK
      *
     C           KOU       IFNE 9999
     C                     Z-ADDKOU       #KOU
      *
     C                     DO   6         Z       50
     C                     SETOF                     80
     C                     Z-ADD@YM,Z     WYYMM
     C           KEY       CHAINMBEPL051             80
     C           *IN80     IFEQ '0'
     C                     Z-ADDI6S,WMM   ZIS,Z
     C                     END
     C                     END
     C                     ELSE
      *
     C                     SETOF                     40
     C                     Z-ADD1         A
     C           1         DO   8         A
     C           TBM,A     IFNE 0
     C                     Z-ADDTBM,A     #KOU
      *
     C                     DO   6         Z
     C                     SETOF                     80
     C                     Z-ADD@YM,Z     WYYMM
     C           KEY       CHAINMBEPL051             80
     C           *IN80     IFEQ '0'
     C                     SETON                     40
     C                     Z-ADDI6S,WMM   ZIS,Z
     C                     END
     C                     END
     C           *IN40     IFEQ '1'
     C                     GOTO $XTP3
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C           $XTP3     TAG
      *
     C                     XFOOTZIS       ZIS07
     C           ZIS07     DIV  6         ZIS08     H
      *
     C                     ADD  ZIS,1     WOK,1
     C                     ADD  ZIS,2     WOK,2
     C                     ADD  ZIS,3     WOK,3
     C                     ADD  ZIS,4     WOK,4
     C                     ADD  ZIS,5     WOK,5
     C                     ADD  ZIS,6     WOK,6
     C                     WRITEDSP2R
     C                     END
     C                     END
     C                     END
      *
     C           @END4     TAG
     C  N70                END
      *
     C           RRN       IFEQ 0
     C                     ADD  1         RRN
     C                     Z-ADD*ZERO     ZIS
     C                     Z-ADD*ZERO     ZIS07
     C                     Z-ADD*ZERO     ZIS08
     C                     MOVELCOM,1     HIN
     C                     WRITEDSP2R
     C                     END
      *
     C                     ENDSR
      *
     C           #MOVE     BEGSR
     C                     MOVE ZKAT1     HKAT1
     C                     MOVE ZKAT2     HKAT2
     C                     MOVE ZKAT3     HKAT3
     C                     MOVE '-'       HF1
     C                     MOVE '-'       HF2
TCHK2C*                    MOVE HKAT      KT1,M
TCHK2C*                    Z-ADDKOS1      KS1,M
TCHK2C*                    Z-ADDKOS2      KS2,M
TCHK2C*                    Z-ADDKOS3      KS3,M
TCHK2C*                    Z-ADDKOS4      KS4,M
TCHK2C*                    Z-ADDKOS5      KS5,M
TCHK2C*                    Z-ADDKOS6      KS6,M
TCHK2C                     MOVE HKAT      TT1,M
TCHK2C                     Z-ADDKOS1      TS1,M
TCHK2C                     Z-ADDKOS2      TS2,M
TCHK2C                     Z-ADDKOS3      TS3,M
TCHK2C                     Z-ADDKOS4      TS4,M
TCHK2C                     Z-ADDKOS5      TS5,M
TCHK2C                     Z-ADDKOS6      TS6,M
     C                     Z-ADD0         KOS
     C           EMOVE     ENDSR
TCHK2C* ----------------------------------------------------
TCHK2C           #SET#A    BEGSR
TCHK2C*
TCHK2C                     MOVE *BLANK    KT1
TCHK2C                     Z-ADD*ZERO     KS1
TCHK2C                     Z-ADD*ZERO     KS2
TCHK2C                     Z-ADD*ZERO     KS3
TCHK2C                     Z-ADD*ZERO     KS4
TCHK2C                     Z-ADD*ZERO     KS5
TCHK2C                     Z-ADD*ZERO     KS6
TCHK2C                     Z-ADD*ZERO     KS7
TCHK2C                     Z-ADD*ZERO     KS8
TCHK2C*
TCHK2C           1         DO   5         P
TCHK2C                     ADD  1         N
TCHK2C                     MOVELTT1,N     KT1,P
TCHK2C                     Z-ADDTS1,N     KS1,P
TCHK2C                     Z-ADDTS2,N     KS2,P
TCHK2C                     Z-ADDTS3,N     KS3,P
TCHK2C                     Z-ADDTS4,N     KS4,P
TCHK2C                     Z-ADDTS5,N     KS5,P
TCHK2C                     Z-ADDTS6,N     KS6,P
TCHK2C                     ENDDO
TCHK2C*
TCHK2C                     ADD  KOS11     KOS71
TCHK2C                     ADD  KOS21     KOS71
TCHK2C                     ADD  KOS31     KOS71
TCHK2C                     ADD  KOS41     KOS71
TCHK2C                     ADD  KOS51     KOS71
TCHK2C                     ADD  KOS61     KOS71
TCHK2C           KOS71     DIV  6         KOS81     H
TCHK2C*
TCHK2C                     ADD  KOS12     KOS72
TCHK2C                     ADD  KOS22     KOS72
TCHK2C                     ADD  KOS32     KOS72
TCHK2C                     ADD  KOS42     KOS72
TCHK2C                     ADD  KOS52     KOS72
TCHK2C                     ADD  KOS62     KOS72
TCHK2C           KOS72     DIV  6         KOS82     H
TCHK2C*
TCHK2C                     ADD  KOS13     KOS73
TCHK2C                     ADD  KOS23     KOS73
TCHK2C                     ADD  KOS33     KOS73
TCHK2C                     ADD  KOS43     KOS73
TCHK2C                     ADD  KOS53     KOS73
TCHK2C                     ADD  KOS63     KOS73
TCHK2C           KOS73     DIV  6         KOS83     H
TCHK2C*
TCHK2C                     ADD  KOS14     KOS74
TCHK2C                     ADD  KOS24     KOS74
TCHK2C                     ADD  KOS34     KOS74
TCHK2C                     ADD  KOS44     KOS74
TCHK2C                     ADD  KOS54     KOS74
TCHK2C                     ADD  KOS64     KOS74
TCHK2C           KOS74     DIV  6         KOS84     H
TCHK2C*
TCHK2C                     ADD  KOS15     KOS75
TCHK2C                     ADD  KOS25     KOS75
TCHK2C                     ADD  KOS35     KOS75
TCHK2C                     ADD  KOS45     KOS75
TCHK2C                     ADD  KOS55     KOS75
TCHK2C                     ADD  KOS65     KOS75
TCHK2C           KOS75     DIV  6         KOS85     H
TCHK2C*
TCHK2C                     ENDSR
TCHK2C* ----------------------------------------------------
**  MSG (ERROR MESSAGE )
E-01 PLEASE SIGNOFF WHEN DOESN'T USE IT LONG TIME.
E-02 INPUT FACTORY CODE.
E-03 FACTORY CODE ISN'T RIGHT.
E-04 INPUT DIE NO
E-05 DATE ISN'T RIGHT
**  COM (COMMENT )
NO DATA
**  TB1
0111
