     H            Y.
     F** ECQR16 **********************************
     F* DIE COST ENTRY
     F* PROGRAM ID. : ECQR16. <RPG> *
     F* CREATE DATE. : MAY.06.02                 *
     F* AUTHOR.         : TCH                    *
     F********************************** ECQR15 **
     FECQPW16 CF  E                    WORKSTN
     F                                              KINFDS @INFDS
     FFCQPL31 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FECQPP01 UF  E           K        DISK                      A
      *-----------------------------------------------------------
     E                    CMD     1   2 78
      *-----------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   40D@MMYY
     I                                        1   20D@MM
     I                                        3   40D@YY
     I            DS
     I                                        1   60WYYMM
     I                                        1   40WYY
     I                                        5   60WMM
     I            DS
     I                                        1   80KYMD
     I                                        1   40KYY
     I                                        5   60KMM
     I                                        7   80KDD
     I            DS
     I                                        1   60EQHZ
     I                                        1   40EQYOYY
     I                                        5   60EQYOMM
     I            DS
     I                                        1   60DFHZ
     I                                        1   40DFKOYY
     I                                        5   60DFKOMM
     I            DS
     I                                        1  15 DFKATA
     I                                        1   2 #KAT1
     I I            '-'                       3   3 #AAA
     I                                        4   7 #KAT2
     I                                        8   8 #BBB
     I                                        9   9 #KAT3
     I            DS
     I                                        1  54 QTY
     I                                        1   90EQQTY1
     I                                       10  180EQQTY2
     I                                       19  270EQQTY3
     I                                       28  360EQQTY4
     I                                       37  450EQQTY5
     I                                       46  540EQQTY6
     I            DS
     I                                        1   60F8YYMM
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------
      *  MAIN ROUTINE
      *--------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C           W@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *------------------------------------------------------
     C           KEY1      KLIST
     C                     KFLD           D@DIE1
     C                     KFLD           D@DIE2
      *
     C           K#ECQ     KLIST
     C                     KFLD           D@DIE1
     C                     KFLD           D@DIE2
     C                     KFLD           D@DIE3
     C                     KFLD           K@KAT4  1
     C           K#ECQX    KLIST
     C                     KFLD           D@DIE1
     C                     KFLD           D@DIE2
     C                     KFLD           D@DIE3
     C                     KFLD           D@DIE4  1
     C                     KFLD           KYMD
      *
     C           K#AGX     KLIST
     C                     KFLD           KYY
     C                     KFLD           KMM
     C                     KFLD           KDD
      *
     C                     MOVE '01'      W@ID    2
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #SCRN1    BEGSR
      *-----------------------------------------------------
     C                     MOVELCMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     EXSR #SET
     C                     MOVE '02'      W@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #CHK1     BEGSR
      *-----------------------------------------------------
     C                     SETOF                     6199
      *
     C           KEY1      CHAINFCQPL31              90
     C           *IN90     IFEQ *ON
     C                     SETON                     6199
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #SET      BEGSR
      *-----------------------------------------------------
      * UNIT PRICE
      *
     C                     Z-ADD*ZERO     D@UPRC
     C                     Z-ADD*ZERO     D@VALD
     C           K#ECQ     SETGTECQPP01
     C           *IN20     DOUEQ*ON
     C           K#ECQ     REDPEECQPP01                  20
     C           *IN20     IFEQ *OFF
     C           ECVALD    ANDLE*DATE
     C                     Z-ADDECUPRC    D@UPRC
     C                     Z-ADDECVALD    D@VALD
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   2ND SCREEN
      *------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVELCMD,2     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP02
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C           *INKL     WHEQ *ON
     C                     MOVEL'01'      W@ID
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD
     C                     MOVEL'01'      W@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #CHK2     BEGSR
      *-----------------------------------------------------
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00'      *IN,61
     C                     Z-ADDD@VALD    KYMD
     C           K#AGX     CHAINAGDPL12              96
     C           *IN96     IFEQ *ON
     C                     SETON                     6199
     C                     ENDIF
      *
     C           D@UPRC    IFEQ *ZERO
     C                     SETON                     6299
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #UPD      BEGSR
      *-----------------------------------------------------
     C           K#ECQX    CHAINECQPP01              96
     C           *IN96     IFEQ *OFF
     C                     Z-ADDD@UPRC    ECUPRC
     C                     Z-ADD*DATE     ECKODT
     C                     TIME           ECKOTM
     C                     MOVEL#USER     ECKOME
     C                     UPDATECQPP011
     C                     ELSE
     C                     CLEARECQPP011
     C                     MOVELD@DIE1    ECKAT1
     C                     MOVELD@DIE2    ECKAT2
     C                     MOVELD@DIE3    ECKAT3
     C                     Z-ADDD@UPRC    ECUPRC
     C                     Z-ADDD@VALD    ECVALD
     C                     Z-ADD*DATE     ECKODT
     C                     TIME           ECKOTM
     C                     MOVEL#USER     ECKOME
     C                     WRITEECQPP011
     C                     ENDIF
      *
     C                     ENDSR
** CMD
  F1:END
  F1:END    F5:UPDATE    F12:GO BACK
