     H            Y.
     F** ECSR74 *******************************************
     F*  PRINT DIE STORE LABEL ( TRANSFER DATA CREATE )   *
     F*          2017.08.24  ITS.  T.MITSUI               *
     F*****************************************************
     F*          FILE DEFINITION                          *
     F*****************************************************
     F*==< DIE STORE LABEL ISSUE DATA >==*
     FECSWP73 IF  E                    DISK
     F*
     F*==< TRANSFER DATA >==*
     FECSWP74 O   F     256            DISK
     F*
     E*****************************************************
     F*          ARRAY DEFINITION                         *
     E*****************************************************
     E*
     E*
     I*****************************************************
     I*          DATA STRUCTURE                           *
     I*****************************************************
     I*==< SYSTEM INFORMATION >==*
     I           SDS
     I                                     *PROGRAM @@PGID
     I                                      244 253 @@WSID
     I                                      254 263 @@USID
     I                                      264 269 @@JBNO
     I*
     I            DS
     I                                        1  11 W0KATA
     I                                        1   2 W0KAT1
     I                                        3   3 HIHN1
     I                                        4   7 W0KAT2
     I                                        8   8 HIHN2
     I                                        9   9 W0KAT3
     I                                       10  10 HIHN3
     I                                       11  11 W0KAT4
     I            DS
     I                                        1  10 W0ISHZ
     I                                        1   40W0ISYY
     I                                        5   5 SLA1
     I                                        6   70W0ISMM
     I                                        8   8 SLA2
     I                                        9  100W0ISDD
     I            DS
     I                                        1   60W0ISJK
     I                                        1   20W0ISJJ
     I                                        3   40W0ISFF
     I                                        5   60W0ISBB
     I            DS
     I                                        1   8 WWISJK
     I                                        1   20WWISJJ
     I                                        3   3 COL1
     I                                        4   50WWISFF
     I                                        6   6 COL2
     I                                        7   80WWISBB
     I            DS
     I                                        1  15 W0BAR@
     I                                        1  14 W0BA14
     C*****************************************************
     C*          PARAMETERS LIST                          *
     C*****************************************************
     C*
     C*
     C*****************************************************
     C*          LEY LIST                                 *
     C*****************************************************
     C*
     C*
     C*****************************************************
     C*          INTERNAL WORKING ITEM                    *
     C*****************************************************
     C*
     C*
     C*****************************************************
     C*          MAIN ROUTINE                             *
     C*****************************************************
     C*                    ____________
     C           1         SETLLECSWP73
     C                     READ ECSWP73                  91
     C*                    ~~~~~~~~~~~~
D----C           *IN91     DOWEQ'0'
|    C*
|    C                     MOVEL'/'       SLA1
|    C                     MOVEL'/'       SLA2
|    C                     MOVEL'-'       HIHN1
|    C                     MOVEL'-'       HIHN2
|    C                     MOVEL'-'       HIHN3
|    C           W0KAT4    IFEQ ' '
|    C                     MOVEL' '       HIHN3
|    C                     END
|    C           W0KAT3    IFEQ ' '
|    C                     MOVEL' '       HIHN2
|    C                     END
|    C*
|    C                     Z-ADDW0ISJJ    WWISJJ
|    C                     Z-ADDW0ISFF    WWISFF
|    C                     Z-ADDW0ISBB    WWISBB
|    C                     MOVEL':'       COL1
|    C                     MOVEL':'       COL2
|    C*                    ____________
|    C                     EXCPTW74REC
|    C                     READ ECSWP73                  91
|    C*                    ~~~~~~~~~~~~
E----C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     O*###################################################*
     O*#   TRANSFER DATA                                 #*
     O*###################################################*
     OECSWP74 E                W74REC
     O*
     O                         W0KATA    11
     O                         W0ISHZ    21
     O                         WWISJK    29
     O                         W0BA14    43
     O                         W0LOC1    44
     O                         W0LOC2    46
     O                         W0LOC3    48
     O                         W0LOC4    49
     O*
