     H            Y.
     F** ECSR01 **********************************
     F*  ..INPUTTING OUTGOING DATA OF DIE..      *
     F*  PROGRAM ID.    :  ECSR01.      <RPG>    *
     F*  CREATE DATE.   :  FEB.07,'90.           *
     F*  AUTHOR.        :  E.KAWASHIMA           *
     F*
     F*  MODIFICATION
     F*     AUG/30/02   TCH
     F*     SEP/08/03   TCH
TCHK1F*     DEC/08/05   TCHK1
@@@@1F*     SEP/09/06   A.IDOTA
     F********************************** ECSR01 **
     FECSPW01 CF  E                    WORKSTN
     FECSPL01 UF  E           K        DISK                      A
     FECSPL04 IF  E           K        DISK
     FECSPL05 IF  E           K        DISK
     FECSPL08 IF  E           K        DISK
     FECQPPNO UF  F      10            DISK
     FFCQPL31 IF  E           K        DISK
     FMFAPL22 IF  E           K        DISK
     FMFAPL26 IF  E           K        DISK
     F**GCQTL13 IF  E           K        DISK
     FGCQPL12 IF  E           K        DISK
     FGHCTL22 IF  E           K        DISK
     FECSPL10 UF  E           K        DISK
     E                    HOP         7  1               d[ｰ hﾎﾞ]
     E                    HKO         7  1               ﾃcﾆ]hﾎﾞ]  s]ﾃc
     E                    HK1         7  2               ﾆ]fjﾌﾞ]  s]ﾃc
     E                    HK2         7  4               ﾆ]fjﾌﾞ]  s]ﾃc
     E                    HK3         7  1               ﾆ]fjﾌﾞ]  s]ﾃc
     E                    HKS         7  3 0             ﾃﾇc s]ﾃc
     E                    HKN         7  3               gﾌﾞ]  s]ﾃc
     E                    HED         7  1               gﾌﾞ] djﾞﾌﾞ]
     E                    HHS         7  1               ﾌ]ﾆﾞｭcgｭc  s]ﾃc
     E                    HHY         7  1               kｬczg]hﾎﾞ]  s]ﾃc
     E                    HRC         7 10 0             ﾛﾃｰnﾞNO. s]ﾃc
     E                    HYO         7  8 0             ﾆﾑcﾍﾞ
     E                    HKA         7  1               f s]ﾃc
     E                    HRI         7  1               ffﾒ s]ﾃc
     E                    TOP         7  1               d[ｰ hﾎﾞ]
     E                    TK1         7  2               ﾆ]fjﾌﾞ]  lbf
     E                    TK2         7  4               ﾆ]fjﾌﾞ]  lbf
     E                    TK3         7  1               ﾆ]fjﾌﾞ]  lbf
     E                    WTK1        7  2               ﾆ]fjﾌﾞ]  lbf
     E                    WTK2        7  4               ﾆ]fjﾌﾞ]  lbf
     E                    WTK3        7  1               ﾆ]fjﾌﾞ]  lbf
     E                    TKS         7  3 0             ﾃﾇc lbf
     E                    TKN         7  3               gﾌﾞ]  lbf
     E                    TED         7  1               gﾌﾞ]  djﾞﾌﾞ]
     E                    THS         7  1               ﾌ]ﾆﾞｭcgｭc  lbf
     E                    THY         7  1               kｬczg]hﾎﾞ]  lbf
     E                    CK1         7  2               ﾆ]fjﾌﾞ]mﾞ mﾞｰjCHK
     E                    XTK         7  1               ﾃcﾆﾞｭcﾃｰnﾞ kｩｮh
     E                    TKOJ    1   1  4 0 TKJN   10   ﾃcﾆﾞｭcxb
     E                    ER      1  28 60               d[ｰ xｮﾈｰﾆﾞ
     E                    ERX     1   4 60               d[ｰ xｮﾈｰﾆﾞ
     IMFAPL261
     I              M@SKJY                          @SKJY
     I              M@SKYY                          @SKYY
     I              M@SKMM                          @SKMM
     I              M@SKDD                          @SKDD
     I              M@BUKA                          @BUKA
     I              M@KAKA                          @KAKA
     I              M@KOTE                          @KOTE
     I              M@KGUN                          @KGUN
     I              M@QCS1                          @COS1
     I              M@QCS2                          @COS2
     I              M@QCS3                          @COS3
     I              M@QKGN                          @QKGN
     I              M@QBKA                          @QBKA
     I              M@QKAK                          @QKAK
     IECQPPNO AA  98
     I                                        1  100DRECD
     I            DS
     I                                        1   7 HOP
     I                                        1   1 HOP1
     I                                        2   2 HOP2
     I                                        3   3 HOP3
     I                                        4   4 HOP4
     I                                        5   5 HOP5
     I                                        6   6 HOP6
     I                                        7   7 HOP7
     I            DS
     I                                        1   7 HKO
     I                                        1   1 HKO1
     I                                        2   2 HKO2
     I                                        3   3 HKO3
     I                                        4   4 HKO4
     I                                        5   5 HKO5
     I                                        6   6 HKO6
     I                                        7   7 HKO7
     I            DS
     I                                        1  14 HK1
     I                                        1   2 HK11
     I                                        3   4 HK12
     I                                        5   6 HK13
     I                                        7   8 HK14
     I                                        9  10 HK15
     I                                       11  12 HK16
     I                                       13  14 HK17
     I            DS
     I                                        1  28 HK2
     I                                        1   4 HK21
     I                                        5   8 HK22
     I                                        9  12 HK23
     I                                       13  16 HK24
     I                                       17  20 HK25
     I                                       21  24 HK26
     I                                       25  28 HK27
     I            DS
     I                                        1   7 HK3
     I                                        1   1 HK31
     I                                        2   2 HK32
     I                                        3   3 HK33
     I                                        4   4 HK34
     I                                        5   5 HK35
     I                                        6   6 HK36
     I                                        7   7 HK37
     I            DS
     I                                        1  210HKS
     I                                        1   30HKS1
     I                                        4   60HKS2
     I                                        7   90HKS3
     I                                       10  120HKS4
     I                                       13  150HKS5
     I                                       16  180HKS6
     I                                       19  210HKS7
     I            DS
     I                                        1  21 HKN
     I                                        1   3 HKN1
     I                                        4   6 HKN2
     I                                        7   9 HKN3
     I                                       10  12 HKN4
     I                                       13  15 HKN5
     I                                       16  18 HKN6
     I                                       19  21 HKN7
     I            DS
     I                                        1   7 HED
     I                                        1   1 HED1
     I                                        2   2 HED2
     I                                        3   3 HED3
     I                                        4   4 HED4
     I                                        5   5 HED5
     I                                        6   6 HED6
     I                                        7   7 HED7
     I            DS
     I                                        1   7 HHS
     I                                        1   1 HHS1
     I                                        2   2 HHS2
     I                                        3   3 HHS3
     I                                        4   4 HHS4
     I                                        5   5 HHS5
     I                                        6   6 HHS6
     I                                        7   7 HHS7
     I            DS
     I                                        1   7 HHY
     I                                        1   1 HHY1
     I                                        2   2 HHY2
     I                                        3   3 HHY3
     I                                        4   4 HHY4
     I                                        5   5 HHY5
     I                                        6   6 HHY6
     I                                        7   7 HHY7
     I            DS
     I                                        1  560HYO
     I                                        1   80HYO1
     I                                        9  160HYO2
     I                                       17  240HYO3
     I                                       25  320HYO4
     I                                       33  400HYO5
     I                                       41  480HYO6
     I                                       49  560HYO7
     I            DS
     I                                        1   7 HKA
     I                                        1   1 HKA1
     I                                        2   2 HKA2
     I                                        3   3 HKA3
     I                                        4   4 HKA4
     I                                        5   5 HKA5
     I                                        6   6 HKA6
     I                                        7   7 HKA7
     I            DS
     I                                        1   7 HRI
     I                                        1   1 HRI1
     I                                        2   2 HRI2
     I                                        3   3 HRI3
     I                                        4   4 HRI4
     I                                        5   5 HRI5
     I                                        6   6 HRI6
     I                                        7   7 HRI7
     I            DS
     I                                        1   7 TOP
     I                                        1   1 TOP1
     I                                        2   2 TOP2
     I                                        3   3 TOP3
     I                                        4   4 TOP4
     I                                        5   5 TOP5
     I                                        6   6 TOP6
     I                                        7   7 TOP7
     I            DS
     I                                        1  14 TK1
     I                                        1   2 TK11
     I                                        3   4 TK12
     I                                        5   6 TK13
     I                                        7   8 TK14
     I                                        9  10 TK15
     I                                       11  12 TK16
     I                                       13  14 TK17
     I            DS
     I                                        1  28 TK2
     I                                        1   4 TK21
     I                                        5   8 TK22
     I                                        9  12 TK23
     I                                       13  16 TK24
     I                                       17  20 TK25
     I                                       21  24 TK26
     I                                       25  28 TK27
     I            DS
     I                                        1   7 TK3
     I                                        1   1 TK31
     I                                        2   2 TK32
     I                                        3   3 TK33
     I                                        4   4 TK34
     I                                        5   5 TK35
     I                                        6   6 TK36
     I                                        7   7 TK37
     I            DS
     I                                        1  210TKS
     I                                        1   30TKS1
     I                                        4   60TKS2
     I                                        7   90TKS3
     I                                       10  120TKS4
     I                                       13  150TKS5
     I                                       16  180TKS6
     I                                       19  210TKS7
     I            DS
     I                                        1  21 TKN
     I                                        1   3 TKN1
     I                                        4   6 TKN2
     I                                        7   9 TKN3
     I                                       10  12 TKN4
     I                                       13  15 TKN5
     I                                       16  18 TKN6
     I                                       19  21 TKN7
     I            DS
     I                                        1   7 TED
     I                                        1   1 TED1
     I                                        2   2 TED2
     I                                        3   3 TED3
     I                                        4   4 TED4
     I                                        5   5 TED5
     I                                        6   6 TED6
     I                                        7   7 TED7
     I            DS
     I                                        1   7 THS
     I                                        1   1 THS1
     I                                        2   2 THS2
     I                                        3   3 THS3
     I                                        4   4 THS4
     I                                        5   5 THS5
     I                                        6   6 THS6
     I                                        7   7 THS7
     I            DS
     I                                        1   7 THY
     I                                        1   1 THY1
     I                                        2   2 THY2
     I                                        3   3 THY3
     I                                        4   4 THY4
     I                                        5   5 THY5
     I                                        6   6 THY6
     I                                        7   7 THY7
     I            DS
     I                                        1   80IYOHZ
     I                                        1   20IYOMM
     I                                        3   40IYODD
     I                                        5   80IYOYY
     I            DS
     I                                        1   80WWHZ
     I                                        1   20WWMM
     I                                        3   40WWDD
     I                                        5   80WWYY
     I            DS
     I                                        1   80WWWHZ
     I                                        1   20WWWMM
     I                                        3   40WWWDD
     I                                        5   80WWWYY
     I            DS
     I                                        1   80KYOHZ
     I                                        1   20KYOMM
     I                                        3   40KYODD
     I                                        5   80KYOYY
     I            DS
     I                                        1   7 IKATA
     I                                        1   2 IKAT1
     I                                        3   6 IKAT2
     I                                        7   7 IKAT3
     I            DS
     I                                        1  19 WKEY
     I                                        1  12 WKE
     I                                        9  19 WKE1
     I                                        1   80WYOHZ
     I                                        1   40WYOYY
     I                                        5   60WYOMM
     I                                        7   80WYODD
     I                                        9  120WBMON
     I                                       13  19 WKATA
     I                                       13  14 WKAT1
     I                                       15  18 WKAT2
     I                                       19  19 WKAT3
     I            DS
     I                                        1  19 MKEY
     I                                        1  12 MKE
     I                                        9  19 MKE1
     I                                        1   80EQYOHZ
     I                                        1   40EQYOYY
     I                                        5   60EQYOMM
     I                                        7   80EQYODD
     I                                        9  120EQBMON
     I                                       13  19 EQKATA
     I                                       13  14 EQKAT1
     I                                       15  18 EQKAT2
     I                                       19  19 EQKAT3
     I            DS
     I                                        1   80@QYOHZ
     I                                        1   20@QYOMM
     I                                        3   40@QYODD
     I                                        5   80@QYOYY
     I            DS
     I                                        1   80EQSKHZ
     I                                        1   40EQSKYY
     I                                        5   60EQSKMM
     I                                        7   80EQSKDD
     I            DS
     I                                        1   80EQKOHZ
     I                                        1   40EQKOYY
     I                                        5   60EQKOMM
     I                                        7   80EQKODD
     I            DS
     I                                        1   60WTIME
     I                                        1   20EQKOHH
     I                                        3   40EQKOSS
     I            DS
     I                                        1   80M8SKHZ
     I                                        1   40M8SKYY
     I                                        5   60M8SKMM
     I                                        7   80M8SKDD
     I            DS
     I                                        1   9 IKTNM
     I                                        1   2 IKTN1
     I                                        3   3 H1
     I                                        4   7 IKTN2
     I                                        8   8 H2
     I                                        9   9 IKTN3
     I            DS
     I                                        1   3 WKIGN
     I                                        1   1 WKG
     I            DS
     I                                        1   80M@SKHZ
     I                                        1   40M@SKYY
     I                                        5   60M@SKMM
     I                                        7   80M@SKDD
     I            DS
     I                                        1   80@SKHZ
     I                                        1   40@SKYY
     I                                        5   60@SKMM
     I                                        7   80@SKDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C           KEY       KLIST
     C                     KFLD           IKAT1
     C                     KFLD           IKAT2
      *
     C           KEY2      KLIST
     C                     KFLD           WKAT1
     C                     KFLD           WKAT2
      *
     C           KEY4      KLIST
     C                     KFLD           IBMON
      *
     C           KEY5      KLIST
     C                     KFLD           IBMON
     C                     KFLD           IKAT1
     C                     KFLD           IKAT2
     C                     KFLD           IKAT3
      *
     C           KEY6      KLIST
     C                     KFLD           WBMON
     C                     KFLD           WKAT1
     C                     KFLD           WKAT2
     C                     KFLD           WKAT3
     C                     KFLD           WRECD
      *
     C           KEY7      KLIST
     C                     KFLD           WKAT1
     C                     KFLD           WKAT2
      *
     C           KEY8      KLIST
     C                     KFLD           EQBMON
     C                     KFLD           WKN
     C                     KFLD           WED
     C           KEY8X     KLIST
     C                     KFLD           EQBMON
      *
     C           KEY9      KLIST
     C                     KFLD           IBMON
     C                     KFLD           WKN
     C                     KFLD           WED
     C           KEY9X     KLIST
     C                     KFLD           IBMON
     C                     KFLD           WKN
     C           K#ECS5    KLIST
TCHK1C*                    KFLD           WKAT1
TCHK1C*                    KFLD           WKAT2
TCHK1C*                    KFLD           WKAT3
TCHK1C                     KFLD           IKAT1
TCHK1C                     KFLD           IKAT2
TCHK1C                     KFLD           IKAT3
     C                     KFLD           IYOYY
     C                     KFLD           IYOMM
     C                     KFLD           IYODD
     C           K#ECS8    KLIST
     C                     KFLD           IYOYY
     C                     KFLD           IYOMM
     C                     KFLD           IYODD
      *
     C           K#ECS     KLIST
     C                     KFLD           EQKAT1
     C                     KFLD           EQKAT2
     C                     KFLD           EQKAT3
     C           K#GHC     KLIST
     C                     KFLD           K@BMN   40
     C                     KFLD           K@MCN   3
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     PARM           WS     10
     C                     MOVELWS        KIBN    1
B1   C           KIBN      IFEQ 'T'
     C                     SETON                     79
E1   C                     END
      *
     C                     Z-ADD0111      K@BMN
     C                     MOVE '-'       H1
     C                     MOVE '-'       H2
     C                     Z-ADD0         IYOHZ
     C                     Z-ADD0         IBMON
     C                     Z-ADD0         WWWHZ
     C                     Z-ADD0         EQBMON
      *
     C*--------------------*
     C*    ..SCREEN 1..    *
     C*--------------------*
     C           STP1      TAG
     C                     EXFMTECSPW011
     C                     MOVEA'0'       *IN,01
     C                     MOVEA'00000000'*IN,80
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    MSGX
      *
 B1  C           *INKA     IFEQ '1'
     C                     SETON                     LR
 E1  C                     RETRN
     C                     END
      *
     C                     Z-ADD0         IYOHZ
     C                     Z-ADD0         IBMON
     C                     MOVE *BLANK    IKATA
     C                     Z-ADD0         WWWHZ
     C                     Z-ADD0         EQBMON
      *
     C*--------------------*
     C* ..UPDATE SECTION ..*
     C*--------------------*
 B1  C           IKUBN     IFNE '1'
     C           IKUBN     ANDNE'2'
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
 E1  C                     END
      *
     C*--------------------*
     C*    ..SCREEN 2..    *
     C*--------------------*
B1   C           IKUBN     IFEQ '1'
     C           STP2      TAG
     C                     EXFMTECSPW012
     C                     MOVEA'00000'   *IN,02
     C                     MOVEA'00000000'*IN,80
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    MSGX
     C                     MOVE *BLANK    WTK1
     C                     MOVE *BLANK    WTK2
     C                     MOVE *BLANK    WTK3
      *
B2   C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
E2   C                     END
      *
B2   C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    IKUBN
     C                     GOTO STP1
 E2  C                     END
      *
     C*------------------*
     C*    ..USE DAY..   *
     C*------------------*
     C                     Z-ADDIYOHZ     WWHZ
 B2  C           IYOHZ     IFNE 0
 B3  C           WWYY      IFGE 1988
     C           WWMM      ANDGE01
     C           WWMM      ANDLE12
     C           WWDD      ANDGE01
     C           WWDD      ANDLE31
 X3  C                     ELSE
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     GOTO STP2
E3   C                     END
E2   C                     END
      *
     C*----------------------*
     C*   ..FACTORY CODE..   *
     C*----------------------*
B2   C           IBMON     IFNE 0111
     C                     SETON                     0399
     C                     MOVE ER,4      MSG
     C                     GOTO STP2
E2   C                     END
      *
     C*--------------------------*
     C*    ..DIE SPEC M/F ..     *
     C*--------------------------*
B2   C           IKATA     IFNE *BLANK
     C                     SETOF                     90
     C           KEY       CHAINFCQPL311             90
@@@@1C***        *IN90     IFEQ '0'
@@@@1C***        Q4SKJY    ANDEQ'D'
@@@@1C***        Q4SKHZ    ANDLE*DATE
@@@@1C***                  SETON                     90
@@@@1C***                  END
B3   C           *IN90     IFEQ '1'
     C                     SETON                     0499
     C                     MOVE ER,6      MSG
     C                     GOTO STP2
E3   C                     END
E2   C                     END
      *
     C*------------------------*
     C*   ..USE DAY DIE NO..   *
     C*------------------------*
B2   C           IYOHZ     IFEQ 0
     C           IKATA     ANDEQ*BLANK
     C                     SETON                     020499
     C                     MOVE ER,2      MSG
     C                     GOTO STP2
E2   C                     END
      *
     C           STP9      TAG
     C                     Z-ADD1         A       20
     C                     MOVE *BLANK    HOP
     C                     MOVE *BLANK    HKO
     C                     MOVE *BLANK    HK1
     C                     MOVE *BLANK    HK2
     C                     MOVE *BLANK    HK3
     C                     Z-ADD0         HKS
     C                     MOVE *BLANK    HKN
     C                     MOVE *BLANK    HED
     C                     MOVE *BLANK    HHS
     C                     MOVE *BLANK    HHY
     C                     Z-ADD0         HRC
     C                     Z-ADD0         HYO
     C                     MOVE *BLANK    CK1
     C                     MOVE *BLANK    HKA
     C                     MOVE *BLANK    HRI
      *
     C*----------------------*
     C*    ..DATA LOKUP..    *
     C*----------------------*
B2   C           IYOHZ     IFEQ 0
     C           KEY5      SETLLECQPL041
X2   C                     ELSE
 B3  C           IKATA     IFNE *BLANK
     C           K#ECS5    SETLLECSPL05
 X3  C                     ELSE
     C           K#ECS8    SETLLECSPL08
 E3  C                     END
 E2  C                     END
      *
 B2  C           1         DO   7         A
     C           STP3      TAG
     C                     SETOF                     90
 B3  C           IYOHZ     IFEQ 0
     C           KEY5      READEECQPL041                 90
     C                     ELSE
 B4  C           IKATA     IFNE *BLANK
     C           K#ECS5    READEECSPL05                  90
     C******     KEY5      READEECQPL041                 90
     C                     ELSE
     C           K#ECS8    READEECSPL08                  90
     C*****      KEY4      READEECQPL041                 90
 E4  C                     END
 E3  C                     END
      *
 B3  C           *IN90     IFEQ '0'
 B4  C           EQSKJY    IFEQ 'D'
     C           EQSKHZ    ANDLE*DATE
     C                     GOTO STP3
 E4  C                     END
 B4  C           IYOHZ     IFNE 0
 B5  C           EQYOHZ    IFLT IYOHZ
     C                     GOTO STP3
 E5  C                     END
 E4  C                     END
      *
     C                     MOVE *BLANK    HOP,A
     C                     MOVE EQKAT1    HK1,A
     C                     MOVE EQKAT2    HK2,A
     C                     MOVE EQKAT3    HK3,A
     C                     Z-ADDEQKOSU    HKS,A
     C                     MOVE EQKINO    HKN,A
     C                     MOVE EQEDNO    HED,A
     C                     MOVE EQHSON    HHS,A
     C                     MOVE EQHYKB    HHY,A
     C                     Z-ADDEQRECD    HRC,A
     C                     Z-ADDEQYOYY    KYOYY
     C                     Z-ADDEQYOMM    KYOMM
     C                     Z-ADDEQYODD    KYODD
     C                     Z-ADDKYOHZ     HYO,A
     C                     MOVE EQKAT1    CK1,A
     C   70                MOVE EQBUKA    HKA,A
     C   70                MOVE EQBURI    HRI,A
E3   C                     END
E2   C  N90                END
      *
B2   C           HK1,1     IFEQ *BLANK
     C                     SETON                     020304
     C                     SETON                     99
     C                     MOVE ER,7      MSG
     C                     GOTO STP2
E2   C                     END
      *
     C                     MOVE IKAT1     IKTN1
     C                     MOVE IKAT2     IKTN2
     C                     MOVE IKAT3     IKTN3
      *
     C*-----------------------*
     C*..FACTORY NAME SELECT..*
     C*-----------------------*
     C                     SETOF                     90
     C                     Z-ADD1         A
     C                     MOVE *BLANK    ISMEI
     C           IBMON     LOKUPTKOJ,A                   90
B2   C           *IN90     IFEQ '1'
     C                     MOVE TKJN,A    ISMEI
E2   C                     END
      *
     C*--------------------*
     C*    ..SCREEN 3..    *
     C*--------------------*
     C           STP4      TAG
     C                     EXFMTECSPW013
     C                     MOVEA'0000000' *IN,11
     C                     MOVEA'0000000' *IN,21
     C                     MOVEA'0000000' *IN,31
     C                     MOVEA'0000000' *IN,41
     C                     MOVEA'0000000' *IN,51
     C                     MOVEA'0000000' *IN,61
     C   70                MOVEA'0000000' *IN,71
     C                     MOVEA'00000000'*IN,80
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    MSGX
      *
B2   C           *INKC     IFEQ '1'
     C                     Z-ADD0         IYOHZ
     C                     Z-ADD0         IBMON
     C                     MOVE *BLANK    IKATA
     C                     GOTO STP2
E2   C                     END
      *
     C                     Z-ADD1         A
     C                     Z-ADD10        B       20
     C                     Z-ADD20        C       20
     C                     Z-ADD30        D       20
     C                     Z-ADD40        E       20
     C                     Z-ADD50        F       20
     C                     Z-ADD60        G       20
     C   70                Z-ADD70        H       20
      *
     C*----------------------------------------------------------------*
     C*..WHEN DONE,AN ADDITIONAL PROCESSING IS CHECKED ON THIS SCREEN..*
     C*----------------------------------------------------------------*
B2   C           1         DO   7         A
     C                     ADD  1         B
     C                     ADD  1         C
     C                     ADD  1         D
     C                     ADD  1         E
     C                     ADD  1         F
     C                     ADD  1         G
     C   70                ADD  1         H
B3   C           CK1,A     IFEQ *BLANK
B4   C           HKO,A     IFEQ *BLANK
     C           HK1,A     ANDEQ*BLANK
     C           HK2,A     ANDEQ*BLANK
     C           HK3,A     ANDEQ*BLANK
     C           HKS,A     ANDEQ0
     C           HKN,A     ANDEQ*BLANK
     C           HED,A     ANDEQ*BLANK
     C           HHS,A     ANDEQ*BLANK
     C           HHY,A     ANDEQ*BLANK
     C           HKA,A     ANDEQ*BLANK
     C           HRI,A     ANDEQ*BLANK
     C                     ELSE
     C                     MOVE '1'       *IN,B
     C                     MOVE '1'       *IN,C
     C                     MOVE '1'       *IN,D
     C                     MOVE '1'       *IN,E
     C                     MOVE '1'       *IN,F
     C                     MOVE '1'       *IN,G
     C   70                MOVE '1'       *IN,H
     C                     SETON                     99
     C                     MOVE ER,5      MSG
     C                     GOTO STP4
E4   C                     END
E3   C                     END
E2   C                     END
      *
     C                     Z-ADD1         A
     C                     Z-ADD10        B
     C                     Z-ADD20        C
     C                     Z-ADD30        D
     C                     Z-ADD40        E
     C                     Z-ADD50        F
     C                     Z-ADD60        G
     C   70                Z-ADD70        H
      *
B2   C           1         DO   7         A
     C                     ADD  1         B
     C                     ADD  1         C
     C                     ADD  1         D
     C                     ADD  1         E
     C                     ADD  1         F
     C                     ADD  1         G
     C   70                ADD  1         H
      *
     C*------------------*
     C*..UPDATE SECTION..*
     C*------------------*
 B3  C           HKO,A     IFNE *BLANK
 B4  C           HKO,A     IFNE '0'
     C           HKO,A     ANDNE'1'
     C                     MOVE '1'       *IN,B
     C                     SETON                     99
     C                     MOVE ER,8      MSG
     C                     GOTO STP4
 E4  C                     END
      *
     C*--------------*
     C*..NEW DIE NO..*
     C*--------------*
     C                     MOVE HK1,A     WKAT1
     C                     MOVE HK2,A     WKAT2
     C                     MOVE HK3,A     WKAT3
 B4  C           WKATA     IFEQ *BLANK
     C                     MOVE '1'       *IN,C
     C                     SETON                     99
     C                     MOVE ER,9      MSG
     C                     GOTO STP4
 E4  C                     END
      *
     C*----------------*
     C*   ..NUMBER..   *
     C*----------------*
 B4  C           HKS,A     IFEQ 0
     C                     MOVE '1'       *IN,D
     C                     SETON                     99
     C                     MOVE ER,10     MSG
     C                     GOTO STP4
 E4  C                     END
      *
     C*----------------*
     C* ..MACHINE NO.. *
     C*----------------*
 B4  C           HKN,A     IFEQ *BLANK
     C                     MOVE '1'       *IN,E
     C                     SETON                     99
     C                     MOVE ER,11     MSG
     C                     GOTO STP4
 E4  C                     END
      *
      *
     C*----------------------------*
     C* ..FACILITY MANAGEMENT M/F..*
     C*----------------------------*
     C                     MOVE HKN,A     WKN     3
     C                     MOVE HED,A     WED     1
     C                     MOVE *BLANK    WKIGN
     C           KEY9      SETLLMFAPL221
 B4  C                     DO   *HIVAL
     C                     SETOF                     9091
     C           KEY9      READEMFAPL221                 90
 B5  C           *IN90     IFEQ '0'
 B6  C           M@SKJY    IFEQ 'D'
     C           M@SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     9091
     C                     MOVE M@KGUN    WKIGN
E6   C                     END
E5   C                     END
E4   C  N90                END
      *
B4   C           WKIGN     IFEQ *BLANK
     C           KEY9      SETLLMFAPL261
B5   C                     DO   *HIVAL
     C                     SETOF                     9091
     C           KEY9      READEMFAPL261                 90
B6   C           *IN90     IFEQ '0'
B7   C           @SKJY     IFEQ 'D'
     C           @SKHZ     ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     9091
     C                     MOVE @QKGN     WKIGN
E7   C                     END
E6   C                     END
E5   C  N90                END
E4   C                     END
      *
     C           *IN91     IFEQ *OFF
     C           KEY9X     CHAINMFAPL261             90
     C           *IN90     IFEQ *ON
     C                     MOVE HKN,A     K@MCN
     C           K#GHC     CHAINGHCTL22              90
     C           *IN90     IFEQ *ON
     C                     MOVE '1'       *IN,E
     C                     SETON                     99
     C                     MOVE ER,24     MSG
     C                     GOTO STP4
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*------------------------*
     C*   ..BREAK REASONS..    *
     C*------------------------*
B4   C           HHS,A     IFNE *BLANK
B5   C           HHS,A     IFNE '1'
     C           HHS,A     ANDNE'2'
     C           HHS,A     ANDNE'3'
     C           HHS,A     ANDNE'4'
     C           HHS,A     ANDNE'5'
     C           HHS,A     ANDNE'6'
     C           HHS,A     ANDNE'7'
     C           HHS,A     ANDNE'8'
     C           HHS,A     ANDNE'9'
     C           HHS,A     ANDNE'S'
     C                     MOVE '1'       *IN,F
     C                     SETON                     99
     C                     MOVE ER,13     MSG
     C                     GOTO STP4
 E5  C                     END
 E4  C                     END
      *
     C*----------------------*
     C*   ..DAY OR NIGHT..   *
     C*----------------------*
 B4  C           HHY,A     IFNE *BLANK
 B5  C           HHY,A     IFNE '0'
     C           HHY,A     ANDNE'1'
     C                     MOVE '1'       *IN,G
     C                     SETON                     99
     C                     MOVE ER,14     MSG
     C                     GOTO STP4
 E5  C                     END
 E4  C                     END
      *
     C*-----------------------*
     C*   ..CHEK ..   *
     C*-----------------------*
B4   C           *IN,70    IFEQ '1'
B5   C           HKA,A     IFEQ *BLANK
     C           HRI,A     OREQ *BLANK
     C                     MOVE '1'       *IN,H
     C                     SETON                     99
     C                     MOVE ER,23     MSG
     C                     GOTO STP4
E5   C                     END
E4   C                     END
     C*--------------------------*
     C*    ..DIE SPEC M/F ..     *
     C*--------------------------*
B4   C           WTK1,A    IFEQ HK1,A
     C           WTK2,A    ANDEQHK2,A
     C           WTK3,A    ANDEQHK3,A
     C                     ELSE
     C                     MOVE *BLANK    HOP,A
E4   C                     END
      *
     C                     SETOF                     90
     C                     MOVE *BLANK    @SIY    1
     C           KEY2      CHAINFCQPL311             90
@@@@1C***        *IN90     IFEQ '0'
@@@@1C***        Q4SKJY    ANDEQ'D'
@@@@1C***        Q4SKHZ    ANDLE*DATE
@@@@1C***                  SETON                     90
@@@@1C***                  END
B4   C           *IN90     IFEQ '0'
     C                     MOVEL'Y'       @SIY
E4   C                     END
      *
     C*-------------------------*
     C*   ..FACTRY CD CHECK..   *
     C*-------------------------*
      *
     C*******              MOVE *BLANK    ZTKR1   1
 B4  C*******    EQBMON    IFEQ 0111
     C                     MOVE '6'       ZTKR1   1
 E4  C******               END
      *
     C                     Z-ADD0         L       10
     C                     MOVE *BLANK    XTK
     C                     MOVE *BLANK    @TKR    1
     C*******    KEY7      SETLLGCQTL131
     C           KEY7      SETLLGCQPL121
 B4  C                     DO   *HIVAL
     C                     SETOF                     90
     C****       KEY7      READEGCQTL131                 90
     C           KEY7      READEGCQPL121                 90
 B5  C           *IN90     IFEQ '0'
 B6  C           T6SKJY    IFEQ 'D'
     C           T6SKHZ    ANDLE*DATE
     C                     ELSE
     C                     SETOF                     92
     C           T6TKR1    LOKUPXTK                      92
 B7  C           *IN92     IFEQ '0'
     C                     ADD  1         L
     C                     MOVE T6TKR1    XTK,L
 E7  C                     END
 E6  C                     END
 E5  C                     END
 E4  C  N90                END
      *
     C                     SETOF                     90
     C           ZTKR1     LOKUPXTK                      90
 B4  C           *IN90     IFEQ '1'
     C                     MOVE 'Y'       @TKR
 E4  C                     END
      *
 B4  C           HOP,A     IFNE '0'
 B5  C           @SIY      IFEQ *BLANK
 B6  C           @TKR      IFNE *BLANK
     C                     MOVE '1'       *IN,C
     C                     SETON                     99
     C                     MOVE ER,19     MSG
     C                     MOVE ERX,3     MSGX
     C           C         ADD  60        P       20
     C                     MOVE '1'       *IN,P
     C                     MOVE HK1,A     WTK1,A
     C                     MOVE HK2,A     WTK2,A
     C                     MOVE HK3,A     WTK3,A
     C                     GOTO STP4
E6   C                     END
E5   C                     END
E4   C                     END
      *
B4   C           @SIY      IFEQ *BLANK
     C*******    @TKR      ANDEQ*BLANK
     C           @TKR      OREQ *BLANK
     C                     MOVE '1'       *IN,C
     C                     SETON                     99
     C                     MOVE ER,27     MSG
     C                     MOVE ERX,4     MSGX
     C                     GOTO STP4
 E4  C                     END
      *
     C                     MOVE HK1,A     WTK1,A
     C                     MOVE HK2,A     WTK2,A
     C                     MOVE HK3,A     WTK3,A
 E3  C                     END
 E2  C                     END
      *
     C*--------------------------*
     C*..DATA CHANGE EXISTENCE.. *
     C*--------------------------*
     C                     Z-ADD1         A
 B2  C           1         DO   7         A
     C                     SETOF                     90
 B3  C           HKO,A     IFNE *BLANK
     C                     SETON                     90
 E3  C                     END
 E2  C  N90                END
      *
 B2  C           *INKE     IFEQ '1'
      *
 B3  C           *IN90     IFEQ '0'
     C                     SETON                     99
     C                     MOVE ER,15     MSG
     C                     GOTO STP4
 E3  C                     END
      *
     C                     SETOF                     91
     C                     Z-ADD1         A
 B3  C           1         DO   7         A
 B4  C           HKO,A     IFNE *BLANK
      *
     C*------------------------*
     C*  ..DIE OUTGOING DATA.. *
     C*------------------------*
     C                     SETOF                     90
     C           HRC,A     CHAINECQPL011             90
 B5  C           *IN90     IFEQ '0'
      ** CHANGE
 B6  C           HKO,A     IFEQ '1'
      *
     C*----------------------------*
     C* ..FACILITY MANAGEMENT M/F..*
     C*----------------------------*
     C                     MOVE *BLANK    SW      1
     C                     MOVE HKN,A     WKN
     C                     MOVE HED,A     WED
     C           KEY9      SETLLMFAPL221
B7   C                     DO   *HIVAL
     C                     SETOF                     90
     C           KEY9      READEMFAPL221                 90
B8   C           *IN90     IFEQ '0'
B9   C           M@SKJY    IFEQ 'D'
     C           M@SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     90
 B10 C           *IN,70    IFEQ '0'
     C                     MOVE M@BUKA    EQBUKA
     C                     MOVE M@KAKA    EQBURI
 E10 C                     END
     C                     MOVE M@KOTE    EQKTEI
     C                     MOVE M@KGUN    EQGRUP
     C                     MOVEL'*'       SW
 E9  C                     END
 E8  C                     END
 E7  C  N90                END
      *
B7   C           SW        IFEQ *BLANK
     C           KEY9      SETLLMFAPL261
B8   C                     DO   *HIVAL
     C                     SETOF                     90
     C           KEY9      READEMFAPL261                 90
B9   C           *IN90     IFEQ '0'
B10  C           @SKJY     IFEQ 'D'
     C           @SKHZ     ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     90
B11  C           *IN,70    IFEQ '0'
     C                     MOVE @QBKA     EQBUKA
     C                     MOVE @QKAK     EQBURI
 E11 C                     END
     C                     MOVE @KOTE     EQKTEI
     C                     MOVE @QKGN     EQGRUP
 E10 C                     END
 E9  C                     END
 E8  C  N90                END
      *
 E7  C                     END
      *
 B7  C           *IN,70    IFEQ '1'
     C                     MOVE HKA,A     EQBUKA
     C                     MOVE HRI,A     EQBURI
 E7  C                     END
      ** PREVIOUS VALUE
     C           HKS,A     SUB  EQKOSU    @@BAL   30
TCHK1C*                    Z-ADDEQKOSU    @@PRV   30
      **
     C                     MOVE HK1,A     EQKAT1
     C                     MOVE HK2,A     EQKAT2
     C                     MOVE HK3,A     EQKAT3
     C                     Z-ADDHKS,A     EQKOSU
     C                     MOVE HKN,A     EQKINO
     C                     MOVE HED,A     EQEDNO
     C                     MOVE HHS,A     EQHSON
     C                     MOVE HHY,A     EQHYKB
     C                     MOVE *BLANK    EQSKJY
     C                     Z-ADD0         EQSKHZ
      ** CANCEL
 X6  C                     ELSE
      *
TCHK1C                     Z-ADDEQKOSU    @@PRV   30
     C                     SETON                     91
     C                     MOVE 'D'       EQSKJY
     C                     Z-ADD*DATE     EQSKHZ
 E6  C                     END
     C                     Z-ADD*DATE     EQKOHZ
     C                     TIME           WTIME
     C                     MOVELUS        EQKOME
 B6  C           HOP,A     IFNE '1'
     C                     UPDATECQPL011
 E6  C                     END
      * INVENTORY FILE
     C           K#ECS     CHAINECSPL10              95
     C           *IN95     IFEQ *OFF
 B6  C           HKO,A     IFEQ '1'
     C                     SUB  @@BAL     E1SQTY
     C                     ELSE
     C                     ADD  @@PRV     E1SQTY
     C                     ENDIF
      *
     C                     Z-ADD*DATE     E1KDAT
     C                     TIME           E1KTIM
     C                     MOVEL#USER     E1KOME
     C                     MOVEL#PGM      E1KPGM
     C                     Z-ADD*DATE     E1OTDT
     C                     UPDATECSPP101
     C                     ENDIF
      *
 E5  C                     END
 E4  C                     END
 E3  C                     END
      *
     C*--------------------------------------*
     C*  ..SCREEN 2  GO TO RETRIEVE DATA..   *
     C*--------------------------------------*
     C                     MOVE *BLANK    HKO
 B3  C           *IN91     IFEQ '1'
     C                     GOTO STP9
 E3  C                     END
     C                     GOTO STP4
     C                     ELSE
      *
 B3  C           *IN90     IFEQ '1'
     C                     SETON                     99
     C                     MOVE ER,16     MSG
     C                     GOTO STP4
 E3  C                     END
 E2  C                     END
      *
     C*-----------------*
     C*   ..ROLL-UP..   *
     C*-----------------*
 B2  C           *IN81     IFEQ '1'
     C                     SETOF                     91
     C                     Z-ADD1         A
     C                     Z-ADD8         B
     C                     Z-ADDIYOHZ     WYOHZ
     C                     Z-ADDIBMON     WBMON
     C                     MOVE HK1,1     WKAT1
     C                     MOVE HK2,1     WKAT2
     C                     MOVE HK3,1     WKAT3
     C                     Z-ADDHRC,1     WRECD  100
      *
     C*----------------------*
     C*   ..RETRIEVE DATA..  *
     C*----------------------*
     C           KEY6      SETLLECQPL041
      *
B3   C           1         DO   7         A
     C           STP5      TAG
B4   C           IYOHZ     IFEQ 0
     C                     SETOF                     90
     C                     READPECQPL041                 90
B5   C           *IN90     IFEQ '1'
     C                     GOTO SP5
E5   C                     END
B5   C           WKE1      IFNE MKE1
     C                     SETON                     90
E5   C                     END
     C                     ELSE
      *
     C                     SETOF                     90
     C                     READPECQPL041                 90
 B5  C           *IN90     IFEQ '1'
     C                     GOTO SP5
 E5  C                     END
 B5  C           IKATA     IFNE *BLANK
 B6  C           WKE1      IFNE MKE1
     C                     SETON                     90
 E6  C                     END
     C                     ELSE
 B6  C           WBMON     IFNE EQBMON
     C                     SETON                     90
 E6  C                     END
 E5  C                     END
 E4  C                     END
      *
 B4  C           *IN90     IFEQ '0'
 B5  C           EQSKJY    IFEQ 'D'
     C           EQSKHZ    ANDLE*DATE
     C                     GOTO STP5
 E5  C                     END
 B5  C           IYOHZ     IFNE 0
 B6  C           EQYOHZ    IFLT IYOHZ
     C                     GOTO STP5
 E6  C                     END
 E5  C                     END
      *
     C                     SETON                     91
     C                     SUB  1         B
 B5  C           B         IFEQ 7
     C                     MOVE *BLANK    HOP
     C                     MOVE *BLANK    HKO
     C                     MOVE *BLANK    HK1
     C                     MOVE *BLANK    HK2
     C                     MOVE *BLANK    HK3
     C                     Z-ADD0         HKS
     C                     MOVE *BLANK    HKN
     C                     MOVE *BLANK    HED
     C                     MOVE *BLANK    HHS
     C                     MOVE *BLANK    HHY
     C                     Z-ADD0         HRC
     C                     Z-ADD0         HYO
     C                     MOVE *BLANK    CK1
     C                     MOVE *BLANK    HKA
     C                     MOVE *BLANK    HRI
E5   C                     END
      *
     C                     MOVE *BLANK    HOP,B
     C                     MOVE EQKAT1    HK1,B
     C                     MOVE EQKAT2    HK2,B
     C                     MOVE EQKAT3    HK3,B
     C                     Z-ADDEQKOSU    HKS,B
     C                     MOVE EQKINO    HKN,B
     C                     MOVE EQEDNO    HED,B
     C                     MOVE EQHSON    HHS,B
     C                     MOVE EQHYKB    HHY,B
     C                     Z-ADDEQRECD    HRC,B
     C                     Z-ADDEQYOYY    @QYOYY
     C                     Z-ADDEQYOMM    @QYOMM
     C                     Z-ADDEQYODD    @QYODD
     C                     Z-ADD@QYOHZ    HYO,B
     C                     MOVE EQKAT1    CK1,B
     C   70                MOVE EQBUKA    HKA,B
     C   70                MOVE EQBURI    HRI,B
     C           SP5       TAG
E4   C                     END
E3   C  N90                END
      *
B3   C           *IN91     IFEQ '0'
     C                     SETON                     99
     C                     MOVE ER,17     MSG
E3   C                     END
     C                     GOTO STP4
E2   C                     END
      *
     C*-----------------*
     C*   ..ROLL-UP..   *
     C*-----------------*
B2   C           HK1,7     IFEQ *BLANK
     C                     SETON                     99
     C                     MOVE ER,18     MSG
     C                     GOTO STP4
E2   C                     END
      *
     C                     SETOF                     91
     C                     Z-ADD1         A
     C                     Z-ADDIYOHZ     WYOHZ
     C                     Z-ADDIBMON     WBMON
     C                     MOVE HK1,7     WKAT1
     C                     MOVE HK2,7     WKAT2
     C                     MOVE HK3,7     WKAT3
     C                     Z-ADDHRC,7     WRECD
      *
     C*----------------------*
     C*   ..RETRIEVE DATA..  *
     C*----------------------*
     C           KEY6      SETGTECQPL041
      *
 B2  C           1         DO   7         A
     C           STP6      TAG
 B3  C           IYOHZ     IFEQ 0
     C                     SETOF                     90
     C                     READ ECQPL041                 90
 B4  C           *IN90     IFEQ '1'
     C                     GOTO SP6
 E4  C                     END
 B4  C           WKE1      IFNE MKE1
     C                     SETON                     90
 E4  C                     END
     C                     ELSE
      *
     C                     SETOF                     90
     C                     READ ECQPL041                 90
 B4  C           *IN90     IFEQ '1'
     C                     GOTO SP6
 E4  C                     END
 B4  C           IKATA     IFNE *BLANK
 B5  C           WKE1      IFNE MKE1
     C                     SETON                     90
 E5  C                     END
 B5  C           WBMON     IFNE EQBMON
     C                     SETON                     90
 E5  C                     END
 E3  C                     END
 E3  C                     END
      *
 B3  C           *IN90     IFEQ '0'
 B4  C           EQSKJY    IFEQ 'D'
     C           EQSKHZ    ANDLE*DATE
     C                     GOTO STP6
 E4  C                     END
 B4  C           IYOHZ     IFNE 0
 B5  C           EQYOHZ    IFLT IYOHZ
     C                     GOTO STP6
 E5  C                     END
 E4  C                     END
      *
     C                     SETON                     91
 B4  C           A         IFEQ 1
     C                     MOVE *BLANK    HOP
     C                     MOVE *BLANK    HKO
     C                     MOVE *BLANK    HK1
     C                     MOVE *BLANK    HK2
     C                     MOVE *BLANK    HK3
     C                     Z-ADD0         HKS
     C                     MOVE *BLANK    HKN
     C                     MOVE *BLANK    HED
     C                     MOVE *BLANK    HHS
     C                     MOVE *BLANK    HHY
     C                     Z-ADD0         HRC
     C                     Z-ADD0         HYO
     C                     MOVE *BLANK    CK1
     C                     MOVE *BLANK    HKA
     C                     MOVE *BLANK    HRI
 E4  C                     END
      *
     C                     MOVE *BLANK    HOP,A
     C                     MOVE EQKAT1    HK1,A
     C                     MOVE EQKAT2    HK2,A
     C                     MOVE EQKAT3    HK3,A
     C                     Z-ADDEQKOSU    HKS,A
     C                     MOVE EQKINO    HKN,A
     C                     MOVE EQEDNO    HED,A
     C                     MOVE EQHSON    HHS,A
     C                     MOVE EQHYKB    HHY,A
     C                     Z-ADDEQRECD    HRC,A
     C                     Z-ADDEQYOYY    @QYOYY
     C                     Z-ADDEQYOMM    @QYOMM
     C                     Z-ADDEQYODD    @QYODD
     C                     Z-ADD@QYOHZ    HYO,A
     C                     MOVE EQKAT1    CK1,A
     C   70                MOVE EQBUKA    HKA,A
     C   70                MOVE EQBURI    HRI,A
     C           SP6       TAG
 E3  C                     END
 E2  C  N90                END
      *
 B2  C           *IN91     IFEQ '0'
     C                     SETON                     99
     C                     MOVE ER,18     MSG
 E2  C                     END
     C                     GOTO STP4
 E1  C                     END
      *
     C*--------------------*
     C*   ..SCREEN 4..     *  << ADD >>
     C*--------------------*
     C           STP7      TAG
     C                     EXFMTECSPW014
     C                     MOVEA'0000'    *IN,02
     C                     MOVEA'00000000'*IN,80
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    MSGX
     C                     MOVE *BLANK    WTK1
     C                     MOVE *BLANK    WTK2
     C                     MOVE *BLANK    WTK3
      *
B1   C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
E1   C                     END
      *
B1   C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    IKUBN
     C                     MOVE *BLANK    EQKA
     C                     MOVE *BLANK    EQRI
     C                     GOTO STP1
E1   C                     END
      *
     C*------------------*
     C*   ..USE DAY..    *
     C*------------------*
B1   C           WWWHZ     IFEQ 0
     C                     SETON                     0299
     C                     MOVE ER,2      MSG
     C                     GOTO STP7
E1   C                     END
      *
B1   C           WWWYY     IFGE 1988
     C           WWWMM     ANDGE01
     C           WWWMM     ANDLE12
     C           WWWDD     ANDGE01
     C           WWWDD     ANDLE31
     C                     ELSE
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     GOTO STP7
 E1  C                     END
      *
     C                     Z-ADDWWWYY     EQYOYY
     C                     Z-ADDWWWMM     EQYOMM
     C                     Z-ADDWWWDD     EQYODD
      *
 B1  C           EQYOHZ    IFGT *DATE
     C                     SETON                     0299
     C                     MOVE ER,28     MSG
     C                     GOTO STP7
E1   C                     END
      *
     C*-----------------*
     C*   ..FACTORY..   *
     C*-----------------*
B1   C           EQBMON    IFNE 0111
     C                     SETON                     0399
     C                     MOVE ER,4      MSG
     C                     GOTO STP7
E1   C                     END
      *
     C*******              MOVE *BLANK    ZTKR1   1
B1   C*******    EQBMON    IFEQ 0111
     C                     MOVE '6'       ZTKR1
E1   C****                 END
      *
     C*-------------------*
     C*..DIVISION CHARGE..*
     C*-------------------*
 B1  C           *IN,70    IFEQ '1'
 B2  C           EQKA      IFEQ *BLANK
     C                     SETON                     0499
     C                     MOVE ER,21     MSG
     C                     GOTO STP7
 E2  C                     END
 B2  C           EQRI      IFEQ *BLANK
     C                     SETON                     0599
     C                     MOVE ER,22     MSG
     C                     GOTO STP7
 E2  C                     END
 E1  C                     END
      *
     C                     MOVE *BLANK    TOP
     C                     MOVE *BLANK    TK1
     C                     MOVE *BLANK    TK2
     C                     MOVE *BLANK    TK3
     C                     Z-ADD0         TKS
     C                     MOVE *BLANK    TKN
     C                     MOVE *BLANK    TED
     C                     MOVE *BLANK    THS
     C                     MOVE *BLANK    THY
      *
     C*-----------------------*
     C*..FACTORY NAME SELECT..*
     C*-----------------------*
     C                     SETOF                     90
     C                     Z-ADD1         A
     C                     MOVE *BLANK    ISMEI
     C           EQBMON    LOKUPTKOJ,A                   90
B1   C           *IN90     IFEQ '1'
     C                     MOVE TKJN,A    ISMEI
E1   C                     END
      *
     C*------------------*
     C*   ..SCREEN 5..   *
     C*------------------*
     C           STP8      TAG
     C                     EXFMTECSPW015
     C                     MOVEA'0000000' *IN,11
     C                     MOVEA'0000000' *IN,21
     C                     MOVEA'0000000' *IN,31
     C                     MOVEA'0000000' *IN,41
     C                     MOVEA'0000000' *IN,51
     C                     MOVEA'0000000' *IN,61
     C                     MOVEA'00000000'*IN,80
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    MSGX
      *
B1   C           *INKC     IFEQ '1'
     C                     Z-ADD0         WWWHZ
     C                     Z-ADD0         EQBMON
     C                     MOVE *BLANK    EQKA
     C                     MOVE *BLANK    EQRI
     C                     GOTO STP7
 E1  C                     END
      *
     C                     Z-ADD1         A
     C                     Z-ADD10        B
     C                     Z-ADD20        C
     C                     Z-ADD30        D
     C                     Z-ADD40        E
     C                     Z-ADD50        F
     C                     Z-ADD60        G
      *
 B1  C           1         DO   7         A
     C                     ADD  1         B
     C                     ADD  1         C
     C                     ADD  1         D
     C                     ADD  1         E
     C                     ADD  1         F
     C                     ADD  1         G
      *
 B2  C           TK1,A     IFEQ *BLANK
     C           TK2,A     ANDEQ*BLANK
     C           TK3,A     ANDEQ*BLANK
     C           TKS,A     ANDEQ0
     C           TKN,A     ANDEQ*BLANK
     C           TED,A     ANDEQ*BLANK
     C           THS,A     ANDEQ*BLANK
     C           THY,A     ANDEQ*BLANK
     C                     ELSE
      *
     C*------------------*
     C*  ..NEW DIE NO..  *
     C*------------------*
     C                     MOVE TK1,A     WKAT1
     C                     MOVE TK2,A     WKAT2
     C                     MOVE TK3,A     WKAT3
B3   C           WKATA     IFEQ *BLANK
     C                     MOVE '1'       *IN,C
     C                     SETON                     99
     C                     MOVE ER,9      MSG
     C                     GOTO STP8
 E3  C                     END
      *
     C*----------------*
     C*   ..NUMBER..   *
     C*----------------*
 B3  C           TKS,A     IFEQ 0
     C                     MOVE '1'       *IN,D
     C                     SETON                     99
     C                     MOVE ER,10     MSG
     C                     GOTO STP8
 E3  C                     END
      *
     C*----------------*
     C* ..MACHINE NO.. *
     C*----------------*
 B3  C           TKN,A     IFEQ *BLANK
     C                     MOVE '1'       *IN,E
     C                     SETON                     99
     C                     MOVE ER,11     MSG
     C                     GOTO STP8
 E3  C                     END
      *
     C*----------------------------*
     C* ..FACILITY MANAGEMENT M/F..*
     C*----------------------------*
     C                     MOVE TKN,A     WKN     3
     C                     MOVE TED,A     WED
     C                     MOVE *BLANK    WKIGN
     C           KEY8      SETLLMFAPL221
B3   C                     DO   *HIVAL
     C                     SETOF                     9091
     C           KEY8      READEMFAPL221                 90
B4   C           *IN90     IFEQ '0'
 B5  C           M@SKJY    IFEQ 'D'
     C           M@SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     9091
     C                     MOVE M@KGUN    WKIGN
 E5  C                     END
 E4  C                     END
 E3  C  N90                END
      *
 B3  C           WKIGN     IFEQ *BLANK
     C           KEY8      SETLLMFAPL261
 B4  C                     DO   *HIVAL
     C                     SETOF                     9091
     C           KEY8      READEMFAPL261                 90
 B5  C           *IN90     IFEQ '0'
 B6  C           @SKJY     IFEQ 'D'
     C           @SKHZ     ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     9091
     C                     MOVE @QKGN     WKIGN
 E6  C                     END
 E5  C                     END
 E4  C  N90                END
 E3  C                     END
      *
     C           *IN91     IFEQ *OFF
     C           KEY8X     CHAINMFAPL261             90
     C           *IN90     IFEQ *ON
     C                     MOVE TKN,A     K@MCN
     C           K#GHC     CHAINGHCTL22              90
     C           *IN90     IFEQ *ON
     C                     MOVE '1'       *IN,E
     C                     SETON                     99
     C                     MOVE ER,24     MSG
     C                     GOTO STP8
 E3  C                     END
 E3  C                     END
 E3  C                     END
     C*------------------------*
     C*   ..BREAK REASONS..    *
     C*------------------------*
 B3  C           THS,A     IFNE *BLANK
 B4  C           THS,A     IFNE '1'
     C           THS,A     ANDNE'2'
     C           THS,A     ANDNE'3'
     C           THS,A     ANDNE'4'
     C           THS,A     ANDNE'5'
     C           THS,A     ANDNE'6'
     C           THS,A     ANDNE'7'
     C           THS,A     ANDNE'8'
     C           THS,A     ANDNE'9'
     C           THS,A     ANDNE'S'
     C                     MOVE '1'       *IN,F
     C                     SETON                     99
     C                     MOVE ER,13     MSG
     C                     GOTO STP8
 E4  C                     END
 E3  C                     END
      *
     C*----------------------*
     C*   ..DAY OR NIGHT..   *
     C*----------------------*
 B3  C           THY,A     IFNE *BLANK
 B4  C           THY,A     IFNE '0'
     C           THY,A     ANDNE'1'
     C                     MOVE '1'       *IN,G
     C                     SETON                     99
     C                     MOVE ER,14     MSG
     C                     GOTO STP8
 E4  C                     END
 E3  C                     END
      *
     C*--------------------------*
     C*   ..DIE SPEC M/F..       *
     C*--------------------------*
 B3  C           WTK1,A    IFEQ TK1,A
     C           WTK2,A    ANDEQTK2,A
     C           WTK3,A    ANDEQTK3,A
     C                     ELSE
     C                     MOVE *BLANK    TOP,A
E3   C                     END
      *
     C                     SETOF                     90
     C                     MOVE *BLANK    @SIY
     C           KEY2      CHAINFCQPL311             90
@@@@1C***        *IN90     IFEQ '0'
@@@@1C***        Q4SKJY    ANDEQ'D'
@@@@1C***        Q4SKHZ    ANDLE*DATE
@@@@1C***                  SETON                     90
@@@@1C***                  END
B3   C           *IN90     IFEQ '0'
     C                     MOVEL'Y'       @SIY
E3   C                     END
      *
     C*---------------*
     C*   ..CHECK..   *
     C*---------------*
     C                     Z-ADD0         L       10
     C                     MOVE *BLANK    XTK
     C                     MOVE *BLANK    @TKR
     C******     KEY7      SETLLGCQTL131
     C           KEY7      SETLLGCQPL121
B3   C                     DO   *HIVAL
     C                     SETOF                     90
     C******     KEY7      READEGCQTL131                 90
     C           KEY7      READEGCQPL121                 90
B4   C           *IN90     IFEQ '0'
B5   C           T6SKJY    IFEQ 'D'
     C           T6SKHZ    ANDLE*DATE
     C                     ELSE
     C                     SETOF                     92
     C           T6TKR1    LOKUPXTK                      92
B6   C           *IN92     IFEQ '0'
     C                     ADD  1         L
     C                     MOVE T6TKR1    XTK,L
E6   C                     END
E5   C                     END
E4   C                     END
E3   C  N90                END
      *
     C                     SETOF                     90
     C           ZTKR1     LOKUPXTK                      90
 B3  C           *IN90     IFEQ '1'
     C                     MOVE 'Y'       @TKR
 E3  C                     END
      *
 B3  C           TOP,A     IFNE '0'
 B4  C           @SIY      IFEQ *BLANK
 B5  C           @TKR      IFNE *BLANK
     C                     MOVE '1'       *IN,C
     C                     SETON                     99
     C                     MOVE ER,19     MSG
     C                     MOVE ERX,3     MSGX
     C           C         ADD  60        P
     C                     MOVE '1'       *IN,P
     C                     MOVE TK1,A     WTK1,A
     C                     MOVE TK2,A     WTK2,A
     C                     MOVE TK3,A     WTK3,A
     C                     GOTO STP8
E5   C                     END
E4   C                     END
E3   C                     END
      *
B3   C           @SIY      IFEQ *BLANK
     C****       @TKR      ANDEQ*BLANK
     C           @TKR      OREQ *BLANK
     C                     MOVE '1'       *IN,C
     C                     SETON                     99
     C                     MOVE ER,27     MSG
     C                     MOVE ERX,4     MSGX
     C                     GOTO STP8
E3   C                     END
      *
     C                     MOVE TK1,A     WTK1,A
     C                     MOVE TK2,A     WTK2,A
     C                     MOVE TK3,A     WTK3,A
 E2  C                     END
E1   C                     END
      *
     C*--------------------------*
     C*..DATA CHANGE EXISTENCE.. *
     C*--------------------------*
     C                     Z-ADD1         A
B1   C           1         DO   7         A
     C                     SETOF                     90
B2   C           TK1,A     IFNE *BLANK
     C                     SETON                     90
E2   C                     END
E1   C  N90                END
      *
B1   C           *INKE     IFEQ '1'
B2   C           *IN90     IFEQ '0'
     C                     SETON                     99
     C                     MOVE ER,15     MSG
     C                     GOTO STP8
E2   C                     END
      *
     C                     Z-ADD1         A
 B2  C           1         DO   7         A
 B3  C           TK1,A     IFNE *BLANK
      *
     C*----------------------------*
     C*..FACILITY MANAGEMENT M/F..*
     C*----------------------------*
     C                     MOVE *BLANK    PSW     1
     C                     MOVE TKN,A     WKN
     C           KEY8      SETLLMFAPL221
 B4  C                     DO   *HIVAL
     C                     SETOF                     90
     C           KEY8      READEMFAPL221                 90
 B5  C           *IN90     IFEQ '0'
 B6  C           M@SKJY    IFEQ 'D'
     C           M@SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     90
 B7  C           *IN,70    IFEQ '0'
     C                     MOVE M@BUKA    EQBUKA
     C                     MOVE M@KAKA    EQBURI
 E7  C                     END
     C                     MOVE M@KOTE    EQKTEI
     C                     MOVE M@KGUN    EQGRUP
     C                     MOVEL'*'       PSW
 E6  C                     END
 E5  C                     END
 E4  C  N90                END
      *
 B4  C           PSW       IFEQ *BLANK
     C           KEY8      SETLLMFAPL261
 B5  C                     DO   *HIVAL
     C                     SETOF                     90
     C           KEY8      READEMFAPL261                 90
 B6  C           *IN90     IFEQ '0'
 B7  C           @SKJY     IFEQ 'D'
     C           @SKHZ     ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     90
 B8  C           *IN,70    IFEQ '0'
     C                     MOVE @QBKA     EQBUKA
     C                     MOVE @QKAK     EQBURI
E8   C                     END
     C                     MOVE @KOTE     EQKTEI
     C                     MOVE @QKGN     EQGRUP
E7   C                     END
E6   C                     END
E5   C  N90                END
E4   C                     END
      *
B4   C           *IN,70    IFEQ '1'
     C                     MOVE EQKA      EQBUKA
     C                     MOVE EQRI      EQBURI
E4   C                     END
B4   C           TOP,A     IFNE '1'
     C                     MOVE TK1,A     EQKAT1
     C                     MOVE TK2,A     EQKAT2
     C                     MOVE TK3,A     EQKAT3
     C                     Z-ADDTKS,A     EQKOSU
     C                     MOVE TKN,A     EQKINO
     C                     MOVE TED,A     EQEDNO
     C                     MOVE THS,A     EQHSON
     C                     MOVE THY,A     EQHYKB
     C                     MOVE *BLANK    EQSKJY
     C                     Z-ADD0         EQSKHZ
     C                     Z-ADD*DATE     EQKOHZ
     C                     TIME           WTIME
     C                     MOVELUS        EQKOME
      *
     C*--------------------------------------*
     C*   ..DIE OUTGOING DATA RECORD FILE..  *
     C*--------------------------------------*
     C                     SETOF                     90
     C           1         CHAINECQPPNO              90
B5   C           *IN90     IFEQ '0'
     C                     ADD  1         DRECD
     C                     Z-ADDDRECD     EQRECD
     C                     EXCPTUP
 E5  C                     END
     C                     WRITEECQPL011
      *
      * INVENTORY FILE
     C           K#ECS     CHAINECSPL10              95
     C           *IN95     IFEQ *OFF
     C                     SUB  TKS,A     E1SQTY
      *
     C                     Z-ADD*DATE     E1KDAT
     C                     TIME           E1KTIM
     C                     MOVEL#USER     E1KOME
     C                     MOVEL#PGM      E1KPGM
     C                     Z-ADD*DATE     E1OTDT
     C                     UPDATECSPP101
     C                     ENDIF
      **
 E4  C                     END
  E3 C                     END
  E2 C                     END
      *
     C                     MOVE *BLANK    TOP
     C                     MOVE *BLANK    TK1
     C                     MOVE *BLANK    TK2
     C                     MOVE *BLANK    TK3
     C                     Z-ADD0         TKS
     C                     MOVE *BLANK    TKN
     C                     MOVE *BLANK    TED
     C                     MOVE *BLANK    THS
     C                     MOVE *BLANK    THY
 E1  C                     END
      *
     C                     GOTO STP8
     OECQPPNO E                UP
     O                         DRECD     10
** TKOJ TKJN
0111 IAF
** ER
E-01 UPDATE SECTION ENTRY 1 OR 2
E-02 DATE OR DIE NO. ENTRY
E-03 DATE ERROR
E-04 FACTORY CODE ERROR
E-05 NO ADDITIONAL ENTRY
E-06 NO DIE NO. IN DIE VERSION MASTER
E-07 NO REFERENCE DATA
E-08 UPDATE SECTION 0 OR 1
E-09 DIE NUMBER ENTRY
E-10 NUMBER ENTRY
E-11 MACHINE NO. ENTRY
E-12 NO MACHINE NO. IN FACILITY MANAAEMENT MASTER
E-13 CLASSIFICATION OF BREAK 1-9 OR S
E-14 SHIFT SECTION 0 OR 1
E-15 NO DATA FOR CHANGE
E-16 CMD-5 PRESS FOR CHANGE DATA
E-17 NO PREVIOUS DATA
E-18 NO FOLLOWING DATA
E-19 DIE NO. OUT OF USE
E-20 Y OR N ENTRY ONLY
E-21 SECTION ENTRY
E-22 TEAM ENTRY
E-23 SECTION AND TEAM ENTRY
E-24 MACHINE NUMBER ERROR.
E-25 MACHINE AND DIE NO.(H.N.R.T.A.W.D) CHANGE IN MASTER
E-26 MISMATCH DIE NO.WITH FACTORY CODE
E-27 DIE NO. OUT OF EXISTENCE
E-28 GREATER DATE
** ERX
 ->  DIE NO. CHECK
 ->  MACHINE NO. CHECK
 ->  '0' PRESS FOR ENTRY WITH ERROR
 ->  DIE NO. CHECK
