     H            Y.
     F** ECSR72 *******************************************
     F*  PRINT DIE STORE LABEL ( INSTRUCTION )            *
     F*          2019.05.15  MAEDA.                       *
     F*****************************************************
     F*          FILE DEFINITION                          *
     F*****************************************************
     F*==< INSTRUCTION SCREEN >==*
     FECSPW72 CF  E                    WORKSTN
     F*
     F*==< DIE KANBAN M/F >==*
     FGCQPL14 IF  E           K        DISK
     F*
     F*==< MANAGING ISSUE NUMBERS FOR DIE STORE LABEL >==*
     FECSPP73 UF  E           K        DISK                      A
     F*
     F*==< DIE STORE LABEL ISSUE DATA >==*
     FECSWP73 IF  E           K        DISK                      A
     F*
     E*****************************************************
     F*          ARRAY DEFINITION                         *
     E*****************************************************
     E                    @MM     1  12  1
     E                    @ER     1  10 60
     E*
     I*****************************************************
     I*          DATA STRUCTURE                           *
     I*****************************************************
     I*==< SYSTEM INFORMATION >==*
     I           SDS
     I                                     *PROGRAM @@PGID
     I                                      244 253 @@WSID
     I                                      254 263 @@USID
     I                                      264 269 @@JBNO
     I*==< SYSTEM DATE/TIME >==*
     I            DS
     I                                        1  140S@TIME
     I                                        1   60S@HMS
     I                                        7  140S@YMD
     I                                        7  100S@YYYY
     I                                       11  120S@MM
     I                                       13  140S@DD
     I*==< SCREEN ITEM >==*
     ID#BAR@      DS
     I*         ( PT KANBAN BARCODE )
     I                                        1   5 D#BITN
     I                                        6  13 D#BKT
     I                                        6   7 D#BKT1
     I                                        8  11 D#BKT2
     I                                       12  12 D#BKT3
     I                                       13  13 D#BKT4
     I                                       14  16 D#BLTN
     I                                       17  17 D#BCDG
     I*         ( PT KANBAN BARCODE NEW )
     I                                        1   1 DNKANR
     I                                        1   7 DNJYNO
     I                                        8   9 DNPAGE
     I                                       10  11 DNKAT1
     I                                       12  15 DNKAT2
     I                                       16  16 DNKAT3
     I                                       17  17 DNKAT4
     I                                       18  18 DNBCDG
     I*         ( GENTI KOUNYU KANBAN BARCODE )
     I                                        4   5 D@BKT1
     I                                        6   9 D@BKT2
     I                                       10  17 D@BFIL
     I                                       19  26 D@AKI
     I*==< WORK >==*
     I*         ( DIE NUMBER )
     I            DS
     I                                        1   8 S@KAT@
     I                                        1   2 S@KAT1
     I                                        3   6 S@KAT2
     I                                        7   7 S@KAT3
     I                                        8   8 S@KAT4
     I*         ( BARCODE )
     I            DS
     I                                        1  15 W@BAR@
     I                                        1   8 W@BKAT
     I                                        9   90W@BISY
     I                                       10  10 W@BISM
     I                                       11  140W@BISN
     I                                       15  15 W@BCDG
     I*
     C*****************************************************
     C*          PARAMETERS LIST                          *
     C*****************************************************
     C*==< ENTRY PARM >==*
     C           *ENTRY    PLIST
     C                     PARM           P@OUTR  50        OUTPUT COUNT
     C*
     C*==< CHKR01 >==*
     C           P@CHK1    PLIST
     C                     PARM           P@BRCD100         BARCODE
     C                     PARM           P@BYTE  3         SIGNIFICANT DIGITS
     C                     PARM           P@CKDG  1         CHECK DIGIT
     C                     PARM           P@RTN1  1         RETURN CODE
     C*
     C*****************************************************
     C*          LEY LIST                                 *
     C*****************************************************
     C*==< GCQPL14 : DIE KANBAN M/F >==*
     C           K@C11S    KLIST
     C                     KFLD           K@KAT1  2         DIE NO.1
     C                     KFLD           K@KAT2  4         DIE NO.2
     C                     KFLD           K@KAT3  1         DIE NO.3
     C                     KFLD           K@KIHZ  80        CHANGE DATE
     C           K@C11R    KLIST
     C                     KFLD           K@KAT1            DIE NO.1
     C                     KFLD           K@KAT2            DIE NO.2
     C                     KFLD           K@KAT3            DIE NO.3
     C           K@C11T    KLIST
     C                     KFLD           K@KAT1            DIE NO.1
     C                     KFLD           K@KAT2            DIE NO.2
     C*
     C*==< ECSPP73 : MANAGING ISSUE NUMBERS FOR DIE STORE LABEL >==*
     C           K@PP73    KLIST
     C                     KFLD           K@KAT1  2         DIE NO.1
     C                     KFLD           K@KAT2  4         DIE NO.2
     C                     KFLD           K@KAT3  1         DIE NO.3
     C                     KFLD           K@KAT4  1         DIE NO.4
     C                     KFLD           K@KEYY  40        YEAR
     C                     KFLD           K@KEYM  20        MONTH
     C*
     C*==< ECSWP73 : DIE STORE LABEL ISSUE DATA >==*
     C           K@WP73    KLIST
     C                     KFLD           K@KAT1            DIE NO.1
     C                     KFLD           K@KAT2            DIE NO.2
     C                     KFLD           K@KAT3            DIE NO.3
     C                     KFLD           K@KAT4            DIE NO.4
     C*
     C*****************************************************
     C*          INTERNAL WORKING ITEM                    *
     C*****************************************************
     C                     MOVEL'EDT1'    S@PROC  4
     C                     MOVEL*BLANK    F@READ  1
     C                     Z-ADD*ZERO     C@LOOP  50
     C                     Z-ADD*ZERO     J       30
     C*
     C*****************************************************
     C*          MAIN ROUTINE                             *
     C*****************************************************
     C*==< INITIAL PROCESSING >==*
     C                     EXSR #INIT
     C*
     C*==< MAIN PROCESSING >==*
D----C           S@PROC    DOWNE'EXIT'
|    C*
|S---C                     SELEC
|+---C           S@PROC    WHEQ 'EDT1'
||   C                     EXSR #EDT1
||   C*
|+---C           S@PROC    WHEQ 'DSP1'
||   C                     EXSR #DSP1
||   C*
|+---C           S@PROC    WHEQ 'CHK1'
||   C                     EXSR #CHK1
||   C*
|+---C           S@PROC    WHEQ 'DATA'
||   C                     EXSR #DATA
||   C*
|E---C                     ENDSL
|    C*
E----C                     ENDDO
     C*
     C*==< FINAL PROCESSING >==*
     C                     SETON                     LR
     C                     RETRN
     C*
     C*****************************************************
     C*  #INIT   INITIAL PROCESSING                       *
     C*****************************************************
     C           #INIT     BEGSR
     C*
     C                     Z-ADD*ZERO     P@OUTR
     C                     SETOF                     51
     C                     MOVEL*BLANK    D#KT1B
     C                     MOVEL*BLANK    D#KT2B
     C                     MOVEL*BLANK    D#KT3B
     C                     MOVEL*BLANK    D#KT4B
     C                     Z-ADD*ZERO     D#BCUN
     C                     MOVEL'0'       @FIRST  1
     C                     Z-ADD*ZERO     D#NOSR
     C*
     C           #INITE    ENDSR
     C*****************************************************
     C*  #EDT1   EDIT SCREEN                              *
     C*****************************************************
     C           #EDT1     BEGSR
     C*
     C*==< INITIALIZE ITEMS >==*
     C                     MOVEL*BLANK    D#BAR@            BARCODE
     C                     MOVEL*BLANK    S@KAT@            DIE NO.
     C                     Z-ADD*ZERO     D#CUNT            ISSUE COUNT
     C                     MOVEL*BLANK    D#EMSG            MESSAGE
     C                     SETOF                     313299
     C*
     C*==< NEXT PROCESSING >==*
     C                     MOVEL'DSP1'    S@PROC
     C*
     C           #EDT1E    ENDSR
     C*****************************************************
     C*  #DSP1   DISPLAY SCREEN                           *
     C*****************************************************
     C           #DSP1     BEGSR
     C*
     C*==< DISPLAY >==*    _____________
     C                     EXFMTECSPW721
     C*                    ~~~~~~~~~~~~~
     C                     TIME           S@TIME
     C*
     C*==< NEXT PROCESSING >==*
S----C                     SELEC
+----C           *IN01     WHEQ '1'                        < F1 >
|    C                     MOVEL'EXIT'    S@PROC
|    C*
+----C           *IN05     WHEQ '1'                        < F5 >
|    C                     MOVEL'CHK1'    S@PROC
|    C*
+----C                     OTHER                           < ENTER >
|    C                     MOVEL'CHK1'    S@PROC
E----C                     ENDSL
     C*
     C           #DSP1E    ENDSR
     C*****************************************************
     C*  #CHK1   CHECK SCRREN                             *
     C*****************************************************
     C           #CHK1     BEGSR
     C*
     C*==< INITIALIZE ITEMS >==*
     C                     MOVEL*BLANK    D#EMSG
     C                     SETOF                     313299
     C*
     C*==< BARCODE >==*
     C                     MOVEL*BLANK    S@KAT@
I----C           D#BKT     IFEQ *BLANK
|    C                     MOVEL@ER,1     D#EMSG
|    C                     SETON                     3199
|    C                     MOVEL'DSP1'    S@PROC
|    C                     GOTO #CHK1E
E----C                     ENDIF
     C*
||   C                     MOVELD#BKT1    S@KAT1
||   C                     MOVELD#BKT2    S@KAT2
||   C                     MOVELD#BKT3    S@KAT3
||   C                     MOVELD#BKT4    S@KAT4
     C*
     C                     MOVELS@KAT1    K@KAT1
     C                     MOVELS@KAT2    K@KAT2
     C                     MOVELS@KAT3    K@KAT3
     C                     Z-ADD*DATE     K@KIHZ
      *
I----C           S@KAT3    IFEQ '4'
|    C           S@KAT3    OREQ 'U'
|    C*                    ____________
|    C           K@C11S    SETLLGCQPL14
|    C           K@C11R    READEGCQPL14                  91
|    C*                    ~~~~~~~~~~~~
|D---C           *IN91     DOWEQ'0'
|    C           T6SKJY    ANDEQ'D'
|    C*                    ____________
|    C           K@C11R    READEGCQPL14                  91
|    C*                    ~~~~~~~~~~~~
|E---C                     ENDDO
+----C                     ELSE
|    C*                    ____________
|    C           K@C11T    SETLLGCQPL14
|    C           K@C11T    READEGCQPL14                  91
|    C*                    ~~~~~~~~~~~~
|D---C           *IN91     DOWEQ'0'
|    C           T6SKJY    ANDEQ'D'
|    C*                    ____________
|    C           K@C11T    READEGCQPL14                  91
|    C*                    ~~~~~~~~~~~~
|E---C                     ENDDO
E----C                     END
     C* FIND -4
I----C           *IN91     IFEQ '1'
|    C           S@KAT3    ANDEQ'U'
|    C                     MOVEL'4'       S@KAT3
|    C                     MOVEL'4'       K@KAT3
|    C                     SETOF                     91
|    C           K@C11S    SETLLGCQPL14
|    C           K@C11R    READEGCQPL14                  91
|    C*                    ~~~~~~~~~~~~
|D---C           *IN91     DOWEQ'0'
||   C           T6SKJY    ANDEQ'D'
||   C*                    ____________
||   C           K@C11R    READEGCQPL14                  91
||   C*                    ~~~~~~~~~~~~
|E---C                     ENDDO
E----C                     END
     C*
I----C           *IN91     IFEQ '1'
|    C                     MOVEL@ER,4     D#EMSG
|    C                     SETON                     3199
|    C                     MOVEL'DSP1'    S@PROC
|    C                     GOTO #CHK1E
E----C                     ENDIF
     C*
     C                     MOVEL'0'       F@READ
     C                     MOVELS@KAT1    K@KAT1
     C                     MOVELS@KAT2    K@KAT2
     C                     MOVELS@KAT3    K@KAT3
     C                     MOVELS@KAT4    K@KAT4
     C           @FIRST    IFEQ '0'
     C                     Z-ADDT6SYOS    D#CUNT
     C                     MOVEL'1'       @FIRST  1
     C                     END
     C*                    ____________
     C           K@WP73    SETLLECSWP73
     C           K@WP73    READEECSWP73                  92
     C*                    ~~~~~~~~~~~~
I----C           *IN92     DOWEQ'0'
|    C           F@READ    ANDEQ'0'
|I---C           D#BAR@    IFEQ W0REDK
||   C                     MOVEL'1'       F@READ
||   C*
|+---C                     ELSE
||   C*                    ____________
||   C           K@WP73    READEECSWP73                  92
||   C*                    ~~~~~~~~~~~~
|E---C                     ENDIF
E----C                     ENDDO
     C*
I----C           *IN92     IFEQ '0'
|    C                     MOVEL@ER,5     D#EMSG
|    C                     SETON                     3199
|    C                     MOVEL'DSP1'    S@PROC
|    C                     GOTO #CHK1E
E----C                     ENDIF
     C*
     C*==< ISSUE COUNT >==*
I----C           D#CUNT    IFEQ *ZERO
|    C                     MOVEL@ER,1     D#EMSG
|    C                     SETON                     3299
|    C                     MOVEL'DSP1'    S@PROC
|    C                     GOTO #CHK1E
E----C                     ENDIF
     C*
     C*==< NEXT PROCESSING >==*
I----C           *IN05     IFEQ '1'
|    C                     MOVEL'DATA'    S@PROC
|    C                     MOVEL'0'       @FIRST
+----C                     ELSE
|    C                     MOVEL'DSP1'    S@PROC
E----C                     ENDIF
     C*
     C           #CHK1E    ENDSR
     C*****************************************************
     C*  #DATA   ECSWP73 RECORD OUTPUT                    *
     C*****************************************************
     C           #DATA     BEGSR
     C*
     C*==< GET OF ISSUE NUMBER >==*
     C                     MOVELS@KAT1    K@KAT1            DIE NO.1
     C                     MOVELS@KAT2    K@KAT2            DIE NO.2
     C                     MOVELS@KAT3    K@KAT3            DIE NO.3
     C                     MOVELS@KAT4    K@KAT4            DIE NO.4
     C                     Z-ADDS@YYYY    K@KEYY            YEAR
     C                     Z-ADDS@MM      K@KEYM            MONTH
     C*                    ____________
     C           K@PP73    CHAINECSPP73              93
     C*                    ~~~~~~~~~~~~
I----C           *IN93     IFEQ '1'
|    C                     MOVELS@KAT1    N0KAT1            DIE NO.1
|    C                     MOVELS@KAT2    N0KAT2            DIE NO.2
|    C                     MOVELS@KAT3    N0KAT3            DIE NO.3
|    C                     MOVELS@KAT4    N0KAT4            DIE NO.4
|    C                     Z-ADDS@YYYY    N0KEYY            YEAR
|    C                     Z-ADDS@MM      N0KEYM            MONTH
|    C                     Z-ADD*ZERO     N0ISNO            ISSUE NUMBER
|    C*
+----C                     ELSE
|I---C           N0ISNO    IFEQ 9999
||   C                     Z-ADD*ZERO     N0ISNO            ISSUE NUMBER
|E---C                     ENDIF
E----C                     ENDIF
     C*
     C*==< ECSWP73 EDIT & OUTPUT >==*
     C                     MOVELS@KAT1    W0KAT1            DIE NO.1
     C                     MOVELS@KAT2    W0KAT2            DIE NO.2
     C                     MOVELS@KAT3    W0KAT3            DIE NO.3
     C                     MOVELS@KAT4    W0KAT4            DIE NO.4
     C                     Z-ADDS@YYYY    W0ISYY            YEAR
     C                     Z-ADDS@MM      W0ISMM            MONTH
     C                     Z-ADDS@DD      W0ISDD            ISSUE DATE
     C                     Z-ADDS@HMS     W0ISJK            ISSUE TIME
     C                     MOVELD#BAR@    W0REDK            READ BARCODE
     C*
     C                     Z-ADD1         C@LOOP
D----C           C@LOOP    DOWLED#CUNT
|    C                     ADD  1         N0ISNO
|    C                     Z-ADDN0ISNO    W0ISNO            ISSUE NUMBER
|    C*
|    C                     MOVEL*BLANK    W@BAR@
|    C                     MOVELS@KAT@    W@BKAT
|    C                     Z-ADDS@YYYY    W@BISY
|    C                     Z-ADDS@MM      J
|    C                     MOVEL@MM,J     W@BISM
|    C                     Z-ADDN0ISNO    W@BISN
|    C*
|    C                     MOVELW@BAR@    P@BRCD    P
|    C                     MOVEL'014'     P@BYTE
|    C                     MOVEL*LOVAL    P@CKDG
|    C                     MOVEL*LOVAL    P@RTN1
|    C                     CALL 'CHKR03'  P@CHK1
|    C*
|    C*CHECK DIGIT ADDING BY PC (NOT AS400)
|    C*---                 MOVELP@CKDG    W@BCDG
|    C                     MOVEL*BLANK    W@BCDG
|    C                     MOVELW@BAR@    W0BAR@            BARCODE
|    C                     MOVEL*BLANK    W0LOC1
|    C                     MOVEL*BLANK    W0LOC2
|    C                     MOVEL*BLANK    W0LOC3
|    C                     MOVEL*BLANK    W0LOC4
|    C                     MOVELT6TKR1    W0LOC1
|    C                     MOVELT6TKR2    W0LOC2
|    C                     MOVELT6TKR3    W0LOC3
|    C                     MOVELT6TKR4    W0LOC4
|    C*                    _____________
|    C                     WRITEECSWP731
|    C*                    ~~~~~~~~~~~~~
|    C                     ADD  1         P@OUTR
|    C                     ADD  1         C@LOOP
E----C                     ENDDO
     C*
     C*==< UPDATE OF ISSUE NUMBER >==*
     C*                    _____________
     C  N93                UPDATECSPP731
     C   93                WRITEECSPP731
     C*                    ~~~~~~~~~~~~~
     C*==< NEXT PROCESSING >==*
     C                     SETON                     51
     C                     MOVELD#BKT1    D#KT1B
     C                     MOVELD#BKT2    D#KT2B
     C                     MOVELD#BKT3    D#KT3B
     C                     MOVELD#BKT4    D#KT4B
     C                     Z-ADDD#CUNT    D#BCUN
     C                     ADD  1         D#NOSR
     C                     MOVEL'EDT1'    S@PROC
     C*
     C           #DATAE    ENDSR
     C*
----+-*--1----+----2----+----3----+----4----+----5----+----6
** @MM
1
2
3
4
5
6
7
8
9
A
B
C
** @ER
E-01 INPUT IS NEEDED.
E-02 INJUSTICE OF A CHECK DEGIT
E-03 THE FORMAT IS DIFFERENT.
E-04 THIS DIE IS NOT REGISTERED.
E-05 IT'S INPUT ALREADY.





