     H            Y.
      ** ECSRA1 **************************
      * 海外拠点金型出庫実績データ作成 *
      *    I-HASADA        2017/10/06    *
      ************************** ECSRA1 **
     FECSPWA1 CF  E                    WORKSTN
     FECSPL07 IF  E           K        DISK
     FGCQPL14 IF  E           K        DISK
     FECSWPA1 O   F     100            DISK
      *
     E                    ER      1   3 70               d[ｰxｮﾈｰﾆﾞ
      *
      ***
     C           KEY1      KLIST
     C                     KFLD           EQKAT1
     C                     KFLD           EQKAT2
      *
     C           *ENTRY    PLIST
     C                     PARM           PJSYY   4
      *
     C                     CLEARECSPWA11
      *
      **********
      * 画面 *
      **********
     C           STP1      TAG
     C                     EXFMTECSPWA11
     C                     SETOF                     5199
      *
      *=====
      *  F1
     C           *INKA     IFEQ '1'
     C                     SETON                     U2LR
     C                     RETRN
     C                     END
      *
      *--------------*
      * 実績日付年 *
      *--------------*
     C           IJSYY     IFEQ 0
     C                     SETON                     5199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C           IJSYY     IFLT 2017
     C                     SETON                     5199
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
      *
      *=====
      *  F5
     C           *INKE     IFEQ '0'
     C                     GOTO STP1
     C                     END
      *
     C                     MOVELIJSYY     PJSYY
      *
      ***
      ******************
      * 型出庫データ *
      ******************
     C                     DO   *HIVAL
     C                     SETOF                     10
     C                     READ ECSPL071                 10
     C           *IN10     IFEQ '1'
     C                     LEAVE
     C                     END
     C           EQSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           IJSYY     IFNE EQYOYY
     C                     ITER
     C                     END
      *
     C                     Z-ADD0         WSYOS   30
     C                     MOVE *BLANK    WTKR1   1
     C                     MOVE *BLANK    WTKR2   2
     C                     MOVE *BLANK    WTKR3   2
     C                     MOVE *BLANK    WTKR4   1
     C                     Z-ADD0         WSRYO   72
     C                     Z-ADD0         WMAIS   30
      *
     C           KEY1      SETLLGCQPL141
     C                     DO   *HIVAL
     C                     SETOF                     11
     C           KEY1      READEGCQPL141                 11
     C           *IN11     IFEQ '1'
     C                     LEAVE
     C                     END
     C           T6SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           *DATE     IFGE T6KIHZ
     C                     Z-ADDT6SYOS    WSYOS
     C                     MOVELT6TKR1    WTKR1
     C                     MOVELT6TKR2    WTKR2
     C                     MOVELT6TKR3    WTKR3
     C                     MOVELT6TKR4    WTKR4
     C                     Z-ADDT6SRYO    WSRYO
     C                     Z-ADDT6MAIS    WMAIS
     C                     LEAVE
     C                     END
     C                     END
      *
     C                     SETON                     U1
     C                     EXCPTDT
     C                     END
      *
     C           *INU1     IFEQ '0'
     C                     SETON                     99
     C                     MOVELER,3      MSG
     C                     GOTO STP1
     C                     END
      *
      *
     C                     SETON                     LR
     C                     RETRN
      *
      ***
     OECSWPA1 E                DT
     O                         EQBMON     4
     O                         EQKAT1     6
     O                         EQKAT2    10
     O                         EQKAT3    11
     O                         WSYOS     14
     O                         WTKR1     15
     O                         WTKR2     17
     O                         WTKR3     19
     O                         WTKR4     20
     O                         WSRYO     27
     O                         EQKOSU    30
     O                         EQYOHZ    38
     O                         WMAIS     41
      *
      *
** ER
E-01実績日付（年）が、入力されていない。
E-02実績日付（年）が、正しく入力されていない。
E-03作成するデータが、有りません。
