     H            Y.
     F** ECSR96 **************************************
     F* INQUIRY STORE IN/OUT HISTORY                 *
     F*       MAEDA.        2017.10.11               *
     F************************************************
     FECSPW96 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
     F                                        RRN   KSFILE SFL2
     FECSWP95 IF  E           K        DISK
     FECSPP70 IF  E           K        DISK
      *
     E                    ER      1  11 65
      *
     I            DS
     I                                        1  11 S1KAT
     I                                        1   2 S1KAT1
     I                                        3   3 S1KAF1
     I                                        4   7 S1KAT2
     I                                        8   8 S1KAF2
     I                                        9   9 S1KAT3
     I                                       10  10 S1KAF3
     I                                       11  11 S1KAT4
      *
     I            DS
     I                                        1  11 D2TKR
     I                                        1   1 D2TKR1
     I                                        2   2 D2TKF1
     I                                        3   4 D2TKR2
     I                                        5   5 D2TKF2
     I                                        6   7 D2TKR3
     I                                        8   8 D2TKF3
     I                                        9   9 D2TKR4
     I                                       10  10 D2TKF4
     I                                       11  11 D2TKR5
      *
     I            DS
     I                                        1   60W0IOJK
     I                                        1   2 W0IOJH
     I                                        3   4 W0IOJM
     I                                        5   6 W0IOJS
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I            DS
     I                                        1   80W@DAT1
     I                                        1   40W@YY1
     I                                        5   60W@MM1
     I                                        7   80W@DD1
      *
     I            DS
     I                                        1   80W@DAT2
     I                                        1   40W@YY2
     I                                        5   60W@MM2
     I                                        7   80W@DD2
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1YMD1  80
     C                     PARM           P1TIM1  40
     C                     PARM           P1YMD2  80
     C                     PARM           P1TIM2  40
     C                     PARM           P1DIE1  2
     C                     PARM           P1DIE2  4
     C                     PARM           P1DIE3  1
     C                     PARM           P1DIE4  1
     C                     PARM           P1RIYU  1
     C                     PARM           P1KIBN  3
     C                     PARM           P1IOKB  1
     C                     PARM           P1GSKB  1
     C                     PARM           P1JUDG  1
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      * CONTROL                                            *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     C                     Z-ADDP1YMD1    C1DAT1
     C                     Z-ADDP1TIM1    C1TIM1
     C                     Z-ADDP1YMD2    C1DAT2
     C                     Z-ADDP1TIM2    C1TIM2
     C                     MOVELP1DIE1    C1KAT
     C           P1DIE2    IFNE *BLANK
     C           C1KAT     CAT  '-':0     C1KAT
     C           C1KAT     CAT  P1DIE2:0  C1KAT
     C                     ENDIF
     C           P1DIE3    IFNE *BLANK
     C           C1KAT     CAT  '-':0     C1KAT
     C           C1KAT     CAT  P1DIE3:0  C1KAT
     C                     ENDIF
     C           P1DIE4    IFNE *BLANK
     C           C1KAT     CAT  '-':0     C1KAT
     C           C1KAT     CAT  P1DIE4:0  C1KAT
     C                     ENDIF
     C                     MOVELP1RIYU    C1RIYU
     C                     MOVELP1KIBN    C1KIBN
     C                     SELEC
     C           P1IOKB    WHEQ ' '
     C                     MOVEL'ALL  '   C1IOKB
     C           P1IOKB    WHEQ '1'
     C                     MOVEL'1:IN '   C1IOKB
     C           P1IOKB    WHEQ '2'
     C                     MOVEL'2:OUT'   C1IOKB
     C                     ENDSL
     C                     SELEC
     C           P1GSKB    WHEQ ' '
     C                     MOVEL'ALL  '   C1GSKB
     C           P1GSKB    WHEQ '1'
     C                     MOVEL'1:HANDY 'C1GSKB
     C           P1GSKB    WHEQ '2'
     C                     MOVEL'1:ADJUST'C1GSKB
     C                     ENDSL
      *
     C                     Z-ADD14        @@MAX   20
     C                     SELEC
     C           P1JUDG    WHEQ ' '
     C                     MOVEL'ALL  '   C1HNTE
     C           P1JUDG    WHEQ '1'
     C                     MOVEL'1:OK'    C1HNTE
     C           P1JUDG    WHEQ '2'
     C                     MOVEL'2:NG'    C1HNTE
     C                     Z-ADD7         @@MAX
     C                     ENDSL
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * READ                                               *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     C                     SETOF                     8166
     C           *LOVAL    SETLLECSWP951
     C                     READ ECSWP951                 81
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ ECSWP951                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     MOVE '02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * 1ST.                                               *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C           CTRX      IFEQ 0
     C                     SETON                     72
     C                     SETON                     99
     C                     MOVELER,1      D9ERR
     C                     ELSE
     C                     SETON                     7273
     C                     ENDIF
      *
     C                     WRITEECSPW969
     C           P1JUDG    IFEQ '2'
     C                     EXFMTSFLCTL2
     C                     ELSE
     C                     EXFMTSFLCTL
     C                     ENDIF
     C                     SETOF                     7273
     C                     SETOF                     3199
     C                     MOVEL*BLANK    D9ERR
      * F3
     C           *IN03     IFEQ '1'
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           CTRX      IFEQ 0
     C                     GOTO ESB220
     C                     ENDIF
      *
      *-----------------*
      * ROLLDOWN/PAGEUP *
      *-----------------*
     C           *IN52     IFEQ '1'
     C*                    ADD  1         CTRX
      * 1ST. PAGE
     C           WKPAGE    IFEQ 1
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
     C           *IN81     IFEQ '1'
     C                     SETOF                     81
     C           *HIVAL    SETGTECSWP951
     C                     READPECSWP951                 81
     C                     SUB  1         CTRX
     C                     ENDIF
      *
     C                     ADD  @@MAX     CTRX
      *                         L--表示行数
     C                     SETOF                     6627
      *
     C           *IN81     DOWEQ'0'
     C           *IN27     ANDEQ'0'
     C                     EXSR #READP
     C                     READPECSWP951                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXTP
     C                     ENDDO
      *
     C                     Z-ADD0         CTRX    40
      *
     C           *IN81     IFEQ '1'
     C           *LOVAL    SETLLECSWP951
     C                     READ ECSWP951                 81
     C                     ENDIF
      *
     C                     EXSR #CLR
     C                     SETOF                     8166
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ ECSWP951                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     SUB  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *--------------------*
      * ROLL-UP            *
      *--------------------*
     C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
      *
     C                     EXSR #CLR
      *
     C                     SETOF                     6681
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ ECSWP951                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     ADD  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *
     C                     Z-ADD1         X       30
     C                     SETOF                     3199
     C*        * X         DOWLE14
     C           X         DOWLE@@MAX
     C           *IN99     ANDEQ'0'
     C*
     C           P1JUDG    IFEQ '2'
     C           X         CHAINSFL2                 23
     C                     ELSE
     C           X         CHAINSFL                  23
     C                     ENDIF
     C*
     C                     SETOF                     3199
     C           *IN23     IFEQ '0'
     C                     EXSR #SB221
     C                     MOVELH1IN39    *IN39
     C                     MOVELH1IN38    *IN38
     C*
     C           P1JUDG    IFEQ '2'
     C                     UPDATSFL2
     C                     ELSE
     C                     UPDATSFL
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
     C           *IN99     IFEQ '1'
     C                     GOTO ESB220
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * CHECK                                              *
      *----------------------------------------------------*
     CSR         #SB221    BEGSR
      *
     C                     SELEC
      *
     C           S1SEL     WHEQ ' '
     C           S1SEL     WHEQ 'M'
     C                     EXSR #SB222
     C                     MOVEL*BLANK    S1SEL
     C                     OTHER
     C                     SETON                     3199
     C                     MOVELER,2      D9ERR
     C                     GOTO ESB221
     C                     ENDSL
      *
     CSR         ESB221    ENDSR
      *----------------------------------------------------*
      * DETAIL                                             *
      *----------------------------------------------------*
     CSR         #SB222    BEGSR
      *
     C                     MOVEL*BLANK    D2TKR
     C                     MOVELH1TKR1    D2TKR1
     C                     MOVEL'-'       D2TKF1
     C                     MOVELH1TKR2    D2TKR2
     C                     MOVEL'-'       D2TKF2
     C                     MOVELH1TKR3    D2TKR3
     C                     MOVEL'-'       D2TKF3
     C                     MOVELH1TKR4    D2TKR4
     C                     MOVEL'-'       D2TKF4
     C                     MOVELH1TKR5    D2TKR5
      *
     C           DSP02     TAG
     C                     EXFMTECSPW962
     C           *IN03     IFEQ '0'
     C                     GOTO DSP02
     C                     ENDIF
      *
     CSR         ESB222    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * READ                                               *
      *----------------------------------------------------*
     CSR         #READ     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREAD
     C                     ENDIF
      *
     C                     EXSR #EDIT
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     ADD  1         CTRX
     C           P1JUDG    IFEQ '2'
     C                     WRITESFL2
     C                     ELSE
     C                     WRITESFL
     C                     ENDIF
      *
     C**      ** CTRX      IFEQ 14
     C           CTRX      IFEQ @@MAX
     C                     SETON                       66
     C                     ENDIF
      *
     CSR         EREAD     ENDSR
      *----------------------------------------------------*
      * READP                                              *
      *----------------------------------------------------*
     CSR         #READP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREADP
     C                     ENDIF
      *
     C                     SUB  1         CTRX           27
      *
     CSR         EREADP    ENDSR
      *----------------------------------------------------*
      * SELECT DATA                                        *
      *----------------------------------------------------*
     CSR         #SELEC    BEGSR
      *
     C                     MOVEL'1'       WKGET
      *
     CSR         ESELEC    ENDSR
      *----------------------------------------------------*
      * CLEAR ITEM                                         *
      *----------------------------------------------------*
     CSR         #CLR      BEGSR
      *
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     WRITESFLCTL2
     C                     SETOF                     7166
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN    40
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
      *
     CSR         ECLR      ENDSR
      *----------------------------------------------------*
      * EDIT ITEM                                          *
      *----------------------------------------------------*
     CSR         #EDIT     BEGSR
      *
     C                     MOVEL*BLANK    S1SEL
     C                     MOVELW0IOKB    S1IOKB
     C                     Z-ADDW0IOHZ    S1IOHZ
     C                     MOVEL*BLANK    S1IOJK
     C           S1IOJK    CAT  W0IOJH:0  S1IOJK
     C           S1IOJK    CAT  ':':0     S1IOJK
     C           S1IOJK    CAT  W0IOJM:0  S1IOJK
     C                     MOVEL*BLANK    S1KAT
     C                     MOVELW0KAT1    S1KAT1
     C                     MOVEL'-'       S1KAF1
     C                     MOVELW0KAT2    S1KAT2
     C                     MOVEL'-'       S1KAF2
     C                     MOVELW0KAT3    S1KAT3
     C                     MOVEL'-'       S1KAF3
     C                     MOVELW0KAT4    S1KAT4
     C                     MOVELW0KIBN    S1KIBN
     C                     Z-ADDW0KOSU    S1KOSU
     C                     MOVEL*BLANK    S1RESN
     C                     MOVELW0RIYU    S1RESN
     C           W0RIYU    CHAINECSPP701             23
     C           *IN23     IFEQ '0'
     C           S1RESN    CAT  E7RSNM:1  S1RESN
     C                     ENDIF
     C                     SELEC
     C           W0GSKB    WHEQ ' '
     C                     MOVEL'      '  S1GSKB
     C           W0GSKB    WHEQ 'H'
     C                     MOVEL'HANDY '  S1GSKB
     C           W0GSKB    WHEQ 'A'
     C                     MOVEL'ADJUST'  S1GSKB
     C                     ENDSL
      *
     C                     SETOF                     39
     C                     MOVEL'0'       H1IN39
     C           W0HNTE    IFEQ 'NG'
     C                     SETON                     39
     C                     MOVEL'1'       H1IN39
     C                     ENDIF
      *
     C                     SETOF                     38
     C                     MOVEL'0'       H1IN38
     C           W0INPK    IFEQ '2'
     C                     SETON                     38
     C                     MOVEL'1'       H1IN38
     C                     ENDIF
      *
     C                     Z-ADDW0BMON    H1BMON
     C                     MOVELW0KIBN    H1KIBN
     C                     MOVELW0RIYU    H1RIYU
     C                     MOVELW0KAT1    H1KAT1
     C                     MOVELW0KAT2    H1KAT2
     C                     MOVELW0KAT3    H1KAT3
     C                     MOVELW0KAT4    H1KAT4
     C                     MOVELW0TKR1    H1TKR1
     C                     MOVELW0TKR2    H1TKR2
     C                     MOVELW0TKR3    H1TKR3
     C                     MOVELW0TKR4    H1TKR4
     C                     MOVELW0TKR5    H1TKR5
     C                     Z-ADDW0KOSU    H1KOSU
     C                     MOVELW0IOKB    H1IOKB
     C                     MOVELW0GSKB    H1GSKB
     C                     Z-ADDW0IOHZ    H1IOHZ
     C                     Z-ADDW0IOJK    H1IOJK
     C                     MOVELW0IOME    H1IOME
     C                     MOVELW0OREQ    H1OREQ
     C                     MOVELW0HNTE    H1HNTE
     C                     MOVELW0EMSG    H1EMSG
     C                     MOVELW0PBAR    H1PBAR
     C                     MOVELW0SBAR    H1SBAR
     C                     MOVELW0LBAR    H1LBAR
     C                     MOVELW0DBAR    H1DBAR
      *
     C                     MOVEL*BLANK    S1EMSG
     C           W0HNTE    IFEQ 'NG'
     C                     MOVELW0EMSG    S1EMSG
     C                     ENDIF
      *
     CSR         EEDIT     ENDSR
      *----------------------------------------------------*
      * NEXT DATA                                          *
      *----------------------------------------------------*
     CSR         #NEXT     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXT
     C                     ENDIF
      *
     C                     READ ECSWP951                 81
      *
     CSR         ENEXT     ENDSR
      *----------------------------------------------------*
      * PRV DATA                                           *
      *----------------------------------------------------*
     CSR         #NEXTP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXTP
     C                     ENDIF
      *
     C                     READPECSWP951                 81
      *
     CSR         ENEXTP    ENDSR
     C*----------------------------------------------------------------
**
ER-1 THERE ARE NO DATA.
ER-2 INPUT 'M'.
