     H            Y.
     F** ECSR80 *******************************************
     F*  (HDT) STORE THE DIE IN                           *
     F*          2017.06.05  ITS.  T.MITSUI               *
     F*****************************************************
     F*          FILE DEFINITION                          *
     F*****************************************************
     F*==< SCREEN >==*
     FECSPW80 CF  E                    WORKSTN
     F*
     F*==< DIE STORE IN/OUT RESULT FILE >==*
     FECSPL81 IF  E           K        DISK                      A
     F*
     F*==< DIE KANBAN M/F >==*
     FGCQPL11 IF  E           K        DISK
     F*
     F*==< DIE INVENTORY FILE >==*
     FECSPL10 UF  E           K        DISK                      A
     F*
     FECSPP20 O   E           K        DISK
     E*****************************************************
     F*          ARRAY DEFINITION                         *
     E*****************************************************
     E                    @ER     1  15 25
     E*
     I*****************************************************
     I*          DATA STRUCTURE                           *
     I*****************************************************
     I*==< SYSTEM INFORMATION >==*
     I           SDS
     I                                     *PROGRAM @@PGID
     I                                      244 253 @@WSID
     I                                      254 263 @@USID
     I                                      264 269 @@JBNO
     I*==< SYSTEM DATE/TIME >==*
     I            DS
     I                                        1  140S@TIME
     I                                        1   60S@HMS
     I                                        7  140S@YMD
     I*==< SCREEN ITEM >==*
     ID#BAR1      DS
     I*         ( PT KANBAN BARCODE )
     I                                        1   5 D#1ITN
     I                                        6   7 D#1KT1
     I                                        8  11 D#1KT2
     I                                       12  12 D#1KT3
     I                                       13  13 D#1KT4
     I                                       14  16 D#1LTN
     I                                       17  17 D#1CDG
     I*         ( PT KANBAN BARCODE NEW )
     I                                        1   1 DNKANR
     I                                        1   7 DNJYNO
     I                                        8   9 DNPAGE
     I                                       10  11 DNKAT1
     I                                       12  15 DNKAT2
     I                                       16  16 DNKAT3
     I                                       17  17 DNKAT4
     I                                       18  18 DNBCDG
     I*         ( GENTI KOUNYU KANBAN BARCODE )
     I                                        1   2 D@1KT1
     I                                        3   3 D@1HF1
     I                                        4   7 D@1KT2
     I                                        8   8 D@1KT3
     I                                        9   9 D@1KT4
     I                                       10  17 D@1FIL
     I*         ( DIE STORE LABEL BARCODE )
     ID#BAR2      DS
     I                                        1   2 D#2KT1
     I                                        3   6 D#2KT2
     I                                        7   7 D#2KT3
     I                                        8   8 D#2KT4
     I                                        9  14 D#2ISN
     I                                       15  15 D#2CDG
     I*         ( DIE LOCATION BARCODE )
     ID#BAR3      DS
     I                                        1   2 D#3KT1
     I                                        3   6 D#3KT2
     I                                        7   7 D#3KT3
     I                                        8   8 D#3KT4
     I                                        9   9 D#3TR1
     I                                       10  11 D#3TR2
     I                                       12  13 D#3TR3
     I                                       14  14 D#3TR4
     I                                       15  15 D#3TR5
     I                                       16  16 D#3CDG
     I*         ( DIE KANBAN )
     ID#BAR4      DS
     I                                        1   1 D#4KSH
     I                                        4   5 D#4KT1
     I                                        6   9 D#4KT2
     I                                       10  10 D#4KT3
     I                                       13  13 D#4CDG
     I*==< WORK >==*
     I*         ( DIE NUMBER : XX-XXXX-X-X )
     I            DS
     I                                        1  11 W@KAT@
     I                                        1   2 W@KAT1
     I                                        3   3 W@KAH2
     I                                        4   7 W@KAT2
     I                                        8   8 W@KAH3
     I                                        9   9 W@KAT3
     I                                       10  10 W@KAH4
     I                                       11  11 W@KAT4
     I*         ( LOCATION : X-XX-XX-X-X )
     I            DS
     I                                        1  11 W@LOC@
     I                                        1   1 W@LOC1
     I                                        2   2 W@LOH2
     I                                        3   4 W@LOC2
     I                                        5   5 W@LOH3
     I                                        6   7 W@LOC3
     I                                        8   8 W@LOH4
     I                                        9   9 W@LOC4
     I                                       10  10 W@LOH5
     I                                       11  11 W@LOC5
     I*
     C*****************************************************
     C*          PARAMETERS LIST                          *
     C*****************************************************
     C*==< ENTRY PARM >==*
     C           *ENTRY    PLIST
     C                     PARM           P@TAC5  5
     C                     PARM           P@TANM 10
     C                     PARM           P@CMD   2
     C                     PARM           P@STS   1
     C*
     C*==< CHKR01 >==*
     C           P@CHK1    PLIST
     C                     PARM           P@BRCD100         BARCODE
     C                     PARM           P@BYTE  3         SIGNIFICANT DIGITS
     C                     PARM           P@CKDG  1         CHECK DIGIT
     C                     PARM           P@RTN1  1         RETURN CODE
     C*
     C*****************************************************
     C*          LEY LIST                                 *
     C*****************************************************
     C*==< ECSPL81 : DIE STORE IN/OUT RESULT FILE >==*
     C           K@CS80    KLIST
     C                     KFLD           K@PBAR 20         PT BARCODE
     C                     KFLD           K@IOKB  1         IN/OUT FLG
     C                     KFLD           K@HNTE  2         JUDGMENT
     C*
     C*==< GCQPL11 : DIE KANBAN M/F >==*
     C           K@CQ11    KLIST
     C                     KFLD           K@TKR1  1         FACTORY
     C                     KFLD           K@TKR2  2         PASSAGE
     C                     KFLD           K@TKR3  2         LINE
     C                     KFLD           K@TKR4  1         STAIR
     C                     KFLD           K@TKR5  1         STAIR
     C                     KFLD           K@KAT1  2         DIE NO.1
     C                     KFLD           K@KAT2  4         DIE NO.2
     C                     KFLD           K@KAT3  1         DIE NO.3
     C           K@CQ12    KLIST
     C                     KFLD           K@TKR1  1         FACTORY
     C                     KFLD           K@TKR2  2         PASSAGE
     C                     KFLD           K@TKR3  2         LINE
     C                     KFLD           K@TKR4  1         STAIR
     C                     KFLD           K@TKR5  1         STAIR
     C                     KFLD           K@KAT1  2         DIE NO.1
     C                     KFLD           K@KAT2  4         DIE NO.2
     C*
     C*
     C*==< ECSPL10 : DIE INVENTORY FILE >==*
     C           K@CS10    KLIST
     C                     KFLD           K@KAT1            DIE#1
     C                     KFLD           K@KAT2                2
     C                     KFLD           K@KAT3                3
     C                     KFLD           K@KAT4  1             4
     C*
     C*****************************************************
     C*          INTERNAL WORKING ITEM                    *
     C*****************************************************
     C                     MOVEL'EDT1'    S@PROC  4
     C                     MOVEL*BLANK    W@DSP9  4
     C                     MOVEL*BLANK    S@1KT1  2
     C                     MOVEL*BLANK    S@1KT2  4
     C                     MOVEL*BLANK    S@1KT3  1
     C                     MOVEL*BLANK    S@1KT4  1
     C*
     C*****************************************************
     C*          MAIN ROUTINE                             *
     C*****************************************************
     C*
D----C           S@PROC    DOWNE'EXIT'
|    C*
|S---C                     SELEC
|+---C           S@PROC    WHEQ 'EDT1'
||   C                     EXSR #EDT1
||   C*
|+---C           S@PROC    WHEQ 'DSP1'
||   C                     EXSR #DSP1
||   C*
|+---C           S@PROC    WHEQ 'CHK1'
||   C                     EXSR #CHK1
||   C*
|+---C           S@PROC    WHEQ 'EDT2'
||   C                     EXSR #EDT2
||   C*
|+---C           S@PROC    WHEQ 'DSP2'
||   C                     EXSR #DSP2
||   C*
|+---C           S@PROC    WHEQ 'CHK2'
||   C                     EXSR #CHK2
||   C*
|+---C           S@PROC    WHEQ 'EDT3'
||   C                     EXSR #EDT3
||   C*
|+---C           S@PROC    WHEQ 'DSP3'
||   C                     EXSR #DSP3
||   C*
|+---C           S@PROC    WHEQ 'CHK3'
||   C                     EXSR #CHK3
||   C*
|+---C           S@PROC    WHEQ 'EDT4'
||   C                     EXSR #EDT4
||   C*
|+---C           S@PROC    WHEQ 'DSP4'
||   C                     EXSR #DSP4
||   C*
|+---C           S@PROC    WHEQ 'CHK4'
||   C                     EXSR #CHK4
||   C*
|+---C           S@PROC    WHEQ 'DATA'
||   C                     EXSR #DATA
||   C*
|E---C                     ENDSL
|    C*
E----C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C*****************************************************
     C*  #EDT1   EDIT SCREEN(1)                           *
     C*****************************************************
     C           #EDT1     BEGSR
     C*
     C*==< INITIALIZE ITEMS >==*
     C                     MOVEL@@WSID    D#WSID
     C                     MOVELP@TANM    D#TANM
     C*
     C                     MOVEL*BLANK    D#BAR1
     C                     MOVEL*BLANK    S@1KT1
     C                     MOVEL*BLANK    S@1KT2
     C                     MOVEL*BLANK    S@1KT3
     C                     MOVEL*BLANK    S@1KT4
     C                     MOVEL*BLANK    D#BAR2
     C                     MOVEL*BLANK    D#BAR3
     C                     MOVEL*BLANK    D#BAR4
     C                     MOVEL*BLANK    D#EMSG
     C*
     C*==< NEXT PROCESSING >==*
     C                     MOVEL'DSP1'    S@PROC
     C*
     C           #EDT1E    ENDSR
     C*****************************************************
     C*  #DSP1   DISPLAY SCREEN(1)                        *
     C*****************************************************
     C           #DSP1     BEGSR
     C*
     C*==< DISPLAY >==*    _____________
     C                     EXFMTECSPW801
     C*                    ~~~~~~~~~~~~~
     C                     TIME           S@TIME
     C*
     C*==< NEXT PROCESSING >==*
S----C                     SELEC
+----C           *IN01     WHEQ '1'                        < F1 >
|    C                     MOVEL'EXIT'    S@PROC
|    C*
+----C           *IN02     WHEQ '1'                        < F2 >
|    C           *IN03     OREQ '1'                        < F3 >
|    C           *IN04     OREQ '1'                        < F4 >
|    C           *IN05     OREQ '1'                        < F5 >
|    C           *IN06     OREQ '1'                        < F6 >
|    C           *IN07     OREQ '1'                        < F7 >
|    C           *IN08     OREQ '1'                        < F8 >
|    C           *IN09     OREQ '1'                        < F9 >
|    C           *IN10     OREQ '1'                        < F10 >
|    C           *IN11     OREQ '1'                        < F11 >
|    C           *IN12     OREQ '1'                        < F12 >
|    C           *IN13     OREQ '1'                        < F13 >
|    C           *IN14     OREQ '1'                        < F14 >
|    C           *IN15     OREQ '1'                        < F15 >
|    C           *IN16     OREQ '1'                        < F16 >
|    C           *IN17     OREQ '1'                        < F17 >
|    C           *IN18     OREQ '1'                        < F18 >
|    C           *IN19     OREQ '1'                        < F19 >
|    C           *IN20     OREQ '1'                        < F20 >
|    C           *IN21     OREQ '1'                        < F21 >
|    C           *IN22     OREQ '1'                        < F22 >
|    C           *IN23     OREQ '1'                        < F23 >
|    C           *IN24     OREQ '1'                        < F24 >
|    C                     MOVEL'DSP1'    S@PROC
|    C*
+----C                     OTHER                           < ENTER >
|    C                     MOVEL'CHK1'    S@PROC
E----C                     ENDSL
     C*
     C           #DSP1E    ENDSR
     C*****************************************************
     C*  #CHK1   CHECK SCREEN(1)                          *
     C*****************************************************
     C           #CHK1     BEGSR
     C*
     C*==< INITIALIZE ITEMS >==*
     C                     MOVEL*BLANK    D#EMSG
     C*
     C*==< PT KANBAN >==*
I----C           D#BAR1    IFEQ *BLANK
|    C                     MOVEL@ER,1     D#EMSG
|    C                     EXSR #DSP9
|    C                     MOVEL'EDT1'    S@PROC
|    C                     GOTO #CHK1E
E----C                     ENDIF
     C*
I----C           D@1FIL    IFNE *BLANK
     C           DNKANR    IFEQ 'Z'
     C* ==> PT KANBAN NEW
     C                     MOVELD#BAR1    P@BRCD    P
     C                     MOVEL'017'     P@BYTE
     C                     MOVEL*LOVAL    P@CKDG
     C                     MOVEL*LOVAL    P@RTN1
     C                     CALL 'CHKR03'  P@CHK1
     C           P@CKDG    IFNE DNBCDG
     C                     MOVEL@ER,2     D#EMSG
     C                     EXSR #DSP9
     C                     MOVEL'EDT1'    S@PROC
     C                     GOTO #CHK1E
     C                     ENDIF
     C*
     C                     MOVELDNKAT1    S@1KT1
     C                     MOVELDNKAT2    S@1KT2
     C                     MOVELDNKAT3    S@1KT4           3 --> 4
     C                     MOVELDNKAT4    S@1KT3           4 --> 3
     C                     ELSE
|    C* ==> PT KANBAN
|    C                     MOVELD#BAR1    P@BRCD    P
|    C                     MOVEL'016'     P@BYTE
|    C                     MOVEL*LOVAL    P@CKDG
|    C                     MOVEL*LOVAL    P@RTN1
|    C                     CALL 'CHKR03'  P@CHK1
|I---C           P@CKDG    IFNE D#1CDG
||   C                     MOVEL@ER,2     D#EMSG
||   C                     EXSR #DSP9
||   C                     MOVEL'EDT1'    S@PROC
||   C                     GOTO #CHK1E
|E---C                     ENDIF
|    C*
|    C                     MOVELD#1KT1    S@1KT1
|    C                     MOVELD#1KT2    S@1KT2
|    C                     MOVELD#1KT3    S@1KT3
|    C                     MOVELD#1KT4    S@1KT4
|    C                     ENDIF
|    C*
+----C                     ELSE
|    C* ==> GENTI KOUNYU KANBAN
|I---C           D@1KT1    IFNE *BLANK
||   C           D@1HF1    ANDEQ'-'
||   C           D@1KT2    ANDNE*BLANK
||   C*                    |
|+---C                     ELSE
||   C                     MOVEL@ER,3     D#EMSG
||   C                     EXSR #DSP9
||   C                     MOVEL'EDT1'    S@PROC
||   C                     GOTO #CHK1E
|E---C                     ENDIF
|    C*
|    C                     MOVELD@1KT1    S@1KT1
|    C                     MOVELD@1KT2    S@1KT2
|    C                     MOVELD@1KT3    S@1KT3
|    C                     MOVELD@1KT4    S@1KT4
E----C                     ENDIF
     C*
     C                     MOVELD#BAR1    K@PBAR            PT BARCODE
     C                     MOVEL'I'       K@IOKB            IN/OUT FLG
     C                     MOVEL'OK'      K@HNTE            JUDGMENT
     C*                    ____________
     C           K@CS80    SETLLECSPL81
     C                     EXSR #CS80
     C*                    ~~~~~~~~~~~~
I----C           *IN91     IFEQ '0'
|    C           D@1HF1    ANDNE'-'
|    C                     MOVEL@ER,4     D#EMSG
|    C                     EXSR #DSP9
|    C                     MOVEL'EDT1'    S@PROC
|    C                     GOTO #CHK1E
E----C                     ENDIF
     C*
     C*==< NEXT PROCESSING >==*
     C                     MOVEL'EDT2'    S@PROC
     C*
     C           #CHK1E    ENDSR
     C*===================================================*
     C*  #CS80   ECSPL81 READE                            *
     C*===================================================*
     C           #CS80     BEGSR
     C*
     C           #CS801    TAG
     C*                    ____________
     C           K@CS80    READEECSPL81                  91
     C*                    ~~~~~~~~~~~~
     C           *IN91     CABEQ'1'       #CS80E
     C*
     C*==< SKIP >==*
I----C           E8SKJY    IFEQ 'D'
|    C           E8SKHZ    ANDLE*DATE
|    C                     GOTO #CS801
E----C                     ENDIF
     C*
I----C           E8GSKB    IFNE 'H'
|    C                     GOTO #CS801
E----C                     ENDIF
     C*
     C           #CS80E    ENDSR
     C*****************************************************
     C*  #EDT2   EDIT SCREEN(2)                           *
     C*****************************************************
     C           #EDT2     BEGSR
     C*
     C*==< INITIALIZE ITEMS >==*
     C                     MOVEL*BLANK    W@KAT@
     C                     MOVELS@1KT1    W@KAT1
     C                     MOVELS@1KT2    W@KAT2
     C                     MOVELS@1KT3    W@KAT3
     C                     MOVELS@1KT4    W@KAT4
I----C           S@1KT2    IFNE *BLANK
|    C                     MOVEL'-'       W@KAH2
E----C                     ENDIF
I----C           S@1KT3    IFNE *BLANK
|    C                     MOVEL'-'       W@KAH3
E----C                     ENDIF
I----C           S@1KT4    IFNE *BLANK
|    C                     MOVEL'-'       W@KAH4
E----C                     ENDIF
     C                     MOVELW@KAT@    D#KAT@
     C*
     C                     MOVEL*BLANK    D#BAR2
     C                     MOVEL*BLANK    D#BAR3
     C                     MOVEL*BLANK    D#BAR4
     C                     MOVEL*BLANK    D#EMSG
     C*
     C*==< NEXT PROCESSING >==*
     C                     MOVEL'DSP2'    S@PROC
     C*
     C           #EDT2E    ENDSR
     C*****************************************************
     C*  #DSP2   DISPLAY SCREEN(2)                        *
     C*****************************************************
     C           #DSP2     BEGSR
     C*
     C*==< DISPLAY >==*    _____________
     C                     EXFMTECSPW802
     C*                    ~~~~~~~~~~~~~
     C                     TIME           S@TIME
     C*
     C*==< NEXT PROCESSING >==*
S----C                     SELEC
+----C           *IN01     WHEQ '1'                        < F1 >
|    C                     MOVEL'EDT1'    S@PROC
|    C*
+----C           *IN02     WHEQ '1'                        < F2 >
|    C           *IN03     OREQ '1'                        < F3 >
|    C           *IN04     OREQ '1'                        < F4 >
|    C           *IN05     OREQ '1'                        < F5 >
|    C           *IN06     OREQ '1'                        < F6 >
|    C           *IN07     OREQ '1'                        < F7 >
|    C           *IN08     OREQ '1'                        < F8 >
|    C           *IN09     OREQ '1'                        < F9 >
|    C           *IN10     OREQ '1'                        < F10 >
|    C           *IN11     OREQ '1'                        < F11 >
|    C           *IN12     OREQ '1'                        < F12 >
|    C           *IN13     OREQ '1'                        < F13 >
|    C           *IN14     OREQ '1'                        < F14 >
|    C           *IN15     OREQ '1'                        < F15 >
|    C           *IN16     OREQ '1'                        < F16 >
|    C           *IN17     OREQ '1'                        < F17 >
|    C           *IN18     OREQ '1'                        < F18 >
|    C           *IN19     OREQ '1'                        < F19 >
|    C           *IN20     OREQ '1'                        < F20 >
|    C           *IN21     OREQ '1'                        < F21 >
|    C           *IN22     OREQ '1'                        < F22 >
|    C           *IN23     OREQ '1'                        < F23 >
|    C           *IN24     OREQ '1'                        < F24 >
|    C                     MOVEL'DSP2'    S@PROC
|    C*
+----C                     OTHER                           < ENTER >
|    C                     MOVEL'CHK2'    S@PROC
E----C                     ENDSL
     C*
     C           #DSP2E    ENDSR
     C*****************************************************
     C*  #CHK2   CHECK SCREEN(2)                          *
     C*****************************************************
     C           #CHK2     BEGSR
     C*
     C*==< INITIALIZE ITEMS >==*
     C                     MOVEL*BLANK    D#EMSG
     C*
     C*==< DIE STORE LABEL >==*
I----C           D#BAR2    IFEQ *BLANK
|    C                     MOVEL@ER,5     D#EMSG
|    C                     EXSR #DSP9
|    C                     MOVEL'EDT2'    S@PROC
|    C                     GOTO #CHK2E
E----C                     ENDIF
     C*
     C                     MOVELD#BAR2    P@BRCD    P
     C                     MOVEL'014'     P@BYTE
     C                     MOVEL*LOVAL    P@CKDG
     C                     MOVEL*LOVAL    P@RTN1
     C                     CALL 'CHKR03'  P@CHK1
I----C           P@CKDG    IFNE D#2CDG
|    C                     MOVEL@ER,6     D#EMSG
|    C                     EXSR #DSP9
|    C                     MOVEL'EDT2'    S@PROC
|    C                     GOTO #CHK2E
E----C                     ENDIF
     C*
I----C           S@1KT1    IFNE D#2KT1                      DIE NO.1
|    C           S@1KT2    ORNE D#2KT2                      DIE NO.2
|    C*          S@1KT3    ORNE D#2KT3                      DIE NO.3
|    C*          S@1KT4    ORNE D#2KT4                      DIE NO.4
|    C                     MOVEL@ER,7     D#EMSG
|    C                     EXSR #DSP9
|    C                     MOVEL'EDT2'    S@PROC
|    C                     GOTO #CHK2E
E----C                     ENDIF
     C*
     C*==< NEXT PROCESSING >==*
     C                     MOVEL'EDT3'    S@PROC
     C*
     C           #CHK2E    ENDSR
     C*****************************************************
     C*  #EDT3   EDIT SCREEN(3)                           *
     C*****************************************************
     C           #EDT3     BEGSR
     C*
     C*==< INITIALIZE ITEMS >==*
     C                     MOVEL*BLANK    D#BAR3
     C                     MOVEL*BLANK    D#BAR4
     C                     MOVEL*BLANK    D#EMSG
     C*
     C*==< NEXT PROCESSING >==*
     C                     MOVEL'DSP3'    S@PROC
     C*
     C           #EDT3E    ENDSR
     C*****************************************************
     C*  #DSP3   DISPLAY SCREEN(3)                        *
     C*****************************************************
     C           #DSP3     BEGSR
     C*
     C*==< DISPLAY >==*    _____________
     C                     EXFMTECSPW803
     C*                    ~~~~~~~~~~~~~
     C                     TIME           S@TIME
     C*
     C*==< NEXT PROCESSING >==*
S----C                     SELEC
+----C           *IN01     WHEQ '1'                        < F1 >
|    C                     MOVEL'EDT2'    S@PROC
|    C*
+----C           *IN02     WHEQ '1'                        < F2 >
|    C           *IN03     OREQ '1'                        < F3 >
|    C           *IN04     OREQ '1'                        < F4 >
|    C           *IN05     OREQ '1'                        < F5 >
|    C           *IN06     OREQ '1'                        < F6 >
|    C           *IN07     OREQ '1'                        < F7 >
|    C           *IN08     OREQ '1'                        < F8 >
|    C           *IN09     OREQ '1'                        < F9 >
|    C           *IN10     OREQ '1'                        < F10 >
|    C           *IN11     OREQ '1'                        < F11 >
|    C           *IN12     OREQ '1'                        < F12 >
|    C           *IN13     OREQ '1'                        < F13 >
|    C           *IN14     OREQ '1'                        < F14 >
|    C           *IN15     OREQ '1'                        < F15 >
|    C           *IN16     OREQ '1'                        < F16 >
|    C           *IN17     OREQ '1'                        < F17 >
|    C           *IN18     OREQ '1'                        < F18 >
|    C           *IN19     OREQ '1'                        < F19 >
|    C           *IN20     OREQ '1'                        < F20 >
|    C           *IN21     OREQ '1'                        < F21 >
|    C           *IN22     OREQ '1'                        < F22 >
|    C           *IN23     OREQ '1'                        < F23 >
|    C           *IN24     OREQ '1'                        < F24 >
|    C                     MOVEL'DSP3'    S@PROC
|    C*
+----C                     OTHER                           < ENTER >
|    C                     MOVEL'CHK3'    S@PROC
E----C                     ENDSL
     C*
     C           #DSP3E    ENDSR
     C*****************************************************
     C*  #CHK3   CHECK SCREEN(3)                          *
     C*****************************************************
     C           #CHK3     BEGSR
     C*
     C*==< INITIALIZE ITEMS >==*
     C                     MOVEL*BLANK    D#EMSG
     C*
     C*==< DIE LOCATION >==*
I----C           D#BAR3    IFEQ *BLANK
|    C                     MOVEL@ER,8     D#EMSG
|    C                     EXSR #DSP9
|    C                     MOVEL'EDT3'    S@PROC
|    C                     GOTO #CHK3E
E----C                     ENDIF
     C*
     C                     MOVELD#BAR3    P@BRCD    P
     C                     MOVEL'015'     P@BYTE
     C                     MOVEL*LOVAL    P@CKDG
     C                     MOVEL*LOVAL    P@RTN1
     C                     CALL 'CHKR03'  P@CHK1
I----C           P@CKDG    IFNE D#3CDG
|    C                     MOVEL@ER,9     D#EMSG
|    C                     EXSR #DSP9
|    C                     MOVEL'EDT3'    S@PROC
|    C                     GOTO #CHK3E
E----C                     ENDIF
     C*
I----C           S@1KT1    IFNE D#3KT1                      DIE NO.1
|    C           S@1KT2    ORNE D#3KT2                      DIE NO.2
|    C*          S@1KT3    ORNE D#3KT3                      DIE NO.3
|    C*          S@1KT4    ORNE D#3KT4                      DIE NO.4
|    C                     MOVEL@ER,10    D#EMSG
|    C                     EXSR #DSP9
|    C                     MOVEL'EDT3'    S@PROC
|    C                     GOTO #CHK3E
E----C                     ENDIF
     C*
     C                     MOVELD#3TR1    K@TKR1            FACTORY
     C                     MOVELD#3TR2    K@TKR2            PASSAGE
     C                     MOVELD#3TR3    K@TKR3            LINE
     C                     MOVELD#3TR4    K@TKR4            STAIR
     C                     MOVELD#3TR5    K@TKR5            STAIR
     C                     MOVELD#3KT1    K@KAT1            DIE NO.1
     C                     MOVELD#3KT2    K@KAT2            DIE NO.2
     C                     MOVELD#3KT3    K@KAT3            DIE NO.3
     C*                    ____________
     C           K@CQ11    SETLLGCQPL11
     C                     EXSR #CQ11
     C*                    ~~~~~~~~~~~~
     C           *IN92     IFEQ '1'
     C           K@CQ12    SETLLGCQPL11
     C                     EXSR #CQ12
     C                     ENDIF
      *
I----C           *IN92     IFEQ '1'
|    C                     MOVEL@ER,11    D#EMSG
|    C                     EXSR #DSP9
|    C                     MOVEL'EDT3'    S@PROC
|    C                     GOTO #CHK3E
E----C                     ENDIF
     C*
     C*==< NEXT PROCESSING >==*
     C                     MOVEL'EDT4'    S@PROC
     C*
     C           #CHK3E    ENDSR
     C*===================================================*
     C*  #CQ11   GCQPL11 READE                            *
     C*===================================================*
     C           #CQ11     BEGSR
     C*
     C           #CQ111    TAG
     C*                    ____________
     C           K@CQ11    READEGCQPL11                  92
     C*                    ~~~~~~~~~~~~
     C           *IN92     CABEQ'1'       #CQ11E
     C*
     C*==< SKIP >==*
I----C           T6SKJY    IFEQ 'D'
|    C           T6SKHZ    ANDLE*DATE
|    C                     GOTO #CQ111
E----C                     ENDIF
     C*
I----C*          T6KSHK    IFNE D#4KSH
|    C*                    GOTO #CQ111
E----C*                    ENDIF
     C*
     C           #CQ11E    ENDSR
     C*===================================================*
     C*  #CQ12   GCQPL11 READE                            *
     C*===================================================*
     C           #CQ12     BEGSR
     C*
     C           #CQ121    TAG
     C*                    ____________
     C           K@CQ12    READEGCQPL11                  92
     C*                    ~~~~~~~~~~~~
     C           *IN92     CABEQ'1'       #CQ12E
     C*
     C*==< SKIP >==*
I----C           T6SKJY    IFEQ 'D'
|    C           T6SKHZ    ANDLE*DATE
|    C                     GOTO #CQ121
E----C                     ENDIF
      *
     C                     SELEC
     C           D#3KT3    WHEQ 'U'
     C           D#3KT3    OREQ '4'
     C           T6KAT3    IFNE 'U'
     C           T6KAT3    ANDNE'4'
     C                     GOTO #CQ121
     C                     ENDIF
     C                     OTHER
     C           T6KAT3    IFEQ 'U'
     C           T6KAT3    OREQ '4'
     C                     GOTO #CQ121
     C                     ENDIF
     C                     ENDSL
      *
     C*
     C           #CQ12E    ENDSR
     C*****************************************************
     C*  #EDT4   EDIT SCREEN(4)                           *
     C*****************************************************
     C           #EDT4     BEGSR
     C*
     C*==< INITIALIZE ITEMS >==*
     C                     MOVEL*BLANK    W@LOC@
     C                     MOVELD#3TR1    W@LOC1
     C                     MOVELD#3TR2    W@LOC2
     C                     MOVELD#3TR3    W@LOC3
     C                     MOVELD#3TR4    W@LOC4
     C                     MOVELD#3TR5    W@LOC5
I----C           D#3TR2    IFNE *BLANK
|    C                     MOVEL'-'       W@LOH2
E----C                     ENDIF
I----C           D#3TR3    IFNE *BLANK
|    C                     MOVEL'-'       W@LOH3
E----C                     ENDIF
I----C           D#3TR4    IFNE *BLANK
|    C                     MOVEL'-'       W@LOH4
E----C                     ENDIF
I----C           D#3TR5    IFNE *BLANK
|    C                     MOVEL'-'       W@LOH5
E----C                     ENDIF
     C                     MOVELW@LOC@    D#LOC@
     C*
     C                     MOVEL*BLANK    D#BAR4
     C                     MOVEL*BLANK    D#EMSG
     C*
     C*==< NEXT PROCESSING >==*
     C                     MOVEL'DSP4'    S@PROC
     C*
     C           #EDT4E    ENDSR
     C*****************************************************
     C*  #DSP4   DISPLAY SCREEN(4)                        *
     C*****************************************************
     C           #DSP4     BEGSR
     C*
     C*==< DISPLAY >==*    _____________
     C                     EXFMTECSPW804
     C*                    ~~~~~~~~~~~~~
     C                     TIME           S@TIME
     C*
     C*==< NEXT PROCESSING >==*
S----C                     SELEC
+----C           *IN01     WHEQ '1'                        < F1 >
|    C                     MOVEL'EDT3'    S@PROC
|    C*
+----C           *IN02     WHEQ '1'                        < F2 >
|    C           *IN03     OREQ '1'                        < F3 >
|    C           *IN04     OREQ '1'                        < F4 >
|    C           *IN05     OREQ '1'                        < F5 >
|    C           *IN06     OREQ '1'                        < F6 >
|    C           *IN07     OREQ '1'                        < F7 >
|    C           *IN08     OREQ '1'                        < F8 >
|    C           *IN09     OREQ '1'                        < F9 >
|    C           *IN10     OREQ '1'                        < F10 >
|    C           *IN11     OREQ '1'                        < F11 >
|    C           *IN12     OREQ '1'                        < F12 >
|    C           *IN13     OREQ '1'                        < F13 >
|    C           *IN14     OREQ '1'                        < F14 >
|    C           *IN15     OREQ '1'                        < F15 >
|    C           *IN16     OREQ '1'                        < F16 >
|    C           *IN17     OREQ '1'                        < F17 >
|    C           *IN18     OREQ '1'                        < F18 >
|    C           *IN19     OREQ '1'                        < F19 >
|    C           *IN20     OREQ '1'                        < F20 >
|    C           *IN21     OREQ '1'                        < F21 >
|    C           *IN22     OREQ '1'                        < F22 >
|    C           *IN23     OREQ '1'                        < F23 >
|    C           *IN24     OREQ '1'                        < F24 >
|    C                     MOVEL'DSP4'    S@PROC
|    C*
+----C                     OTHER                           < ENTER >
|    C                     MOVEL'CHK4'    S@PROC
E----C                     ENDSL
     C*
     C           #DSP4E    ENDSR
     C*****************************************************
     C*  #CHK4   CHECK SCREEN(4)                          *
     C*****************************************************
     C           #CHK4     BEGSR
     C*
     C*==< INITIALIZE ITEMS >==*
     C                     MOVEL*BLANK    D#EMSG
     C*
     C*==< DIE KANBAN >==*
I----C           D#BAR4    IFEQ *BLANK
|    C                     MOVEL@ER,12    D#EMSG
|    C                     EXSR #DSP9
|    C                     MOVEL'EDT4'    S@PROC
|    C                     GOTO #CHK4E
E----C                     ENDIF
     C*
     C                     MOVELD#BAR4    P@BRCD    P
     C                     MOVEL'012'     P@BYTE
     C                     MOVEL*LOVAL    P@CKDG
     C                     MOVEL*LOVAL    P@RTN1
     C                     CALL 'CHKR03'  P@CHK1
I----C           P@CKDG    IFNE D#4CDG
|    C*                    MOVEL@ER,13    D#EMSG
|    C*                    EXSR #DSP9
|    C*                    MOVEL'EDT4'    S@PROC
|    C*                    GOTO #CHK4E
E----C                     ENDIF
     C*
I----C           S@1KT1    IFNE D#4KT1                      DIE NO.1
|    C           S@1KT2    ORNE D#4KT2                      DIE NO.2
|    C*          S@1KT3    ORNE D#4KT3                      DIE NO.3
|    C                     MOVEL@ER,14    D#EMSG
|    C                     EXSR #DSP9
|    C                     MOVEL'EDT4'    S@PROC
|    C                     GOTO #CHK4E
E----C                     ENDIF
     C*
     C*==< NEXT PROCESSING >==*
     C                     MOVEL'DATA'    S@PROC
     C*
     C           #CHK4E    ENDSR
     C*****************************************************
     C*  #DATA   ECSPP80 RECORD OUTPUT                    *
     C*          ECSPP10 RECORD UPDATE                    *
     C*****************************************************
     C           #DATA     BEGSR
     C*
     C*==< ECSPP20 (OK) >==*
     C                     CLEARECSPP201
     C                     Z-ADDS@YMD     E2KDAT
     C                     Z-ADDS@HMS     E2KTIM
     C                     MOVELP@TAC5    E2KOME
     C                     MOVEL'ECSR80'  E2KPGM
     C                     MOVELS@1KT1    E2KAT1
     C                     MOVELS@1KT2    E2KAT2
     C           S@1KT3    IFEQ '4'
     C                     MOVEL'U'       E2KAT3
     C                     ELSE
     C                     MOVELS@1KT3    E2KAT3
     C                     END
     C                     MOVELS@1KT4    E2KAT4
     C                     Z-ADDS@YMD     E2DATE
     C                     MOVEL*BLANK    E2ISNO
     C                     Z-ADDT6SYOS    E2WQTY
     C                     MOVEL'1'       E2WHID
     C*                    _____________
     C                     WRITEECSPP201
     C*                    ~~~~~~~~~~~~~
     C*==< ECSPP80 (OK) >==*
     C                     CLEARECSPL811
     C                     Z-ADD0111      E8BMON            FACTORY CODE
     C                     MOVEL*BLANK    E8KIBN            MACHINE NO
     C                     MOVEL*BLANK    E8RIYU            IN/OUT REASON
     C                     MOVELS@1KT1    E8KAT1            DIE NO.1
     C                     MOVELS@1KT2    E8KAT2            DIE NO.2
     C                     MOVELS@1KT4    E8KAT3            DIE NO.3
     C           S@1KT3    IFEQ 'U'
     C                     MOVEL'4'       E8KAT4            DIE NO.4
     C                     ELSE
     C                     MOVELS@1KT3    E8KAT4            DIE NO.4
     C                     END
     C                     MOVELD#3TR1    E8TKR1            LOCATION (FACTORY)
     C                     MOVELD#3TR2    E8TKR2            LOCATION (PASSAGE)
     C                     MOVELD#3TR4    E8TKR3            LOCATION (LINE)
     C                     MOVELD#3TR3    E8TKR4            LOCATION (STAIR)
     C                     MOVELD#3TR5    E8TKR5            LOCATION (STAIR)
     C                     Z-ADDT6SYOS    E8KOSU            IN/OUT QUANTITY
     C                     MOVEL'I'       E8IOKB            IN/OUT FLG
     C                     MOVEL'H'       E8GSKB            GENERATION SOURCE
     C                     Z-ADDS@YMD     E8IOHZ            IN/OUT DATE
     C                     Z-ADDS@HMS     E8IOJK            IN/OUT TIME
     C                     MOVELP@TAC5    E8IOME            IN/OUT WORKER
     C                     MOVEL*BLANK    E8OREQ            OUT REQUESTER
     C                     MOVEL'OK'      E8HNTE            JUDGMENT
     C                     MOVEL*BLANK    E8EMSG            ERR MSG
     C                     MOVELD#BAR1    E8PBAR            PT BARCODE
     C                     MOVELD#BAR2    E8SBAR            S/OUT LABEL BARCODE
     C                     MOVELD#BAR3    E8LBAR            LOCATION BARCODE
     C                     MOVELD#BAR4    E8DBAR            DIE KANBAN BARCODE
     C*                    _____________
     C                     WRITEECSPL811
     C*                    ~~~~~~~~~~~~~
     C*==< ECSPP10 >==*
     C                     MOVELS@1KT1    K@KAT1            DIE#1
     C                     MOVELS@1KT2    K@KAT2                2
     C           S@1KT3    IFEQ '4'
     C                     MOVEL'U'       K@KAT3                3
     C                     ELSE
     C                     MOVELS@1KT3    K@KAT3                3
     C                     END
     C*                    MOVELS@1KT4    K@KAT4                4
     C                     MOVEL*BLANK    K@KAT4                4
     C*                    ____________
     C           K@CS10    CHAINECSPL10              93
     C*                    ~~~~~~~~~~~~
I----C           *IN93     IFEQ '1'
|    C           *IN93     OREQ '0'
|    C           E1SKJY    ANDEQ'D'
|    C                     CLEARECSPP101
|    C                     MOVELS@1KT1    E1KAT1            DIE#1
|    C                     MOVELS@1KT2    E1KAT2                2
|    C           S@1KT3    IFEQ '4'
|    C                     MOVEL'U'       E1KAT3                3
|    C                     ELSE
|    C                     MOVELS@1KT3    E1KAT3                3
|    C                     END
|    C*--                  MOVELS@1KT4    E1KAT4                4
|    C                     MOVELD#3TR1    E1LOC1            LOCATION 1
|    C                     MOVELD#3TR2    E1LOC2                     2
|    C                     MOVELD#3TR3    E1LOC3                     3
|    C                     MOVELD#3TR4    E1LOC4                     4
E----C                     ENDIF
     C*
     C                     Z-ADDS@YMD     E1KDAT            UPDATE DATE
     C                     Z-ADDS@HMS     E1KTIM            UPDATE TIME
     C                     MOVELP@TAC5    E1KOME            UPDATE USER
     C                     MOVEL@@PGID    E1KPGM            UPDATE PGM
     C                     Z-ADD*DATE     E1INDT            LATEST IN DATE
     C                     ADD  T6SYOS    E1SQTY            CURRENT INVENTORY
     C*                    _____________
     C  N93                UPDATECSPP101
     C   93                WRITEECSPP101
     C*                    ~~~~~~~~~~~~~
     C*==< NEXT PROCESSING >==*
     C                     MOVEL'EDT1'    S@PROC
     C*
     C           #DATAE    ENDSR
     C*****************************************************
     C*  #DSP9   DISPLAY SCREEN(9)                        *
     C*****************************************************
     C           #DSP9     BEGSR
     C*
     C                     MOVEL'DISP'    W@DSP9
     C                     SETON                     99
     C*
D----C           W@DSP9    DOWNE'EXIT'
|    C*==< DISPLAY >==*    _____________
|    C                     EXFMTECSPW809
|    C*                    ~~~~~~~~~~~~~
|    C                     SETOF                     99
|    C*==< PF KEY >==*
|S---C                     SELEC
|+---C           *IN01     WHEQ '1'
||   C                     MOVEL'EXIT'    W@DSP9
|E---C                     ENDSL
E----C                     ENDDO
     C*
     C*==< ECSPP80 (NG) >==*
     C                     CLEARECSPL811
     C                     Z-ADD0111      E8BMON            FACTORY CODE
     C                     MOVEL*BLANK    E8KIBN            MACHINE NO
     C                     MOVEL*BLANK    E8RIYU            IN/OUT REASON
     C                     MOVELS@1KT1    E8KAT1            DIE NO.1
     C                     MOVELS@1KT2    E8KAT2            DIE NO.2
     C                     MOVELS@1KT4    E8KAT3            DIE NO.3
     C           S@1KT3    IFEQ 'U'
     C                     MOVEL'4'       E8KAT4            DIE NO.4
     C                     ELSE
     C                     MOVELS@1KT3    E8KAT4            DIE NO.4
     C                     END
     C                     MOVELD#3TR1    E8TKR1            LOCATION (FACTORY)
     C                     MOVELD#3TR2    E8TKR2            LOCATION (PASSAGE)
     C                     MOVELD#3TR3    E8TKR3            LOCATION (LINE)
     C                     MOVELD#3TR4    E8TKR4            LOCATION (STAIR)
     C                     MOVELD#3TR5    E8TKR5            LOCATION (STAIR)
     C                     Z-ADD*ZERO     E8KOSU            IN/OUT QUANTITY
     C                     MOVEL'I'       E8IOKB            IN/OUT FLG
     C                     MOVEL'H'       E8GSKB            GENERATION SOURCE
     C                     Z-ADDS@YMD     E8IOHZ            IN/OUT DATE
     C                     Z-ADDS@HMS     E8IOJK            IN/OUT TIME
     C                     MOVELP@TAC5    E8IOME            IN/OUT WORKER
     C                     MOVEL*BLANK    E8OREQ            OUT REQUESTER
     C                     MOVEL'NG'      E8HNTE            JUDGMENT
     C                     MOVELD#EMSG    E8EMSG            ERR MSG
     C                     MOVELD#BAR1    E8PBAR            PT BARCODE
     C                     MOVELD#BAR2    E8SBAR            S/OUT LABEL BARCODE
     C                     MOVELD#BAR3    E8LBAR            LOCATION BARCODE
     C                     MOVELD#BAR4    E8DBAR            DIE KANBAN BARCODE
     C*                    _____________
     C                     WRITEECSPL811
     C*                    ~~~~~~~~~~~~~
     C           #DSP9E    ENDSR
     C*
----+-*--1----+----2----+----3----+----4----+----5----+----6
** @ER
E-01 READ ERR (P)
E-02 CHECK DIGIT ERR (P)
E-03 FORMAT IS DIFFERENT
E-04 PT KANBAN DUPLICATE
E-05 READ ERR (O)
E-06 CHECK DIGIT ERR (O)
E-07 DIE PART NO. ERR (O)
E-08 READ ERR (L)
E-09 CHECK DIGIT ERR (L)
E-10 DIE PART NO. ERR (L)
E-11 DIE KANBAN M/F ERR
E-12 READ ERR (D)
E-13 CHECK DIGIT ERR (D)
E-14 DIE PART NO. ERR (D)

