     H            Y.
     F** ECTR22 *******************************************************
     F* INQ DIE OUT DATA   ECQR22 -> ECTR22 2018.09.21
     F*       MAEDA.        2017.10.11               *
     F*****************************************************************
     FECTPW22 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
     FECSPL85 IF  E           K        DISK
     FECSPP70 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
      *
     E                    ER      1  11 65
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I            DS
     I                                        1   80W@DAT1
     I                                        1   40W@YY1
     I                                        5   60W@MM1
     I                                        7   80W@DD1
      *
     I            DS
     I                                        1   80W@DAT2
     I                                        1   40W@YY2
     I                                        5   60W@MM2
     I                                        7   80W@DD2
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1DATE  80
     C                     PARM           P1KAT1  2
     C                     PARM           P1KAT2  4
     C                     PARM           P1BMON  40
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
     C           KEYEC     KLIST
     C                     KFLD           K1KAT1  2
     C                     KFLD           K1KAT2  4
      *
      *----------------------------------------------------*
      * CONTROL                                            *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     C                     MOVELP1BMON    C1KOJO
     C           P1BMON    CHAINFGBPL011             22
     C           *IN22     IFEQ '0'
     C                     MOVELB2SMEI    C1KJNM
     C                     ENDIF
     C                     MOVELP1KAT1    C1KAT
     C           C1KAT     CAT  '-':0     C1KAT
     C           C1KAT     CAT  P1KAT2:0  C1KAT
      * PAST 6 MONTH
     C                     Z-ADDP1DATE    W@DAT2
     C                     Z-ADD99        W@DD2
     C                     Z-ADDW@DAT2    C1DAT2
      *
     C                     Z-ADDP1DATE    W@DAT1
     C                     Z-ADD1         W@DD1
     C                     SUB  5         W@MM1
     C           W@MM1     IFLE 0
     C                     SUB  1         W@YY1
     C                     ADD  12        W@MM1
     C                     ENDIF
     C                     Z-ADDW@DAT1    C1DAT1
      *
     C                     MOVELP1KAT1    K1KAT1
     C                     MOVELP1KAT2    K1KAT2
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * READ                                               *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     C                     SETOF                     8166
     C           KEYEC     SETLLECSPL85
     C           KEYEC     READEECSPL85                  81
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C           KEYEC     READEECSPL85                  81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     MOVE '02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * 1ST.                                               *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C           CTRX      IFEQ 0
     C                     SETON                     72
     C                     SETON                     99
     C                     MOVELER,1      D9ERR
     C                     ELSE
     C                     SETON                     7273
     C                     ENDIF
      *
     C                     WRITEECTPW229
     C                     EXFMTSFLCTL
     C                     SETOF                     7273
     C                     SETOF                     3199
     C                     MOVEL*BLANK    D9ERR
      * F3
     C           *IN03     IFEQ '1'
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           CTRX      IFEQ 0
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
      * ROLLDOWN/PAGEUP *
      *-----------------*
     C           *IN52     IFEQ '1'
     C*                    ADD  1         CTRX
      * 1ST. PAGE
     C           WKPAGE    IFEQ 1
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
     C           *IN81     IFEQ '1'
     C                     SETOF                     81
     C           KEYEC     SETGTECSPL85
     C           KEYEC     REDPEECSPL85                  81
     C                     SUB  1         CTRX
     C                     ENDIF
      *
     C                     ADD  15        CTRX
      *                         L--表示行数
     C                     SETOF                     6627
      *
     C           *IN81     DOWEQ'0'
     C           *IN27     ANDEQ'0'
     C                     EXSR #READP
     C           KEYEC     REDPEECSPL85                  81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXTP
     C                     ENDDO
      *
     C                     Z-ADD0         CTRX    40
      *
     C           *IN81     IFEQ '1'
     C           KEYEC     SETLLECSPL85
     C           KEYEC     READEECSPL85                  81
     C                     ENDIF
      *
     C                     EXSR #CLR
     C                     SETOF                     8166
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C           KEYEC     READEECSPL85                  81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     SUB  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *--------------------*
      * ROLL-UP            *
      *--------------------*
     C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
      *
     C                     EXSR #CLR
      *
     C                     SETOF                     6681
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C           KEYEC     READEECSPL85                  81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     ADD  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * READ                                               *
      *----------------------------------------------------*
     CSR         #READ     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREAD
     C                     ENDIF
      *
     C                     EXSR #EDIT
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     ADD  1         CTRX
     C                     WRITESFL
      *
     C           CTRX      IFEQ 15
     C                     SETON                       66
     C                     ENDIF
      *
     CSR         EREAD     ENDSR
      *----------------------------------------------------*
      * READP                                              *
      *----------------------------------------------------*
     CSR         #READP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREADP
     C                     ENDIF
      *
     C                     SUB  1         CTRX           27
      *
     CSR         EREADP    ENDSR
      *----------------------------------------------------*
      * SELECT DATA                                        *
      *----------------------------------------------------*
     CSR         #SELEC    BEGSR
      *
     C           E8SKJY    IFEQ 'D'
     C           E8SKHZ    ANDLE*DATE
     C                     GOTO ESELEC
     C                     ENDIF
      *
     C           E8IOKB    IFNE 'O'
     C                     GOTO ESELEC
     C                     ENDIF
      *
     C           E8HNTE    IFNE 'OK'
     C                     GOTO ESELEC
     C                     ENDIF
      *
     C           E8IOHZ    IFLT W@DAT1
     C                     GOTO ESELEC
     C                     ENDIF
      *
     C           E8IOHZ    IFGT W@DAT2
     C                     GOTO ESELEC
     C                     ENDIF
      *
     C           E8BMON    IFNE P1BMON
     C                     GOTO ESELEC
     C                     ENDIF
      *
     C                     MOVEL'1'       WKGET
      *
     CSR         ESELEC    ENDSR
      *----------------------------------------------------*
      * CLEAR ITEM                                         *
      *----------------------------------------------------*
     CSR         #CLR      BEGSR
      *
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     SETOF                     7166
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN    40
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
      *
     CSR         ECLR      ENDSR
      *----------------------------------------------------*
      * EDIT ITEM                                          *
      *----------------------------------------------------*
     CSR         #EDIT     BEGSR
      *
     C                     Z-ADDE8IOHZ    S1YOHZ
     C           E8IOJK    DIV  100       S1IOJK
     C*
     C                     MOVEL*BLANK    S1KAT
     C                     MOVELE8KAT1    S1KAT
     C           S1KAT     CAT  '-':0     S1KAT
     C           S1KAT     CAT  E8KAT2:0  S1KAT
     C           E8KAT3    IFNE *BLANK
     C           S1KAT     CAT  '-':0     S1KAT
     C           S1KAT     CAT  E8KAT3:0  S1KAT
     C                     ENDIF
     C           E8KAT4    IFNE *BLANK
     C           S1KAT     CAT  '-':0     S1KAT
     C           S1KAT     CAT  E8KAT4:0  S1KAT
     C                     ENDIF
     C*
     C                     Z-ADDE8KOSU    S1KOSU
     C*
     C                     MOVELE8KIBN    S1KIBN
     C*
     C                     SETOF                     23
     C           E8RIYU    CHAINECSPP701             23
     C           *IN23     IFEQ '0'
     C                     MOVELE7RSNM    S1RESN
     C                     ELSE
     C                     MOVEL*BLANK    S1RESN
     C                     END
     C                     MOVEL*BLANK    S1KOME
     C           E8IOME    CHAINRGAPL111             22
     C           *IN22     IFEQ '0'
     C                     MOVELJ8NAME    S1KOME
     C                     ENDIF
      *
     CSR         EEDIT     ENDSR
      *----------------------------------------------------*
      * NEXT DATA                                          *
      *----------------------------------------------------*
     CSR         #NEXT     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXT
     C                     ENDIF
      *
     C           KEYEC     READEECSPL85                  81
      *
     CSR         ENEXT     ENDSR
      *----------------------------------------------------*
      * PRV DATA                                           *
      *----------------------------------------------------*
     CSR         #NEXTP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXTP
     C                     ENDIF
      *
     C           KEYEC     REDPEECSPL85                  81
      *
     CSR         ENEXTP    ENDSR
     C*----------------------------------------------------------------
**
ER-1 THERE ARE NO DATA.
ER-2 INPUT 'M'.
