     H            Y,
      *** EDIR30 ***********************************
      * USER CUSTOMER CODE DELLVERY CODE DOCK CODE *
      * TO IN-HOUSE CODE CONVERSION                *
      * CODING : K.OKACHI               98.02.09   *
JW1   * JW       2022.03.09 CHG ERROR MSG          *
      **********************************************
     FEDIPW30 CF  E                    WORKSTN
     FEDIPL30 UF  E           K        DISK                      A
     FFGBPL01 IF  E           K        DISK
     E                    ER      1  16 60               ERROR MESSAGE
     E                    TB1     1   3  1   TB2     6
      *
     I            DS
     I                                        1   80E1SKHZ
     I                                        1   40E1SKYY
     I                                        5   60E1SKMM
     I                                        7   80E1SKDD
     I            DS
     I                                        1   80E1KOHZ
     I                                        1   40E1KOYY
     I                                        5   60E1KOMM
     I                                        7   80E1KODD
     I            DS
     I                                        1   60WTIME
     I                                        1   20E1KOHH
     I                                        3   40E1KOSS
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     C           *ENTRY    PLIST
     C                     PARM           USER   10
      **********************
      *  DISPLAY 1 SCREEN  *
      **********************
     C           STEP0     TAG
     C                     MOVE *BLANK    NO
     C                     MOVE *BLANK    SIRE
     C                     MOVE *BLANK    SKOJ
     C                     MOVE *BLANK    SUKE
      *
     C           STEP1     TAG
     C                     EXFMTEDIPW301
     C                     SETOF                     010203
     C                     SETOF                     047799
     C                     MOVE *BLANK    MSG
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
      *
     C           NO        IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STEP1
     C                     END
      *
     C           NO        IFNE '0'
     C           NO        ANDNE'1'
     C           NO        ANDNE'2'
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     GOTO STEP1
     C                     END
      *
     C           SIRE      IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     GOTO STEP1
     C                     END
      *
     C           SKOJ      IFEQ *BLANK
     C                     SETON                     0399
     C                     MOVE ER,4      MSG
     C                     GOTO STEP1
     C                     END
      *
     C**JW1      SUKE      IFEQ *BLANK
     C**                   SETON                     0499
     C**                   MOVE ER,5      MSG
     C**                   GOTO STEP1
     C**                   END
      *
     C                     MOVE *BLANK    TOKU
     C                     MOVE *BLANK    NONY
     C                     MOVE *BLANK    NKOJ
     C                     MOVE *BLANK    NUKE
     C                     SETOF                     50
      *
     C           KEY1      KLIST
     C                     KFLD           SIRE
     C                     KFLD           SKOJ
     C                     KFLD           SUKE
      *
     C           KEY1      CHAINEDIPL301             50
      *
     C           NO        IFEQ '0'
     C           NO        OREQ '1'
     C           *IN50     IFEQ '1'
     C                     SETON                     020304
     C                     SETON                     99
     C                     MOVE ER,10     MSG
     C                     GOTO STEP1
     C                     END
     C           *IN50     IFEQ '0'
     C           E1SKJY    IFEQ 'D'
     C           E1SKHZ    ANDLE*DATE
     C                     SETON                     020304
     C                     SETON                     99
     C                     MOVE ER,11     MSG
     C                     GOTO STEP1
     C                     END
     C                     MOVE E1TOKU    TOKU
     C                     MOVE E1NONY    NONY
     C                     MOVE E1NKOJ    NKOJ
     C                     MOVE E1UKEI    NUKE
     C                     END
     C                     END
      *
     C           NO        IFEQ '0'
     C                     SETON                     77
     C                     END
      *
     C           NO        IFEQ '2'
     C           *IN50     IFEQ '0'
     C           E1SKJY    IFEQ 'D'
     C           E1SKHZ    ANDLE*DATE
     C                     ELSE
     C                     SETON                     020304
     C                     SETON                     99
     C                     MOVE ER,13     MSG
     C                     GOTO STEP1
     C                     END
     C                     END
     C                     END
      **********************
      *  DISPLAY 2 SCREEN  *
      **********************
     C                     Z-ADD1         X       10
     C                     SETOF                     70
     C           NO        LOKUPTB1,X                    70
     C           *IN70     IFEQ '1'
     C                     MOVE TB2,X     KUBN
     C                     END
      *
     C           STEP2     TAG
     C                     EXFMTEDIPW302
     C                     SETOF                     050607
     C                     SETOF                     0899
     C                     MOVE *BLANK    MSG
      *
     C           *INKC     IFEQ '1'
     C                     GOTO STEP0
     C                     ENDIF
      *
     C           TOKU      IFEQ *BLANK
     C                     SETON                     0599
     C                     MOVE ER,6      MSG
     C                     GOTO STEP2
     C                     END
      *
     C           NONY      IFEQ *BLANK
     C                     SETON                     0699
     C                     MOVE ER,7      MSG
     C                     GOTO STEP2
     C                     END
      *
     C           NKOJ      IFEQ *BLANK
     C                     SETON                     0799
     C                     MOVE ER,8      MSG
     C                     GOTO STEP2
     C                     END
      *
     C**JW1      NUKE      IFEQ *BLANK
     C**                   SETON                     0899
     C**                   MOVE ER,9      MSG
     C**                   GOTO STEP2
     C**                   END
      *
     C                     MOVE TOKU      WTOKU   40
     C                     SETOF                     60
     C           WTOKU     CHAINFGBPL01              60
     C           *IN60     IFEQ '1'
     C                     SETON                     0599
     C                     MOVE ER,12     MSG
     C                     GOTO STEP2
     C                     END
     C           *IN60     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     0599
     C                     MOVE ER,11     MSG
     C                     GOTO STEP2
     C                     END
     C                     END
      *
     C                     MOVE NONY      WNONY   40
     C                     SETOF                     60
     C           WNONY     CHAINFGBPL01              60
     C           *IN60     IFEQ '1'
     C                     SETON                     0699
     C                     MOVE ER,14     MSG
     C                     GOTO STEP2
     C                     END
     C           *IN60     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     0699
     C                     MOVE ER,11     MSG
     C                     GOTO STEP2
     C                     END
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     MOVE ER,16     MSG
     C                     GOTO STEP2
     C                     END
      *
     C           NO        IFEQ '0'
     C                     MOVE 'D'       E1SKJY
     C                     Z-ADD*DATE     E1SKHZ
     C                     ELSE
     C                     MOVE ' '       E1SKJY
     C                     Z-ADD0         E1SKHZ
     C                     END
      *
     C           NO        IFEQ '1'
     C           NO        OREQ '2'
     C                     MOVE SIRE      E1SIRE
     C                     MOVE SKOJ      E1SKOJ
     C                     MOVE SUKE      E1SUKE
     C                     MOVE TOKU      E1TOKU
     C                     MOVE NONY      E1NONY
     C                     MOVE NKOJ      E1NKOJ
     C                     MOVE NUKE      E1UKEI
     C                     END
      *
     C                     Z-ADD*DATE     E1KOHZ
     C                     TIME           WTIME
     C                     MOVELUSER      E1KOME
      *
     C           *IN50     IFEQ '0'
     C                     UPDATEDIPL301
     C                     ELSE
     C                     WRITEEDIPL301
     C                     END
      *
     C                     GOTO STEP0
** ER
E-01 ENTER UPDATE CODE !
E-02 UPDATE CODE SHOULD BE 0, 1 OR 2 !
E-03 ENTER SUPPLIER CODE !
E-04 ENTER FACTORY CODE !
E-05 ENTER DOCK CODE !
E-06 ENTER CUSTOMER CODE !
E-07 ENTER DELIVERY CODE !
E-08 ENTER FACTORY CODE !
E-09 ENTER DOCK CODE !
E-10 DATA NOT FOUND !
E-11 DATA WAS ALREADY DELETED !
E-12 CUSTMER NOT FOUND IN MASTER FILE !
E-13 DATA ALREADY EXIST !
E-14 CUSTOMER CODE NOT FOUND !
E-15 DELIVERY CODE NOT FOUND !
PRESS F5 TO UPDATE...
**  TB1(NO)TB2(KUBN)
0CANCEL
1CHANGE
2ADD
