     H            Y.
      ** EDIR80A *********************************************
      *  EDI862 ORDER INQUIRY BY DELIVERY CODE (V.2)         *
      *  J.WATANABE 2024.06.27                               *
      ********************************************************
     FEDIPW80ACF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     FAB#EL4S6IF  E           K        DISK
      ********************************************************
     E                    MSG     1  12 60
      *
     I            DS
     I                                        1   80P8NOHZ
     I                                        1   40P8NOYY
     I                                        5   60P8NOMM
     I                                        7   80P8NODD
      *
     I            DS
     I                                        1   80K#NOHZ
     I                                        1   40K#NOYY
     I                                        5   60K#NOMM
     I                                        7   80K#NODD
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *-----------------------------------------------------------*
      *     M  A  I  N  L  I  N  E      SFL1                      *
      *-----------------------------------------------------------*
      *
     C                     EXSR #INIT
      *
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #DSP1
     C           W@ID      CASEQ'02'      #SFL1
     C                     ENDCS
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *************************************************************
      * DISPLAY 1ST SCREEN
      *************************************************************
     C           #DSP1     BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANKS   XMSG
     C                     MOVE *OFF      *IN85
     C                     MOVE *OFF      *IN41
     C                     MOVE *OFF      *IN42
     C                     MOVE *OFF      *IN43
     C                     MOVE *OFF      *IN44
      * F1/F3: EXIT
     C           *INKA     IFEQ *ON
     C           *INKC     OREQ *ON
     C           *INKL     OREQ *ON
     C                     MOVEL'99'      W@ID
     C                     GOTO XDSP1
     C                     ENDIF
      *
     C                     EXSR #CHK1
      *
     C           *IN85     IFEQ *OFF
     C                     MOVEL'02'      W@ID
     C                     ENDIF
      *
     C           XDSP1     ENDSR
      *************************************************************
      *  CHECK ENTRY DATA
      *************************************************************
     C           #CHK1     BEGSR
      * DELIVERY#
     C           XNONY     IFEQ 0
     C                     MOVELMSG,8     XMSG
     C                     SETON                     4185
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C                     MOVELXNONY     $DLV
     C                     CALL 'UTLR62'
     C                     PARM           $DLV    4
     C                     PARM           $GRP    3
     C                     PARM           $NAME1 15
     C                     PARM           $NAME2 50
     C                     PARM           $RTN    1
     C           $RTN      IFEQ '*'
     C                     MOVELMSG,9     XMSG
     C                     SETON                     4185
     C                     GOTO XCHK1
     C                     ENDIF
     C                     MOVEL$NAME1    XNAME
      * CHECK DATE FROM
     C**         XFROM     IFEQ *BLANK
     C**                   MOVELMSG,6     XMSG
     C**                   SETON                     4185
     C**                   GOTO XCHK1
     C**                   ENDIF
      *
     C           XFROM     IFEQ *BLANK
     C                     MOVELTODAY     XFROM
     C                     ENDIF
      *
     C                     MOVE XFROM     $SRC
     C                     CALL 'UTLR01A'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE1  8
     C                     PARM           $TRUE2 10
     C                     PARM           $RTN    1
     C           $RTN      IFEQ *BLANK
     C                     MOVEL$TRUE1    @FROM   80
     C                     MOVEL$TRUE2    XFROM
     C                     ELSE
     C                     MOVELMSG,1     XMSG
     C                     SETON                     4285
     C                     GOTO XCHK1
     C                     ENDIF
      * CHECK DATE TO
     C           XTO       IFEQ *BLANK
     C                     MOVELXFROM     XTO
     C                     ENDIF
      *
     C           XTO       IFEQ '99999999'
     C                     Z-ADD99999999  @TO     80
     C                     ELSE
     C                     MOVE XTO       $SRC
     C                     CALL 'UTLR01A'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE1  8
     C                     PARM           $TRUE2 10
     C                     PARM           $RTN    1
     C           $RTN      IFEQ *BLANK
     C                     MOVEL$TRUE1    @TO     80
     C                     MOVEL$TRUE2    XTO
     C                     ELSE
     C                     MOVELMSG,2     XMSG
     C                     SETON                     4385
     C                     GOTO XCHK1
     C                     ENDIF
     C                     ENDIF
      *
     C           @FROM     IFGT @TO
     C                     MOVELMSG,3     XMSG
     C                     SETON                     424385
     C                     ENDIF
      * CHECK SHIP DATE
     C           XNOHZ     IFEQ *BLANK
     C                     Z-ADD0         @NOHZ
     C                     ELSE
     C                     MOVE XNOHZ     $SRC
     C                     CALL 'UTLR01A'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE1  8
     C                     PARM           $TRUE2 10
     C                     PARM           $RTN    1
     C           $RTN      IFEQ *BLANK
     C                     MOVEL$TRUE1    @NOHZ
     C                     MOVEL$TRUE2    XNOHZ
     C                     ELSE
     C                     MOVELMSG,10    XMSG
     C                     SETON                     4485
     C                     GOTO XCHK1
     C                     ENDIF
     C                     ENDIF
      * IF NO ERROR -------------------------------------
     C           *IN85     IFEQ *OFF
     C                     EXSR #SET1
      *
     C           RCNT1     IFGT 0
     C                     MOVEL'02'      W@ID
     C                     ELSE
     C                     MOVELMSG,4     XMSG
     C                     SETON                     424385
     C                     ENDIF
     C                     ENDIF
      *
     C           XCHK1     ENDSR
      ************************************************************
      *  SET DATA FOR SFL01
      ************************************************************
     C           #SET1     BEGSR
      *
     C                     MOVE 'Y'       FIRST   1
     C                     Z-ADD0         TSRYO   70
     C                     EXSR #CLRS1
      *
     C                     MOVELXNONY     K#NONY
     C                     Z-ADD@FROM     K#CRDT
     C                     Z-ADD0         K#CRTM
     C           K#40S     SETLLAB#EL4S6
     C                     DO   *HIVAL
     C           K#NONY    READEAB#EL4S6                 97
     C   97                LEAVE
      * END?
     C           ECRDT     IFGT @TO
     C                     LEAVE
     C                     ENDIF
      * IGNORE QTY
     C           ESRYO     IFEQ 0
     C                     ADD  1         ZCNT1
     C                     ITER
     C                     ENDIF
      * IGNORE PART
     C           XMHIN     IFNE *BLANK
     C           XMHIN     ANDNEEMHIN
     C                     ADD  1         ZCNT1
     C                     ITER
     C                     ENDIF
      * IGNORE SHIP DATE
     C           @NOHZ     IFNE 0
     C           @NOHZ     ANDNEENDATE
     C                     ADD  1         ZCNT1
     C                     ITER
     C                     ENDIF
      * BLANK LINE
     C           RRN1      IFNE 0
     C           ECRDT     IFNE SCRDT
     C           ECRTM     ORNE SCRTM
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDIF
     C                     ENDIF
      *
     C                     CLEARSFL01
     C                     Z-ADDECRDT     S1RCHZ
     C                     MOVELECRTM     S1RCTM
     C                     MOVELEMHIN     S1MHIN
     C                     Z-ADDENDATE    S1NOHZ
     C                     Z-ADDENDATE    S1IAHZ
     C                     Z-ADDESRYO     S1QTY
     C                     MOVELEODRN     S1ODRN
      * PAST DUE
     C           S1RCHZ    IFGT S1NOHZ
     C                     MOVE *ON       *IN51
     C                     ELSE
     C                     MOVE *OFF      *IN51
     C                     ENDIF
      *
     C           S1RCHZ    IFGT S1IAHZ
     C                     MOVE *ON       *IN52
     C                     ELSE
     C                     MOVE *OFF      *IN52
     C                     ENDIF
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
      *
     C                     Z-ADDECRDT     SCRDT
     C                     Z-ADDECRTM     SCRTM
      *
     C                     ENDDO
      *
     C                     Z-ADDRRN1      RCNT1
      *
      *
     C                     ENDSR
      ************************************************************
      *  DSPLAY 2ND SCREEN
      ************************************************************
     C           #SFL1     BEGSR
      *
     C                     EXSR #SET1
      *
     C                     WRITEDSP99
     C                     MOVE *ON       *IN70
     C                     EXFMTCTL01
     C                     MOVEL*BLANKS   XMSG
     C                     MOVE *OFF      *IN85
     C                     MOVE *OFF      *IN70
     C                     MOVE *OFF      *IN51
     C                     MOVE *OFF      *IN52
      *
     C                     SELEC
      * F3: EXIT
     C           *INKC     WHEQ *ON
     C                     MOVEL'99'      W@ID
      * F12: BACK
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      W@ID
      * ENTER
     C                     OTHER
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************
      * CLEAR SUB FILE 01
      *************************************************************
     C           #CLRS1    BEGSR
      *
     C                     SETON                     71
     C                     WRITECTL01
     C                     SETOF                     71
     C                     Z-ADD0         RRN1
     C                     Z-ADD0         ZCNT1   60
     C                     Z-ADD0         XCRDT   80
      *
     C                     ENDSR
      *************************************************************
      * INITIAL SETTING
      *************************************************************
     C           #INIT     BEGSR
      *
     C           K#40S     KLIST
     C                     KFLD           K#NONY  4
     C                     KFLD           K#CRDT  80
     C                     KFLD           K#CRTM  60
      *
     C                     TIME           SDATE
     C                     MOVEL*BLANKS   XMSG
     C                     MOVEL'01'      W@ID    2
     C                     MOVELTODAY     XFROM     P
     C                     MOVELTODAY     XTO       P
     C                     Z-ADD0         RRN1    40
     C                     Z-ADD0         RCNT1   40
     C                     Z-ADD0         K#CRTM
     C                     Z-ADD0         @NOHZ   80
     C                     Z-ADD0         SCRDT   80
     C                     Z-ADD0         SCRTM   60
      *
     C                     ENDSR
      *************************************************************
** (ERR) (60A).....2.........3.........4.........5.........6
FROM_DATE IS INCORRECT !                                     01
TO_DATE IS INCORRECT !                                       02
FROM_DATE > TO_DATE !                                        03
NO DATA FOUND !                                              04
PRESS F5 TO PROCESS...                                       05
ENTER FROM_DATE !                                            06
ENTER TO_DATE !                                              07
ENTER DELIVERY CODE!                                         08
DELIVERY CODE NOT FOUND IN MASTER!                           09
SHIP DATE IS INCORRECT !                                     10
                                                             11
                                                             12
