     H            Y/                                    1
     H** EDIR63 *******************************************************
     H*  EVENT NAME MAINTENANCE                                       *
     H*  JW   2019.08.23                                              *
JW1  H*  JW   2020.01.15 CHG AB#PP12 TO AB#PLA5                       *
     H*****************************************************************
     FEDIPW63 CF  E                    WORKSTN      KINFDS INFDS
     F                                        RRN1  KSFILE SFL01
     FAB#PL1O IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     F**AB#PP12 UF  E           K        DISK                      A
JW1  FAB#PLA5 UF  E           K        DISK
      *================================================================
     E                    MSG     1  10 70
      *================================================================
      * RENAME FIELDS
     IAB#PLA51    01
     I              BASKJY                          XASKJY
     I              BASKHZ                          XASKHZ
     I              BASKYY                          XASKYY
     I              BASKMM                          XASKMM
     I              BASKDD                          XASKDD
     I              BASKTM                          XASKTM
     I              BASKME                          XASKME
     I              BASKPG                          XASKPG
     I              BAKOHZ                          XAKOHZ
     I              BAKOYY                          XAKOYY
     I              BAKOMM                          XAKOMM
     I              BAKODD                          XAKODD
     I              BAKOHH                          XAKOHH
     I              BAKOSS                          XAKOSS
     I              BAKOME                          XAKOME
     I              BANOPG                          XANOPG
     I              BASIRE                          XASIRE
     I              BASIRK                          XASIRK
     I              BATOKU                          XATOKU
     I              BANONY                          XANONY
     I              BANKOJ                          XANKOJ
     I              BANUKE                          XANUKE
     I              BASBAN                          XASBAN
     I              BAMHIN                          XAMHIN
     I              BAMHN1                          XAMHN1
     I              BAMHN2                          XAMHN2
     I              BAMHN3                          XAMHN3
     I              BAMHN4                          XAMHN4
     I              BASHIN                          XASHIN
     I              BASHN1                          XASHN1
     I              BASHN2                          XASHN2
     I              BASHN3                          XASHN3
     I              BANOHZ                          XANOHZ
     I              BANOYY                          XANOYY
     I              BANOMM                          XANOMM
     I              BANODD                          XANODD
     I              BANOTM                          XANOTM
     I              BAINVN                          XAINVN
     I              BAODRN                          XAODRN
     I              BASRYO                          XASRYO
     I              BASYOS                          XASYOS
     I              BATANK                          XATANK
     I              BAURHZ                          XAURHZ
     I              BAURYY                          XAURYY
     I              BAURMM                          XAURMM
     I              BAURDD                          XAURDD
     I              BAURTM                          XAURTM
     I              BAURME                          XAURME
     I              BAURPG                          XAURPG
     I              BACARD                          XACARD
     I              BARCOD                          XARCOD
     I              BAALFL                          XAALFL
     I              BANOBN                          XANOBN
     I              BAUSYS                          XAUSYS
     I              BAODER                          XAODER
     I              BAHENK                          XAHENK
     I              BAJYKB                          XAJYKB
     I              BAEDIK                          XAEDIK
     I              BARESE                          XARESE
     I              BADEYY                          XADEYY
     I              BADEMM                          XADEMM
     I              BADEDD                          XADEDD
     I              BAPGID                          XAPGID
      *
     I              BAPAL#                          XAPAL#
     I              BAPALT                          XAPALT
     I              BAPLNT                          XAPLNT
     I              BAEDII                          XAEDII
     I              BASHCD                          XASHCD
     I              BAREVN                          XAREVN
     I              BACTTP                          XACTTP
     I              BAORD#                          XAORD#
     I              BACRHZ                          XACRHZ
     I              BACRTM                          XACRTM
     I              BACRME                          XACRME
     I              BACRPG                          XACRPG
      *
     I              BAFLG1                          XAFLG1
     I              BADAT1                          XADAT1
     I              BAFLD1                          XAFLD1
     I              BAFLD2                          XAFLD2
      *
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
     I            DS
     I                                        1  140@TIME
     I                                        1   60@NOW
     I                                        1   20@NOWHH
     I                                        3   40@NOWSS
     I                                        7  140@TODAY
      *
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
      *
     I            DS
     I                                        1   80@NOHZ
     I                                        1   40@NOYY
     I                                        5   60@NOMM
     I                                        7   80@NODD
      *
     I            DS
     I                                        1   80K@NOHZ
     I                                        1   40K@NOYY
     I                                        5   60K@NOMM
     I                                        7   80K@NODD
      *
     I           SDS
     I                                     *PROGRAM #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *===============================================================
      *  START  PROGRAM
      *===============================================================
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C           @STEP     CASEQ'#CHK1   '#CHK1
     C           @STEP     CASEQ'#CHK1 F5'#CHK1
     C           @STEP     CASEQ'#DSP2   '#DSP2
     C           @STEP     CASEQ'#UPD1   '#UPD1
      * -----------------------------------------
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      *  DISPLAY 1ST SCREEN - CHANE PLANT CODE
      *===============================================================
     C           #DSP1     BEGSR
     C*
     C                     TIME           @TIME
     C                     EXFMTDSP01
     C                     SETOF                     85
     C                     SETOF                     414243
     C                     MOVE *BLANK    XMSG
     C*
     C                     SELEC
     C*  < F1 >  END
     C           *INKA     WHEQ *ON
     C                     MOVE *BLANK    XMSG
     C                     MOVE '#END    '@STEP
     C*  < F5 >  UPDAT
     C           *INKE     WHEQ *ON
     C                     MOVE '#CHK1 F5'@STEP
     C*  < F12 > INQ
     C           *INKL     WHEQ *ON
     C                     CALL 'EDIR64'
     C                     PARM           $EVNT
     C                     MOVE '#CHK1   '@STEP
     C*  < ENTR > CHECK
     C                     OTHER
     C                     MOVE '#CHK1   '@STEP
     C                     ENDSL
     C*
     C                     ENDSR
      *===============================================================
      * CHECK SCREEN1 DATA
      *===============================================================
     C           #CHK1     BEGSR
      *
     C           XTOKU     IFEQ 0
     C                     SETON                     85  41
     C                     MOVELMSG,1     XMSG
     C                     GOTO @CHK1Z
     C                     ENDIF
      *
     C           XTOKU     CHAINFGBPL01              99
     C           *IN99     IFEQ *ON
     C                     SETON                     85  41
     C                     MOVELMSG,6     XMSG
     C                     GOTO @CHK1Z
     C                     ENDIF
      *
     C           XNONY     IFEQ 0
     C                     SETON                     85  42
     C                     MOVELMSG,2     XMSG
     C                     GOTO @CHK1Z
     C                     ENDIF
      *
     C           XNONY     CHAINFGBPL01              99
     C           *IN99     IFEQ *ON
     C                     SETON                     85  42
     C                     MOVELMSG,7     XMSG
     C                     GOTO @CHK1Z
     C                     ENDIF
      *
     C           XSHDT     IFEQ *BLANK
     C                     SETON                     85  43
     C                     MOVELMSG,3     XMSG
     C                     GOTO @CHK1Z
     C                     ENDIF
      * DATE VALIDATION
     C                     MOVELXSHDT     $SRC
     C                     CALL 'UTLR01'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE   8
     C                     PARM           $RTN    1
     C           $RTN      IFNE *BLANK
     C                     SETON                     85  43
     C                     MOVELMSG,5     XMSG
     C                     GOTO @CHK1Z
     C                     ELSE
     C                     MOVEL$TRUE     @NOHZ
     C                     MOVEL$TRUE     XNOHZ
     C                     MOVEL$TRUE     XSHDT     P
     C                     ENDIF
      * CLEAR SUB FILE
     C           @STEP     IFEQ '#CHK1 F5'
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
     C                     ENDIF
      * READ ORDER DATA
     C                     Z-ADD0         RRN1
     C                     Z-ADD0         ENDRRN  40
     C                     Z-ADDXTOKU     KTOKU
     C                     Z-ADDXNONY     KNONY
     C                     Z-ADD@NOYY     KNOYY
     C                     Z-ADD@NOMM     KNOMM
     C                     Z-ADD@NODD     KNODD
     C           K@PP10    SETLLAB#PL1O
     C                     DO   *HIVAL
     C           K@PP10    READEAB#PL1O                  90
     C   90                LEAVE
      *
     C           BASKJY    IFEQ 'D'
     C           BANONY    ORNE XNONY
     C                     ITER
     C                     ENDIF
      *
     C           XNKOJ     IFNE *BLANK
     C           XNKOJ     ANDNEBANKOJ
     C                     ITER
     C                     ENDIF
      *
     C           XNUKE     IFNE *BLANK
     C           XNUKE     ANDNEBANUKE
     C                     ITER
     C                     ENDIF
      *
     C           XBIN      IFNE 0
     C           XBIN      ANDGTBANOBN
     C                     ITER
     C                     ENDIF
      *
     C           XODRN     IFNE *BLANK
     C           XODRN     ANDNEBAODRN
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         RRN1
      * WRITE SUB FILE
     C           @STEP     IFEQ '#CHK1 F5'
     C                     EXSR #SFSET
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           RRN1      IFEQ 0
     C                     SETON                     85
     C                     MOVELMSG,4     XMSG
     C                     GOTO @CHK1Z
     C                     ENDIF
      *
     C                     Z-ADDRRN1      ENDRRN
     C                     Z-ADD1         RRN1
      *
     C*-------------------------
     C           @CHK1Z    TAG
     C*-------------------------
     C           *IN85     IFEQ *OFF
     C           @STEP     IFEQ '#CHK1 F5'
     C                     MOVE *BLANK    XMSG
     C                     MOVEL'#DSP2   '@STEP
     C                     ELSE
     C                     MOVELMSG,8     XMSG
     C                     MOVEL'#DSP1   '@STEP
     C                     ENDIF
     C                     ELSE
     C                     MOVEL'#DSP1   '@STEP
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      *  WRITE SUB FILE
      *===============================================================
     C           #SFSET    BEGSR
      *
     C                     CLEARSFL01
     C                     Z-ADDRRN1      S1SEQ
     C                     MOVELBANKOJ    S1NKOJ
     C                     MOVELBANUKE    S1NUKE
     C                     Z-ADDBANOBN    S1BIN
     C                     MOVELBAODRN    S1ODRN
     C                     MOVELBAMHN1    S1MHN1
     C                     MOVELBAMHN2    S1MHN2
     C                     MOVELBAMHN3    S1MHN3
     C                     Z-ADDBASRYO    S1SRYO
      * GET EVENT NAME
     C                     Z-ADDBATOKU    K@TOKU
     C                     Z-ADDBANONY    K@NONY
     C                     MOVELBANKOJ    K@NKOJ
     C                     MOVELBANUKE    K@NUKE
     C                     MOVELBAMHN1    K@MHN1
     C                     MOVELBAMHN2    K@MHN2
     C                     MOVELBAMHN3    K@MHN3
     C                     MOVE *BLANK    K@MHN4
     C                     MOVELBAODRN    K@ODRN
     C                     Z-ADDBANOHZ    K@NOHZ
     C                     Z-ADDBANOBN    K@NOBN
     C           K@PP12    CHAINAB#PLA5              98
     C           *IN98     IFEQ *OFF
     C                     Z-ADDXACRHZ    S1CRHZ
     C                     MOVELXAFLD1    S1EVNT
     C                     ELSE
     C                     Z-ADD0         S1CRHZ
     C                     MOVE *BLANK    S1EVNT
     C                     ENDIF
      *
     C                     WRITESFL01
      *
     C                     ENDSR
      *===============================================================
      *  DISPLAY SECOND SCREEN
      *===============================================================
     C           #DSP2     BEGSR
      *
     C                     SETON                     70
     C                     SETON                     71
     C                     MOVELMSG,10    XCMD
     C                     WRITEDSP99
     C                     EXFMTCTL01
     C                     SETOF                     7071
     C                     Z-ADD$$RRN     RRN1
     C                     MOVE *BLANK    XMSG
     C*----------
     C                     SELEC
     C* < F3 > END
     C           *INKC     WHEQ *ON
     C                     MOVE '#DSP1   '@STEP
     C* < F5 > UPDATE
     C           *INKE     WHEQ *ON
     C                     MOVE '#UPD1   '@STEP
     C* < PAGE UP/DOWN >
     C           *IN73     WHEQ *ON
     C           *IN73     OREQ *ON
      * < ENTER >
     C                     OTHER
     C                     MOVELMSG,8     XMSG
     C                     MOVE '#DSP2   '@STEP
     C                     ENDSL
      *
     C                     ENDSR
      *===============================================================
      *  UPDATE
      *===============================================================
     C           #UPD1     BEGSR
      *
     C                     Z-ADD0         RRN1
      *
     C                     DO   *HIVAL
     C                     ADD  1         RRN1
     C           RRN1      CHAINSFL01                99
     C   99                LEAVE
      *
     C                     Z-ADDXTOKU     K@TOKU
     C                     Z-ADDXNONY     K@NONY
     C                     MOVELS1NKOJ    K@NKOJ
     C                     MOVELS1NUKE    K@NUKE
     C                     MOVELS1MHN1    K@MHN1
     C                     MOVELS1MHN2    K@MHN2
     C                     MOVELS1MHN3    K@MHN3
     C                     MOVE *BLANK    K@MHN4
     C                     MOVELS1ODRN    K@ODRN
     C                     Z-ADDXNOHZ     K@NOHZ
     C                     Z-ADDS1BIN     K@NOBN
     C           K@PP12    CHAINAB#PLA5              98
     C           *IN98     IFEQ *OFF
     C                     Z-ADD@TODAY    XAKOHZ
     C                     Z-ADD@NOWHH    XAKOHH
     C                     Z-ADD@NOWSS    XAKOSS
     C                     MOVEL#USER     XAKOME
     C                     MOVEL#PGM      XANOPG
     C                     MOVELS1EVNT    XAFLD1
     C                     UPDATAB#PLA51
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVEL'#DSP1   '@STEP
      *
     C                     ENDSR
      *===============================================================
      *   << INIT >>
      *===============================================================
     C           #INIT     BEGSR
      *
     C           K@PP10    KLIST
     C                     KFLD           KTOKU   40
     C                     KFLD           KNONY   40
     C                     KFLD           KNOYY   40
     C                     KFLD           KNOMM   20
     C                     KFLD           KNODD   20
      *
     C           K@PP12    KLIST
     C                     KFLD           K@TOKU  40
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
     C                     KFLD           K@ODRN 10
     C                     KFLD           K@NOYY  40
     C                     KFLD           K@NOMM  20
     C                     KFLD           K@NODD  20
     C                     KFLD           K@NOBN  20
      *
     C                     MOVE *BLANK    XNKOJ
     C                     MOVE *BLANK    XNUKE
     C                     MOVE *BLANK    XMSG
     C                     MOVE '#DSP1   '@STEP
     C                     MOVE *BLANK    $EVNT  10
      *
     C                     ENDSR
**  MSG -------------------------------------------------------------> (70)
ENTER CUSTOMER CODE !                                                   01
ENTER DELIVERY CODE !                                                   02
ENTER SHIP DATE !                                                       03
THERE IS NO DATA !                                                      04
INVALID DATE !                                                          05
CUST# NOT FOUND IN MASTER FILE !                                        06
DELIV# NOT FOUND IN MASTER FILE !                                       07
PRESS F5 TO PROCESS...                                                  08
                                                                        09
F3:BACK   F5:UPDATE                                                     10
