     H            Y/                                    1
     H** EDIR75 *******************************************************
     H*  UPDATE TTAI LOCATION TABLE                                   *
     H*  RUN IN VJBC71  (JOB SCHEDULE  05:45 AM)                      *
     H*  RUN IN VJBC72  (JOB SCHEDULE  16:30 PM)                      *
     H*  JW  2020.12.11                                               *
     H*****************************************************************
     FAB#PLA1 IF  E           K        DISK
     FEDIPP46 UF  E           K        DISK                      A
      *================================================================
     E                    CHR        20  1
     I            DS
     I                                        1  140@TIME
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I           SDS
     I                                     *PROGRAM #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I                                      264 269 #JBNO
     C*===============================================================
     C*  MAIN PROGRAM
     C*===============================================================
     C                     EXSR #INIT
     C*
     C           @@DAT3    SETLLAB#PLA1
     C                     DO   *HIVAL
     C                     READ AB#PLA1                  90
     C   90                LEAVE
      *
     C           BASKJY    IFEQ 'D'
     C           BAPGID    OREQ *BLANK
     C           BANONY    ORNE 3556
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELBANONY    K#NONY
     C                     MOVELBAMHIN    K#MHIN
     C           K#PP46    CHAINEDIPP46              99
      *
     C           *IN99     IFEQ *OFF
     C           BAPGID    IFEQ E6LOC
     C                     ITER
     C                     ELSE
     C                     MOVELBAPGID    E6LOC
     C                     Z-ADDTODAY     E6KOHZ
     C                     Z-ADDNOW       E6KOTM
     C                     MOVEL#USER     E6KOME
     C                     MOVEL#PGM      E6KOPG
     C                     UPDATEDIPP461
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN99     IFEQ *ON
     C                     CLEAREDIPP461
     C                     Z-ADDBANONY    E6NONY
     C                     MOVELBAMHIN    E6MHIN
     C                     MOVELBAPGID    E6LOC
     C                     Z-ADDTODAY     E6CRHZ
     C                     Z-ADDNOW       E6CRTM
     C                     MOVEL#USER     E6CRME
     C                     MOVEL#PGM      E6CRPG
     C                     WRITEEDIPP461
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C*   << INIT >>
     C*===============================================================
     C           #INIT     BEGSR
      *
     C           K#PP46    KLIST
     C                     KFLD           K#NONY  40
     C                     KFLD           K#MHIN 20
      *
     C                     TIME           @TIME
      * 3 DAYS BACK
     C                     MOVELTODAY     $DT8
     C                     MOVE '-'       $SIGN
     C                     MOVEL'0003'    $DAYS
     C                     MOVE 'Y'       $IAF
     C                     CALL 'UTLR10'
     C                     PARM           $DT8    8
     C                     PARM           $SIGN   1
     C                     PARM           $DAYS   4
     C                     PARM           $IAF    1
     C                     PARM           $TGT8   8
     C                     PARM           $RTN    1
     C                     MOVEL$TGT8     @@DAT3  80
      *
     C                     ENDSR
      *===============================================================
