     H            Y/                                    1
     H* EDIR54 ********************************************************
     H* CUSTOMER GROUP CODE MAINTENANCE (SORTING)                     *
     H*
     H* J.WATANABE  2017.09.06                                        *
     H*****************************************************************
     FEDIPW54 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     FEDIPP43 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FEDIPL44 UF  E           K        DISK
      *================================================================
     E                    MSG     1  20 60
      *================================================================
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
     I            DS
     I                                        1  140@TIME
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I            DS
     I                                        1   80E4KOHZ
     I                                        1   40E4KOYY
     I                                        5   60E4KOMM
     I                                        7   80E4KODD
      *
     I            DS
     I                                        1   40E4KOTM
     I                                        1   20E4KOHH
     I                                        3   40E4KOSS
      *
     I           SDS
     I                                     *PROGRAM W@PGM
     I                                      244 253 W@WSID
     I                                      254 263 W@USER
     I                                      264 269 W@JBNO
      *===============================================================
      *  START  PROGRAM
      *===============================================================
     C                     EXSR #INIT
      *
     C           @STP1     DOUEQ'END'
      *  DISPLAY (DSP01)
     C                     EXFMTDSP01
     C                     MOVEA'00000000'*IN,21
     C                     MOVE *OFF      *IN85
     C                     MOVE *BLANK    D1MSG
      *
     C                     SELEC
     C*  < F1 >  END JOB
     C           *INKA     WHEQ *ON
     C                     MOVE 'END'     @STP1
      *
     C*  < F5  >  UPDATE
     C           *INKE     WHEQ *ON
     C                     EXSR #CHK1
     C           *IN85     IFEQ *OFF
     C                     EXSR #DSP2
     C                     ENDIF
      *
     C** < F10 > CREATE CAPACITY CHECK DATA
     C**         *INKJ     WHEQ *ON
     C**                   CALL 'AAFCS0'
      *
      *  < F12 >  GROUP/DELIVERY INQUIRY
     C           *INKL     WHEQ *ON
     C                     MOVE *BLANK    P@GRP
     C                     MOVE '2'       P@TYP            GROUP=SORT
     C                     CALL 'EDIR52'
     C                     PARM           P@GRP   3
     C                     PARM           P@TYP   1
     C           P@GRP     IFNE *BLANK
     C                     MOVELP@GRP     D2GRP
     C                     ENDIF
      *
      *  < ENTR >
     C                     OTHER
     C                     EXSR #CHK1
      *
     C                     ENDSL
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      * CHECK SCREEN 1
      *===============================================================
     C           #CHK1     BEGSR
     C                     MOVE *BLANK    D1NONN
     C                     MOVE *OFF      *IN85
     C*--------------------
     C* D1NONY (21)
     C*--------------------
     C           D1NONY    IFEQ 0
     C                     SETON                     2185
     C                     MOVELMSG,3     D1MSG
     C                     GOTO #CHK1X
     C                     ENDIF
      *
     C           D1NONY    CHAINEDIPL44             N90
     C           *IN90     IFEQ *ON
     C           *IN90     OREQ *OFF
     C           E4SKJY    ANDEQ'D'
     C                     SETON                     2185
     C                     MOVELMSG,5     D1MSG
     C                     GOTO #CHK1X
     C                     ENDIF
      * IF NO ERROR
     C           *IN85     IFEQ *OFF
     C           D1NONY    CHAINFGBPL01              90
     C           *IN90     IFEQ *OFF
     C                     MOVELB2SMEI    D1NONN
     C                     MOVELMSG,6     D1MSG
     C                     MOVELE4GRP2    D2GRP
     C           D2GRP     CHAINEDIPP43              91
     C           *IN91     IFEQ *OFF
     C                     MOVELE3GPNM    D2GRPN
     C                     ELSE
     C                     MOVE *BLANK    D2GRPN
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C           #CHK1X    ENDSR
      *===============================================================
      * DISPLAY SCREEN 2
      *===============================================================
     C           #DSP2     BEGSR
     C                     MOVE *BLANK    @STP2
      *
     C           @STP2     DOUEQ'END'
      *  DISPLAY (DSP02)
     C                     EXFMTDSP02
     C                     MOVEA'00000000'*IN,21
     C                     MOVE *OFF      *IN86
     C                     MOVE *BLANK    D2MSG
      *
     C                     SELEC
     C*  < F3 >  END JOB
     C           *INKC     WHEQ *ON
     C                     MOVE 'END'     @STP2
     C                     MOVE *BLANK    D1MSG
      *
     C*  < F5  >  UPDATE
     C           *INKE     WHEQ *ON
     C                     EXSR #CHK2
     C           *IN86     IFEQ *OFF
     C                     EXSR #UPDAT
     C                     MOVE 'END'     @STP2
     C                     MOVE *BLANK    D1MSG
     C                     ENDIF
      *
     C*  < F7  >  GROUP CODE MAINTENANCE
     C           *INKG     WHEQ *ON
     C                     MOVE *BLANK    P@GRP
     C                     MOVE '2'       P@TYP            GROUP=SORT
     C                     CALL 'EDIC50'
     C                     PARM           P@TYP
      *
      *  < F12 >  GROUP CODE INQUIRY
     C           *INKL     WHEQ *ON
     C                     MOVE *BLANK    P@GRP
     C                     CALL 'EDIR51'
     C                     PARM           P@GRP   3
      *  < ENTR >
     C                     OTHER
     C                     EXSR #CHK2
      *
     C                     ENDSL
     C                     ENDDO
      *
      *
     C           #DSP2X    ENDSR
      *===============================================================
      * CHECK SCREEN 2
      *===============================================================
     C           #CHK2     BEGSR
     C                     MOVE *BLANK    D2GRPN
     C                     MOVE *OFF      *IN86
     C*--------------------
     C* D1GRP  (22)
     C*--------------------
     C           D2GRP     IFEQ *BLANK
     C                     MOVE *BLANK    D2GRPN
     C                     MOVELMSG,7     D2MSG
     C                     GOTO #CHK2X
     C                     ENDIF
     C*
     C           D2GRP     CHAINEDIPP43              90
     C           *IN90     IFEQ *ON
     C           *IN90     OREQ *OFF
     C           E3SKJY    ANDEQ'D'
     C                     SETON                     2286
     C                     MOVELMSG,4     D2MSG
     C                     MOVEL'???'     D2GRPN    P
     C                     GOTO #CHK2X
     C                     ENDIF
      * IF NO ERROR
     C           *IN86     IFEQ *OFF
     C                     MOVELE3GPNM    D2GRPN
     C                     MOVELMSG,7     D2MSG
     C                     ENDIF
      *
     C           #CHK2X    ENDSR
      *===============================================================
      *  UPDATE PROCESS
      *===============================================================
     C           #UPDAT    BEGSR
     C*
     C           D1NONY    CHAINEDIPL44              99
     C           *IN99     IFEQ *OFF                       0-CANCEL
     C                     Z-ADDTODAY     E4KOHZ           UPD DATE
     C                     MOVELNOW       E4KOTM           UPD TIME
     C                     MOVELW@USER    E4KOME           UPD USER
     C                     MOVELW@PGM     E4KOPG           UPD PROGRAM
     C                     MOVELD2GRP     E4GRP2
     C                     UPDATEDIPP421
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      *   << INIT >>
      *===============================================================
     C           #INIT     BEGSR
     C                     TIME           @TIME
     C                     MOVEA*ALL'0'   *IN
     C                     MOVE *BLANK    D2GRP
     C                     Z-ADD0         D1NONY
     C                     MOVE *BLANK    D2GRPN
     C                     MOVE *BLANK    D1NONN
     C                     MOVE *BLANK    D1MSG
     C                     MOVE *BLANK    @STP1   3
     C                     MOVE *BLANK    @STP2   3
     C                     ENDSR
      *===============================================================
**  MSG
ERROR: ENTER 0, 1 OR 2 FOR UPDATING!                         01
ERROR: ENTER GROUP CODE!                                     02
ERROR: ENTER DELIVERY CODE!                                  03
ERROR: GROUP CODE NOT FOUND!                                 04
ERROR: DELIVERY CODE NOT FOUND!                              05
MSG: PRESS F5 TO CONTINUE, OR PRESS F1 TO EXIT               06
MSG: PRESS F5 TO UPDATE, OR PRESS F3 TO GO BACK              07
                                                             08
                                                             09
                                                             10
