     H            Y/                                    1
     H** EDIR75C ******************************************************
     H*  TTAI LOCATION TABLE INQUIRY                                  *
     H*  JW  2020.12.11                                               *
     F*---------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'EDIR75C'
     F*                    PARM           $NONY   40
     F*                    PARM           $MHIN  20
     H*****************************************************************
     FEDIPW75BCF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN1  KSFILE SFL01
     FEDIPP46 IF  E           K        DISK
      *================================================================
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
     I            DS
     I                                        1  140@TIME
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I           SDS
     I                                     *PROGRAM #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I                                      264 269 #JBNO
     C*===============================================================
     C*  START  PROGRAM
     C*===============================================================
     C                     EXSR #INIT
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      *   DISPLAY SCREEN 1
      *===============================================================
     C           #DSP1     BEGSR
     C*
     C                     SETON                     70
     C           ENDRRN    IFNE 0
     C                     SETON                     71
     C                     ENDIF
     C                     WRITEDSP99
     C                     EXFMTCTL01
     C                     SETOF                     707199
     C                     Z-ADD$$RRN     RRN1
     C*----------
     C                     SELEC
     C* < F3 > END
     C           *INKA     WHEQ *ON
     C           *INKC     OREQ *ON
     C           $RRN      IFNE 0
     C           $RRN      CHAINSFL01                95
     C           *IN95     IFEQ *OFF
     C                     MOVELS1MHN1    P@MHN1
     C                     MOVELS1MHN2    P@MHN2
     C                     MOVELS1MHN3    P@MHN3
     C                     MOVELS1MHN4    P@MHN4
     C                     MOVELS1NONY    P@NONY
     C                     ENDIF
     C                     ENDIF
     C   KC                MOVE '#END    '@STEP   8
     C* < PAGE UP/DOWN >
     C           *IN73     WHEQ *ON
     C           *IN73     OREQ *ON
     C                     MOVE '#DSP1   '@STEP
     C* < ENTR >
     C                     OTHER
     C                     EXSR #SFL01
     C                     MOVE '#DSP1   '@STEP
     C                     ENDSL
      *
     C                     ENDSR
     C*===============================================================
     C*   SET SFL01
     C*===============================================================
     C           #SFL01    BEGSR
      *
     C* SFLCLR
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
     C                     Z-ADD0         RRN1    40
     C                     Z-ADD0         ENDRRN  40
      *
     C           *LOVAL    SETLLEDIPP46
      *-----------------------------------
     C                     DO   *HIVAL
     C                     READ EDIPP46                  90
     C   90                LEAVE
      *
     C           E5SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           D2MHN1    IFNE *BLANK
     C           D2MHN1    ANDNEE5MHN1
     C                     ITER
     C                     ENDIF
      *
     C           D2MHN2    IFNE *BLANK
     C           D2MHN2    ANDNEE5MHN2
     C                     ITER
     C                     ENDIF
      *
     C           D2MHN3    IFNE *BLANK
     C           D2MHN3    ANDNEE5MHN3
     C                     ITER
     C                     ENDIF
      *
     C           D2MHN4    IFNE *BLANK
     C           D2MHN4    ANDNEE5MHN4
     C                     ITER
     C                     ENDIF
      *
     C           D2NONY    IFNE 0
     C           D2NONY    ANDNEE5NONY
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELE5MHN1    S1MHN1
     C                     MOVELE5MHN2    S1MHN2
     C                     MOVELE5MHN3    S1MHN3
     C                     MOVELE5MHN4    S1MHN4
     C                     Z-ADDE5NONY    S1NONY
     C                     MOVELE5UPRT    S1UPRT
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
      *
     C                     ENDDO
      *-----------------------------------
     C                     Z-ADDRRN1      ENDRRN
     C                     Z-ADD1         RRN1             ERROR
      *
     C                     ENDSR
     C*===============================================================
     C*   << INIT >>
     C*===============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P@MHN1  5
     C                     PARM           P@MHN2  5
     C                     PARM           P@MHN3  5
     C                     PARM           P@MHN4  5
     C                     PARM           P@NONY  4
      *
     C                     TIME           @TIME
      * SFL01
     C                     MOVE *BLANK    D2MHN1
     C                     MOVE *BLANK    D2MHN2
     C                     MOVE *BLANK    D2MHN3
     C                     MOVE *BLANK    D2MHN4
     C                     Z-ADD0         D2NONY
     C                     EXSR #SFL01
     C                     MOVE '#DSP1   '@STEP
     C*
     C                     ENDSR
      *===============================================================
