     H            Y,
      *** EDIR33  ***********************************************
      * SETUP EDI CUST#/DELIV# FOR EDIPP10 BY AB#PP10           *
      * JW    2022.09.22                                        *
      ***********************************************************
     FAB#PL19AIF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FEDIPP10 O   E           K        DISK
      ***********************************************************
      * SYSTEM TIME
     I            DS
     I                                        1  140SDAT
     I                                        1   60NOW
     I                                        7  140TODAY
      * GET SYSTEM DATE
     C                     TIME           SDAT
     C                     Z-ADD0         SVTOKU  40
      *
     C                     DO   *HIVAL
     C                     READ AB#PL19A                 98
     C   98                LEAVE
      *
     C           BATOKU    IFNE SVTOKU
     C                     CLEAREDIPP101
     C           BATOKU    CHAINFGBPL01              99
     C           *IN99     IFEQ *OFF
     C                     MOVELB2SMEI    EANAME
     C                     ENDIF
     C                     Z-ADDBATOKU    EATOKU
     C                     Z-ADDTODAY     EACRHZ
     C                     Z-ADDNOW       EACRTM
     C                     MOVEL'EDIR10S' EACRUS    P
     C                     WRITEEDIPP101
     C                     ENDIF
     C                     Z-ADDBATOKU    SVTOKU
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
