     H            Y.
     F** EDSR90 ***********************************************
     F*  PROGRAM: SAVE GDL SOURCE DATA TO GDLSRC
     F*  WRITTEN: JW (SRA)  2021.05.19
     F*
     F*--------------------------------------------------------
     FINPUT   IF  F     500            DISK
     FGDLSRC  O   E                    DISK
      *--------------------------------------------------------
     IINPUT   AA  01
     I                                        1   62SEQ1
     I                                        7  120SEQ2
     I                                       13 268 DATA
     I                                       13  15 #TEST
     I            DS
     I                                        1  140STIME
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      * MAIN ROUTINE
      *--------------------------------------------------------
     C                     EXSR #INIT
      *
     C                     DO   *HIVAL
     C                     READ INPUT                    98
     C   98                LEAVE
      * IGNORE
     C           #TEST     IFEQ ',,,'
     C                     ITER
     C                     ENDIF
      *
     C                     CLEARGDLSRC1
     C                     Z-ADDSEQ1      SRCSEQ
     C                     Z-ADDSEQ2      SRCDAT
     C                     MOVELDATA      SRCDTA
      *
     C                     SELEC
     C           PSUPP     WHEQ '8990'
     C                     Z-ADD8990      GDSUPP
     C                     MOVEL'ASJ     'GDFILE
     C           PSUPP     WHEQ '4511'
     C                     Z-ADD4511      GDSUPP
     C                     MOVEL'OANDK   'GDFILE
     C           PSUPP     WHEQ '4530'
     C                     Z-ADD4530      GDSUPP
     C                     MOVEL'NSCI    'GDFILE
     C           PSUPP     WHEQ '4540'
     C                     Z-ADD4540      GDSUPP
     C                     MOVEL'CHARTER 'GDFILE
     C           PSUPP     WHEQ '4550'
     C                     Z-ADD4550      GDSUPP
     C                     MOVEL'POSCO   'GDFILE
     C           PSUPP     WHEQ '4560'
     C                     Z-ADD4560      GDSUPP
     C                     MOVEL'TSUSHO  'GDFILE
     C                     ENDSL
      *
     C                     Z-ADDTODAY     GDCRHZ
     C                     Z-ADDNOW       GDCRTM
     C                     MOVEL#PGM      GDCRPG
     C                     MOVEL#USER     GDCRUS
     C                     MOVEL#WSID     GDCRWS
      *
     C                     WRITEGDLSRC1
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------------
      * INITIAL SETTING
      *--------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           PSUPP   4
      *
     C                     TIME           STIME
      *
     C                     ENDSR
