     H            Y.
     F** EDSR60 ********************************************
     F*  PROGRAM: UTILITY - SAVE AB#EP60 TO AB#EP60S       *
     F*  WRITTEN: JW (SRA)                                 *
     F*           02/19/2016                               *
     F*----------------------------------------------------*
     FAB#EP59 IF  E                    DISK
     FAB#EP67 IF  E                    DISK
     FAB#EP68 IF  E                    DISK
     FAB#EP69 IF  E                    DISK
     FAB#EL5S IF  E           K        DISK                      A
     FAB#EP67SO   E                    DISK
     FAB#EP68SO   E                    DISK
     FAB#EP69SO   E                    DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  140D#TIME
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      * INITIAL SETTING
     C**                   Z-ADD*DATE     TODAY   80
     C**                   TIME           NOW     60
     C                     TIME           D#TIME
      * SAVE AB#EP59 --------------------------------------
     C                     MOVE *OFF      *IN99
     C           *IN99     DOWEQ*OFF
     C                     READ AB#EP59                  99
     C           *IN99     IFEQ *OFF
     C                     MOVELE1SHID    #SHID  10
     C           #SHID     CHAINAB#EL5S              98
     C           *IN98     IFEQ *ON
     C                     Z-ADDTODAY     E1CRDT
     C                     Z-ADDNOW       E1CRTM
     C                     MOVEL#PGM      E1CRPG
     C                     MOVEL#WSID     E1CRWS
     C                     MOVEL#USER     E1CRUS
     C                     WRITEAB#E59S1
      *DTL
     C                     EXSR #DTL
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------
      *                    SAVE DETAIL
      *----------------------------------------------------
     C           #DTL      BEGSR
      * SAVE AB#EP67 --------------------------------------
     C                     MOVE *OFF      *IN99
     C           *IN99     DOWEQ*OFF
     C                     READ AB#EP67                  99
     C           *IN99     IFEQ *OFF
     C           E7SHID    ANDEQ#SHID
     C                     Z-ADDTODAY     E7CRDT
     C                     Z-ADDNOW       E7CRTM
     C                     WRITEAB#E67S1
     C                     ENDIF
     C                     ENDDO
      *
      * SAVE AB#EP68 --------------------------------------
     C                     MOVE *OFF      *IN99
     C           *IN99     DOWEQ*OFF
     C                     READ AB#EP68                  99
     C           *IN99     IFEQ *OFF
     C           E8SHID    ANDEQ#SHID
     C                     Z-ADDTODAY     E8CRDT
     C                     Z-ADDNOW       E8CRTM
     C                     WRITEAB#E68S1
     C                     ENDIF
     C                     ENDDO
      *
      * SAVE AB#EP69 --------------------------------------
     C                     MOVE *OFF      *IN99
     C           *IN99     DOWEQ*OFF
     C                     READ AB#EP69                  99
     C           *IN99     IFEQ *OFF
     C           E3SHID    ANDEQ#SHID
     C                     Z-ADDTODAY     E3CRDT
     C                     Z-ADDNOW       E3CRTM
     C                     WRITEAB#E69S1
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
