     H            Y.
     F** EDSR50 ********************************************
     F*  PROGRAM: UTILITY - SAVE AB#EP50 TO AB#EP50S       *
     F*  WRITTEN: JW (SRA)                                 *
     F*           02/18/2016                               *
     F*----------------------------------------------------*
     FAB#EP50 IF  E           K        DISK
JW1  FAB#EP97 IF  E           K        DISK
     FAB#EP50SO   E                    DISK
JW1  FAB#EP97SO   E                    DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  140D#TIME
     I                                        1   60NOW
     I                                        7  140TODAY
      *--------------------------------------------------------
      * INITIAL SETTING
     C**                   Z-ADD*DATE     TODAY   80
     C**                   TIME           NOW     60
     C                     TIME           D#TIME
      * SAVE AB#EP50 --------------------------------------
     C                     MOVE *OFF      *IN99
     C           *IN99     DOWEQ*OFF
     C                     READ AB#EP50                  99
     C           *IN99     IFEQ *OFF
     C                     Z-ADDTODAY     A5SVDT
     C                     Z-ADDNOW       A5SVTM
     C                     WRITEAB#E50S1
     C                     ENDIF
     C                     ENDDO
      * SAVE AB#EP97 --------------------------------------
     C                     MOVE *OFF      *IN98
     C           *IN98     DOWEQ*OFF
     C                     READ AB#EP97                  98
     C           *IN98     IFEQ *OFF
     C                     Z-ADDTODAY     AECRDT
     C                     Z-ADDNOW       AECRTM
     C                     WRITEAB#E97S1
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
