     H            Y.
     F** EDSR80 ***********************************************
     F*  PROGRAM: UTILITY - SAVE AB#EP80/81 TO AB#EP80S/81S...
     F*  WRITTEN: JW (SRA)  2016.12.16
     F*
     F*--------------------------------------------------------
     FAB#EP80 IF  E                    DISK
     FAB#EP80SO   E                    DISK
     F**AB#EP81 IF  E                    DISK
     F**AB#EP81SO   E                    DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  140D#TIME
     I                                        1   60NOW
     I                                        7  140TODAY
      *--------------------------------------------------------
      * INITIAL SETTING
     C**                   Z-ADD*DATE     TODAY   80
     C**                   TIME           NOW     60
     C                     TIME           D#TIME
      * SAVE AB#EP80 --------------------------------------
     C                     MOVE *OFF      *IN99
     C           *IN99     DOWEQ*OFF
     C                     READ AB#EP80                  99
     C           *IN99     IFEQ *OFF
     C                     Z-ADDTODAY     RRCRDT
     C                     Z-ADDNOW       RRCRTM
     C                     WRITEAB#E80S1
     C                     ENDIF
     C                     ENDDO
      * SAVE AB#EP81 --------------------------------------
     C**                   MOVE *OFF      *IN99
     C**         *IN99     DOWEQ*OFF
     C**                   READ AB#EP81                  99
     C**         *IN99     IFEQ *OFF
     C**                   Z-ADDTODAY     RRCRDT
     C**                   Z-ADDNOW       RRCRTM
     C**                   WRITEAB#E81S1
     C**                   ENDIF
     C**                   ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
