     H            Y.
     F** EDSR66 *****************************************************
     F*  PROGRAM: UTILITY - SAVE AB#PP6J/6K/6L TO AB#PP6JS/6KS/6LS  *
     F*  WRITTEN: J.WATANABE   2017.07.18                           *
     F***************************************************************
     FAB#PP6J IF  E           K        DISK
     FAB#PP6K IF  E           K        DISK
     FAB#PP6L IF  E                    DISK
     FAB#PP6JSO   E                    DISK
     FAB#PP6KSO   E                    DISK
     FAB#PP6LSO   E                    DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  140D#TIME
     I                                        1   60NOW
     I                                        7  140TODAY
      *--------------------------------------------------------
      * INITIAL SETTING
     C                     TIME           D#TIME
      *
      * SAVE AB#PP6J --------------------------------------
     C                     MOVE *OFF      *IN99
     C           *LOVAL    SETLLAB#PP6J
     C           *IN99     DOWEQ*OFF
     C                     READ AB#PP6J                  99
     C           *IN99     IFEQ *OFF
     C                     Z-ADDTODAY     APCRDT
     C                     Z-ADDNOW       APCRTM
     C                     WRITEAB#P6JS1
     C                     ENDIF
     C                     ENDDO
      *
      * SAVE AB#PP6K --------------------------------------
     C                     MOVE *OFF      *IN99
     C           *LOVAL    SETLLAB#PP6K
     C           *IN99     DOWEQ*OFF
     C                     READ AB#PP6K                  99
     C           *IN99     IFEQ *OFF
     C                     Z-ADDTODAY     APCRDT
     C                     Z-ADDNOW       APCRTM
     C                     WRITEAB#P6KS1
     C                     ENDIF
     C                     ENDDO
      *
      * SAVE AB#PP6L --------------------------------------
     C                     MOVE *OFF      *IN99
     C           *IN99     DOWEQ*OFF
     C                     READ AB#PP6L                  99
     C           *IN99     IFEQ *OFF
     C                     Z-ADDTODAY     ALCRDT
     C                     Z-ADDNOW       ALCRTM
     C                     WRITEAB#P6LS1
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
