     H            Y.
     F** EDSR61 *****************************************************
     F*  PROGRAM: TRANSFER AB#EP60/61/62 TO AC#EP60/61/62           *
     F*  TARGET : TTTX(3511)                                        *
     F*  WRITTEN: JW (SRA)  2020.08.19                              *
     F*-------------------------------------------------------------*
     FAB#EL60 UF  E           K        DISK
     FAB#EP61 UF  E           K        DISK
     FAB#EP62 UF  E           K        DISK
     FAC#EP60 IF  E           K        DISK                      A
     FAC#EP61 IF  E           K        DISK                      A
     FAC#EP62 IF  E           K        DISK                      A
     FAC#EP60SO   E           K        DISK
     FAC#EP61SO   E           K        DISK
     FAC#EP62SO   E           K        DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *--------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
     C                     EXSR #INIT
      *
     C                     EXSR #EP60
     C                     EXSR #EP61
     C                     EXSR #EP62
      *
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------
      * TRANSFER AB#EP60
      *----------------------------------------------------
     C           #EP60     BEGSR
      *
     C           *LOVAL    SETLLAB#EL60
     C                     DO   *HIVAL
     C                     READ AB#EL60                  91
     C   91                LEAVE
      *
     C           E1PRTN    IFNE '3511'
     C           E1PRTN    ANDNE'0848'
     C           E1PRTN    ANDNE'2694'
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELE1PRTN    K0PRTN
     C                     MOVELE1SHID    K0SHID
     C           K#EP60    CHAINAC#EP60              98
     C           *IN98     IFEQ *ON
     C                     WRITEAC#EP601
     C                     Z-ADDTODAY     ECRDT
     C                     Z-ADDNOW       ECRTM
     C                     MOVEL#WSID     ECRWS
     C                     MOVEL#USER     ECRUS
     C                     MOVEL#PGM      ECRPG
     C                     WRITEAC#E60S1
     C                     ENDIF
      *
     C                     DELETAB#EP601
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------
      * TRANSFER AB#EP61
      *----------------------------------------------------
     C           #EP61     BEGSR
      *
     C           *LOVAL    SETLLAB#EP61
     C                     DO   *HIVAL
     C                     READ AB#EP61                  91
     C   91                LEAVE
      *
     C           E2PRTN    IFNE '3511'
     C           E2PRTN    ANDNE'0848'
     C           E2PRTN    ANDNE'2694'
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELE2PRTN    K1PRTN
     C                     MOVELE2SHID    K1SHID
     C           K#EP61    CHAINAC#EP61              98
     C           *IN98     IFEQ *ON
     C                     WRITEAC#EP611
     C                     Z-ADDTODAY     E2CRDT
     C                     Z-ADDNOW       E2CRTM
     C                     MOVEL#PGM      E2CRPG
     C                     WRITEAC#E61S1
     C                     ENDIF
      *
     C                     DELETAB#EP611
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------
      * TRANSFER AB#EP62
      *----------------------------------------------------
     C           #EP62     BEGSR
      *
     C           *LOVAL    SETLLAB#EP62
     C                     DO   *HIVAL
     C                     READ AB#EP62                  91
     C   91                LEAVE
      *
     C           E3PRTN    IFNE '3511'
     C           E3PRTN    ANDNE'0848'
     C           E3PRTN    ANDNE'2694'
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELE3PRTN    K2PRTN
     C                     MOVELE3SHID    K2SHID
     C                     MOVELE3MAN#    K2MAN#
     C                     MOVELE3MHIN    K2MHIN
     C                     MOVELE3ORDN    K2ORDN
     C           K#EP62    CHAINAC#EP62              98
     C           *IN98     IFEQ *ON
     C                     WRITEAC#EP621
     C                     Z-ADDTODAY     E3CRDT
     C                     Z-ADDNOW       E3CRTM
     C                     MOVEL#PGM      E3CRPG
     C                     WRITEAC#E62S1
     C                     ENDIF
      *
     C                     DELETAB#EP621
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------
      * INITIAL SET
      *----------------------------------------------------
     C           #INIT     BEGSR
      *
     C           K#EP60    KLIST
     C                     KFLD           K0PRTN 10
     C                     KFLD           K0SHID 10
      *
     C           K#EP61    KLIST
     C                     KFLD           K1PRTN 10
     C                     KFLD           K1SHID 10
      *
     C           K#EP62    KLIST
     C                     KFLD           K2PRTN 10
     C                     KFLD           K2SHID 10
     C                     KFLD           K2MAN# 20
     C                     KFLD           K2MHIN 20
     C                     KFLD           K2ORDN 10
      *
     C                     TIME           SDATE
     C                     Z-ADDNOW       SVTIME  60
      *
     C                     ENDSR
