     H            Y.
     F** EDSR01 ********************************************
     F*  PROGRAM: UTILITY -  SAVE ABBPP01 TO ABBPP10       *
     F*  WRITTEN: JW (SRA)                                 *
     F*           05/21/2018                               *
     F*----------------------------------------------------*
     FABBPP01 IF  E                    DISK
     FABBPP10 O   E                    DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  140D#TIME
     I                                        1   60NOW
     I                                        7  140TODAY
      *--------------------------------------------------------
      * INITIAL SETTING
     C                     TIME           D#TIME
      *
      * SAVE ABBPP01 --------------------------------------
     C                     MOVE *OFF      *IN99
     C           *IN99     DOWEQ*OFF
     C                     READ ABBPP01                  99
     C           *IN99     IFEQ *OFF
     C                     Z-ADDTODAY     Q5CRDT
     C                     Z-ADDNOW       Q5CRTM
     C                     WRITEABBPP101
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
