     H            Y.
     F** EDSR64 ********************************************
     F*  PROGRAM: UTILITY - SAVE AB#EP60 TO AB#EP60S       *
     F*  WRITTEN: JW (SRA)                                 *
     F*           04/08/2016                               *
     F*----------------------------------------------------*
     FAB#EP63 IF  E           K        DISK
     FAB#EP64 IF  E           K        DISK
     FAB#EP65 IF  E           K        DISK
     FAB#EP66 IF  E           K        DISK
     FAB#EP63SO   E                    DISK
     FAB#EP64SO   E                    DISK
     FAB#EP65SO   E                    DISK
     FAB#EL66SIF  E           K        DISK                      A
      *--------------------------------------------------------
     I            DS
     I                                        1  140D#TIME
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      * INITIAL SETTING
     C                     TIME           D#TIME
      * SAVE AB#EP66 --------------------------------------
     C**                   MOVE *OFF      *IN99
     C**         *IN99     DOWEQ*OFF
     C**                   READ AB#EP66                  99
     C**         *IN99     IFEQ *OFF
     C                     MOVE *OFF      *IN97
     C           *IN97     DOWEQ*OFF
     C                     READ AB#EP66                  97
     C           *IN97     IFEQ *OFF
     C                     MOVELE6SHID    @SHID  10
     C           @SHID     CHAINAB#EL66S             98
     C           *IN98     IFEQ *ON
     C                     Z-ADDTODAY     E6CRDT
     C                     Z-ADDNOW       E6CRTM
     C                     MOVEL#WSID     E6CRWS
     C                     MOVEL#USER     E6CRUS
     C                     MOVEL#PGM      E6CRPG
     C                     WRITEAB#E66S1
     C                     EXSR #EP99
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------
      * SAVE AB#EP63/64/65
      *----------------------------------------------------
     C           #EP99     BEGSR
      *
      * SAVE AB#EP63 --------------------------------------
     C                     MOVE *OFF      *IN99
     C           @SHID     SETLLAB#EP63
     C           *IN99     DOWEQ*OFF
     C           @SHID     READEAB#EP63                  99
     C           *IN99     IFEQ *OFF
     C                     Z-ADDTODAY     E3CRDT
     C                     Z-ADDNOW       E3CRTM
     C                     WRITEAB#E63S1
     C                     ENDIF
     C                     ENDDO
      *
      * SAVE AB#EP64 --------------------------------------
     C                     MOVE *OFF      *IN99
     C           @SHID     SETLLAB#EP64
     C           *IN99     DOWEQ*OFF
     C           @SHID     READEAB#EP64                  99
     C           *IN99     IFEQ *OFF
     C                     Z-ADDTODAY     E4CRDT
     C                     Z-ADDNOW       E4CRTM
     C                     WRITEAB#E64S1
     C                     ENDIF
     C                     ENDDO
      *
      * SAVE AB#EP65 --------------------------------------
     C                     MOVE *OFF      *IN99
     C           @SHID     SETLLAB#EP65
     C           *IN99     DOWEQ*OFF
     C           @SHID     READEAB#EP65                  99
     C           *IN99     IFEQ *OFF
     C                     Z-ADDTODAY     E5CRDT
     C                     Z-ADDNOW       E5CRTM
     C                     WRITEAB#E65S1
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
