     H            Y.
     F** EDTR06 ****************************************
     F*  EDIT LOCATION WITH HYPHEN                     *
     F*  J.WATANABE    2021.11.29                      *
     F*------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'EDTR06'
     F*                    PARM           $LOC1   1
     F*                    PARM           $LOC2   2
     F*                    PARM           $LOC3   2
     F*                    PARM           $LOC4   1
     F*                    PARM           $LOC    9
     F*  IN  $LOC1 :  1A LOC1
     F*      $LOC2 :  2A LOC2
     F*      $LOC3 :  2A LOC3
     F*      $LOC4 :  1A LOC4
     F*  OUT $LOC  :  9A LOCATION WITH HOPHEN
     F*-----------------------------------------
     F*  EX.  1 23 45 6 --> 1-23-45-6
     F**************************************************
     I            DS
     I                                        1   9 @LOC
     I                                        1   1 @LOC1
     I                                        2   2 HP1
     I                                        3   4 @LOC2
     I                                        5   5 HP2
     I                                        6   7 @LOC3
     I                                        8   8 HP3
     I                                        9  10 @LOC4
      *
     C           *ENTRY    PLIST
     C                     PARM           $LOC1   1
     C                     PARM           $LOC2   2
     C                     PARM           $LOC3   2
     C                     PARM           $LOC4   1
     C                     PARM           $LOC    9
      *
     C                     MOVEL$LOC1     @LOC1
     C                     MOVEL$LOC2     @LOC2
     C                     MOVEL$LOC3     @LOC3
     C                     MOVEL$LOC4     @LOC4
      *
     C                     MOVE '-'       HP1
     C                     MOVE '-'       HP2
     C                     MOVE '-'       HP3
      *
     C                     MOVEL@LOC      $LOC
      *
     C                     SETON                     LR
     C                     RETRN
