     H            Y.
     F** EDTR05A***********************************************************
     F*  CONVERT NUMERIC : (NUMERIC TO CHARACTER) / EDIT
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'EDTR05A'
     F*                    PARM           $IN    156
     F*                    PARM           $TRUE  17
     F*                    PARM           $RTN    1
     F*   IN  $IN    15,6  SOURCE NUMBER    (EX. 1.018= )
     F*   OUT $TRUE  17A   TRUE (CHARACTER) (EX. 1.018- )
     F*       $RTN    1A   RETURN (BLANK: OK, *: ERROR)
     F*
     F*   ** DECIMAL POINT SHOULD BE <= 6 DIGITS
     F*   ** INTEGER       SHOULD BE <= 9 DIGITS
     F*   ** MAX 999,999,999.999999
     F*   ** MIN 0.000001 (+/-)
     F*   ** SIGN WILL BE SET AT END POSITION
     F*********************************************************************
     E                    IN         15  1
     E                    OT         17  1
     F******************************************************************
     C                     EXSR #INIT
      * MOVE BEFORE DECIMAL POINT
     C                     Z-ADD0         IY
     C                     Z-ADD0         IZ
      *
     C           1         DO   9         IX
      *
     C           IN,IX     IFEQ *BLANK
     C                     ITER
     C                     ENDIF
      *
     C           FIRST0    IFEQ 'Y'
     C           IN,IX     ANDEQ'0'
     C                     ADD  1         ZSCNT
     C                     ITER
     C                     ENDIF
      *
     C                     MOVE 'N'       FIRST0
     C                     ADD  1         IY
     C                     MOVELIN,IX     OT,IY
     C                     ENDDO
      * IF INTERGER=0
     C           FIRST0    IFEQ 'Y'
     C                     ADD  1         IY
     C                     SUB  1         ZSCNT
     C                     MOVE '0'       OT,IY
     C                     ENDIF
      * DECIMAL POINT
     C                     ADD  1         IY
     C                     MOVE '.'       OT,IY
      * MOVE AFTER DECIMAL POINT
     C                     Z-ADD16        IZ
     C           18        SUB  ZSCNT     IY
      *
     C           1         DO   6         IX
     C                     SUB  1         IZ
     C                     SUB  1         IY
      *
     C           IN,IZ     IFEQ *BLANK
     C                     ITER
     C                     ENDIF
      *
     C**         LAST0     IFEQ 'Y'
     C**         IN,IZ     ANDEQ'0'
     C**                   ITER
     C**                   ENDIF
      *
     C           LAST0     IFEQ 'Y'
     C                     MOVE 'N'       LAST0
     C                     MOVE @SIGN     OT,IY
     C                     SUB  1         IY
     C                     ENDIF
      *
     C                     MOVELIN,IZ     OT,IY
      *
     C                     ENDDO
      * CHECK RESULT
     C                     MOVEAOT        $IN2
     C                     CALL 'UTLR60'
     C                     PARM           $IN2   17
     C                     PARM           $TRUE2 156
     C                     PARM           $RTN2   1
      *
     C           $IN       IFEQ $TRUE2
     C                     MOVE *BLANK    $RTN
     C                     MOVEAOT        $TRUE
     C                     ELSE
     C                     MOVE '*'       $RTN
     C                     MOVE *BLANK    $TRUE
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *==========================================================
      * INITIAL VALUE
      *==========================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $IN    156
     C                     PARM           $TRUE  17
     C                     PARM           $RTN    1
      *
     C                     MOVE *BLANK    $TRUE
     C                     MOVE *BLANK    $RTN
      * SIGN
     C           $IN       IFGE 0
     C                     MOVE ' '       @SIGN   1
     C                     Z-ADD$IN       @IN    156
     C                     ELSE
     C                     MOVE '-'       @SIGN
     C           $IN       MULT -1        @IN
     C                     ENDIF
      *
     C                     MOVEL@IN       INX    15
     C                     MOVEAINX       IN
     C                     Z-ADD0         IX      20
     C                     Z-ADD0         IY      20
     C                     Z-ADD0         IZ      20
     C                     Z-ADD0         ZSCNT   20       ZERO SUPLESS
     C                     MOVE 'Y'       FIRST0  1
     C                     MOVE 'Y'       LAST0   1
      *
     C                     ENDSR
