     H            Y.
     F** EDTR04C **********************************************************
     F*  UTILITY- EDIT NUMERIC -> PUT APOSTROPHE AT 1ST CHARACTER         *
     F*-------------------------------------------------------------------*
     F*  CALLING SEQ.                                                     *
     F*                    CALL 'EDTR04C'
     F*                    PARM           $IN    20
     F*                    PARM           $LONG   2
     F*                    PARM           $OUT   21
     F*   IN  $IN   : 20A INPUT                                           *
     F*       $LONG :  2A INPUT                                           *
     F*   OUT $OUT  : 21A OUTPUT                                          *
     F*   EX.                                                             *
     F*   003 --> '003                                                    *
     F*********************************************************************
     E                    APO     1   1  1
     E                    IN         20  1
     E                    OUT        21  1
     F******************************************************************
     I*
     C           *ENTRY    PLIST
     C                     PARM           $IN    10
     C                     PARM           $LONG   2
     C                     PARM           $OUT   11
      *
     C                     MOVEA$IN       IN
     C                     MOVEL$LONG     @LONG   20
     C                     MOVE *BLANK    $OUT
     C                     MOVE 'N'       NFLG    1
     C                     Z-ADD0         IX      20
     C* CHECK 1ST CHARACTER
     C**                   MOVEL$IN       LTR1    1
     C**         LTR1      IFNE '0'
     C**                   MOVEL$IN       $OUT
     C**                   GOTO ENDP
     C**                   ENDIF
     C* CHECK NUMERIC
     C           1         DO   @LONG     IX
     C           IN,IX     IFEQ ' '
     C                     ITER
     C                     ENDIF
      *
      * COUNT 'E' AS NUMERIC (EXCEL)
     C           IN,IX     IFLT '0'
     C           IN,IX     ANDNE'E'
     C           IN,IX     ORGT '9'
     C           IN,IX     ANDNE'E'
     C                     MOVE 'N'       NFLG
     C                     MOVEL$IN       $OUT
     C                     GOTO ENDP
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADD1         IY      20
     C                     MOVELAPO,1     OUT,1
     C                     MOVE 'Y'       NFLG
     C           1         DO   @LONG     IX
     C                     ADD  1         IY
     C                     MOVELIN,IX     OUT,IY
     C                     ENDDO
     C                     MOVEAOUT       $OUT
      *
     C           ENDP      TAG
     C                     SETON                     LR
     C                     RETRN
** APO
'
