     H            Y.
     F** EDTR07  ***************************************
     F*  CONVERT DATE YYYYMMDD TO MMDDYYYY             *
     F*  J.WATANABE    2024.05.09                      *
     F*------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'EDTR07 '
     F*                    PARM           $YMD    8
     F*                    PARM           $MDY1   8
     F*                    PARM           $MDY2   6
     F*  IN  $YMD    8A DATE YYYYMMDD  (EX. 20241231) BLANK=TODAY
     F*  OUT $DMY1   8A DATE MMDDYYYY  (EX. 12312024)
     F*  OUT $DMY2   6A DATE MMDDYY    (EX. 123124)
     F**************************************************
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I            DS
     I                                        1   8 @YMD
     I                                        1   4 @YYYY
     I                                        5   6 @MM
     I                                        7   8 @DD
     I                                        3   4 @YY
     I            DS
     I                                        1   8 XMDY1
     I                                        1   2 XMM1
     I                                        3   4 XDD1
     I                                        5   8 XYYYY1
     I            DS
     I                                        1   6 XMDY2
     I                                        1   2 XMM2
     I                                        3   4 XDD2
     I                                        5   6 XYY2
      *=========================
      * MAIN ROUTINE
      *=========================
     C           *ENTRY    PLIST
     C                     PARM           $YMD    8
     C                     PARM           $MDY1   8
     C                     PARM           $MDY2   6
      *
     C           $YMD      IFEQ *BLANK
     C           $YMD      OREQ *ZEROS
     C                     TIME           SDATE
     C                     MOVELTODAY     @YMD
     C                     ELSE
     C                     MOVEL$YMD      @YMD
     C                     ENDIF
      * $MDY1
     C                     MOVEL@MM       XMM1
     C                     MOVEL@DD       XDD1
     C                     MOVEL@YYYY     XYYYY1
     C                     MOVELXMDY1     $MDY1
      * $MDY2
     C                     MOVEL@MM       XMM2
     C                     MOVEL@DD       XDD2
     C                     MOVEL@YY       XYY2
     C                     MOVELXMDY2     $MDY2
      *
     C                     SETON                     LR
     C                     RETRN
