     H            Y.
     F** EDTR05D **********************************************************
     F*  REMOVE 0 OR BLANK FROM THE BEGINNING OF CHARACTER
     F*--EX.--------
     F*  '00300 ABC'  --> '300 ABC   '
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'EDTR05'
     F*                    PARM           $IN    20
     F*                    PARM           $OUT   20
     F*
     F*   IN  $IN    20A   SOURCE VALUE
     F*   OUT $OUT   20A   RESULT
     F*********************************************************************
     E                    IN         20  1
     E                    OT         20  1
     F******************************************************************
     C                     EXSR #INIT
     C* EXAMIN
     C           1         DO   20        IX
      *
     C           IY        IFEQ 0
     C           IN,IX     IFEQ '0'
     C           IN,IX     OREQ ' '
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      *
     C                     ADD  1         IY
     C                     MOVE IN,IX     OT,IY
     C                     ENDDO
      *
     C                     MOVEAOT        $OUT
      *
     C                     SETON                     LR
     C                     RETRN
      *==========================================================
      * INITIAL VALUE
      *==========================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $IN    20
     C                     PARM           $OUT   20
      *
     C                     MOVE *ALL' '   IN
     C                     MOVE *ALL' '   OT
     C                     MOVEA$IN       IN
     C                     MOVE *BLANK    $OUT
     C                     Z-ADD0         IX      20
     C                     Z-ADD0         IY      20
      *
     C                     ENDSR
