     H            Y.
     F** EDTR09  ***************************************
     F*  EDIT EDI RAW DATA  (EDIWP01 --> EDIWP01A)     *
     F*  J.WATANABE    2025.04.03                      *
     F**************************************************
     FEDIWP01 IF  E                    DISK
     FEDIWP01AUF  E           K        DISK                      A
      *=========================
      * MAIN ROUTINE
      *=========================
      * DELETE EDIWP01A BEFORE TRANSFER
     C                     EXSR #DLT
      *
      * TRANSFER EDIWP01 --> EDIWP01A
     C                     EXSR #MOVE
      *
     C                     SETON                     LR
     C                     RETRN
      *=========================
      * DELETE
      *=========================
     C           #DLT      BEGSR
      *
     C           *LOVAL    SETLLEDIWP01A
     C                     DO   *HIVAL
     C                     READ EDIWP01A                 98
     C   98                LEAVE
      *
     C                     DELETEDIW01A1
     C                     ENDDO
      *
     C                     ENDSR
      *=========================
      * TRANSFER EDIWP01 --> EDIWP01A
      *=========================
     C           #MOVE     BEGSR
      *
     C                     Z-ADD0         SEQ#    50
     C           1         SETLLEDIWP01
     C                     DO   *HIVAL
     C                     READ EDIWP01                  98
     C   98                LEAVE
      *
     C                     ADD  1         SEQ#
     C                     Z-ADDSEQ#      TXTSQ
     C                     WRITEEDIW01A1
     C                     ENDDO
      *
     C                     ENDSR
