     H            Y.
     F** EGBR12 ********************************************
     F*  SET TIMES TO EGBWP10 (PROGRAM USE)                *
     F*  J.WATALIB    2019.12.20                           *
     F******************************************************
     F**UTLWP07BIF  E           K        DISK
     FUTLPP07BIF  E           K        DISK
     FEGBWP10 UF  E           K        DISK
      ******************************************************
     I            DS
     I                                        1  140@SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                     *PROGRAM #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ******************************************************
      * MAIN ROUTINE
      ******************************************************
     C                     EXSR #INIT
     C*
     C**         @FROM     SETLLUTLWP07B
     C           @FROM     SETLLUTLPP07B
     C                     DO   *HIVAL
     C**                   READ UTLWP07B                 98
     C                     READ UTLPP07B                 98
     C   98                LEAVE
      *
     C           U1CRDT    IFGT @TO
     C                     LEAVE
     C                     ENDIF
      *
      * CHECK EGBWP10
     C                     MOVELU1PGM     X1PGM  10
     C           K#WP10    CHAINEGBWP10              97
     C           *IN97     IFEQ *OFF
     C                     ADD  1         G1TMS
     C           U1CRDT    IFGT G1ULHZ
     C                     Z-ADDU1CRDT    G1ULHZ
     C                     ENDIF
     C                     UPDATEGBWP101
     C                     ENDIF
      *
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C* INITIAL SETTING
     C*===============================================================
     C           #INIT     BEGSR
     C*
     C           *ENTRY    PLIST
     C                     PARM           $FROM   8
     C                     PARM           $TO     8
     C*
     C           K#WP10    KLIST
     C                     KFLD           U1USER
     C                     KFLD           X1PGM
     C*
     C                     MOVEL$FROM     @FROM   80
     C                     MOVEL$TO       @TO     80
     C                     TIME           @SDATE
     C*
     C                     ENDSR
