     H            Y.
     F** EGBR14 ********************************************
     F*  SUMMARIZE EGBWP10 TO EGBWP11                      *
     F*  J.WATALIB    2019.12.20                           *
     F******************************************************
     FEGBWP10 IF  E           K        DISK
     FEGBWP11 UF  E           K        DISK                      A
      ******************************************************
     I            DS
     I                                        1  140@SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                     *PROGRAM #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ******************************************************
      * MAIN ROUTINE
      ******************************************************
     C                     EXSR #INIT
     C*
     C                     DO   *HIVAL
     C                     READ EGBWP10                  98
     C   98                LEAVE
      *
      * CHECK EGBWP10
     C           G1PGM     CHAINEGBWP11              97
     C           *IN97     IFEQ *OFF
     C                     ADD  G1TMS     G2TMS
     C                     UPDATEGBWP111
     C                     ELSE
     C                     MOVELG1PGM     G2PGM
     C                     MOVELG1ATTR    G2ATTR
     C                     Z-ADDG1TMS     G2TMS
     C                     MOVELG1TEXT    G2TEXT
     C                     Z-ADDG1LUHZ    G2LUHZ
     C                     Z-ADDG1CRHZ    G2CRHZ
     C                     WRITEEGBWP111
     C                     ENDIF
      *
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C* INITIAL SETTING
     C*===============================================================
     C           #INIT     BEGSR
      *
     C                     TIME           @SDATE
     C*
     C                     ENDSR
