     H            Y.
     F** EGBR01 **********************************
     F* ... A MENU EXCLUSIVE PROGRAMMER ... *.
     F* PROGRAM ID. : EGBR01. <RPG> *
     F* CREATE DATE. : JAN.09,'90.               *
     F* AUTHOR.         : K.NAKAMURA             *
     F*
     F* AUG/27/02 (TCH) ADD F2 FOR PRINTER CONTROL
     F* TCHK1  01/12/07 CHG SELECT WORK NO FOR F4
     F* TCHK2  10/20/08 CHG I0064 & I0065 DOES NOT WORK F4
     F* TCHK3  02/17/10 ADD I0023 SELECT WORK NO FOR F4
     F* TCHK4  01/17/13 ADD I0995 SELECT WORK NO FOR F4
     F********************************** EGBR01 **
     FEGBPW01 CF  E                    WORKSTN
     F                                              KNUM        1
     F                                              KINFDS FEEDBK
     FEGBPL12 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     E                    NO         10  3               xpｬ-NO
     E                    NOD        10  5               xpｬ-NO-DSP
     E                    CM         10 40               xpﾏ- ﾃx]n
     E                    CL         10  6               ﾎﾟﾜhﾞ[wxb
     E                    MR         10  1               gvltﾃﾞ
     E                    TC         42 10               j]ncﾃ-nﾞ
     E                    TM         42 10               j]ncﾆzxb
     E                    ER      1   8 60               d[-xlﾈbﾆﾞ
     E                    GM      1   4 34               fﾞx] jbnﾓ
     I            DS
     I                                        1  10 UUSER
     I                                        1   2 UBMON
     I                                        1   7 UUSR
     I                                       11  12 UM1
     I                                       13  14 UM2
     I                                       15  17 UMENU
     I                                       17  170USDAN
     I                                       18  190M1MNNO
     I                                       20  200M1MNDN
     I                                       18  20 UMNNO
     I                                       21  25 UNOD
     I                                       22  24 UDNO
     I                                       26  75 NOD
     I                                       26  30 NO1
     I                                       31  35 NO2
     I                                       36  40 NO3
     I                                       41  45 NO4
     I                                       46  50 NO5
     I                                       51  55 NO6
     I                                       56  60 NO7
     I                                       61  65 NO8
     I                                       66  70 NO9
     I                                       71  75 NOA
     I                                      376 381 MENUN
     I                                      376 379 MMEI
     I                                      380 381 MBAN
     I                                      382 391 CUSER
     I                                      382 383 CBMON
     I                                      392 401 CHGUS
     I                                      397 401 USBL
     I                                      402 821 TC
     I                                      402 411 TC01
     I                                      412 421 TC02
     I                                      422 431 TC03
     I                                      432 441 TC04
     I                                      442 451 TC05
     I                                      452 461 TC06
     I                                      462 471 TC07
     I                                      472 481 TC08
     I                                      482 491 TC09
     I                                      492 501 TC10
     I                                      502 511 TC11
     I                                      512 521 TC12
     I                                      522 531 TC13
     I                                      532 541 TC14
     I                                      542 551 TC15
     I                                      552 561 TC16
     I                                      562 571 TC17
     I                                      572 581 TC18
     I                                      582 591 TC19
     I                                      592 601 TC20
     I                                      602 611 TC21
     I                                      612 621 TC22
     I                                      622 631 TC23
     I                                      632 641 TC24
     I                                      642 651 TC25
     I                                      652 661 TC26
     I                                      662 671 TC27
     I                                      672 681 TC28
     I                                      682 691 TC29
     I                                      692 701 TC30
     I                                      702 711 TC31
     I                                      712 721 TC32
     I                                      722 731 TC33
     I                                      732 741 TC34
     I                                      742 751 TC35
     I                                      752 761 TC36
     I                                      762 771 TC37
     I                                      772 781 TC38
     I                                      782 791 TC39
     I                                      792 801 TC40
     I                                      802 811 TC41
     I                                      812 821 TC42
     I                                      8221241 TM
     I                                      822 831 TM01
     I                                      832 841 TM02
     I                                      842 851 TM03
     I                                      852 861 TM04
     I                                      862 871 TM05
     I                                      872 881 TM06
     I                                      882 891 TM07
     I                                      892 901 TM08
     I                                      902 911 TM09
     I                                      912 921 TM10
     I                                      922 931 TM11
     I                                      932 941 TM12
     I                                      942 951 TM13
     I                                      952 961 TM14
     I                                      962 971 TM15
     I                                      972 981 TM16
     I                                      982 991 TM17
     I                                      9921001 TM18
     I                                     10021011 TM19
     I                                     10121021 TM20
     I                                     10221031 TM21
     I                                     10321041 TM22
     I                                     10421051 TM23
     I                                     10521061 TM24
     I                                     10621071 TM25
     I                                     10721081 TM26
     I                                     10821091 TM27
     I                                     10921101 TM28
     I                                     11021111 TM29
     I                                     11121121 TM30
     I                                     11221131 TM31
     I                                     11321141 TM32
     I                                     11421151 TM33
     I                                     11521161 TM34
     I                                     11621171 TM35
     I                                     11721181 TM36
     I                                     11821191 TM37
     I                                     11921201 TM38
     I                                     12021211 TM39
     I                                     12121221 TM40
     I                                     12221231 TM41
     I                                     12321241 TM42
     I            DS
     I                                        1  10 J8PROF
     I                                        1   2 JBMON
     I            DS
     I                                        1   6 UCL
     I                                        1   4 UCLM
     I                                        5   6 UCLN
     I            DS
     I                                        1 400 CM
     I                                        1  40 CM1
     I                                       41  80 CM2
     I                                       81 120 CM3
     I                                      121 160 CM4
     I                                      161 200 CM5
     I                                      201 240 CM6
     I                                      241 280 CM7
     I                                      281 320 CM8
     I                                      321 360 CM9
     I                                      361 400 CMA
     IFEEDBK      DS
     I                                     *STATUS  @STTS
     C           *ENTRY    PLIST
     C                     PARM           PUSER  10
     C                     PARM           PHIZK   6
     C                     PARM           PTIME   6
     C                     PARM           PWS     5
     C                     PARM           PPRT    2
     C                     PARM           PSMEI  10
     C                     PARM           PJOB    6
     C                     PARM           PSYS    1
     C                     PARM           PCL     6
     C                     PARM           PMNNO   2
     C                     MOVE 'MENU'    MMEI
     C                     MOVE PUSER     UUSER
     C                     MOVE PUSER     CUSER
     C                     Z-ADD0         M1MNNO
     C                     Z-ADD0         M1MNDN
     C                     MOVE PHIZK     HIZK    60
     C                     MOVE PTIME     TIME    60
     C                     MOVE '01'      UM1
     C                     MOVE '99'      UM2
     C                     Z-ADD0         DDAN    10
     C           UUSR      IFEQ 'TEST   '
     C                     SETON                     88
     C                     END
     C           UUSR      IFEQ 'QSECOFR'
     C                     MOVEL'QSECOFR 'PSMEI
     C                     MOVE GM,1      HD
     C                     GOTO STEP00
     C                     END
     C           UUSR      IFEQ 'QSYSOPR'
     C                     MOVEL'SYSOPR  'PSMEI
     C                     MOVE GM,2      HD
     C                     GOTO STEP00
     C                     END
     C           UUSR      IFEQ 'QPGMR  '
     C                     MOVEL'PGMR    'PSMEI
     C                     MOVE GM,3      HD
     C                     GOTO STEP00
     C                     END
     C                     MOVE GM,4      HD
     C           STEP00    TAG
     C                     SETON                     08
     C           KEY1      KLIST
     C                     KFLD           UUSER
     C                     KFLD           WMNO    20
     C                     KFLD           DDAN
     C           STEP4     TAG
     C                     SETOF                     1011
     C                     Z-ADD0         MENO
     C                     MOVE *BLANK    NO
     C                     MOVE *BLANK    NOD
     C                     MOVE *BLANK    CL
     C                     MOVE *BLANK    CM
     C                     MOVE *BLANK    MR
     C           PMNNO     COMP *BLANK               06
     C   06                MOVE PMNNO     UM1
     C                     MOVE UM1       WMNO
     C                     MOVE UM1       KMNNO   20
     C****************************************************************
     C*    abﾃnﾞﾌﾞ mﾞ ﾌ]xbﾆj ﾅgﾞﾑcNO ﾉ xpﾏ- uﾇj- ﾉ ﾑﾍﾞjﾞﾆ            *
     C****************************************************************
     C                     SETOF                     0799
     C           KEY1      SETLLEGBPL12                  07
     C  N07N08             SETON                     99
     C   99                MOVELER,3      MSG
     C   99                GOTO STEP2
     C                     SETOF                     08
     C                     MOVE WMNO      MBAN
     C                     SETOF                     01
     C                     Z-ADD0         C
     C           STEP1     TAG
     C                     READ EGBPL12                  01
     C   01                GOTO STEP2
     C           M1SKJY    CABEQ'D'       STEP1
     C                     SETOF                     1213
     C           PUSER     COMP UUSER                1212
     C   12      M1KIMT    COMP 'M'                      13
     C   13                GOTO STEP1
     C           M1USRC    COMP UUSER                0202
     C   02                GOTO STEP2
     C           M1MNNO    COMP KMNNO                03
     C   03                GOTO STEP3
     C   05                MOVE *BLANK    NO
     C   05                MOVE *BLANK    NOD
     C   05                MOVE *BLANK    CL
     C   05                MOVE *BLANK    CM
     C   05                MOVE *BLANK    MR
     C           STEP6     TAG
     C                     SETOF                     05
     C           M1MNDN    ADD  1         I       20
     C                     MOVE UMNNO     UDNO
     C                     MOVE UNOD      NOD,I
     C                     MOVE UMNNO     NO,I
     C                     MOVE M1PGMN    CL,I
     C           M1KNJI    IFNE *BLANK
     C                     MOVE M1KNJI    CM,I
     C                     ELSE
     C                     MOVE M1TEXT    CM,I
     C                     END
     C                     MOVE M1KIMT    MR,I
     C           C         ADD  1         C       20
     C                     GOTO STEP1
     C           STEP3     TAG
     C           C         COMP 0                        09
     C   09                Z-ADDM1MNNO    WMNO
     C   09                Z-ADDWMNO      KMNNO
     C   09                MOVE WMNO      MBAN
     C   09                GOTO STEP6
     C                     Z-ADD0         C
     C                     SETON                     10
     C****************************************************************
     C*    abﾃnﾞﾌﾞ mﾞ ﾌ]xbﾆj ﾅgﾞﾑcNO   ﾅbﾆﾑ ﾉ xpﾏ-fﾞx] ﾍﾑcﾆﾞ         *
     C****************************************************************
     C           STEP7     TAG
     C                     WRITEEGBPW011
     C                     READ EGBPW01                7172
     C           *IN71     IFEQ '1'
     C           @STTS     IFEQ 1331
     C                     MOVE 'D'       PSYS
     C                     GOTO STEP12
     C                     END
     C                     END
     C                     SETOF                     99
      *
     C           *INKB     IFEQ *ON
     C                     CALL 'AJPC01'
     C                     GOTO STEP7
     C                     ENDIF
      *
TCHK2C           PUSER     IFEQ 'I0064'
TCHK2C           PUSER     OREQ 'I0065'
TCHK2C   KD                GOTO STEP7
TCHK2C                     END
     C   KD                GOTO STEP5
     C   KA                MOVE 'S'       PSYS
     C   KA                GOTO STEP12
     C   KF                MOVE 'P'       PSYS
     C   KF                GOTO STEP12
     C   KL                MOVE 'G'       PSYS             IGC OUTQ
     C   KL                GOTO STEP12
     C   KG                MOVE 'M'       PSYS
     C   KG                GOTO STEP12
     C   KI                MOVE 'D'       PSYS
     C   KI                GOTO STEP12
     C   KH                SETON                     08
     C   KH                MOVE '01'      PMNNO
     C   KH                GOTO STEP4
     C           MENO      COMP 0                        05
     C   05                Z-ADDM1MNNO    WMNO
     C   05                Z-ADDWMNO      KMNNO
     C   05                MOVE WMNO      MBAN
     C   05                MOVE *BLANK    NO
     C   05                MOVE *BLANK    NOD
     C   05                MOVE *BLANK    CL
     C   05                MOVE *BLANK    CM
     C   05                MOVE *BLANK    MR
     C   05                GOTO STEP6
     C                     MOVE MENO      TMENO   3
     C                     Z-ADD1         I
     C                     SETOF                     04
     C           TMENO     LOKUPNO,I                     04
     C  N04                SETON                     99
     C   99                MOVELER,2      MSG
     C   99                GOTO STEP3
     C           STEP10    TAG
     C                     MOVE CL,I      UCL
     C           UCLM      CABNE'MENU'    STEP13
     C                     MOVE UCLN      WMNO
     C                     MOVE WMNO      PMNNO
     C                     Z-ADD0         DDAN
     C                     GOTO STEP4
     C           STEP13    TAG
     C                     MOVE CL,I      PCL
     C                     MOVE NO,I      WMENO   3
     C                     MOVELWMENO     PMNNO
     C                     GOTO END
     C           STEP12    TAG
     C                     MOVE *BLANK    PCL
     C                     MOVELWMNO      PMNNO
     C                     GOTO END
     C****************************************************************
     C*    abﾃnﾞﾌﾞ mﾞ ﾌ]xbﾆj ﾅgﾞﾑcNO   ﾅbﾃﾞ ﾉ xpﾏ-fﾞx] ﾍﾑcﾆﾞ         *
     C****************************************************************
     C           STEP2     TAG
     C                     SETON                     11
     C                     WRITEEGBPW011
     C                     READ EGBPW01                7172
     C           *IN71     IFEQ '1'
     C           @STTS     IFEQ 1331
     C                     MOVE 'D'       PSYS
     C                     GOTO STEP12
     C                     END
     C                     END
     C                     SETOF                     99
      *
     C           *INKB     IFEQ *ON
     C                     CALL 'AJPC01'
     C                     GOTO STEP2
     C                     ENDIF
      *
TCHK2C           PUSER     IFEQ 'I0064'
TCHK2C           PUSER     OREQ 'I0065'
TCHK2C   KD                GOTO STEP2
TCHK2C                     END
     C   KD                GOTO STEP5
     C   KA                MOVE 'S'       PSYS
     C   KA                GOTO STEP12
     C   KF                MOVE 'P'       PSYS
     C   KF                GOTO STEP12
     C   KL                MOVE 'G'       PSYS
     C   KL                GOTO STEP12
     C   KG                MOVE 'M'       PSYS
     C   KG                GOTO STEP12
     C   KI                MOVE 'D'       PSYS
     C   KI                GOTO STEP12
     C   KH                SETON                     08
     C   KH                MOVE '01'      PMNNO
     C   KH                GOTO STEP4
     C           MENO      COMP 0                        99
     C   99                MOVELER,1      MSG    60
     C   99                GOTO STEP2
     C                     MOVE MENO      TMENO   3
     C                     Z-ADD1         I
     C                     SETOF                     04
     C           TMENO     LOKUPNO,I                     04
     C  N04                SETON                     99
     C   99                MOVELER,2      MSG
     C   99                GOTO STEP2
     C           STEP11    TAG
     C                     MOVE CL,I      UCL
     C           UCLM      CABNE'MENU'    STEP14
     C                     MOVE UCLN      WMNO
     C                     MOVE WMNO      PMNNO
     C                     Z-ADD0         DDAN
     C                     GOTO STEP4
     C           STEP14    TAG
     C                     MOVE CL,I      PCL
     C                     MOVE NO,I      WMENO
     C                     MOVELWMENO     PMNNO
     C                     GOTO END
     C****************************************************************
     C*       jﾞbﾒﾅgﾞﾑcﾆz fﾞ jﾞbﾒﾅgﾞﾑc xpﾏ- ﾉ ﾑﾍﾞjﾞﾆ                 *
     C****************************************************************
     C           STEP5     TAG
     C                     MOVE *BLANK    TC
     C                     MOVE *BLANK    TM
     C                     MOVEL'00000'   KUS    10
     C                     MOVELUBMON     KUS
     C                     Z-ADD1         N       20
     C           KUS       SETLLRGAPL11
     C           STEP9     TAG
     C                     READ RGAPL11                  14
     C   14                GOTO STEP8
     C           J8SKJY    CABEQ'D'       STEP9
TCHK1C           J8PROF    IFEQ 'I0022'
TCHK3C           J8PROF    OREQ 'I0023'
TCHK1C           J8PROF    OREQ 'I0034'
TCHK1C           J8PROF    OREQ 'I0777'
TCHK1C           J8PROF    OREQ 'I0888'
TCHK4C           J8PROF    OREQ 'I0995'
TCHK1C           J8PROF    OREQ 'I0996'
TCHK1C           J8PROF    OREQ 'I0998'
TCHK1C           J8PROF    OREQ 'I0999'
TCHK1C           J8PROF    OREQ 'A2034'
TCHK1C                     GOTO STEP9
TCHK1C                     END
     C           JBMON     COMP UBMON                1414
     C   14                GOTO STEP8
     C                     MOVELJ8PROF    TC,N
     C                     MOVELJ8NAME    TM,N
     C           N         COMP 42                   15  15
     C   15                GOTO STEP8
     C           N         ADD  1         N
     C                     GOTO STEP9
     C           STEP8     TAG
     C                     WRITEEGBPW012
     C                     READ EGBPW01                7172
     C           *IN71     IFEQ '1'
     C           @STTS     IFEQ 1331
     C                     MOVE 'D'       PSYS
     C                     GOTO STEP12
     C                     END
     C                     END
     C                     SETOF                     99
      *
     C           *INKB     IFEQ *ON
     C                     CALL 'AJPC01'
     C                     GOTO STEP8
     C                     ENDIF
      *
     C   KC 10             GOTO STEP7
     C   KC 11             GOTO STEP2
     C           CHGUS     COMP *BLANK                   99
     C   99                MOVELER,4      MSG
     C   99                GOTO STEP8
     C                     SETOF                     16
     C           CHGUS     LOKUPTC                       16
     C  N16                SETON                     99
     C   99                MOVELER,8      MSG
     C   99                GOTO STEP8
     C           USBL      COMP *BLANK               9999
     C   99                MOVELER,7      MSG
     C   99                GOTO STEP8
     C           CHGUS     CHAINRGAPL11              99
     C   99                MOVELER,5      MSG
     C   99                GOTO STEP8
     C           CBMON     COMP UBMON                9999
     C   99                MOVELER,6      MSG
     C   99                GOTO STEP8
     C                     MOVELCHGUS     UUSER
     C                     Z-ADD0         M1MNNO
     C                     Z-ADD0         M1MNDN
     C                     MOVE '01'      UM1
     C                     MOVE '99'      UM2
     C                     Z-ADD0         DDAN    10
     C                     SETON                     08
     C                     MOVE '01'      PMNNO
     C                     MOVE *BLANK    CHGUS
     C                     GOTO STEP4
     C           END       TAG
     C                     Z-ADD0         MENO
     C                     SETON                     LR
**
E-01 MENU NO ISN'T INPUT
E-02 MENU NO WHICH WAS INPUT INTO IS NOT IN THIS MENU
E-03 MENU WHICH YOU CAN OPERATE IS NOT
E-04 WORK NO THAT SUBSTITUTION WORKS ISN'T INPUT
E-05 WORK NO THAT SUBSTITUTION WORKS DOESN'T EXIST
E-06 SUBSTITUTION WORK OF THE OTHER DEPT ISN'T COMPLETED
E-07 WORK NO IS 5 COLUMNS. CHANGE IT
E-08 WORK NO INPUT IS NOT IN THIS SCREEN
**
MENU-EXCLUSIVE SECURITY IN CHARGE
  MENU-EXCLUSIVE SYSTEM OPERATOR
    MENU-EXCLUSIVE PROGRAMMER
         WORKSTATION MENU
