     H            Y.
     F** EIAR02 ******************************
     F* .. MENU ACCOUNT BOOK BY SYSTEM .. *.
     F* I-HASADA                95.10.31     *
     F****************************** EIAR02 **
     FEIAPP01 IP  E                    DISK
     FEIAWP02 O   F     100            DISK
     I            DS
     I                                        1   80EISKHZ
     I                                        1   40EISKYY
     I                                        5   60EISKMM
     I                                        7   80EISKDD
      *
     C           EISKJY    IFEQ 'D'
     C           EISKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     EXCPTDT
      *
     C                     END
      *
     OEIAWP02 E                DT
     O                         EIPROG     6
     O                         EISTEM     8
     O                         EIOUT1    10
     O                         EIOUT2    11
     O                         EIBSYO    13
