     H            Y.
     F** EJKR20 **********************************
     F* B2B  DELETE OLD DATA OF MANAGEMENT FILE  *
      *    **ORIGINAL IS JK182R FROM ASJ**       *
     F*  T.SAKAKI              2016.10.12        *
     F********************************************
     FEJKPP01 UF  E                    DISK
     FEJKPP40 UF  E                    DISK
     FEJKPP50 UF  E                    DISK
     FEJKPP55 UF  E                    DISK
     FEJRPP01 UF  E                    DISK
      *
      * WORK FILEDS
     I            DS
     I                                        1   80WDELHZ
     I                                        1   40WDELYY
     I                                        5   60WDELMM
     I                                        7   80WDELDD
     I* SYSTEM VALUE
     I            DS
     I                                        1  140WTIME
     I                                        1   20SYSJI
     I                                        3   40SYSPN
     I                                        5   60SYSBY
     I                                        7  140SYSHZ
     IINFDSP     SDS
     I                                        1  10 PGMNM
     I                                      254 263 USID
     C*
     C                     TIME           WTIME
     C*
     C           DATR12    PLIST
     C                     PARM           PDATE   8
     C                     PARM           PPORM   1        + OR -
     C                     PARM           PDAYS   4
     C                     PARM           PRDAT   8
     C                     PARM           PRTN    1
      *
     C                     MOVE SYSHZ     PDATE
     C                     MOVE '-'       PPORM
     C***                  MOVE '0021'    PDAYS
     C                     MOVE '0090'    PDAYS
     C                     MOVE *BLANK    PRDAT
     C                     MOVE *BLANK    PRTN
     C                     CALL 'DATR12'  DATR12
     C                     MOVE PRDAT     WDELHZ
      *
      *=====================================================
      * EJKPP01
      *=====================================================
     C                     DO   *HIVAL
     C                     READ EJKPP011                 55
     C   55                LEAVE
     C*
     C           DJADHZ    IFLE WDELHZ
     C*
     C           EJKC52    PLIST
     C                     PARM           DJLIBL 10
     C                     PARM           DJFILE 10
     C*
     C                     CALL 'EJKC52'  EJKC52
     C*
     C                     Z-ADD*DATE     DJSKHZ
     C                     MOVELPGMNM     DJKOME
     C                     MOVELUSID      DJKOPG
     C                     DELETEJKPP011
      *
     C                     ENDIF
      *
     C                     ENDDO
      *=====================================================
      * EJKPP40
      *=====================================================
     C                     DO   *HIVAL
     C                     READ EJKPP401                 56
     C   56                LEAVE
     C*
     C           DJADHZ    IFLE WDELHZ
     C*
     C                     CALL 'EJKC52'  EJKC52
     C*
     C                     Z-ADD*DATE     DJSKHZ
     C                     MOVELPGMNM     DJKOME
     C                     MOVELUSID      DJKOPG
     C                     DELETEJKPP401
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
      *=====================================================
      * EJKPP50
      *=====================================================
     C                     DO   *HIVAL
     C                     READ EJKPP501                 57
     C   57                LEAVE
     C           DJADHZ    IFLE WDELHZ
     C*
     C                     CALL 'EJKC52'  EJKC52
     C*
     C                     Z-ADD*DATE     DJSKHZ
     C                     MOVELPGMNM     DJKOME
     C                     MOVELUSID      DJKOPG
     C                     DELETEJKPP501
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
      *=====================================================
      * EJKPP55
      *=====================================================
     C                     DO   *HIVAL
     C                     READ EJKPP551                 58
     C   58                LEAVE
     C           D1TAHZ    IFLE WDELHZ
     C*
     C                     Z-ADD*DATE     D1SKHZ
     C                     MOVELPGMNM     D1KOME
     C                     MOVELUSID      D1KOPG
     C                     DELETEJKPP551
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
      *=====================================================
      * EJRPP01
      *=====================================================
     C                     DO   *HIVAL
     C                     READ EJRPP011                 59
     C   59                LEAVE
     C           E1KOHZ    IFLE WDELHZ
     C*
     C                     Z-ADD*DATE     E1SKHZ
     C                     DELETEJRPP011
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
      *=====================================================
      * END
      *=====================================================
     C                     SETON                     LR
     C                     RETRN
