     H            Y.
     F** EJKR52 ***********************************************
     F* B2B_S  GET FILE NAME AND SET COMPLETE DATE          *
      *           **ORIGINAL IS JK508R FROM ASJ**             *
     F* T.SAKAKI                       2016.10.12             *
     F********************************** EJKR52 ***************
     FEJKPL51 UF  E           K        DISK
     I*
     I            DS
     I                                        1  140@TIME
     I                                        1   60@@TIME
     I                                        7  140@@DATE
     I*
     IINFDSP     SDS
     I                                        1  10 PGMNM
     I                                      254 263 USID
     C*
     C           *ENTRY    PLIST
     C                     PARM           P@JYKB  2         PARTNER GROUP
     C                     PARM           P@LIBL 10         LIBRARY
     C                     PARM           P@FILE 10         FILE
     C                     PARM           P@DKBN  3         EDI DATA CODE
     C                     PARM           P@SAKI 10         RECEIVER
     C*
     C                     TIME           @TIME
     C*
     C           KEY1      KLIST
     C                     KFLD           P@JYKB
     C                     KFLD           P@DKBN
     C                     KFLD           P@LIBL
     C                     KFLD           P@FILE
     C                     KFLD           P@SAKI
     C*
     C                     SETOF                     99
     C           KEY1      CHAINEJKPL51              99
     C                     Z-ADD@@DATE    DJKOHZ
     C                     Z-ADD@@TIME    DJKOTM
     C                     MOVELUSID      DJKOME
     C                     MOVELPGMNM     DJKOPG
     C                     Z-ADD@@DATE    DJKNHZ
     C                     Z-ADD@@TIME    DJKNTM
     C                     UPDATEJKPL511
     C*
     C                     SETON                     LR
     C                     RETRN
