     H            Y.
     F** EJKR59 **********************************
     F* B2B_E  GET ERROR FILE NAME               *
     F* T.SAKAKI          2016.10.12             *
     F********************************** EJKR53 **
     FEJKPL52 IF  E           K        DISK
     I*
     I            DS
     I                                        1  140@TIME
     I                                        1   60@@TIME
     I                                        7  140@@DATE
     I*
     IINFDSP     SDS
     I                                        1  10 PGMNM
     I                                      254 263 USID
     C*
     C           *ENTRY    PLIST
     C                     PARM           P@JYKB  2         PARTNER GROUP
     C                     PARM           P@LIBL 10         LIBRARY
     C                     PARM           P@FILE 10         FILE
     C                     PARM           P@DKBN  3         EDI DATA CODE
     C                     PARM           P@SAKI 10         RECEIVER
     C                     PARM           P@ERDT 32         ERROR DETAIL
     C*
     C                     TIME           @TIME
     C*
     C                     MOVEL*BLANK    P@JYKB
     C                     MOVEL*BLANK    P@LIBL
     C                     MOVEL*BLANK    P@FILE
     C                     MOVEL*BLANK    P@DKBN
     C                     MOVEL*BLANK    P@SAKI
     C                     MOVEL*BLANK    P@ERDT
     C*
     C*
     C           *LOVAL    SETLLEJKPL521
     C                     DO   *HIVAL
     C                     READ EJKPL521                 99
     C   99                LEAVE
     C*
     C           DJSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C* ERROR DATA
     C           DJERHZ    IFNE 0
     C                     MOVELDJJSYS    P@JYKB
     C                     MOVELDJLIBL    P@LIBL
     C                     MOVELDJFILE    P@FILE
     C                     MOVELDJDKBN    P@DKBN
     C                     MOVELDJSAKI    P@SAKI
     C                     MOVELDJERDT    P@ERDT
     C                     LEAVE
     C                     ENDIF
     C*
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
