     H            Y/                                    1
     **** EJKR15 ******************************************************
     **   B2B PROGRAM M/F MAINTENANCE                                 *
     **   DATE WRITEN     :  2016.11.02                               *
     **                   :  J.WATANABE                               *
     ******************************************************************
     FEJKPW15 CF  E                    WORKSTN
     F                                              KINFDS WSDS
     FFGBPL01 IF  E           K        DISK
     FEJKPP10 UF  E           K        DISK                      A
     **==============================================================**
     E                    @SL     1   3  6                SELECT
     E                    @MS     1  18 53                ERR MSG
     **==============================================================**
     I            DS
     I                                        1  140S@TIME
     I                                        1   60S@HMS
     I                                        1   20S@TMHH
     I                                        3   40S@TMMM
     I                                        5   60S@TMSS
     I                                        7  140S@YYMD
     I                                        7  100S@DYYY
     I                                       11  120S@DYMM
     I                                       13  140S@DYDD
     IWSDS        DS
     I                                    B 370 3710S@CUR
     I                                      370 370 S@LIN
     I                                      371 371 S@COL
     I                                    B 378 3790S@POS
     I            DS
     I                                        1   8 W@SEL
     I                                        1   1 W@SEL1
     I                                        2   2 W@HF
     I                                        3   8 W@SEL2
     I            DS
     I                                        1   4 W1HFID
     I                                        1   1 W1SNRV
     I                                        2   4 W1DKBN
     I           SDS
     I                                     *PROGRAM S@PGID
     I                                      244 253 S@WSID
     I                                      254 263 S@USID
     I                                      264 269 S@JBID
     **==============================================================**
     **                    MAIN ROUTINE                              **
     **==============================================================**
      *
     C                     EXSR #INIT
      *
     C           W@NEXT    DOUEQ'END  '
      * SCREEN1
     C           W@NEXT    CASEQ'SET10'   #SET10
     C           W@NEXT    CASEQ'PNL10'   #PNL10
     C           W@NEXT    CASEQ'CHK10'   #CHK10
      * SCREEN2
     C           W@NEXT    CASEQ'SET20'   #SET20
     C           W@NEXT    CASEQ'PNL20'   #PNL20
     C           W@NEXT    CASEQ'CHK20'   #CHK20
     C**         W@NEXT    CASEQ'WIN20'   #WIN20
      *
     C           W@NEXT    CASEQ'DBOUT'   #DBOUT
     C                     END
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-------------------------------------------------------------------------
      * SET INITIAL VALUE FOR SCREEN1
      *-------------------------------------------------------------------------
     C           #SET10    BEGSR
      *
     C                     SETOF                     909192
     C                     SETOF                     414243
     C                     SETOF                     4445
     C                     SETOF                     99
      *
     C                     MOVEL*BLANK    D1SEL
     C                     MOVEL*BLANK    D1JSYS
     C                     MOVEL*BLANK    D1SNRV
     C                     MOVEL*BLANK    D1DKBN
     C                     MOVEL*BLANK    D1MSG
      *
      * NEXT-CONTROL
     C                     MOVEL'PNL10'   W@NEXT           G1-PNL
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      * SCREEN1 PROCESS
      *-------------------------------------------------------------------------
     C           #PNL10    BEGSR
      *
     C                     EXFMTDSP01
      *
     C                     SETOF                     909192
     C                     SETOF                     414243
     C                     SETOF                     4445
     C                     SETOF                     99
     C                     MOVEL*BLANK    D1MSG            * ERR MSG
      *
      * F03: END
     C           *INKA     IFEQ *ON
     C                     MOVEL'END  '   W@NEXT
     C                     GOTO XPNL10
     C                     ENDIF
      * F12: INQ
     C           *INKL     IFEQ *ON
     C                     CALL 'EJKR16'
     C                     PARM           D1JSYS
     C                     PARM           D1SNRV
     C                     PARM           D1DKBN
     C                     MOVEL'PNL10'   W@NEXT
     C                     GOTO XPNL10
     C                     ENDIF
      * ENTER
     C                     MOVEL'CHK10'   W@NEXT
      *
     C           XPNL10    ENDSR
      *-------------------------------------------------------------------------
      *  CHECK FIELDS OF SCREEN1
      *-------------------------------------------------------------------------
     C           #CHK10    BEGSR
      *
     C           D1SEL     IFNE '0'
     C           D1SEL     ANDNE'1'
     C           D1SEL     ANDNE'2'
     C  N99                MOVEL@MS,01    D1MSG     P
     C  N99                SETON                     4199
     C                     GOTO XCHK10
     C                     ENDIF
      *
     C                     SELEC
     C           D1SEL     WHEQ '0'
     C                     SETON                     90
     C           D1SEL     WHEQ '1'
     C                     SETON                     91
     C           D1SEL     WHEQ '2'
     C                     SETON                     92
     C                     ENDSL
      *
     C           D1JSYS    IFEQ *BLANK
     C           D1SNRV    ANDEQ*BLANK
     C           D1DKBN    ANDEQ*BLANK
     C  N99                MOVEL@MS,02    D1MSG     P
     C  N99                SETON                     424344
     C  N99                SETON                     4599
     C                     GOTO XCHK10
     C                     ENDIF
      * CHECK R/S
     C           D1SNRV    IFNE 'S'
     C           D1SNRV    ANDNE'R'
     C  N99                MOVEL@MS,06    D1MSG     P
     C  N99                SETON                     43
     C  N99                SETON                     4599
     C                     GOTO XCHK10
     C                     ENDIF
      *
     C           *IN99     IFEQ '0'
     C                     MOVELD1JSYS    K@JSYS
     C                     MOVELD1SNRV    K@SNRV
     C                     MOVELD1DKBN    K@DKBN
     C           K@EJK     CHAINEJKPP10             N80
     C           *IN80     IFEQ '0'
      * ADD
     C           D1SEL     IFEQ '2'
     C           DPSKJY    IFEQ 'D'
     C                     ELSE
     C  N99                MOVEL@MS,05    D1MSG     P
     C  N99                SETON                     424344
     C  N99                SETON                     4599
     C                     GOTO XCHK10
     C                     ENDIF
     C                     ENDIF
      * CHANGE/DELETE
     C           D1SEL     IFEQ '0'
     C           D1SEL     OREQ '1'
     C           DPSKJY    IFEQ 'D'
     C  N99                MOVEL@MS,04    D1MSG     P
     C  N99                SETON                     424344
     C  N99                SETON                     4599
     C                     ENDIF
     C                     ENDIF
      *
     C                     ELSE
      * CHANGE/DELETE
     C           D1SEL     IFEQ '0'
     C           D1SEL     OREQ '1'
     C  N99                MOVEL@MS,03    D1MSG     P
     C  N99                SETON                     424344
     C  N99                SETON                     4599
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
      *
     C           D1SNRV    IFEQ 'S'
     C                     MOVE *OFF      *IN45
     C                     ELSE
     C                     MOVE *ON       *IN45
     C                     ENDIF
      *
      * NEXT-CONTROL
     C           XCHK10    TAG
     C           *IN99     IFEQ *ON
     C                     MOVEL'PNL10'   W@NEXT
     C                     ELSE
     C                     MOVEL'SET20'   W@NEXT
     C                     ENDIF
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      * SET INITIAL VALUE OF SCREEN2
      *-------------------------------------------------------------------------
     C           #SET20    BEGSR
      *
     C                     SETOF                     515253
     C                     SETOF                     545556
     C                     SETOF                     575859
     C                     SETOF                     60
     C                     SETOF                     99
      *
     C                     MOVEL*BLANK    D2RPG1
     C                     Z-ADD2048      D2LENG
     C                     MOVEL*BLANK    D2CPG1
     C                     MOVEL*BLANK    D2HOST
     C                     MOVEL*BLANK    D2LIBL
     C                     MOVEL*BLANK    D2FILE
     C                     MOVEL*BLANK    D2NONY
      *
     C                     MOVEL*BLANK    W1HFID
     C                     MOVELD1SNRV    W1SNRV
     C                     MOVELD1DKBN    W1DKBN
      *
     C                     MOVELW1HFID    D2HFID
     C                     MOVEL*BLANK    D2PTID
     C                     MOVELW1HFID    D2FNAM
     C                     MOVEL*BLANK    D2MSG
      * SET UPD TITLE
     C                     MOVELD1SEL     W@SEL1
     C                     MOVEL'-'       W@HF
     C                     SELEC
     C           D1SEL     WHEQ '0'
     C                     MOVEL@SL,01    W@SEL2
     C           D1SEL     WHEQ '1'
     C                     MOVEL@SL,02    W@SEL2
     C           D1SEL     WHEQ '2'
     C                     MOVEL@SL,03    W@SEL2
     C                     ENDSL
     C                     MOVELW@SEL     D2SEL
      * IF UPD=CHANGE/DELETE
     C           D1SEL     IFEQ '0'
     C           D1SEL     OREQ '1'
     C                     MOVELDPRPG1    D2RPG1
     C                     MOVELDPLENG    D2LENG
     C                     MOVELDPCPG1    D2CPG1
     C                     MOVELDPHOST    D2HOST
     C                     MOVELDPLIBL    D2LIBL
     C                     MOVELDPFILE    D2FILE
     C                     MOVELDPNONY    D2NONY
     C                     MOVELDPHFID    D2HFID
     C                     MOVELDPPTID    D2PTID
     C                     MOVELDPFNAM    D2FNAM
     C                     ENDIF
      *
      * NEXT-CONTROL
     C                     MOVEL'PNL20'   W@NEXT
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *  SCREEN2 PROCESS
      *-------------------------------------------------------------------------
     C           #PNL20    BEGSR
      *
     C                     EXFMTDSP02
      *
     C                     SETOF                     515253
     C                     SETOF                     545556
     C                     SETOF                     575859
     C                     SETOF                     60
     C                     SETOF                     99
     C                     MOVEL*BLANK    D2MSG            * ERR MSG
      *
      * NEXT-CONTROL
     C                     MOVEL'CHK20'   W@NEXT
      * IF F3
     C           *INKC     IFEQ *ON
     C           *INKL     OREQ *ON
     C                     MOVEL'PNL10'   W@NEXT
     C                     ENDIF
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *  CHECK FILEDS OF SCREEN2
      *-------------------------------------------------------------------------
     C           #CHK20    BEGSR
      * IF RECEIVE ----------------
      *    CHECK PGM
     C           D1SNRV    IFEQ 'R'
     C           D2RPG1    ANDEQ*BLANK
     C  N99                MOVEL@MS,09    D2MSG     P
     C  N99                SETON                     51  99
     C                     GOTO SKIP2
     C                     ENDIF
     C           D1SNRV    IFEQ 'R'
     C           D2LENG    ANDEQ0
     C  N99                MOVEL@MS,18    D2MSG     P
     C  N99                SETON                     52  99
     C                     GOTO SKIP2
     C                     ENDIF
      * IF SEND -------------------
     C           D1SNRV    IFEQ 'S'
      *    CHECK PGM
     C           D2CPG1    IFEQ *BLANK
     C  N99                MOVEL@MS,10    D2MSG     P
     C  N99                SETON                     53  99
     C                     GOTO SKIP2
     C                     ENDIF
      *    CHECK HULFT FILE ID
     C           D2HFID    IFEQ *BLANK
     C  N99                MOVEL@MS,17    D2MSG     P
     C  N99                SETON                     60  99
     C                     GOTO SKIP2
     C                     ENDIF
      *    CHECK FILE NAME
     C           D2FNAM    IFEQ *BLANK
     C  N99                MOVEL@MS,13    D2MSG     P
     C  N99                SETON                     55  99
     C                     GOTO SKIP2
     C                     ENDIF
      *    CHECK SERVER NAME
     C           D2HOST    IFEQ *BLANK
     C  N99                MOVEL@MS,14    D2MSG     P
     C  N99                SETON                     56  99
     C                     GOTO SKIP2
     C                     ENDIF
      *    CHECK RECEPT LIB
     C           D2LIBL    IFEQ *BLANK
     C  N99                MOVEL@MS,15    D2MSG     P
     C  N99                SETON                     57  99
     C                     GOTO SKIP2
     C                     ENDIF
      *    CHECK RECEPT FILE
     C           D2FILE    IFEQ *BLANK
     C  N99                MOVEL@MS,16    D2MSG     P
     C  N99                SETON                     58  99
     C                     GOTO SKIP2
     C                     ENDIF
     C                     ENDIF
      * COMMON FIELD -----------------
      *    CHECK DETAIL CODE
     C           D2NONY    IFNE *BLANK
     C                     MOVELD2NONY    NUM4    40
     C           NUM4      CHAINFGBPL01              95
     C           *IN95     IFEQ *ON
     C  N99                MOVEL@MS,11    D2MSG     P
     C  N99                SETON                     59
     C  N99                SETON                     99
     C                     GOTO SKIP2
     C                     ENDIF
     C                     ENDIF
      *    CHECK PARTNER ID
     C           D2PTID    IFEQ *BLANK
     C  N99                MOVEL@MS,12    D2MSG     P
     C  N99                SETON                     54  99
     C                     GOTO SKIP2
     C                     ENDIF
      *
      * NEXT-CONTROL
     C           SKIP2     TAG
     C                     MOVEL'PNL20'   W@NEXT
      * IF F5
     C           *IN05     IFEQ '1'
     C           *IN99     ANDEQ'0'
     C                     MOVEL'DBOUT'   W@NEXT
     C                     ENDIF
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *  UPDATE RECORD
      *-------------------------------------------------------------------------
     C           #DBOUT    BEGSR
      *
     C                     TIME           S@TIME
      *
     C                     MOVELD1JSYS    K@JSYS
     C                     MOVELD1SNRV    K@SNRV
     C                     MOVELD1DKBN    K@DKBN
     C           K@EJK     CHAINEJKPP10              80
      *
      * DELETE
     C           D1SEL     IFEQ '0'
     C           *IN80     IFEQ '0'
     C                     EXSR #DEL10
     C                     ENDIF
     C                     ELSE
      * ADD / CHANGE
     C           *IN80     IFEQ '0'
      * ADD(UPDAT)
     C           D1SEL     IFEQ '2'
     C                     EXSR #WRT11
     C                     ENDIF
      * CHANGE
     C           D1SEL     IFEQ '1'
     C                     EXSR #UPD10
     C                     ENDIF
     C                     ELSE
      * ADD(WRITE)
     C                     EXSR #WRT10
     C                     ENDIF
     C                     ENDIF
      *
      * NEXT-CONTROL
     C                     MOVEL'SET10'   W@NEXT
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      * WRITE RECORD
      *-------------------------------------------------------------------------
     C           #WRT10    BEGSR
      *
     C                     CLEAREJKPP101
      *
     C                     Z-ADDS@YYMD    DPKOHZ
     C                     Z-ADDS@HMS     DPKOTM
     C                     MOVELS@PGID    DPKOPG
     C                     MOVELS@USID    DPKOME
     C                     MOVELD1JSYS    DPJSYS
     C                     MOVELD1SNRV    DPSNRV
     C                     MOVELD1DKBN    DPDKBN
     C                     MOVELD2RPG1    DPRPG1
     C                     Z-ADDD2LENG    DPLENG
     C                     MOVELD2CPG1    DPCPG1
     C                     MOVELD2HFID    DPHFID
     C                     MOVELD2PTID    DPPTID
     C                     MOVELD2FNAM    DPFNAM
     C                     MOVELD2HOST    DPHOST
     C                     MOVELD2LIBL    DPLIBL
     C                     MOVELD2FILE    DPFILE
     C                     MOVELD2NONY    DPNONY
      *
     C                     WRITEEJKPP101
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *  WRITE(UPDATE) RECORD
      *-------------------------------------------------------------------------
     C           #WRT11    BEGSR
      *
     C                     MOVEL*BLANK    DPSKJY
     C                     Z-ADD*ZERO     DPSKHZ
     C                     Z-ADDS@YYMD    DPKOHZ
     C                     Z-ADDS@HMS     DPKOTM
     C                     MOVELS@PGID    DPKOPG
     C                     MOVELS@USID    DPKOME
     C                     MOVELD2RPG1    DPRPG1
     C                     Z-ADDD2LENG    DPLENG
     C                     MOVELD2CPG1    DPCPG1
     C                     MOVELD2HFID    DPHFID
     C                     MOVELD2PTID    DPPTID
     C                     MOVELD2FNAM    DPFNAM
     C                     MOVELD2HOST    DPHOST
     C                     MOVELD2LIBL    DPLIBL
     C                     MOVELD2FILE    DPFILE
     C                     MOVELD2NONY    DPNONY
      *
     C                     UPDATEJKPP101
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      * UPDATE RECORD
      *-------------------------------------------------------------------------
     C           #UPD10    BEGSR
      *
     C                     MOVEL*BLANK    DPSKJY
     C                     Z-ADD*ZERO     DPSKHZ
     C                     Z-ADDS@YYMD    DPKOHZ
     C                     Z-ADDS@HMS     DPKOTM
     C                     MOVELS@PGID    DPKOPG
     C                     MOVELS@USID    DPKOME
     C                     MOVELD2RPG1    DPRPG1
     C                     Z-ADDD2LENG    DPLENG
     C                     MOVELD2CPG1    DPCPG1
     C                     MOVELD2HFID    DPHFID
     C                     MOVELD2PTID    DPPTID
     C                     MOVELD2FNAM    DPFNAM
     C                     MOVELD2HOST    DPHOST
     C                     MOVELD2LIBL    DPLIBL
     C                     MOVELD2FILE    DPFILE
     C                     MOVELD2NONY    DPNONY
      *
     C                     UPDATEJKPP101
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      * DELETE(UPDATE) RECORD
      *-------------------------------------------------------------------------
     C           #DEL10    BEGSR
      *
     C                     MOVEL'D'       DPSKJY           * DELETE CODE D
     C                     Z-ADDS@YYMD    DPSKHZ           * DELETE DATE
     C                     Z-ADDS@YYMD    DPKOHZ           * UPDATE DATE
     C                     Z-ADDS@HMS     DPKOTM           * UPDATE TIME
     C                     MOVELS@PGID    DPKOPG           * UPDATE PROGRAM
     C                     MOVELS@USID    DPKOME           * UPDATE PERSON
      *
     C                     UPDATEJKPP101
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *  INITIAL PROCESS
      *-------------------------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           K@EJK     KLIST
     C                     KFLD           K@JSYS  2
     C                     KFLD           K@SNRV  1
     C                     KFLD           K@DKBN  3
      * NEXT-CONTROL
     C                     MOVEL'SET10'   W@NEXT  5
      *
     C                     ENDSR
      *----------------------------------------------------------------
**  @SL  ( SELECT )
DELETE
CHANGE
ADD
**  @MS  ( ERR MSG )
ER01 SELECT 0, 1 OR 2!
ER02 ENTER KEYS!
ER03 NOT EXSIST IN B2B PROGRAM MASTER(EJKPP10)!
ER04 KEYS ALREADY DELETED!
ER05 KEYS EXIST IN B2B PROGRAM MASTER(EJKPP10)!
ER06 R/S SHOULD BE R OR S!
ER07 ENTER RCV OR SND PROGRAM!
ER08 ENTER RCV OR SND PROGRAM EXCLUSIVELY!
ER09 ENTER RCV PROGRAM!
ER10 ENTER SND PROGRAM!
ER11 DETAIL CODE IS NOT IN M/F(FGBPL01)!
ER12 ENTER B2B PARTNER ID!
ER13 ENTER B2B FILE NAME!
ER14 ENTER SERVER NAME!
ER15 ENTER RECEPTION LIBRARY!
ER16 ENTER RECEPTION FILE!
ER17 ENTER HULFT FILE ID !
ER18 INPUT CORRECT DIGITS.
