     H            Y.
     F** EJKR36 *************************************
     F* UPDATE & RE-PROCESS B2B_R MANAGEMENT FILE   *
     F*  T.SAKAKI         2016.12.13                *
     F***********************************************
     FEJKPW36 CF  E                    WORKSTN
     I*
     FEJKPL03 UF  E           K        DISK
      *
     I            DS
     I                                        1  140@TIME
     I                                        1   60@@TIME
     I                                        7  140@@DATE
     I*
     IINFDSP     SDS
     I                                        1  10 PGMNM
     I                                      254 263 USID
      *=====================================================
      * ENTRY LIST
      *=====================================================
     C           *ENTRY    PLIST
     C                     PARM           P@JYKB  2         PARTNER GROUP
     C                     PARM           P@DKBN  3         EDI DATA CODE
     C                     PARM           P@LIBL 10         LIBRARY
     C                     PARM           P@FILE 10         FILE
      *=====================================================
      * KEY LIST
      *=====================================================
     C           KEY1      KLIST
     C                     KFLD           P@JYKB
     C                     KFLD           P@DKBN
     C                     KFLD           P@LIBL
     C                     KFLD           P@FILE
      *=====================================================
      * MAIN ROUTINE
      *=====================================================
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *=====================================================
     C*  INITIAL SET
      *=====================================================
     C           #SB100    BEGSR
     C*
     C                     MOVEL'01'      DSPSW   2
     C                     MOVEL*BLANK    D1MSG
     C                     SETOF                     606162
     C                     SETOF                     99
     C*
     C*
     C                     SETOF                     80
     C           KEY1      CHAINEJKPL03              80
     C           *IN80     IFEQ *OFF
     C*
     C                     MOVELDJJSYS    D1JSYS
     C                     MOVELDJDKBN    D1DKBN
     C                     MOVELDJPTID    D1PTID
     C                     MOVELDJSAKI    D1SAKI
     C                     MOVELDJORGF    D1ORGF
     C                     MOVELDJLIBL    D1LIBL
     C                     MOVELDJFILE    D1FILE
     C                     Z-ADDDJADHZ    D1ADHZ
     C                     Z-ADDDJADTM    D1ADTM
     C                     Z-ADDDJKNHZ    D1KNHZ
     C                     Z-ADDDJKNTM    D1KNTM
     C                     Z-ADDDJERHZ    D1ERHZ
     C                     Z-ADDDJERTM    D1ERTM
     C                     MOVELDJERDT    D1ERDT
     C*
     C                     ENDIF
     C*
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
     C******************************************************
     C* 1ST SCREEN
     C******************************************************
     C           #SB210    BEGSR
     C*
     C                     EXFMTEJKPW361
     C                     MOVEL*BLANK    D1MSG
     C                     SETOF                     606162
     C                     SETOF                     99
      * F3 BACK
     C           *INKC     IFEQ '1'
     C                     MOVEL'99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
     C*-------------------------------
     C* F23 DELETE
     C*-------------------------------
     C           *INKX     IFEQ *ON
     C                     EXSR @DELET
     C                     MOVEL'99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
     C*-----------------------
     C* CHECK INPUT
     C*-----------------------
     C*-------------------------------
     C* F5 UPDATE & RESEND
     C*-------------------------------
     C           *IN99     IFEQ *OFF
     C           *INKE     IFEQ *ON
     C                     EXSR @UPDAT
     C                     MOVEL'99'      DSPSW
     C                     ENDIF
     C                     ENDIF
     C*
     CSR         ESB210    ENDSR
      *=====================================================
     C*  UPDATE
      *=====================================================
     C           @UPDAT    BEGSR
     C*
     C                     TIME           @TIME
     C*
     C                     SETOF                     80
     C           KEY1      CHAINEJKPL03              80
     C           *IN80     IFEQ *OFF
     C                     Z-ADD0         DJKNHZ            END DATE
     C                     Z-ADD0         DJKNTM            END TIME
     C                     Z-ADD0         DJERHZ            ERROR DATE
     C                     Z-ADD0         DJERTM            ERROR TIME
     C                     MOVEL*BLANK    DJERID            ERROR ID
     C                     MOVEL*BLANK    DJERDT            ERROR DETAIL
     C                     Z-ADD@@DATE    DJKOHZ            UPDATE DATE
     C                     Z-ADD@@TIME    DJKOTM            UPDATE TIME
     C                     MOVELUSID      DJKOME            UPDATE USER
     C                     MOVELPGMNM     DJKOPG            UPDATE PGM
     C                     UPDATEJKPL031
     C                     ENDIF
     C*
     C                     ENDSR
      *=====================================================
     C*  DELETE
      *=====================================================
     C           @DELET    BEGSR
     C*
     C                     TIME           @TIME
     C*
     C                     SETOF                     80
     C           KEY1      CHAINEJKPL03              80
     C           *IN80     IFEQ *OFF
     C                     MOVEL'D'       DJSKJY            ERROR ID
     C                     Z-ADD@@DATE    DJSKHZ            DELETE DATE
     C                     Z-ADD@@DATE    DJKOHZ            UPDATE DATE
     C                     Z-ADD@@TIME    DJKOTM            UPDATE TIME
     C                     MOVELUSID      DJKOME            UPDATE USER
     C                     MOVELPGMNM     DJKOPG            UPDATE PGM
     C                     UPDATEJKPL031
     C                     ENDIF
     C*
     C                     ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
