     H            Y.
      ** EJRR14 *******************************************************
      * R820FORD (REMITTANCE ADV) CREATE AB#PP6J/6K/6L                *
      * J.WATANABE   2017.04.11                                       *
JW1   * J.WATANABE   2021.04.26 ADD 2 FIELDS FOR HEADER (EB#PP6L)     *
      *****************************************************************
     FEB#PP6A IF  E           K        DISK
     FEJGPL00 IF  E           K        DISK
     FEB#PP6J O   E                    DISK
     FEB#PP6K O   E                    DISK
     FEB#PP6L O   E                    DISK
      *****************************************************************
     E                    TB1      1400  1
     E                    TB2        70  1
     E                    TB3        15  1
      *
     I            DS
     I                                        1 256 #DATA
     I                                        1   1 @KUBN
     I                                        2   7 @RCID
     I                                        8  18 @PRTN
     I                                       10  69 @MSG
     I                                       27  38 @JREF1
     I                                      198 210 @JREF2
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *================================================================
      *  MAIN
      *================================================================
     C                     EXSR #INIT
     C                     MOVEL'FORD820' K1RCID
      *----------------------------------------
     C                     DO   *HIVAL
     C                     READ EB#PP6A                  90
     C   90                LEAVE
     C                     MOVELE1DATA    #DATA
     C                     MOVEAE1DATA    TB1
     C                     MOVEL@KUBN     K2RTYP
      *
     C                     SELEC
      * HEADER
     C           E1TYPE    WHEQ 'H'
     C                     EXSR #HSET
      * ADJUST
     C           E1TYPE    WHEQ 'J'
     C                     EXSR #JSET
      * RMR
     C           E1TYPE    WHEQ 'R'
     C                     EXSR #RSET
      *
     C                     ENDSL
      *
     C                     ENDDO
      *----------------------------------------
      *
     C                     SETON                     LR
     C                     RETRN
      *================================================================
      *  GET HEADER --> EB#PP6L
      *================================================================
     C           #HSET     BEGSR
     C                     MOVEL'OT01'    K3AFIL
     C* CLEAR
     C                     CLEAREB#PP6L1
      * ALRENO  HDR
     C                     MOVEL'ALRENO'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       ALRENO
     C                     MOVEL@AN       @@RENO 20
      * ALCNM1  HDR
     C                     MOVEL'ALCNM1'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       ALCNM1
     C                     MOVEL@AN       @@CNM1 20
      * ALCNM2  HDR
     C                     MOVEL'ALCNM2'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       ALCNM2
     C                     MOVEL@AN       @@CNM2 20
      * ALMAMT  HDR
     C                     MOVEL'ALMAMT'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     Z-ADD@NUM      ALMAMT
     C                     Z-ADD@NUM      @@MAMT 122
      * ALDBCR  HDR
     C                     MOVEL'ALDBCR'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       ALDBCR
     C                     MOVEL@AN       @@DBCR  1
JW1   * ALDFI#  HDR
     C                     MOVEL'ALDFI#'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       ALDFI#
     C                     MOVEL@AN       @@DFI# 12
JW1   * ALACC#  HDR
     C                     MOVEL'ALACC#'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       ALACC#
     C                     MOVEL@AN       @@ACC# 35
      * WRITE
     C                     WRITEEB#PP6L1
      *
     C           EHDSET    ENDSR
      *================================================================
      *  GET ADJUST --> EB#PP6J
      *================================================================
     C           #JSET     BEGSR
      * CHECK DUPLICATE
     C           @JREF1    IFEQ SJREF1
     C           @JREF2    ANDEQSJREF2
     C                     GOTO EJSET
     C                     ENDIF
     C* CLEAR
     C                     CLEAREB#PP6J1
     C                     MOVEL@@RENO    APRENO
     C                     MOVEL@@CNM1    APCNM1
     C                     MOVEL@@CNM2    APCNM2
     C                     Z-ADD@@MAMT    APMAMT
     C                     MOVEL@@DBCR    APDBCR
      * APAJST ADJ
     C                     MOVEL'APAJST'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     Z-ADD@NUM      APAJST
      * APAJCD ADJ
     C                     MOVEL'APAJCD'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APAJCD
      * APADAT  ADJ
     C                     MOVEL'APADAT'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     Z-ADD@DATE8    APADAT
      * APREQL  ADJ (ALWAYS PM)
     C**                   MOVEL'APREQL'  K4AFLD
     C**                   MOVE *BLANK    K4EGRP
     C**                   EXSR #GET
     C**                   MOVEL@AN       APREQL
     C                     MOVEL'PM'      APREQL
      * APREFN  ADJ (ALWAYS PART#)
     C                     MOVEL'APREFN'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APREFN
      * APDATE  ADJ
     C                     MOVEL'APDATE'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     Z-ADD@DATE8    APDATE
      * APINVN  ADJ
     C                     MOVEL'APINVN'  K4AFLD
     C                     MOVEL'IV   '   K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APINVN
      * APTRNS  ADJ
     C                     MOVEL'APTRNS'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APTRNS
      * APPLNT  ADJ
     C                     MOVEL'APPLNT'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APPLNT
      * APNTE2  ADJ
     C                     MOVEL'APNTE2'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APNTE2
      * WRITE
     C                     MOVEL@JREF1    JWREF1
     C                     MOVEL@JREF2    JWREF2
      *
     C           APDATE    IFNE 0
     C                     WRITEEB#PP6J1
     C                     ENDIF
      *
     C                     MOVEL@JREF1    SJREF1
     C                     MOVEL@JREF2    SJREF2
      *
     C           EJSET     ENDSR
      *================================================================
      *  GET RMR --> EB#PP6K
      *================================================================
     C           #RSET     BEGSR
     C* CLEAR
     C                     CLEAREB#PP6K1
     C                     MOVEL@@RENO    APRENO
     C                     MOVEL@@CNM1    APCNM1
     C                     MOVEL@@CNM2    APCNM2
     C                     Z-ADD@@MAMT    APMAMT
     C                     MOVEL@@DBCR    APDBCR
      * MESSAGE LINE
     C           @KUBN     IFEQ 'M'
     C                     EXSR #RMSG
     C                     GOTO ERMSET
     C                     ENDIF
      * APRM01 RMR
     C                     MOVEL'APRM01'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APRM01
     C                     MOVEL@AN       @@RM01
      * APRM02 RMR
     C                     MOVEL'APRM02'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APRM02
     C                     MOVEL@AN       @@RM02
      * APRM04 RMR
     C                     MOVEL'APRM04'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     Z-ADD@NUM      APRM04
     C                     Z-ADD@NUM      @@RM04
      * APRM05 RMR
     C                     MOVEL'APRM05'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     Z-ADD@NUM      APRM05
     C                     Z-ADD@NUM      @@RM05
      * APRM06 RMR
     C                     MOVEL'APRM06'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     Z-ADD@NUM      APRM06
     C                     Z-ADD@NUM      @@RM06
      * APNTE2 RMR
     C**                   MOVEL'APNTE2'  K4AFLD
     C**                   MOVE *BLANK    K4EGRP
     C**                   EXSR #GET
     C**                   MOVEL@AN       APNTE2
     C**                   MOVEL@AN       @@NTE2
      * APINVN RMR
     C                     MOVEL'APINVN'  K4AFLD
     C                     MOVEL'IV   '   K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APINVN
     C                     MOVEL@AN       @@INVN
      * APPLNT RMR
     C                     MOVEL'APPLNT'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APPLNT
     C                     MOVEL@AN       @@PLNT
      * AFDTM2 RMR
     C                     MOVEL'AFDTM2'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@DATE8    AFDTM2
     C**                   MOVEL@DATE8    @@DTM2
      * APIQTY RMR
     C                     MOVEL'APIQTY'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     Z-ADD@NUM      APIQTY
      * APUNIT RMR
     C                     MOVEL'APUNIT'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     Z-ADD@NUM      APUNIT
      * APPART RMR
     C                     MOVEL'APPART'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APPART
     C                     MOVEL@AN       APPART
      * APTRNS RMR
     C                     MOVEL'APTRNS'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APTRNS
     C                     MOVEL@AN       @@TRNS
      * APPONO RMR
     C                     MOVEL'APPONO'  K4AFLD
     C                     MOVE *BLANK    K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APPONO
     C                     MOVEL@AN       @@PONO
      * APREF2 RMR
     C                     MOVEL'APREF2'  K4AFLD
     C                     MOVEL'CR   '   K4EGRP
     C                     EXSR #GET
     C                     MOVEL@AN       APREF2
     C                     MOVEL@AN       @@REF2
      * WRITE
     C                     WRITEEB#PP6K1
      *
     C           ERMSET    ENDSR
      *================================================================
      * RMR - MESSAGE PROCESS
      *================================================================
     C           #RMSG     BEGSR
      *
     C                     MOVEL@@RM02    APRM02
     C                     MOVEL@@REF2    APREF2
     C                     MOVEL@@RM01    APRM01
     C                     MOVEL@@REF2    APREF2
     C                     Z-ADD@@RM04    APRM04
     C                     Z-ADD@@RM05    APRM05
     C                     Z-ADD@@RM06    APRM06
     C                     MOVEL@@RM06    APRM06
     C                     MOVEL@MSG      APNTE2
     C                     MOVEL@@INVN    APINVN
     C                     MOVEL@@PONO    APPONO
     C                     MOVEL@@PLNT    APPLNT
     C                     MOVEL@@TRNS    APTRNS
      * WRITE
     C                     WRITEEB#PP6K1
     C           ERMSG     ENDSR
      *================================================================
      *  GET VALUE FROM
      *================================================================
     C           #GET      BEGSR
      *
     C                     MOVE '+'       SIGN    1
     C                     MOVEA*BLANK    TB2
     C                     MOVEA*ALL'0'   TB3
     C                     MOVE *BLANK    @AN    60
     C                     Z-ADD0         @N150  150
     C                     Z-ADD0         @N151  151
     C                     Z-ADD0         @N152  152
     C                     Z-ADD0         @N153  153
     C                     Z-ADD0         @N154  154
     C                     Z-ADD0         @N155  155
     C                     Z-ADD0         @DP     20
     C                     Z-ADD0         @DATE6  60
     C                     Z-ADD0         @DATE8  80
      *
     C           K@EJG0    CHAINEJGPL00              98
     C           *IN98     IFEQ *OFF
      *
     C                     SELEC
      * CONSTANT ----------------------------------
     C           E0FTYP    WHEQ 'C '
     C                     MOVELE0VAL1    @AN
      * CHARACTER ---------------------------------
     C           E0FTYP    WHEQ 'AN'
     C           E0FTYP    OREQ 'ID'
     C           E0POS1    SUB  1         IX
     C           1         DO   E0LNG     IY
     C                     ADD  1         IX
     C                     MOVELTB1,IX    TB2,IY
     C                     ENDDO
     C                     MOVEATB2       @AN
      * NUMERIC -----------------------------------
     C           E0FTYP    WHEQ 'DT'
     C           E0FTYP    OREQ 'TM'
     C           E0FTYP    OREQ 'R '
     C           E0POS2    ADD  1         IX
     C                     Z-ADD16        IY
     C                     DO   E0LNG
     C                     SUB  1         IX
     C           IX        IFLT E0POS1
     C                     LEAVE
     C                     ENDIF
     C           TB1,IX    IFEQ '.'
     C           16        SUB  IY        @DP
     C                     ITER
     C                     ENDIF
     C                     SUB  1         IY
     C           IY        IFLE 0
     C                     LEAVE
     C                     ENDIF
     C           TB1,IX    IFEQ '-'
     C                     MOVE '-'       SIGN
     C                     ENDIF
     C           TB1,IX    IFEQ *BLANK
     C           TB1,IX    OREQ '+'
     C           TB1,IX    OREQ '-'
     C                     MOVE '0'       TB3,IY
     C                     ELSE
     C                     MOVELTB1,IX    TB3,IY
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEATB3       LTR15  15
     C                     MOVE LTR15     @N150
     C                     MOVE LTR15     @N151
     C                     MOVE LTR15     @N152
     C                     MOVE LTR15     @N153
     C                     MOVE LTR15     @N154
     C                     MOVE LTR15     @N155
      *
     C                     Z-ADD0         @NUM   154
     C                     SELEC
     C           @DP       WHEQ 0
     C                     Z-ADD@N150     @NUM
     C           @DP       WHEQ 1
     C                     Z-ADD@N151     @NUM
     C           @DP       WHEQ 2
     C                     Z-ADD@N152     @NUM
     C           @DP       WHEQ 3
     C                     Z-ADD@N153     @NUM
     C           @DP       WHEQ 4
     C                     Z-ADD@N154     @NUM
     C           @DP       WHEQ 5
     C                     Z-ADD@N155     @NUM
     C                     ENDSL
      *
     C                     Z-ADD@N150     @DATE6
     C           @DATE6    IFEQ 0
     C                     Z-ADD0         @DATE8
     C                     ELSE
     C           @DATE6    ADD  20000000  @DATE8
     C                     ENDIF
     C           SIGN      IFEQ '-'
     C                     MULT -1        @NUM
     C                     ENDIF
      *    ----------------------------------------
     C                     ENDSL
      *
     C                     ENDIF
     C                     ENDSR
      *================================================================
      *  INITIAL SET
      *================================================================
     C           #INIT     BEGSR
      *
     C           K@EJG0    KLIST
     C                     KFLD           K1RCID
     C                     KFLD           K2RTYP
     C                     KFLD           K3AFIL
     C                     KFLD           K4AFLD
     C                     KFLD           K4EGRP
      *
     C           *LIKE     DEFN E0RCID    K1RCID
     C           *LIKE     DEFN E0RTYP    K2RTYP
     C           *LIKE     DEFN E0AFIL    K3AFIL
     C           *LIKE     DEFN E0AFLD    K4AFLD
     C           *LIKE     DEFN E0EGRP    K4EGRP
      *
     C           *LIKE     DEFN APRM02    @@RM02
     C           *LIKE     DEFN APREF2    @@REF2
     C           *LIKE     DEFN APRM01    @@RM01
     C           *LIKE     DEFN APRM04    @@RM04
     C           *LIKE     DEFN APRM05    @@RM05
     C           *LIKE     DEFN APRM06    @@RM06
     C           *LIKE     DEFN APNTE2    @@NTE2
     C           *LIKE     DEFN APINVN    @@INVN
     C           *LIKE     DEFN APPONO    @@PONO
     C           *LIKE     DEFN APPLNT    @@PLNT
     C           *LIKE     DEFN APTRNS    @@TRNS
      *
     C                     Z-ADD*DATE     @DATE   80
     C                     TIME           @TIME   60
     C                     TIME           WTIME
     C                     Z-ADD0         IX      40
     C                     Z-ADD0         IY      40
     C                     MOVE *BLANK    SJREF1 12
     C                     MOVE *BLANK    SJREF2 13
      *
     C                     ENDSR
