     H            Y.
     F** EJRR16 **********************************
     F*  R820FORD REM ADV (CONVERT FLAT DATA)    *
     F*  J.WATANABE 2017.07.12                   *
     F********************************************
     FR820    IF  F    2048            DISK
     FEB#PP6A O   E                    DISK
     F********************************************
     IR820    AA  01
     I                                        11400 @DATA
     I                                        1   1 @KUBN
     I                                        2   7 @RCID
     I                                      245 274 @REF
      **********************************************************
     C                     Z-ADD*DATE     @DATE   80
     C                     TIME           @TIME   60
     C                     MOVE *BLANK    @@KUBN  1
      *
     C                     DO   *HIVAL
     C                     READ R820                     90
     C   90                LEAVE
      *
     C           @KUBN     IFEQ *BLANK
     C                     ITER
     C                     ENDIF
      *
     C           @KUBN     IFEQ 'H'
     C                     MOVEL@REF      @@REF  20
     C                     ENDIF
     C                     MOVEL@@REF     E1REF
      *
     C           @KUBN     IFEQ 'H'
     C           @KUBN     OREQ 'R'
     C           @KUBN     OREQ 'A'
     C           @KUBN     OREQ 'T'
     C                     MOVEL@KUBN     E1TYPE
     C                     MOVEL@RCID     E1SEQ#
     C                     MOVE *BLANK    E1ATTR
     C                     MOVEL@KUBN     @@TYPE  1
     C                     MOVEL@RCID     @@SEQ#  6
     C                     ELSE
     C                     MOVEL@@TYPE    E1TYPE
     C                     MOVEL@@SEQ#    E1SEQ#
     C                     MOVEL'M'       E1ATTR
     C                     ENDIF
      * CHANGE ADJ--> J
     C           E1TYPE    IFEQ 'A'
     C                     MOVE 'J'       E1TYPE
     C                     ENDIF
      *
     C                     MOVEL@DATA     E1DATA
     C                     Z-ADD@DATE     E1CRDT
     C                     Z-ADD@TIME     E1CRTM
     C                     WRITEEB#PP6A1
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
