     H            Y.
     F** ENDR10 ******************************************
     F*  PROGRAM NAME : ENDJOB 実行プログラム          *
     F*  PROGRAM ID   : ENDR10                           *
     F*  CREATE DATE  : 2004.08.29                       *
     F*  AUTHOR       : A.MAMIYA                         *
     F****************************************** ENDR10 **
     FENDPP01 UP  E                    DISK
      * ﾎﾟﾜhﾞ[w情報DS
     IINFDSP     SDS
     I                                        1  10 @PGM
     I                                      254 263 @USID
     I            DS
     I                                        1   80E1SKHZ
     I                                        1   40E1SKYY
     I                                        5   60E1SKMM
     I                                        7   80E1SKDD
     I            DS
     I                                        1   80E1KOHZ
     I                                        1   40E1KOYY
     I                                        5   60E1KOMM
     I                                        7   80E1KODD
     I            DS
     I                                        1   60E1KOTI
     I                                        1   20E1KOHH
     I                                        3   40E1KOSS
     I            DS
     I                                        1   80E1ENHZ
     I                                        1   40E1ENDY
     I                                        5   60E1ENDM
     I                                        7   80E1ENDD
     I            DS
     I                                        1   60E1ENTI
     I                                        1   20E1ENDJ
     I                                        3   40E1ENDH
     I                                        5   60E1ENDB
     I            DS
     I                                        1   80E1STHZ
     I                                        1   40E1STAY
     I                                        5   60E1STAM
     I                                        7   80E1STAD
     I            DS
     I                                        1   60E1STTI
     I                                        1   20E1STAJ
     I                                        3   40E1STAH
     I                                        5   60E1STAB
     I            DS
     I                                        1  140QTIME
     I                                        1   60WTIME
     I                                        7  140WDATE
     C           E1SKJY    IFEQ 'D'
     C           E1SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL*BLANK    @EFLG   1
     C                     MOVEL*BLANK    @SFLG   1
      *----------------*
      *ジョブ終了処理*
      *----------------*
     C           E1EFLG    IFEQ *BLANK
     C                     TIME           QTIME
     C           E1ENHZ    IFLT WDATE
     C                     EXSR #SB100
     C                     END
     C           E1ENHZ    IFEQ WDATE
     C           E1ENTI    ANDLEWTIME
     C                     EXSR #SB100
     C                     END
     C                     END
      *----------------*
      *ジョブ起動処理*
      *----------------*
      * （起動条件：ジョブ終了済み+投入ＰＧＭ有り+投入時刻有り）*
     C           E1EFLG    IFEQ '*'
     C           E1SPGM    IFNE *BLANK
     C           E1STHZ    IFNE 0
      *
     C           E1SFLG    IFEQ *BLANK
     C                     TIME           QTIME
     C           E1STHZ    IFLT WDATE
     C                     EXSR #SB200
     C                     END
     C           E1STHZ    IFEQ WDATE
     C           E1STTI    ANDLEWTIME
     C                     EXSR #SB200
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C                     END
      *
     C           @EFLG     IFEQ '*'
     C           @SFLG     OREQ '*'
     C                     Z-ADDWDATE     E1KOHZ
     C                     TIME           E1KOTI
     C                     MOVEL@USID     E1KOME
     C                     MOVEL@PGM      E1KOPG
     C                     UPDATENDPP011
     C                     END
      *
     C                     END
      *-------------------------------------------------------*
      *          ENDJOBサブルーチン                         *
      *-------------------------------------------------------*
     C           #SB100    BEGSR
     C                     MOVELE1JOBM    PJOBM  10
     C                     MOVELE1USER    PUSER  10
     C                     MOVELE1WNBR    PWNBR   6
     C                     MOVELE1EDTA    PEDTA  10
     C                     MOVELE1ELIB    PELIB  10
     C                     MOVEL*BLANK    PEFLG   1
     C                     CALL 'ENDC11'
     C                     PARM           PJOBM
     C                     PARM           PUSER
     C                     PARM           PWNBR
     C                     PARM           PEDTA
     C                     PARM           PELIB
     C                     PARM           PEFLG
      *----------------------------*
      * 通信処理中はPEFLG = ' '  *
      *----------------------------*
     C           PEFLG     IFNE *BLANK
     C                     MOVEL'*'       @EFLG
     C                     MOVELPEFLG     E1EFLG
     C           PEFLG     IFNE '*'
     C                     MOVEL'E'       E1SFLG
     C                     END
     C                     END
      *
     C           ESB100    ENDSR
      *-------------------------------------------------------*
      *          START JOBサブルーチン                      *
      *-------------------------------------------------------*
     C           #SB200    BEGSR
     C                     MOVELE1SPGM    PSPGM  10
     C                     MOVELE1PAR1    PPAR1  10
     C                     MOVELE1PAR2    PPAR2  10
     C                     MOVELE1SJOB    PSJOB  10
     C                     MOVELE1JOBD    PJOBD  10
     C                     MOVELE1JOBQ    PJOBQ  10
     C                     MOVELE1SDTA    PSDTA  10
     C                     MOVELE1SLIB    PSLIB  10
     C                     MOVEL*BLANK    PSFLG   1
     C                     CALL 'ENDC12'
     C                     PARM           PSPGM
     C                     PARM           PPAR1
     C                     PARM           PPAR2
     C                     PARM           PSJOB
     C                     PARM           PJOBD
     C                     PARM           PJOBQ
     C                     PARM           PSDTA
     C                     PARM           PSLIB
     C                     PARM           PSFLG
      *
     C                     MOVEL'*'       @SFLG
     C                     MOVELPSFLG     E1SFLG
     C           ESB200    ENDSR
