     H            Y.
     F** ESVR91 ********************************************
     F*  PROGRAM: FIX AB#WP2OZ                             *
     F*  WRITTEN: JW (SRA) 2024.10.09                      *
     F*----------------------------------------------------*
     FAB#WL2OZUF  E           K        DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      * MAIN ROUTINE
      *--------------------------------------------------------
     C                     EXSR #INIT
      *
      * READ AB#WP2OZ -------------------------------------
     C           @FROM     SETLLAB#WL2OZ
     C                     DO   *HIVAL
     C                     READ AB#WL2OZ                 98
     C   98                LEAVE
      *
     C**         O2CRWS    IFNE *BLANK
     C**                   ITER
     C**                   ENDIF
      *
     C                     MOVELO2CRDT    $CRHZ
     C                     MOVELO2CRPF    $FILE
     C                     MOVELO2CRUS    $USER
     C                     MOVELO2DELY    $NONY
     C                     MOVELO2SHDT    $NOHZ
     C                     MOVELO2ORDR    $ODRN
      *
     C                     CALL 'UTLR51B'
     C                     PARM           $CRHZ   8
     C                     PARM           $FILE  10
     C                     PARM           $USER  10
     C                     PARM           $NONY   4
     C                     PARM           $NOHZ   8
     C                     PARM           $ODRN  10
     C                     PARM           $PICK#  9
      *
     C                     MOVEL$PICK#    O2CRWS
      *
     C           O2CRWS    IFNE *BLANK
     C                     UPDATAB#WP2Z1
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------------
      * INITIAL SETTING
      *--------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $FROM   8
      *
     C                     TIME           SDATE
      *
     C           $FROM     IFEQ ' '
     C                     Z-ADDTODAY     @FROM   80
     C                     ELSE
     C                     MOVEL$FROM     @FROM
     C                     ENDIF
      *
     C                     ENDSR
