     H            Y.
     F** ESVR02 ********************************************
     F*  PROGRAM: SAVE AB#WP2O TO AB#WP2OZ                 *
     F*  WRITTEN: JW (SRA) 2020.10.12                      *
     F*----------------------------------------------------*
     FAB#WP2O IF  E                    DISK
     FAB#WP2OZO   E                    DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      * MAIN ROUTINE
      *--------------------------------------------------------
     C                     EXSR #INIT
      *
      * SAVE AB#WP2O --------------------------------------
     C                     DO   *HIVAL
     C                     READ AB#WP2O                  98
     C   98                LEAVE
      *
     C                     Z-ADDTODAY     O2CRDT
     C                     Z-ADDNOW       O2CRTM
     C                     MOVEL#USER     O2CRUS
     C                     MOVEL'AB#WP2O 'O2CRPF
     C                     MOVEL#WSID     LTR3    3
     C                     MOVELLTR3      O2CRMB
      * GET PL#
     C           O2CRDT    IFNE SVCRDT
     C           O2CRPF    ORNE $FILE
     C           O2CRUS    ORNE $USER
     C           O2DELY    ORNE $NONY
     C           O2SHDT    ORNE $NOHZ
     C           O2ORDR    ORNE $ODRN
     C                     Z-ADDO2CRDT    SVCRDT
     C                     MOVELO2CRDT    $CRHZ
     C                     MOVELO2CRPF    $FILE
     C                     MOVELO2CRUS    $USER
     C                     MOVELO2DELY    $NONY
     C                     MOVELO2SHDT    $NOHZ
     C                     MOVELO2ORDR    $ODRN
     C                     CALL 'UTLR51B'
     C                     PARM           $CRHZ   8
     C                     PARM           $FILE  10
     C                     PARM           $USER  10
     C                     PARM           $NONY   4
     C                     PARM           $NOHZ   8
     C                     PARM           $ODRN  10
     C                     PARM           $PICK#  9
     C                     ENDIF
     C                     MOVEL$PICK#    O2CRWS
      *
     C                     WRITEAB#WP2Z1
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------------
      * INITIAL SETTING
      *--------------------------------------------------------
     C           #INIT     BEGSR
      *
     C                     TIME           SDATE
      *
     C                     Z-ADD0         SVCRDT  80
     C                     MOVE *BLANK    $CRHZ   8
     C                     MOVE *BLANK    $FILE  10
     C                     MOVE *BLANK    $USER  10
     C                     MOVE *BLANK    $NONY   4
     C                     MOVE *BLANK    $NOHZ   8
     C                     MOVE *BLANK    $ODRN  10
     C                     MOVE *BLANK    $PICK#  9
      *
     C                     ENDSR
