     H            Y.
     F** FAAR21 ******************************************
     F*  COMMON PART M/F MAINTENANCE                     *
     F*  M-OKUDA  1981.11.24                             *
JW1  F*  JW       2019.02.05 ADD FAAPP04 (LOG)           *
JW2  F*  JW       2021.05.07 CHG SCREEN IMAGE            *
JW3  F*  JW       2023.04.13 ADD F10: INQ (FAAC24)       *
JW4  F*  JW       2023.08.21 ADD UAAR03B-UPDATE PRICE M/F*
     F****************************************************
     FFAAPW21 CF  E                    WORKSTN
     FFAAPL02 UF  E           K        DISK                      A
     FFCEPL01 UF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FFCCTL12 IF  E           K        DISK
     FALAPL01 IF  E           K        DISK
     FALBPP06 UF  E           K        DISK
     FALBPP05 UF  E           K        DISK
     FALAWPA5 O   F     130            DISK
JW1  FFAAPP04 O   E           K        DISK
     E                    ER      1  10 60
     I            DS
     I                                        1   80B7SKHZ
     I                                        1   40B7SKYY
     I                                        5   60B7SKMM
     I                                        7   80B7SKDD
     I            DS
     I                                        1   80B7KOHZ
     I                                        1   40B7KOYY
     I                                        5   60B7KOMM
     I                                        7   80B7KODD
     I                                        3   80XXKOHZ
     I            DS
     I                                        1   60WTIME
     I                                        1   20B7KOJI
     I                                        3   40B7KOFN
JW1  I            DS
     I                                        1  140STIME
     I                                        1   60NOW
     I                                        7  140TODAY
     I            DS
     I                                        1  12 OSHIN
     I                                        1   5 B7SHN1
     I                                        6  10 B7SHN2
     I                                       11  12 B7SHN3
     I            DS
     I                                        1  20 OMHIN
     I                                        1   5 B7MHN1
     I                                        6  10 B7MHN2
     I                                       11  15 B7MHN3
     I                                       16  20 B7MHN4
     I            DS
     I                                        1  20 MHIN
     I                                        1   5 MHN1
     I                                        6  10 MHN2
     I                                       11  15 MHN3
     I                                       16  20 MHN4
     I            DS
     I                                        1  12 SHIN
     I                                        1   5 SHN1
     I                                        6  10 SHN2
     I                                       11  12 SHN3
     I            DS
     I                                        1   7 WKTBM
     I                                        1   3 WKOTI
     I                                        4   70WKBMN
     I            DS
     I                                        1  12 A2SHIN
     I                                        1   5 A2BHB1
     I                                        6  10 A2BHB2
     I                                       11  12 A2BHB3
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   6 A2STKR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ********************************************************
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     PARM           @MM     2
     C                     MOVE @MM       MM      20
      *
     C           DKEY      KLIST
     C                     KFLD           TOKU
     C                     KFLD           NONY
     C                     KFLD           TKOJ
     C                     KFLD           TUKE
     C                     KFLD           MHN1
     C                     KFLD           MHN2
     C                     KFLD           MHN3
     C                     KFLD           MHN4
      *
     C           KEY       KLIST
     C                     KFLD           B7SHN1
     C                     KFLD           B7SHN2
     C                     KFLD           B7SHN3
      ****************************************************
      *
     C                     Z-ADD0         B7SKHZ
     C                     Z-ADD0         B7KOHZ
     C                     Z-ADD0         WTIME
      *
     C           STEP1     TAG
     C                     EXFMTFAAPW211
     C                     SETOF                     1999
JW2  C                     SETOF                     414243
JW2  C                     SETOF                     44
      * F1: END
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
 JW3  * F3: END
     C           *INKC     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
 JW3  * F10: LOG
     C           *INKJ     IFEQ '1'
     C                     CALL 'FAAC24'
     C                     GOTO STEP1
     C                     ENDIF
      *
     C           KOSIN     IFNE '0'
     C           KOSIN     ANDNE'1'
     C           KOSIN     ANDNE'2'
     C                     SETON                     99  41
     C                     MOVE ER,1      MSG
     C                     GOTO STEP1
     C                     END
      *
     C           KOSIN     IFEQ '0'
     C                     SETON                     19
     C                     MOVE 'CAN '    CMNT
     C                     END
      *
     C           KOSIN     IFEQ '1'
     C                     SETON                     19
     C                     MOVE 'CHG '    CMNT
     C                     END
      *
     C           KOSIN     IFEQ '2'
     C                     MOVE 'ADD '    CMNT
     C                     END
      *
     C           TOKU      IFEQ 0
     C                     SETON                     99  42
     C                     MOVE ER,6      MSG
     C                     GOTO STEP1
     C                     END
      *
     C           MHIN      IFEQ *BLANK
     C                     SETON                     99  43
     C                     MOVE ER,7      MSG
     C                     GOTO STEP1
     C                     END
      *
     C           NONY      IFEQ 0
     C                     Z-ADDTOKU      NONY
     C                     END
      *
     C                     SETOF                     04
     C                     MOVEL*BLANK    TMEI
     C           TOKU      CHAINFGBPL011             04
     C           *IN04     IFEQ '1'
     C                     SETON                     99  42
     C                     MOVE ER,2      MSG
     C                     GOTO STEP1
     C                     END
     C                     MOVELB2SMEI    TMEI
      *
     C                     SETOF                     04
     C           NONY      CHAINFGBPL011             04
     C           *IN04     IFEQ '1'
     C                     SETON                     99  44
     C                     MOVE ER,10     MSG
     C                     GOTO STEP1
     C                     END
      *
     C                     SETOF                     17
     C           DKEY      CHAINFAAPL021             17
     C           KOSIN     IFEQ '2'
     C           *IN17     IFEQ '0'
     C           B7SKBN    IFEQ 'D'
     C           B7SKHZ    ANDLE*DATE
     C                     GOTO XTP1
     C                     END
     C                     SETON                     99  41
     C                     MOVE ER,4      MSG
     C                     GOTO STEP1
     C                     END
     C                     END
      *
     C           KOSIN     IFEQ '1'
     C           *IN17     IFEQ '1'
     C                     SETON                     99  41
     C                     MOVE ER,5      MSG
     C                     GOTO STEP1
     C                     END
     C           B7SKBN    IFEQ 'D'
     C           B7SKHZ    ANDLE*DATE
     C                     SETON                     99  43
     C                     MOVE ER,9      MSG
     C                     GOTO STEP1
     C                     END
     C                     END
      *
     C           KOSIN     IFEQ '0'
     C           *IN17     IFEQ '1'
     C                     SETON                     99  41
     C                     MOVE ER,5      MSG
     C                     GOTO STEP1
     C                     END
     C           B7SKBN    IFEQ 'D'
     C           B7SKHZ    ANDLE*DATE
     C                     SETON                     99  43
     C                     MOVE ER,3      MSG
     C                     GOTO STEP1
     C                     END
     C                     END
     C           XTP1      TAG
      *
     C           KOSIN     IFNE '2'
     C                     MOVE OSHIN     SHIN
     C                     ELSE
     C                     MOVE *BLANK    SHIN
     C                     END
      *
     C                     MOVE *BLANK    WSHIN  12
     C           KOSIN     IFEQ '1'
     C                     MOVE OSHIN     WSHIN
     C                     END
      *
     C           STEP2     TAG
     C                     EXFMTFAAPW212
     C                     SETOF                     99
     C                     SETOF                     45
      *
     C           *INKC     IFEQ '1'
     C                     EXSR CLR
     C                     GOTO STEP1
     C                     END
      *
     C           SHIN      IFEQ *BLANK
     C                     SETON                     99  45
     C                     MOVE ER,8      MSG
     C                     GOTO STEP2
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STEP2
     C                     END
      *
     C                     MOVE *BLANK    B7SKBN
     C                     Z-ADD0         B7SKHZ
     C           KOSIN     IFEQ '0'
     C                     MOVE 'D'       B7SKBN
     C                     Z-ADD*DATE     B7SKHZ
     C                     END
      *
     C                     Z-ADD*DATE     B7KOHZ
     C                     TIME           WTIME
     C                     MOVE US        B7KONA
      *
     C                     MOVE TOKU      B7TOKU
     C                     MOVE NONY      B7NONY
     C                     MOVE TKOJ      B7NKJO
     C                     MOVE TUKE      B7NUKE
     C                     MOVE MHIN      OMHIN
     C                     MOVE SHIN      OSHIN
      *
     C           *IN17     IFEQ '1'
     C                     WRITEFAAPL021
     C                     ELSE
     C                     UPDATFAAPL021
     C                     END
JW1  C                     EXSR #LOG
JW4  C                     EXSR #PRICE
      *
     C                     EXSR CLR
     C                     GOTO STEP1
      *
      * TPX mﾞｰj ﾅhﾈb *
     C           KOSIN     IFEQ '0'
     C           KOSIN     OREQ '1'
     C                     EXSR @DLT
     C                     END
      *
     C                     SETOF                     01
     C           KEY       CHAINFCEPL011             01
     C           *IN01     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
      *
     C           *IN01     IFEQ '0'
     C           A2TEHI    IFEQ 'G'
     C                     MOVE A2AK31    WAK31   1
     C                     MOVE A2AK31    WSU     10
     C           WSU       IFEQ 5
     C                     MOVE '0'       A2AK31
     C                     ELSE
     C                     ADD  1         WSU
     C                     MOVE WSU       A2AK31
     C                     END
     C                     Z-ADDA2SSYS    WSYOS   60
     C                     MOVELA2AKI     WKTBM
      *
     C           KOSIN     IFEQ '0'
     C                     UPDATFCEPL011
     C                     END
      *
     C           KOSIN     IFEQ '1'
     C           WSHIN     IFNE OSHIN
     C                     UPDATFCEPL011
     C                     END
     C                     END
      *
     C           KOSIN     IFEQ '2'
     C                     UPDATFCEPL011
     C                     END
     C                     END
     C                     END
      *
     C                     EXSR CLR
     C                     GOTO STEP1
JW1   **************
      * WRITE LOG  *
      **************
     C           #LOG      BEGSR
      *
     C                     TIME           STIME
      *
     C                     SELEC
     C           KOSIN     WHEQ '0'                        DELETE
     C                     Z-ADDTODAY     B7SKDT
     C                     Z-ADDNOW       B7SKTM
     C                     MOVEL#USER     B7SKUS
     C                     MOVEL#PGM      B7SKPG
     C                     MOVEL'DLT'     B7TYPE
      *
     C           KOSIN     WHEQ '1'                        CHANGE
     C                     Z-ADDTODAY     B7CHDT
     C                     Z-ADDNOW       B7CHTM
     C                     MOVEL#USER     B7CHUS
     C                     MOVEL#PGM      B7CHPG
     C                     MOVEL'UPD'     B7TYPE
      *
     C           KOSIN     WHEQ '2'                        ADD
     C                     Z-ADDTODAY     B7CRDT
     C                     Z-ADDNOW       B7CRTM
     C                     MOVEL#USER     B7CRUS
     C                     MOVEL#PGM      B7CRPG
     C                     MOVEL'ADD'     B7TYPE
     C                     Z-ADD0         B7SKDT
     C                     Z-ADD0         B7SKTM
     C                     MOVE *BLANK    B7SKUS
     C                     MOVE *BLANK    B7SKPG
      *
     C                     OTHER                           NO LOG
     C                     GOTO #LOGX
     C                     ENDSL
      *
     C                     TIME           STIME
     C                     Z-ADDTODAY     B7KODT
     C                     Z-ADDNOW       B7KOTM
     C                     MOVEL#USER     B7KOUS
      *
     C                     WRITEFAAPP041
      *
     C           #LOGX     ENDSR
      **************************
JW4   * UPDATE PRICE MASTER    *
 .    **************************
 .   C           #PRICE    BEGSR
 .    *
     C                     MOVELB7TOKU    $TOKU
     C                     MOVELB7NONY    $NONY
     C                     MOVELB7NKJO    $NKOJ
     C                     MOVELB7NUKE    $NUKE
     C                     MOVELOMHIN     $MHIN
     C                     MOVE 'Y'       $UPD
     C                     CALL 'UAAR03B'
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $MHIN  20
 .   C                     PARM           $UPD    1
 .   C                     PARM           $RTN    1
 .    *
JW4  C                     ENDSR
      **************
      * CLEAR      *
      **************
     C           CLR       BEGSR
     C                     MOVE *BLANK    KOSIN
     C                     Z-ADD0         TOKU
     C                     Z-ADD0         NONY
     C                     MOVE *BLANK    TKOJ
     C                     MOVE *BLANK    TUKE
     C                     MOVE *BLANK    MHIN
     C                     MOVE *BLANK    SHIN
     C                     MOVE *BLANK    CMNT
     C                     ENDSR
      ********************
      * ＴＰＸ　ＫＥＹ *
      ********************
     C           TKEY1     KLIST
     C                     KFLD           MM
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *
     C           TKEY2     KLIST
     C                     KFLD           B4TOKU
     C                     KFLD           B4NONY
     C                     KFLD           B4NKOJ
     C                     KFLD           B4NUKE
      *
     C           TKEY3     KLIST
     C                     KFLD           TPTPTK
     C                     KFLD           KZETI
      *
     C           TKEY4     KLIST
     C                     KFLD           KNTKIS
     C                     KFLD           KNKOSI
     C                     KFLD           KNZETI
      ****************
      * DELETE
      ****************
     C           @DLT      BEGSR
     C                     MOVE *ALL'?'   X01    16
     C                     MOVE *BLANK    X02     1
     C                     MOVE *ALL'?'   X03    11
     C                     MOVE *BLANK    X04     1
     C                     MOVE *ALL'?'   X05     4
     C                     MOVE *BLANK    X06     4
     C                     MOVE *ALL'?'   X07    15
     C                     MOVE *BLANK    X08     5
     C                     MOVE *ALL'?'   X09    27
     C                     MOVE *ALL'?'   X10    32
     C                     MOVE '2'       XMT     1
     C                     MOVE *BLANK    KZETI   4
      * ﾎﾞﾍ]ﾆﾞｭctc uﾇjｰ *
     C                     SETOF                     50
     C           KEY       CHAINFCEPL011             50
     C           *IN50     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     ELSE
     C           A2TEHI    IFEQ 'G'
     C                     MOVE A2ZETI    KZETI
      * f]ﾌﾞ] uﾇjｰ *
     C           TKEY1     SETLLFCCTL121
     C                     SETOF                     50
     C                     DO   *HIVAL
     C           TKEY1     READEFCCTL121                 50
     C           *IN50     IFEQ '0'
     C           B4SKBN    IFEQ 'D'
     C           B4SKHZ    ANDLE*DATE
     C                     ELSE
     C           B4NOKN    IFEQ 'C'
      * nhbﾅguﾇjｰ (TPX) *
     C                     SETOF                     51
     C           TKEY2     CHAINALAPL011             51
     C           *IN51     IFEQ '0'
      * f]ﾌﾞ]uﾇjｰ (TPX) *
     C           TKEY3     SETLLALBPP051
     C                     SETOF                     52
     C                     DO   *HIVAL
     C           TKEY3     READEALBPP051                 52
     C           *IN52     IFEQ '0'
     C                     MOVE KNTKIS    XTK     6
     C                     MOVE KNZETI    XZT     4
     C                     Z-ADDKNKOSI    XKS     10
     C                     EXCPTDT01
     C                     DELETALBPP051
      * kｩｮh uﾇjｰ (TPX) *
     C                     SETOF                     53
     C           TKEY4     CHAINALBPP061             53
     C           *IN53     IFEQ '0'
     C                     DELETALBPP061
     C                     END
     C                     END
     C  N52                END
     C                     END
     C                     END
     C                     END
     C                     END
     C  N50                END
     C                     END
     C                     END
     C                     END
     C                     ENDSR
      ***************
      * ﾎｦbﾓ OUTPUT *
      ***************
     OALAWPA5 E                DT01
     O                         X01       16
     O                         XTK       22
     O                         X02       23
     O                         X03       34
     O                         X04       35
     O                         X05       39
     O                         X06       43
     O                         X07       58
     O                         X08       63
     O                         X09       90
     O                         XZT       94
     O                         XKS       95
     O                         X10      127
     O                         XMT      128
**
E-01 ENTER 0:CANCEL OR 1:CHANGE OR 3:ADD!
E-02 CUSTOMER CODE NOT FOUND IN DETAIL M/F!
E-03 PART# WAS CANCELLED ALREADY!
E-04 PART# ALREADY REGISTERD!
E-05 USER PART NOT FOUND IN COMMON MASTER!
E-06 ENTER CUSTOMER CODE!
E-07 ENTER USER PART#!
E-08 ENTER IAF PART#!
E-09 PART# IS ALREADY CANCELLED!
E-10 THERE IS NOT DELIVERY CODE IN DETAIL M/F!
