     H            Y.
     F** FAER13 ******************
     F* ..PERSON IN CHARGE CODE CHECK .. *
     F* ..ORDER RECEIPT DATA INPUT *
     F* I-HASADA 89.09.28 *
     F****************** FAER13 **
     FFAEPL01 IF  E           K        DISK
     C           *ENTRY    PLIST
     C                     PARM           PTANT   4
     C                     PARM           PERR    1
     C                     MOVE PTANT     WTANT   40
      *
     C                     SETOF                     01
     C           WTANT     CHAINFAEPL011             01
     C           *IN01     IFEQ '1'
     C                     MOVE 'E'       PERR
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
