     H            Y.
     F** FBCR61K ***************************************************************
     F*  PROGRAM    : FBCPP01 (CHK DUPLIACATE) FOR ALL CUSTOMER                *
     F*             : COPIED FROM @FBCPP01K                                    *
     F*  WRITTEN    : 12/8/2015                                                *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F*  CL         : RUN IN CHKC23 (VJBC71, FCKC00, VJBC72)                   *
     F*  FUNCTION   : CHECK DUPLICATE KEY                                      *
     F*             : (TOKU/NONY/MHN/EFDATE/EXPDATE)                           *
     F**************************************************************************
     FFBCPL01BUF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      **************************************************************************
     C                     EXSR @INIT
      *
     C           *LOVAL    SETLLFBCPL01B
     C                     DO   *HIVAL
      *
     C           UPDFLG    IFEQ 'Y'
     C                     READ FBCPL01B                 98
     C                     ELSE
     C                     READ FBCPL01B            N    98
     C                     ENDIF
     C   98                LEAVE
      *
     C           FBSKJY    IFNE ' '
     C                     ITER
     C                     ENDIF
      *
     C**         FBTSYY    ANDNE9999
      *
     C           FIRST     IFEQ 'N'
     C           FBTOKU    ANDEQSVTOKU
     C           FBNONY    ANDEQSVNONY
     C           FBMHN1    ANDEQSVMHN1
     C           FBMHN2    ANDEQSVMHN2
     C           FBMHN3    ANDEQSVMHN3
     C           FBMHN4    ANDEQSVMHN4
     C           FBTKYY    ANDEQSVTKYY
     C           FBTKMM    ANDEQSVTKMM
     C           FBTKDD    ANDEQSVTKDD
     C                     EXSR @PRINT
     C           UPDFLG    IFEQ 'Y'
     C                     MOVEL'D'       FBSKJY
     C                     MOVE 'XX'      FBKOME
     C                     UPDATFBCPL1B1
     C                     ENDIF
     C                     ENDIF
      * SAVE
     C                     MOVEL'N'       FIRST
     C                     MOVELFBTOKU    SVTOKU
     C                     MOVELFBNONY    SVNONY
     C                     MOVELFBMHN1    SVMHN1
     C                     MOVELFBMHN2    SVMHN2
     C                     MOVELFBMHN3    SVMHN3
     C                     MOVELFBMHN4    SVMHN4
     C                     MOVELFBTKYY    SVTKYY
     C                     MOVELFBTKMM    SVTKMM
     C                     MOVELFBTKDD    SVTKDD
     C                     MOVELFBNTAN    SVNTAN
     C                     ENDDO
      * FOOT
     C           SEQ#      IFEQ 0
     C                     EXCPT@FOT
     C                     ELSE
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           @PRINT    BEGSR
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           @INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           UPDFLG  1
     C                     PARM           $RTN    1
      *
     C                     MOVE *BLANK    $RTN
     C                     MOVEL'Y'       FIRST   1
     C                     Z-ADD*DATE     @DATE   80
     C                     TIME           @TIME   60
     C                     Z-ADD0         SEQ#    40
      *
     C           *LIKE     DEFN FBTOKU    SVTOKU
     C           *LIKE     DEFN FBNONY    SVNONY
     C           *LIKE     DEFN FBMHN1    SVMHN1
     C           *LIKE     DEFN FBMHN2    SVMHN2
     C           *LIKE     DEFN FBMHN3    SVMHN3
     C           *LIKE     DEFN FBMHN4    SVMHN4
     C           *LIKE     DEFN FBTKYY    SVTKYY
     C           *LIKE     DEFN FBTKMM    SVTKMM
     C           *LIKE     DEFN FBTKDD    SVTKDD
     C           *LIKE     DEFN FBNTAN    SVNTAN
      *
     C                     EXCPT@HDR
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                         UPDFLG    12
     O                                   60 '** ERROR REPORT **      '
     O                                   69 'DATE'
     O                         @DATE     72 '    .  .  '
     O                         @TIME     82 '  :  :  '
     O                                   85 'P.'
     O                         PAGE  Z   89
     O                                  110 'USE CALL FBCR61I   ('
     O                                  129 '/Y/) - SAME PRICE  '
     O        E   02           @HDR
     O                                   10 'CONDITION:'
     O                                   20 'CUST=ALL'
     O                                   60 '(DUPLICATE EFFECTIVE DT)'
     O                                  110 'USE CALL FBCR61J   ('
     O                                  129 '/Y/) - DIFF PRICE  '
     O        E   03           @HDR
     O                                  110 'CHK CALL FBCR61K   ('
     O                                  129 '// //) CHECK       '
     O        E   04           @HDR
     O                                    5 'SEQ#'
     O                                   10 'CUST'
     O                                   15 'DELV'
     O                                   25 'CUST_PART'
     O                                   48 'EFFECTIV'
     O                                   57 'EXP_DT'
     O                                   68 'UPD_DT'
     O                                   79 'UPD_ID'
     O                                   96 'PRICE'
     O        E 1              @DTL
     O                         SEQ#  Z +001
     O                         FBTOKU  +001
     O                         FBNONY  +001
     O                         FBMHN1  +001
     O                         FBMHN2  +001
     O                         FBMHN3  +001
     O                         FBMHN4  +001
     O                         FBTKHZ  +001 '    /  /  '
     O                         FBTSHZ  +001 '    /  /  '
     O                         FBKOYY  +001
     O                                 +000 '/'
     O                         FBKOMM  +000
     O                                 +000 '/'
     O                         FBKODD  +000
     O                         FBKOME  +001
     O                         FBNTAN1 +001
     O        E 1              @FOT
     O                                   20 '** THERE IS NO TARGE'
     O                                   40 'T DATA **           '
