     H            Y.
     F** FBCR32 ************************************
     A*   SALES EXPANTISON PARTS CLASS             *
     F*                           2004.02.10       *
     F************************************ FBCR32 **
     FFBCPW32 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FFBCPP25 UF  E           K        DISK                      A
      *--------------------------------------------------------
     E                    CMD     1   1 78
     E                    ERR     1   1 78
     E                    CD        100  2 0
      *--------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *----------------------------------------------------*
      *   MAIN ROUTINE                                     *
      *----------------------------------------------------*
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *----------------------------------------------------*
      * INITIALIZE
      *----------------------------------------------------*
     C           *INZSR    BEGSR
      *
     C                     MOVE '01'      @@ID    2
      *
     C                     EXSR #SET
      *
     C                     ENDSR
      *----------------------------------------------------*
      * SET DATA
      *----------------------------------------------------*
     C           #SET      BEGSR
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
      *
     C           *LOVAL    SETLLFBCPP25
     C           *IN90     DOUEQ*ON
     C                     READ FBCPP25             N    90
     C           *IN90     IFEQ *OFF
     C           F5SKJY    ANDEQ*BLANK
     C                     ADD  1         RRN1
     C                     Z-ADDF5CLAS    S@CLAS
     C                     Z-ADDF5CLAS    H@CLAS
     C                     MOVELF5DESC    S@DESC
     C                     WRITESFL01
     C                     ENDIF
     C                     ENDDO
      *
     C                     DO   51
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   1ST.SCREEN
      *----------------------------------------------------*
     C           #SCRN1    BEGSR
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
      *
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD
     C                     MOVE '99'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   1ST.SCRREC     (CHECK INPUT DATA)              *
      *----------------------------------------------------*
     C           #CHK1     BEGSR
      *
     C                     Z-ADD*ZERO     @@RRN   40
     C                     Z-ADD*ZERO     CD
     C                     Z-ADD*ZERO     X       30
     C                     SETOF                     6199
     C           *IN90     DOUEQ*ON
      *
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C                     MOVE *OFF      *IN61
     C           S@CLAS    IFNE *ZERO
      *
     C           S@CLAS    LOKUPCD                       10
     C           *IN10     IFEQ *ON
     C                     SETON                     6199
     C                     MOVELERR,1     D@MSG
     C                     ELSE
     C                     ADD  1         X
     C                     Z-ADDS@CLAS    CD,X
     C                     ENDIF
     C                     ENDIF
     C                     UPDATSFL01
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------*
      * UPDATE
      *----------------------------------------------------*
     C           #UPD      BEGSR
      *
     C                     Z-ADD*ZERO     @@RRN   40
     C                     SETOF                     6199
     C           *IN90     DOUEQ*ON
      *
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
      *
     C           H@CLAS    IFNE S@CLAS
     C           H@CLAS    ANDNE*ZERO
     C           H@CLAS    CHAINFBCPP25              95
     C           *IN95     IFEQ *OFF
     C                     MOVE 'D'       F5SKJY
     C                     Z-ADD*DATE     F5SYMD
     C                     Z-ADD*DATE     F5KYMD
     C                     TIME           F5KTIM
     C                     MOVEL#USER     F5KOME
     C                     UPDATFBCPP251
     C                     ENDIF
     C                     ENDIF
      *
     C           S@CLAS    IFNE *ZERO
     C           S@CLAS    CHAINFBCPP25              95
     C           *IN95     IFEQ *OFF
     C                     Z-ADD*DATE     F5KYMD
     C                     TIME           F5KTIM
     C                     MOVEL#USER     F5KOME
     C                     MOVELS@DESC    F5DESC
     C                     UPDATFBCPP251
     C                     ELSE
     C                     CLEARFBCPP251
     C                     Z-ADD*DATE     F5KYMD
     C                     TIME           F5KTIM
     C                     MOVEL#USER     F5KOME
     C                     MOVELS@DESC    F5DESC
     C                     Z-ADDS@CLAS    F5CLAS
     C                     WRITEFBCPP251
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------*
** CMD
 F1:END     F5:UPDATE
** ERR
E-01 DUPLICATE CODE.
