     H            Y.
     F** FBCR28 *******************************
     F*  UNIT SALES PRICE UPDATE  LIST        *
     F*    I-HASADA               2000.09.27  *
     F******************************* FBCR28 **
     FFBCWP28 IP  F     100            DISK
     FFBCPL03 UF  E           K        DISK                      A
JW1  FFBCPP05 O   E                    DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TBL     1   1 29
     IFBCWP28 AA  01
     I                                        1   40ITOKU
     I                                        5   80INONY
     I                                        9   9 INKOJ
     I                                       10  13 INUKE
     I                                       14  18 IMHN1
     I                                       19  23 IMHN2
     I                                       24  28 IMHN3
     I                                       29  33 IMHN4
     I                                       34  370ITKYY
     I                                       38  390ITKMM
     I                                       40  410ITKDD
     I                                       42  485INTAN
     I                                       49  560@TKHZ
     I                                       57  640@TSHZ
     I                                       65  720$TSHZ
     I            DS
     I                                        1   80FBSKHZ
     I                                        1   40FBSKYY
     I                                        5   60FBSKMM
     I                                        7   80FBSKDD
     I            DS
     I                                        1   80FBKOHZ
     I                                        1   40FBKOYY
     I                                        5   60FBKOMM
     I                                        7   80FBKODD
     I            DS
     I                                        1   60FBTIME
     I                                        1   20FBKOHH
     I                                        3   40FBKOSS
     I            DS
     I                                        1   80FBTKHZ
     I                                        1   40FBTKYY
     I                                        5   60FBTKMM
     I                                        7   80FBTKDD
     I            DS
     I                                        1   80FBTSHZ
     I                                        1   40FBTSYY
     I                                        5   60FBTSMM
     I                                        7   80FBTSDD
      *
JW1  I            DS
 |   I                                        1  140SDATE
 |   I                                        1   60NOW
JW1  I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
     C           KEY1      KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C                     KFLD           ITKYY
     C                     KFLD           ITKMM
     C                     KFLD           ITKDD
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
      *
     C                     SETOF                     10
     C                     TIME           WTIME   60
     C  N11                SETON                     1011
      *
     C                     SETOF                     20
     C           KEY1      CHAINFBCPL031             20
     C           *IN20     IFEQ '0'
     C           FBSKJY    IFEQ 'D'
     C           FBSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     Z-ADD$TSHZ     FBTSHZ
      *
JW   C           FBIND     IFEQ *BLANK
JW   C                     MOVE 'N'       FBIND
JW   C                     ENDIF
      *
     C                     UPDATFBCPL031
JW1   * OUT LOG#
"    C                     MOVE 'A'       LOGFLG  1
"    C                     EXSR #LOG
      *
     C                     Z-ADDFBNTAN    WOTAN  105
      *
     C                     MOVE *BLANK    FBSKJY
     C                     Z-ADD0         FBSKHZ
     C                     Z-ADD*DATE     FBKOHZ
     C                     TIME           FBTIME
     C                     MOVELPUS       FBKOME
     C                     Z-ADDINTAN     FBNTAN
     C                     Z-ADD@TKHZ     FBTKHZ
     C                     Z-ADD@TSHZ     FBTSHZ
     C                     WRITEFBCPL031
JW1   * OUT LOG#
"    C                     MOVE 'A'       LOGFLG  1
"    C                     EXSR #LOG
      *
     C                     END
     C                     END
     C*-----------------------------------------------------
JW1  C* OUT LOG FILE
     C*-----------------------------------------------------
     C           #LOG      BEGSR
      *
     C                     CLEARFBCPP051
      *
     C                     MOVELFBSKJY    F5SKJY
     C                     Z-ADDFBTOKU    F5TOKU
     C                     Z-ADDFBNONY    F5NONY
     C                     MOVELFBNKOJ    F5NKOJ
     C                     MOVELFBNUKE    F5NUKE
     C                     MOVELFBMHN1    F5MHN1
     C                     MOVELFBMHN2    F5MHN2
     C                     MOVELFBMHN3    F5MHN3
     C                     MOVELFBMHN4    F5MHN4
JW   C                     MOVELFBSHN1    F5SHN1
     C                     MOVELFBSHN2    F5SHN2
     C                     MOVELFBSHN3    F5SHN3
      *
     C                     Z-ADDFBNTAN    F5NTAN
     C                     Z-ADDFBTKHZ    F5TKHZ
     C                     Z-ADDFBTSHZ    F5TSHZ
      *
     C                     TIME           SDATE
     C                     Z-ADDTODAY     F5PRHZ
     C                     Z-ADDNOW       F5PRTM
     C                     MOVEL#USER     F5PRUS
     C                     MOVEL#PGM      F5PRPG
     C                     SELEC
     C           LOGFLG    WHEQ 'A'
     C                     MOVEL'ADD'     F5PTYP
     C                     Z-ADDTODAY     F5CRHZ
     C                     Z-ADDNOW       F5CRTM
     C                     MOVEL#USER     F5CRUS
     C                     MOVEL#PGM      F5CRPG
     C           LOGFLG    WHEQ 'C'
     C                     MOVEL'CHG'     F5PTYP
     C                     Z-ADDTODAY     F5CHHZ
     C                     Z-ADDNOW       F5CHTM
     C                     MOVEL#USER     F5CHUS
     C                     MOVEL#PGM      F5CHPG
     C           LOGFLG    WHEQ 'D'
     C                     MOVEL'DLT'     F5PTYP
     C                     Z-ADDTODAY     F5DLHZ
     C                     Z-ADDNOW       F5DLTM
     C                     MOVEL#USER     F5DLUS
     C                     MOVEL#PGM      F5DLPG
     C                     ENDSL
      *
     C                     WRITEFBCPP051
      *
JW1  C                     ENDSR
      *
     OQPRINT  H  102   10
     O       OR        OF
     O                                  131 '.....................'
     O        H  1     10
     O       OR        OF
     O                                  131 '.         .         .'
     O        H  1     10
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O        H  2     10
     O       OR        OF
     O                                   10 'FBCR28-1'
     O                                   35 '**'
     O                                   70 '**'
     O                         TBL,1     66
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        H  1     10
     O       OR        OF
     O                                   87 'REVISED'
     O        H  2     10
     O       OR        OF
     O                                   14 'CUSTOMER'
     O                                   24 'DELIVERY'
     O                                   33 'FACTORY'
     O                                   39 'DOCK'
     O                                   54 'USER PART NO.'
     O                                   77 'UNIT PRICE'
     O                                   90 'UNIT PRICE'
     O                                  106 'EFFECTIVE DATE'
     O                                  123 'EXPIRATION DATE'
     O        D  1     01
     O                         FBTOKU    12
     O                         FBNONY    22
     O                         FBNKOJ    30
     O                         FBNUKE    39
     O                         FBMHN1    46
     O                                   47 '-'
     O                         FBMHN2    52
     O                                   53 '-'
     O                         FBMHN3    58
     O                                   59 '-'
     O                         FBMHN4    64
     O                         WOTAN 1   77
     O                         FBNTAN1   90
     O                         FBTKHZ   104 '    .  .  '
     O                         FBTSHZ   120 '    .  .  '
** TBL
UNIT SALES PRICE UPDATE  LIST
