     H            Y.
     F** FBCR22 ****************************************
     A*   INQUIRY SCREEN OF EXCEPTIONAL UNIT PRIVE M/F *
     F*       MSK.KUNIEDA         2000.04.07           *
     F************************************ FBCR22 ******
     FFBCPW22 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL1
     F                                        RRN2  KSFILE SFL2
     FFGBPL01 IF  E           K        DISK
     FFBCPL13 IF  E           K        DISK
     FFBCPL14 IF  E           K        DISK
      *
     E                    $ER     1   4 60
      *
     I            DS
     I                                        1   60TIME
     I                                        1   20TIMHH
     I                                        3   40TIMMM
      *
     I            DS
     I                                        1   80HYMD8
     I                                        3   80HYMD6
     I                                        1   40HYY
     I                                        5   60HMM
     I                                        7   80HDD
      *
     I            DS
     I                                        1  14 @HIN
     I                                        1   5 @HN1
     I                                        6   6 WKF1
     I                                        7  11 @HN2
     I                                       12  12 WKF2
     I                                       13  14 @HN3
      *
     I            DS
     I                                        1  23 @MHIND
     I                                        1   5 @MHN1D
     I                                        6   6 WKF6
     I                                        7  11 @MHN2D
     I                                       12  12 WKF7
     I                                       13  17 @MHN3D
     I                                       18  18 WKF8
     I                                       19  23 @MHN4D
      *
     I            DS
     I                                        1  23 @MHIN
     I                                        1   5 @MHN1
     I                                        6   6 WKF3
     I                                        7  11 @MHN2
     I                                       12  12 WKF4
     I                                       13  17 @MHN3
     I                                       18  18 WKF5
     I                                       19  23 @MHN4
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      * BREAK FLD
     I            DS
     I                                        1  51 BKFLD
     I                                        1  33 INFLD
     I                                        1   40WKTOKU
     I                                        5   80WKNONY
     I                                        9   9 WKNKOJ
     I                                       10  13 WKNUKE
     I                                       14  18 WKMHN1
     I                                       19  23 WKMHN2
     I                                       24  28 WKMHN3
     I                                       29  33 WKMHN4
     I                                       34  410WKTKHZ
     I                                       34  370WKTKYY
     I                                       38  390WKTKMM
     I                                       40  410WKTKDD
     I                                       42  515WKNTAN
      * SAVE FLD
     I            DS
     I                                        1  51 CHKFLD
     I                                        1  33 SVFLD
     I                                        1   40FCTOKU
     I                                        5   80FCNONY
     I                                        9   9 FCNKOJ
     I                                       10  13 FCNUKE
     I                                       14  18 FCMHN1
     I                                       19  23 FCMHN2
     I                                       24  28 FCMHN3
     I                                       29  33 FCMHN4
     I                                       34  410FCTKHZ
     I                                       34  370FCTKYY
     I                                       38  390FCTKMM
     I                                       40  410FCTKDD
     I                                       42  515FCNTAN
      *
      *----------------------------------------------------*
      *   PARAMETER TRANCEFER                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PCMD    1
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
     C           KEYSV1    KLIST
     C                     KFLD           #SSHN1  5
     C                     KFLD           #SSHN2  5
     C                     KFLD           #SSHN3  2
     C                     KFLD           #STOKU  40
     C                     KFLD           #SNONY  40
     C                     KFLD           #SNKOJ  1
     C                     KFLD           #SNUKE  4
     C                     KFLD           #SMHN1  5
     C                     KFLD           #SMHN2  5
     C                     KFLD           #SMHN3  5
     C                     KFLD           #SMHN4  5
     C                     KFLD           #STKYY  40
     C                     KFLD           #STKMM  20
     C                     KFLD           #STKDD  20
     C           KEYSV2    KLIST
     C                     KFLD           #KTOKU  40
     C                     KFLD           #KNONY  40
     C                     KFLD           #KNKOJ  1
     C                     KFLD           #KNUKE  4
     C                     KFLD           #KMHN1  5
     C                     KFLD           #KMHN2  5
     C                     KFLD           #KMHN3  5
     C                     KFLD           #KMHN4  5
     C                     KFLD           #KTKYY  40
     C                     KFLD           #KTKMM  20
     C                     KFLD           #KTKDD  20
      *
     C           KEYFC1    KLIST
     C                     KFLD           #KSHN1  5
     C                     KFLD           #KSHN2  5
     C                     KFLD           #KSHN3  2
      *
     C           KEYFC3    KLIST
     C                     KFLD           #KSHN1  5
     C                     KFLD           #KSHN2  5
     C                     KFLD           #KSHN3  2
     C                     KFLD           #KTOKU  40
     C                     KFLD           #KNONY  40
     C                     KFLD           #KNKOJ  1
     C                     KFLD           #KNUKE  4
     C                     KFLD           #KMHN1  5
     C                     KFLD           #KMHN2  5
     C                     KFLD           #KMHN3  5
     C                     KFLD           #KMHN4  5
     C           KEYFC2    KLIST
     C                     KFLD           #KTOKU  40
     C                     KFLD           #KNONY  40
     C                     KFLD           #KNKOJ  1
     C                     KFLD           #KNUKE  4
     C                     KFLD           #KMHN1  5
     C                     KFLD           #KMHN2  5
     C                     KFLD           #KMHN3  5
     C                     KFLD           #KMHN4  5
      *----------------------------------------------------*
      *  メインルーチン                                  *
      *----------------------------------------------------*
     C                     EXSR $SB100
     C           *IN01     DOWEQ'0'
     C           *IN03     ANDEQ'0'
     C                     EXSR $SB200
     C                     END
     C                     EXSR $SB300
      *----------------------------------------------------*
      *   INITIAL PROCESS                                  *
      *----------------------------------------------------*
     CSR         $SB100    BEGSR
     C                     TIME           TIME
     C                     Z-ADD*DATE     HYMD8
     C                     MOVE '0'       DSPSW1  1
     C                     MOVE '0'       DSPSW2  1
     C                     MOVE '0'       DSPSW3  1
     C                     Z-ADD0         X       20
     C                     MOVE *ZERO     #KTOKU  40
     C                     MOVE *ZERO     #KNONY  40
     C                     MOVE *BLANK    #KNKOJ  1
     C                     MOVE *BLANK    #KNUKE  4
     C                     MOVE *BLANK    #KMHN1  5
     C                     MOVE *BLANK    #KMHN2  5
     C                     MOVE *BLANK    #KMHN3  5
     C                     MOVE *BLANK    #KMHN4  5
     C                     MOVE *ZERO     #KTKYY  40
     C                     MOVE *ZERO     #KTKMM  20
     C                     MOVE *ZERO     #KTKDD  20
     C                     MOVE *BLANK    @HN1
     C                     MOVE *BLANK    @HN2
     C                     MOVE *BLANK    @HN3
     C                     MOVE *ZERO     @TKCD
     C                     MOVE '0'       GETFLG  1
     C                     MOVE '0'       SETFLG  1
     C                     MOVE '0'       SVFLG   1
      *
      *SFL CLEAD
     C                     Z-ADD1         WKPAG1  20
     C                     Z-ADD1         WKPAG2  20
      *
     C                     SETON                     71
     C                     WRITESFLREC1
     C                     SETOF                     71
     C                     Z-ADD0         RRN1    30
     C                     Z-ADD0         @RRN1   40
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
      *
     C                     SETON                     73
     C                     WRITESFLREC2
     C                     SETOF                     73
     C                     Z-ADD0         RRN2    30
     C                     Z-ADD0         @RRN2   40
     C                     Z-ADD0         CTRXX   40
     C                     Z-ADD1         @SFRC2
      *
     C                     MOVE '1'       DSPSW1
     C                     MOVE '0'       DSPSW2
     CSR         $S100E    ENDSR
      *----------------------------------------------------*
      *    MAIN PROCESS                                    *
      *----------------------------------------------------*
     CSR         $SB200    BEGSR
     C           *IN01     DOWEQ'0'
     C           *IN03     ANDEQ'0'
     C           DSPSW1    ANDEQ'1'
     C                     EXSR $SB210
     C                     END
      *
     C           *IN01     DOWEQ'0'
     C           *IN03     ANDEQ'0'
     C           DSPSW2    ANDEQ'1'
     C                     EXSR $SB220
     C                     END
      *
     CSR         $S200E    ENDSR
      *----------------------------------------------------*
      *   1ST.SCRREC     (SELECT KEY INPUT)              *
      *----------------------------------------------------*
     CSR         $SB210    BEGSR
     C                     EXFMTFBCPW221
     C                     SETOF                     3199
     C                     MOVEL*BLANK    @ERR
      * CMD-1
     C           *IN01     IFEQ '1'
     C                     GOTO $S210E
     C                     END
      * CMD-3
     C           *IN03     IFEQ '1'
     C                     GOTO $S210E
     C                     END
      *
     C           @HN1      IFEQ *BLANK
     C           @HN2      ANDEQ*BLANK
     C           @HN3      ANDEQ*BLANK
     C                     SETON                     3199
     C                     MOVEL$ER,1     @ERR
     C                     GOTO $S210E
     C                     END
      *
     C           @TKCD     IFNE 0
      *
     C           @TKCD     CHAINFGBPL011             21
     C           *IN21     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLEHYMD8
     C                     SETON                     21
     C                     END
     C           *IN21     IFEQ '1'
     C                     SETON                     3299
     C                     MOVEL$ER,2     @ERR
     C                     GOTO $S210E
     C                     END
      *
     C                     END
     C                     MOVE @HN1      #KSHN1
     C                     MOVE @HN2      #KSHN2
     C                     MOVE @HN3      #KSHN3
     C                     MOVE @TKCD     #KTOKU
      *----------------------*
      * UNIT PRICE FILE READ *
      *----------------------*
     C                     MOVE *BLANK    BKSW
     C           KEYFC1    SETLLFBCPL141
     C                     SETOF                     816667
     C                     DO   *HIVAL
     C                     EXSR $SB900
     C           GETFLG    IFEQ '1'
     C                     SETON                     67
     C                     END
     C  N81N67             END
      * NOT FOUND
     C           *IN81     IFEQ '1'
     C           *IN67     ANDEQ'0'
     C                     MOVEL$ER,3     @ERR
     C                     SETON                     3199
     C           @TKCD     IFNE 0
     C                     SETON                     32
     C                     END
     C                     GOTO $S210E
     C                     END
      *-------------------*
      * NEXT SCREEN ITEM  *
      *-------------------*
     C                     MOVE *BLANK    BKSW
     C           KEYFC1    SETLLFBCPL141
     C                     SETOF                     816667
     C                     DO   *HIVAL
     C                     EXSR $SB900                     FBCPL14 READ
     C           GETFLG    IFEQ '1'
     C                     EXSR $SB400                     SFL1 WRITE
     C                     MOVE CHKFLD    BKFLD
     C                     END
      *
      *
     C  N81N67             END
      *
     C                     MOVE '-'       WKF1
     C                     MOVE '-'       WKF2
     C           @HN3      IFEQ *BLANK
     C                     MOVE *BLANK    WKF2
     C                     END
     C                     MOVE @TKCD     @TKCDD
     C           @TKCD     IFEQ 0
     C                     MOVE *BLANK    @TKCDD
     C                     END
      * NEXT POINTER SET
     C           *IN81     IFEQ '0'
     C                     MOVE FCSHN1    #KSHN1
     C                     MOVE FCSHN2    #KSHN2
     C                     MOVE FCSHN3    #KSHN3
     C                     MOVE FCTOKU    #KTOKU
     C                     MOVE FCNONY    #KNONY
     C                     MOVE FCNKOJ    #KNKOJ
     C                     MOVE FCNUKE    #KNUKE
     C                     MOVE FCMHN1    #KMHN1
     C                     MOVE FCMHN2    #KMHN2
     C                     MOVE FCMHN3    #KMHN3
     C                     MOVE FCMHN4    #KMHN4
     C           KEYFC3    SETLLFBCPL141
     C                     EXSR $SB999
     C                     END
      *
     C                     MOVE '1'       DSPSW2
     C                     MOVE '0'       DSPSW1
      *
     CSR         $S210E    ENDSR
      *----------------------------------------------------*
      *   DETAILS SCREEN                                 *
      *----------------------------------------------------*
     CSR         $SB220    BEGSR
     C                     SETON                     7015
     C                     SETOF                     16
     C                     WRITEFBCPW227
     C                     WRITEFBCPW228
     C                     WRITEFBCPW229
     C                     EXFMTSFLREC1
     C                     SETOF                     70
     C                     SETOF                     9933
     C                     MOVEL*BLANK    @ERR
      * CMD-1
     C           *IN01     IFEQ '1'
     C                     GOTO $S220E
     C                     END
      * CMD-3
     C           *IN03     IFEQ '1'
     C                     MOVE '1'       DSPSW1
     C                     MOVE '0'       DSPSW2
     C                     EXSR $SB600
     C                     CLEARFBCPW221
     C                     SETOF                     03
     C                     GOTO $S220E
     C                     END
      *-------------------*
      * ROLLDOWN          *
      *-------------------*
     C           *IN52     IFEQ '1'
     C                     ADD  1         CTRX
      *
     C           WKPAG1    IFEQ 1
     C                     GOTO $S220E
     C                     END
      *
     C           *IN81     IFEQ '1'
     C                     SETOF                       81
     C           KEYFC1    SETGTFBCPL141
     C                     END
      *
     C                     MOVE *BLANK    BKSW
     C                     ADD  10        CTRX
     C                     SETOF                     6667
     C                     DO   *HIVAL
     C                     EXSR $SB401
     C           GETFLG    IFEQ '1'
     C                     SUB  1         CTRX           67
     C                     MOVE CHKFLD    BKFLD
     C                     END
     C  N81N67             END
      *
     C                     Z-ADD0         CTRX    40
      *
     C           *IN81     IFEQ '1'
     C                     SETOF                       81
     C           KEYFC1    SETLLFBCPL141
     C                     END
      * SFL1 CLEAR
     C                     SETON                     71
     C                     WRITESFLREC1
     C                     SETOF                     71
     C                     Z-ADD0         RRN1    30
     C                     Z-ADD0         @RRN1
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
      *
     C                     SETOF                       6667
     C                     MOVE *BLANK    BKSW
     C                     DO   *HIVAL
     C                     EXSR $SB900
     C           GETFLG    IFEQ '1'
     C                     EXSR $SB400
     C                     MOVE CHKFLD    BKFLD
     C                     END
      *
      *
     C  N81N67             END
      *
     C           *IN81     IFEQ '0'
     C                     MOVE FCSHN1    #KSHN1
     C                     MOVE FCSHN2    #KSHN2
     C                     MOVE FCSHN3    #KSHN3
     C                     MOVE FCTOKU    #KTOKU
     C                     MOVE FCNONY    #KNONY
     C                     MOVE FCNKOJ    #KNKOJ
     C                     MOVE FCNUKE    #KNUKE
     C                     MOVE FCMHN1    #KMHN1
     C                     MOVE FCMHN2    #KMHN2
     C                     MOVE FCMHN3    #KMHN3
     C                     MOVE FCMHN4    #KMHN4
     C           KEYFC3    SETLLFBCPL141
      *
     C                     EXSR $SB999
     C                     END
     C                     SUB  1         WKPAG1
     C                     END
      *-------------------*
      * ROLL-UP           *
      *-------------------*
     C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
     C                     Z-ADD0         RRN1    30
     C                     Z-ADD0         @RRN1
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
     C                     SETON                       71
     C                     WRITESFLREC1
     C                     SETOF                     666771
      *
     C                     MOVE *BLANK    BKSW
     C                     DO   *HIVAL
     C                     EXSR $SB900
     C           GETFLG    IFEQ '1'
     C                     EXSR $SB400
     C                     MOVE CHKFLD    BKFLD
     C                     END
      *
     C  N81N67             END
      *
     C           *IN81     IFEQ '0'
     C                     MOVE FCSHN1    #KSHN1
     C                     MOVE FCSHN2    #KSHN2
     C                     MOVE FCSHN3    #KSHN3
     C                     MOVE FCTOKU    #KTOKU
     C                     MOVE FCNONY    #KNONY
     C                     MOVE FCNKOJ    #KNKOJ
     C                     MOVE FCNUKE    #KNUKE
     C                     MOVE FCMHN1    #KMHN1
     C                     MOVE FCMHN2    #KMHN2
     C                     MOVE FCMHN3    #KMHN3
     C                     MOVE FCMHN4    #KMHN4
     C           KEYFC3    SETLLFBCPL141
     C                     EXSR $SB999
     C                     END
      *
     C                     ADD  1         WKPAG1
     C                     END
      *SELECT NO CHECK
     C                     SETOF                       6823
     C                     Z-ADD0         X       20
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           X         CHAINSFL1                 23
     C           *IN23     IFEQ '0'
      *
     C           @OP       IFNE *BLANK
     C           @OP       ANDNE'M'
     C                     MOVEL$ER,4     @ERR
     C                     SETON                     3399
     C                     END
      *
     C                     UPDATSFL1
     C                     SETOF                     33
     C                     END
      *
     C  N23N99             END
     C   99                GOTO $S220E
      *-------------------*
      * NEXT DETAIL       *
      *-------------------*
     C                     SETOF                         23
     C                     Z-ADD0         X       20
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           X         CHAINSFL1                 23
     C           *IN23     IFEQ '0'
     C           @OP       IFEQ 'M'
      * SFL2 CLEAR
     C                     EXSR $SB402
      *
     C                     MOVE KTOKU     #KTOKU
     C                     MOVE KNONY     #KNONY
     C                     MOVE KNKOJ     #KNKOJ
     C                     MOVE KNUKE     #KNUKE
     C                     MOVE KMHN1     #KMHN1
     C                     MOVE KMHN2     #KMHN2
     C                     MOVE KMHN3     #KMHN3
     C                     MOVE KMHN4     #KMHN4
      *
     C                     MOVE KTOKU     @TOKUD
     C                     MOVE KNONY     @NONYD
     C                     MOVE KNKOJ     @NKOJD
     C                     MOVE KNUKE     @NUKED
     C                     MOVE KMHN1     @MHN1D
     C                     MOVE KMHN2     @MHN2D
     C                     MOVE KMHN3     @MHN3D
     C                     MOVE KMHN4     @MHN4D
     C                     MOVE '-'       WKF6
     C                     MOVE '-'       WKF7
     C                     MOVE '-'       WKF8
     C           @MHN4     IFEQ *BLANK
     C                     MOVE *BLANK    WKF8
     C                     END
     C           @MHN3     IFEQ *BLANK
     C                     MOVE *BLANK    WKF7
     C                     END
      *
     C           KEYFC2    SETLLFBCPL131
     C                     SETOF                     826869
     C                     Z-ADD0         @NO1
     C                     DO   *HIVAL
     C                     EXSR $SB901                     FBCPL13 READ
     C           SETFLG    IFEQ '1'
     C                     EXSR $SB403                     SFL2 WRITE
     C                     END
     C  N82N69             END
      *
      * UNIT PRICE M/F NEXT POINT SET
     C                     EXSR $SB998
      *
      * SALES UNIT PRICE DETAILS
     C           CTRXX     IFNE 0
      *
     C                     MOVE '0'       DSPSW3
     C           *IN01     DOWEQ'0'
     C           *IN03     ANDEQ'0'
     C                     EXSR $SB230
     C                     END
      * PORV/SCREEN
     C           DSPSW3    IFEQ '1'
     C           *IN03     ANDEQ'1'
     C                     SETOF                     03
     C                     END
      *
     C                     END
      *
     C                     END
     C                     MOVE *BLANK    @OP
     C                     UPDATSFL1
     C                     END
     C  N23N01             END
     CSR         $S220E    ENDSR
      *----------------------------------------------------*
      *   2ND. DETAILS SCREEN                            *
      *----------------------------------------------------*
     CSR         $SB230    BEGSR
     C                     SETON                     7216
     C                     SETOF                     15
     C                     WRITEFBCPW228
     C                     WRITEFBCPW229
     C                     EXFMTSFLREC2
     C                     SETOF                     72
     C                     MOVE '1'       DSPSW3
      * CMD-1
     C           *IN01     IFEQ '1'
     C                     GOTO $S230E
     C                     END
      * CMD-3
     C           *IN03     IFEQ '1'
     C                     GOTO $S230E
     C                     END
      *-------------------*
      * ROLLDOWN          *
      *-------------------*
     C           *IN54     IFEQ '1'
     C                     ADD  1         CTRXX
      *
     C           WKPAG2    IFEQ 1
     C                     GOTO $S230E
     C                     END
      *
     C           *IN82     IFEQ '1'
     C                     SETOF                       82
     C           KEYFC2    SETGTFBCPL131
     C                     END
      *
     C                     ADD  12        CTRXX
     C                     SETOF                     6869
     C                     DO   *HIVAL
     C                     EXSR $SB404
     C           SETFLG    IFEQ '1'
     C                     SUB  1         CTRXX          68
     C                     END
     C  N82N68             END
      *
     C                     Z-ADD0         CTRXX   40
      *
     C           *IN82     IFEQ '1'
     C                     SETOF                       82
     C           KEYFC2    SETLLFBCPL131
     C                     END
      * SFL2 CLEAR
     C                     SETON                     73
     C                     WRITESFLREC2
     C                     SETOF                     73
     C                     Z-ADD0         RRN2    30
     C                     Z-ADD0         @RRN2
     C                     Z-ADD0         CTRXX   40
     C                     Z-ADD1         @SFRC2
      *
     C                     SETOF                       6869
     C                     Z-ADD0         @NO1
     C                     DO   *HIVAL
     C                     EXSR $SB901
     C           SETFLG    IFEQ '1'
     C                     EXSR $SB403
     C                     END
     C  N82N69             END
      *
      *
     C                     EXSR $SB998
     C                     SUB  1         WKPAG2
     C                     END
      *-------------------*
      * ROLL-UP           *
      *-------------------*
     C           *IN53     IFEQ '1'
     C           *IN82     ANDEQ'0'
     C                     Z-ADD0         RRN2    30
     C                     Z-ADD0         @RRN2
     C                     Z-ADD0         CTRXX   40
     C                     Z-ADD1         @SFRC2
     C                     SETON                       73
     C                     WRITESFLREC2
     C                     SETOF                       736869
      *
     C                     Z-ADD0         @NO1
     C                     DO   *HIVAL
     C                     EXSR $SB901
     C           SETFLG    IFEQ '1'
     C                     EXSR $SB403
     C                     END
     C  N82N69             END
      *
     C                     EXSR $SB998
     C                     ADD  1         WKPAG2
     C                     END
     CSR         $S230E    ENDSR
      *----------------------------------------------------*
      *     EXIT                                           *
      *----------------------------------------------------*
     CSR         $SB300    BEGSR
      *USED INOUT CMD-1
     C           *IN01     IFEQ '1'
     C                     MOVE '1'       PCMD
     C                     END
      *USED INPUT CMD-3
     C           *IN03     IFEQ '1'
     C                     MOVE '3'       PCMD
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
     CSR         $S300E    ENDSR
      *----------------------------------------------------*
      *     SFL1 WRITE                                     *
      *----------------------------------------------------*
     CSR         $SB400    BEGSR
     C                     MOVE *BLANK    @OP
     C                     MOVE WKTOKU    @TOKU
     C                     MOVE WKNONY    @NONY
     C                     MOVE WKNKOJ    @NKOJ
     C                     MOVE WKNUKE    @NUKE
     C                     MOVE WKMHN1    @MHN1
     C                     MOVE WKMHN2    @MHN2
     C                     MOVE WKMHN3    @MHN3
     C                     MOVE WKMHN4    @MHN4
     C                     MOVE '-'       WKF3
     C                     MOVE '-'       WKF4
     C                     MOVE '-'       WKF5
     C           @MHN4     IFEQ *BLANK
     C                     MOVE *BLANK    WKF5
     C                     END
     C           @MHN3     IFEQ *BLANK
     C                     MOVE *BLANK    WKF4
     C                     END
     C                     Z-ADDWKNTAN    @TNK
     C                     Z-ADDWKTKHZ    @SYMD
      *
     C                     MOVE WKTOKU    KTOKU
     C                     MOVE WKNONY    KNONY
     C                     MOVE WKNKOJ    KNKOJ
     C                     MOVE WKNUKE    KNUKE
     C                     MOVE WKMHN1    KMHN1
     C                     MOVE WKMHN2    KMHN2
     C                     MOVE WKMHN3    KMHN3
     C                     MOVE WKMHN4    KMHN4
     C                     MOVE WKTKYY    KTKYY
     C                     MOVE WKTKMM    KTKMM
     C                     MOVE WKTKDD    KTKDD
      *
     C                     ADD  1         CTRX
     C                     ADD  1         RRN1
     C                     ADD  1         @RRN1
      *
     C                     WRITESFL1
     C           CTRX      IFEQ 10
     C                     SETON                       67
     C                     END
     CSR         $S400E    ENDSR
      *----------------------------------------------------*
      *     SALES UNIT PRICE M/F   READP                   *
      *----------------------------------------------------*
     CSR         $SB401    BEGSR
     C                     MOVE '0'       GETFLG
     C                     SETOF                     66
     C           KEYFC1    REDPEFBCPL141                 81
     C           *IN81     IFEQ '0'
     C           FCSKJY    ANDEQ'D'
     C           FCSKHZ    ANDLEHYMD8
     C                     SETON                     66
     C                     END
     C           *IN81     IFEQ '0'
     C           *IN66     ANDEQ'0'
      *
     C           @TKCD     IFEQ 0
     C                     MOVE '1'       GETFLG
     C                     ELSE
     C           @TKCD     IFEQ FCTOKU
     C                     MOVE '1'       GETFLG
     C                     END
     C                     END
      *
     C           GETFLG    IFEQ '1'
     C                     MOVE '0'       GETFLG
     C                     MOVE '1'       SVFLG
     C           BKSW      IFEQ *BLANK
     C                     MOVE CHKFLD    BKFLD
     C                     MOVE '1'       BKSW    1
     C                     END
     C           INFLD     IFNE SVFLD
     C                     MOVE '1'       GETFLG
     C                     END
     C                     END
      *
     C                     END
     C           *IN81     IFEQ '1'
     C           SVFLG     ANDEQ'1'
     C                     MOVE *BLANK    BKSW
     C                     MOVE '1'       GETFLG
     C                     END
     CSR         $S401E    ENDSR
      *----------------------------------------------------*
      *     SFL2 CLEAR
      *----------------------------------------------------*
     CSR         $SB402    BEGSR
     C                     SETON                     73
     C                     WRITESFLREC2
     C                     SETOF                     73
     C                     Z-ADD0         RRN2    30
     C                     Z-ADD0         @RRN2   40
     C                     Z-ADD0         CTRXX   40
     C                     Z-ADD1         @SFRC2
     CSR         $S402E    ENDSR
      *----------------------------------------------------*
      *     SFL2 WRITE                                     *
      *----------------------------------------------------*
     CSR         $SB403    BEGSR
     C                     ADD  1         @NO1
     C                     Z-ADDFCNTAN    @TANK1
     C                     Z-ADDFCTKHZ    @SYMD1
     C                     Z-ADDFCTSHZ    @EYMD1
      *
     C                     ADD  1         CTRXX
     C                     ADD  1         RRN2
     C                     ADD  1         @RRN2
      *
     C                     WRITESFL2
     C           CTRXX     IFEQ 12
     C                     SETON                       69
     C                     END
     CSR         $S403E    ENDSR
      *----------------------------------------------------*
      *     SALES UNIT PRICE M/F   READP                   *
      *----------------------------------------------------*
     CSR         $SB404    BEGSR
     C                     MOVE '0'       SETFLG
     C                     SETOF                     68
     C           KEYFC2    REDPEFBCPL131                 82
      *
     C           *IN82     IFEQ '0'
     C           FCSKJY    ANDEQ'D'
     C           FCSKHZ    ANDLEHYMD8
     C                     SETON                     68
     C                     END
      *
     C           *IN82     IFEQ '0'
     C           *IN68     ANDEQ'0'
     C                     MOVE '1'       SETFLG
     C                     END
      *
     CSR         $S404E    ENDSR
      *----------------------------------------------------*
      *   ITEM CODE CLEAR
      *----------------------------------------------------*
     CSR         $SB600    BEGSR
     C                     SETON                     71
     C                     WRITESFLREC1
     C                     SETOF                     71
     C                     Z-ADD0         RRN1
     C                     Z-ADD0         @RRN1
     C                     Z-ADD0         CTRX
     C                     Z-ADD1         @SFRC1
      *
     C                     SETON                     73
     C                     WRITESFLREC2
     C                     SETOF                     73
     C                     Z-ADD0         RRN2
     C                     Z-ADD0         @RRN2
     C                     Z-ADD0         CTRXX
     C                     Z-ADD1         @SFRC2
      *
     C                     MOVE *BLANK    @HIN
     C                     MOVE *ZERO     @TKCD
     C                     MOVE *ZERO     @NONYD
     C                     MOVE *BLANK    @NKOJD
     C                     MOVE *BLANK    @NUKED
     C                     MOVE *BLANK    @MHIND
     C                     MOVE *ZERO     @TOKUD
     CSR         $S600E    ENDSR
      *----------------------------------------------------*
      *  UNIT PRICE MASTER FILE READ                       *
      *----------------------------------------------------*
     CSR         $SB900    BEGSR
     C                     MOVE '0'       GETFLG
     C                     SETOF                     66
     C           KEYFC1    READEFBCPL141                 81
     C           *IN81     IFEQ '0'
     C           FCSKJY    ANDEQ'D'
     C           FCSKHZ    ANDLEHYMD8
     C                     SETON                     66
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN66     ANDEQ'0'
      *
     C           @TKCD     IFEQ 0
     C                     MOVE '1'       GETFLG
     C                     ELSE
     C           @TKCD     IFEQ FCTOKU
     C                     MOVE '1'       GETFLG
     C                     END
     C                     END
      *
     C           GETFLG    IFEQ '1'
     C                     MOVE '0'       GETFLG
     C                     MOVE '1'       SVFLG
      *
     C           BKSW      IFEQ *BLANK
     C                     MOVE CHKFLD    BKFLD
     C                     MOVE '1'       BKSW    1
     C                     END
      *
     C           SVFLD     IFNE INFLD
     C                     MOVE '1'       GETFLG
     C                     END
      *
     C                     END
      *
     C                     END
      *
     C           *IN81     IFEQ '1'
     C           SVFLG     ANDEQ'1'
     C                     MOVE *BLANK    BKSW
     C           @TKCD     IFEQ 0
     C                     MOVE '1'       GETFLG
     C                     ELSE
     C           @TKCD     IFEQ WKTOKU
     C                     MOVE '1'       GETFLG
     C                     END
     C                     END
     C                     END
     CSR         $S900E    ENDSR
      *----------------------------------------------------*
      *  UNIT PRICE MASTER FILE READ                       *
      *----------------------------------------------------*
     CSR         $SB901    BEGSR
     C                     MOVE '0'       SETFLG
     C                     SETOF                     68
     C           KEYFC2    READEFBCPL131                 82
      *
     C           *IN82     IFEQ '0'
     C           FCSKJY    ANDEQ'D'
     C           FCSKHZ    ANDLEHYMD8
     C                     SETON                     68
     C                     END
      *
     C           *IN82     IFEQ '0'
     C           *IN68     ANDEQ'0'
     C                     MOVE '1'       SETFLG
     C                     END
      *
     CSR         $S901E    ENDSR
      *----------------------------------------------------*
      *    NEXT POINTER SET                                *
      *----------------------------------------------------*
     CSR         $SB998    BEGSR
      *
     C                     MOVE '0'       SETFLG
     C                     SETOF                     69
     C                     DO   *HIVAL
     C           KEYFC2    READEFBCPL131                 82
     C                     SETOF                     68
      *
     C           *IN82     IFEQ '0'
     C           FCSKJY    ANDEQ'D'
     C           FCSKHZ    ANDLEHYMD8
     C                     SETON                     68
     C                     END
      *
     C           *IN82     IFEQ '0'
     C           *IN68     ANDEQ'0'
     C                     MOVE '1'       SETFLG
     C                     SETON                     67
     C                     END
      *
     C  N81N67             END
      *
     C           SETFLG    IFEQ '1'
     C                     MOVE FCTOKU    #KTOKU
     C                     MOVE FCNONY    #KNONY
     C                     MOVE FCNKOJ    #KNKOJ
     C                     MOVE FCNUKE    #KNUKE
     C                     MOVE FCMHN1    #KMHN1
     C                     MOVE FCMHN2    #KMHN2
     C                     MOVE FCMHN3    #KMHN3
     C                     MOVE FCMHN3    #KMHN4
     C                     MOVE FCTKYY    #KTKYY
     C                     MOVE FCTKMM    #KTKMM
     C                     MOVE FCTKDD    #KTKDD
     C           KEYSV2    SETLLFBCPL131
     C                     END
     CSR         $S998E    ENDSR
      *----------------------------------------------------*
      *    NEXT POINTER SET                                *
      *----------------------------------------------------*
     CSR         $SB999    BEGSR
      *
     C                     MOVE '0'       GETFLG
     C                     SETOF                     67
     C                     DO   *HIVAL
     C           KEYFC1    READEFBCPL141                 81
     C                     SETOF                     66
      *
     C           *IN81     IFEQ '0'
     C           FCSKJY    ANDEQ'D'
     C           FCSKHZ    ANDLEHYMD8
     C                     SETON                     66
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN66     ANDEQ'0'
      *
     C           @TKCD     IFEQ 0
     C                     MOVE '1'       GETFLG
     C                     SETON                     67
     C                     ELSE
     C           @TKCD     IFEQ FCTOKU
     C                     MOVE '1'       GETFLG
     C                     SETON                     67
     C                     END
     C                     END
      *
     C                     END
      *
     C  N81N67             END
     C           GETFLG    IFEQ '1'
     C                     MOVE FCSHN1    #SSHN1
     C                     MOVE FCSHN2    #SSHN2
     C                     MOVE FCSHN3    #SSHN3
     C                     MOVE FCTOKU    #STOKU
     C                     MOVE FCNONY    #SNONY
     C                     MOVE FCNKOJ    #SNKOJ
     C                     MOVE FCNUKE    #SNUKE
     C                     MOVE FCMHN1    #SMHN1
     C                     MOVE FCMHN2    #SMHN2
     C                     MOVE FCMHN3    #SMHN3
     C                     MOVE FCMHN3    #SMHN4
     C                     MOVE FCTKYY    #STKYY
     C                     MOVE FCTKMM    #STKMM
     C                     MOVE FCTKDD    #STKDD
     C           KEYSV1    SETLLFBCPL141
     C                     END
     CSR         $S999E    ENDSR
** ERR MSG
E-01 INPUT INTRAL COMPANY PART NO.
E-02 NO DATA IN DETAIL M/F
E-03 EXIST DATA IN UNIT PRICE M/F
E-04 DIVISION INSTRUCTION IS < ' ' , 'M'  >
