     H            Y.
     F** FBCR29 ****************************************************************
     A*   INQUIRY SCREEN OF UNIT PRICE M/F                                     *
     F*                           2001.12.05                                   *
     F*                                                                        *
     F* TCHK1 04/03/06 BUG FIX                                                 *
     F*------------------------------------------------------------------------*
     F* CHANGE DATE| PROGRAMMER  | ID  | MEMO                                  *
     F*------------------------------------------------------------------------*
     F* 2006/4/3   | TCHK1       |TCHK1| BUG FIX                               *
     F* 2015/11/02 | JW (SRA)    | JW1 | FIX BUG OF SUBFILE CONTROL (*IN82)    *
     F* 2018/03/30 | JW (SRA)    | JW2 | CHG DISPLAY CORECT TABLE              *
     F* 2018/08/09 | JW (SRA)    | JW3 | ADD UPDATE INFORMATION                *
     F* 2019/10/22 | JW (SRA)    | JW5 | FIX 'MORE' 'BOTTOM' INDICATOR IN84    *
     F**************************************************************** FBCR29 **
     FFBCPW29 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL1
     F                                        RRN2  KSFILE SFL2
     F                                              KINFDS @INFDS
     FFGBPL01 IF  E           K        DISK
     FFBCPL03 IF  E           K        DISK
     FFBCPL05 IF  E           K        DISK
      *
     E**JW2               $ER     1   6 60
JW2  E                    $ER     1   7 70
      *
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   60TIME
     I                                        1   20TIMHH
     I                                        3   40TIMMM
      *
     I            DS
     I                                        1   80HYMD8
     I                                        3   80HYMD6
     I                                        1   40HYY
     I                                        5   60HMM
     I                                        7   80HDD
      *
     I            DS
     I                                        1  23 @MHIND
     I                                        1   5 @MHN1D
     I                                        6   6 WKF6
     I                                        7  11 @MHN2D
     I                                       12  12 WKF7
     I                                       13  17 @MHN3D
     I                                       18  18 WKF8
     I                                       19  23 @MHN4D
      *
     I            DS
     I                                        1  23 @MHIN
     I                                        1   5 @MHN1
     I                                        6   6 WKF3
     I                                        7  11 @MHN2
     I                                       12  12 WKF4
     I                                       13  17 @MHN3
     I                                       18  18 WKF5
     I                                       19  23 @MHN4
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
JW3  I            DS
 |   I                                        1   80FBKODT
 |   I                                        1   40FBKOYY
 |   I                                        5   60FBKOMM
 |   I                                        7   80FBKODD
 |   I            DS
 |   I                                        1   40FBKOTM
 |   I                                        1   20FBKOHH
JW3  I                                        3   40FBKOSS
      * BREAK FLD
     I            DS
     I                                        1  51 BKFLD
     I                                        1  33 INFLD
     I                                        1   40WKTOKU
     I                                        5   80WKNONY
     I                                        9   9 WKNKOJ
     I                                       10  13 WKNUKE
     I                                       14  18 WKMHN1
     I                                       19  23 WKMHN2
     I                                       24  28 WKMHN3
     I                                       29  33 WKMHN4
     I                                       34  410WKTKHZ
     I                                       34  370WKTKYY
     I                                       38  390WKTKMM
     I                                       40  410WKTKDD
     I                                       42  515WKNTAN
      * SAVE FLD
     I            DS
     I                                        1  51 CHKFLD
     I                                        1  33 SVFLD
     I                                        1   40FBTOKU
     I                                        5   80FBNONY
     I                                        9   9 FBNKOJ
     I                                       10  13 FBNUKE
     I                                       14  18 FBMHN1
     I                                       19  23 FBMHN2
     I                                       24  28 FBMHN3
     I                                       29  33 FBMHN4
     I                                       34  410FBTKHZ
     I                                       34  370FBTKYY
     I                                       38  390FBTKMM
     I                                       40  410FBTKDD
     I                                       42  515FBNTAN
      *
      *----------------------------------------------------*
      *   PARAMETER TRANCEFER                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PCMD    1
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
     C           KEYSV1    KLIST
     C                     KFLD           #STOKU  40
     C                     KFLD           #SMHN1  5
     C                     KFLD           #SMHN2  5
     C                     KFLD           #SMHN3  5
     C                     KFLD           #SMHN4  5
     C                     KFLD           #SNONY  40
     C                     KFLD           #SNKOJ  1
     C                     KFLD           #SNUKE  4
     C                     KFLD           #STKYY  40
     C                     KFLD           #STKMM  20
     C                     KFLD           #STKDD  20
     C           KEYSV2    KLIST
     C                     KFLD           #KTOKU  40
     C                     KFLD           #KNONY  40
     C                     KFLD           #KNKOJ  1
     C                     KFLD           #KNUKE  4
     C                     KFLD           #KMHN1  5
     C                     KFLD           #KMHN2  5
     C                     KFLD           #KMHN3  5
     C                     KFLD           #KMHN4  5
     C                     KFLD           #KTKYY  40
     C                     KFLD           #KTKMM  20
     C                     KFLD           #KTKDD  20
      *
     C           KEYFB1    KLIST
     C                     KFLD           #KTOKU  40
     C                     KFLD           #KMHN1  5
     C                     KFLD           #KMHN2  5
     C                     KFLD           #KMHN3  5
     C                     KFLD           #KMHN4  5
      *
     C           KEYFB3    KLIST
     C                     KFLD           #KTOKU  40
     C                     KFLD           #KMHN1  5
     C                     KFLD           #KMHN2  5
     C                     KFLD           #KMHN3  5
     C                     KFLD           #KMHN4  5
     C                     KFLD           #KNONY  40
     C                     KFLD           #KNKOJ  1
     C                     KFLD           #KNUKE  4
     C           KEYFB2    KLIST
     C                     KFLD           KTOKU
     C                     KFLD           KNONY
     C                     KFLD           KNKOJ
     C                     KFLD           KNUKE
     C                     KFLD           KMHN1
     C                     KFLD           KMHN2
     C                     KFLD           KMHN3
     C                     KFLD           KMHN4
      *
     C                     MOVE '01'      @@ID    2
      *
     C           @@ID      DOUEQ'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C           @@ID      CASEQ'02'      #SCRN2
     C           @@ID      CASEQ'03'      #SCRN3
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *----------------------------------------------------*
      *   INITIAL PROCESS                                  *
      *----------------------------------------------------*
     C           *INZSR    BEGSR
     C                     TIME           TIME
JW2  C                     TIME           SDATE  140
 "   C                     Z-ADDSDATE     #DATE   80
     C**JW2                Z-ADD*DATE     HYMD8
JW2  C                     Z-ADD#DATE     HYMD8
     C                     MOVE '0'       DSPSW1  1
     C                     MOVE '0'       DSPSW2  1
     C                     MOVE '0'       DSPSW3  1
     C                     Z-ADD0         X
     C                     MOVE *ZERO     #KTOKU  40
     C                     MOVE *ZERO     #KNONY  40
     C                     MOVE *BLANK    #KNKOJ  1
     C                     MOVE *BLANK    #KNUKE  4
     C                     MOVE *BLANK    #KMHN1  5
     C                     MOVE *BLANK    #KMHN2  5
     C                     MOVE *BLANK    #KMHN3  5
     C                     MOVE *BLANK    #KMHN4  5
     C                     MOVE *ZERO     #KTKYY  40
     C                     MOVE *ZERO     #KTKMM  20
     C                     MOVE *ZERO     #KTKDD  20
     C                     MOVE *ZERO     @TKCD
     C                     MOVE '0'       GETFLG  1
     C                     MOVE '0'       SETFLG  1
     C                     MOVE '0'       SVFLG   1
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   1ST.SCRREC     (SELECT KEY INPUT)              *
      *----------------------------------------------------*
     C           #SCRN1    BEGSR
     C                     EXFMTDSP01
      * CMD-1
     C                     SELEC
     C           *IN01     WHEQ '1'
     C                     MOVE '1'       PCMD
     C                     MOVE '99'      @@ID
      * CMD-3
     C           *IN03     WHEQ '1'
     C                     MOVE '99'      @@ID
     C                     MOVE '3'       PCMD
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     EXSR #SET1
     C           RRN1      IFEQ *ZERO
     C**JW2                MOVEL$ER,2     @ERR
JW2  C                     MOVEL$ER,7     @ERR
     C                     SETON                     3199
JW2  C                     SETON                     32
     C                     ELSE
     C                     MOVE '02'      @@ID
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   1ST.SCRREC     (CHECK INPUT DATA)              *
      *----------------------------------------------------*
     C           #CHK1     BEGSR
      *
     C                     SETOF                     343599
     C                     SETOF                     313233
     C                     MOVEL*BLANK    @ERR
      * CUST#
     C           @TKCD     IFEQ 0
     C                     MOVEL$ER,1     @ERR
     C                     SETON                     3199
     C                     GOTO $S210E
     C                     END
      * CUST#
     C           @TKCD     IFNE 0
     C                     SETOF                     21
     C           @TKCD     CHAINFGBPL011             21
     C           *IN21     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLEHYMD8
     C                     SETON                     21
     C                     END
     C           *IN21     IFEQ '1'
     C                     SETON                     3199
JW2  C                     SETON                     32
     C                     MOVEL$ER,2     @ERR
     C                     GOTO $S210E
     C                     END
     C                     ENDIF
      * PART#
     C           @MHN1     IFEQ *BLANK
     C           @MHN2     ANDEQ*BLANK
     C           @MHN3     ANDEQ*BLANK
     C           @MHN4     ANDEQ*BLANK
     C                     SETON                     3299
     C                     MOVEL$ER,3     @ERR
     C                     GOTO $S210E
     C                     END
      *
     C           @NKOJ     IFNE *BLANK
     C           @NOCD     ANDEQ0
     C                     SETON                     333499
     C                     MOVEL$ER,4     @ERR
     C                     GOTO $S210E
     C                     END
      *
     C           @NOCD     IFNE 0
     C                     SETOF                     21
     C           @NOCD     CHAINFGBPL011             21
     C           *IN21     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLEHYMD8
     C                     SETON                     21
     C                     END
     C           *IN21     IFEQ '1'
     C                     SETON                     3399
     C                     MOVEL$ER,2     @ERR
     C                     GOTO $S210E
     C                     END
      *
     C                     END
      *
     C           @NUKE     IFNE *BLANK
     C           @NKOJ     ANDEQ*BLANK
     C                     SETON                     343599
     C                     MOVEL$ER,4     @ERR
     C                     GOTO $S210E
     C                     END
      *
     C                     MOVE @MHN1     #KMHN1
     C                     MOVE @MHN2     #KMHN2
     C                     MOVE @MHN3     #KMHN3
     C                     MOVE @MHN4     #KMHN4
     C                     MOVE @TKCD     #KTOKU
      *----------------------*
      * UNIT PRICE FILE READ *
      *----------------------*
     C                     MOVE *BLANK    BKSW
     C           KEYFB1    SETLLFBCPL051
     C                     SETOF                     816667
     C                     DO   *HIVAL
     C                     EXSR $SB900
     C           GETFLG    IFEQ '1'
     C                     SETON                     67
     C                     END
     C  N81N67             END
      * NOT FOUND
     C           *IN81     IFEQ '1'
     C           *IN67     ANDEQ'0'
     C                     MOVEL$ER,5     @ERR
     C                     SETON                     313299
     C           @NOCD     IFNE 0
     C                     SETON                     33
     C                     END
     C           @NKOJ     IFNE *BLANK
     C                     SETON                     34
     C                     END
     C           @NUKE     IFNE *BLANK
     C                     SETON                     35
     C                     END
     C                     GOTO $S210E
     C                     END
      *
     CSR         $S210E    ENDSR
      *----------------------------------------------------*
      *   SET DATA FOR 2ND SCREEN                        *
      *----------------------------------------------------*
     C           #SET1     BEGSR
      *
     C                     MOVE *ON       *IN71
     C                     WRITECTL1
     C                     MOVE *OFF      *IN71
     C                     Z-ADD*ZERO     RRN1    40
     C                     Z-ADD*ZERO     @@RRN   40
     C           KEYFB1    SETLLFBCPL051
     C           KEYFB1    READEFBCPL051                 81
     C           *IN81     IFEQ *OFF
     C                     MOVE FBTOKU    #KTOKU
     C                     MOVE FBNONY    #KNONY
     C                     MOVE FBNKOJ    #KNKOJ
     C                     MOVE FBNUKE    #KNUKE
     C                     MOVE FBMHN1    #KMHN1
     C                     MOVE FBMHN2    #KMHN2
     C                     MOVE FBMHN3    #KMHN3
     C                     MOVE FBMHN4    #KMHN4
     C           KEYFB3    SETGTFBCPL051
     C                     EXSR #SET11
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   SET DATA FOR 2ND SCREEN                        *
      *----------------------------------------------------*
     C           #SET11    BEGSR
      *
     C                     Z-ADD@@RRN     RRN1
     C                     Z-ADD*ZERO     @CNT    20
     C           *IN82     DOUEQ*ON
TCHK1C           *IN83     DOUEQ*ON
TCHK1C           KEYFB3    REDPEFBCPL051                 83
TCHK1C           *IN83     IFEQ '0'
     C           FBSKJY    IFEQ *BLANK
     C**         FBTSHZ    ANDGE*DATE
JW2  C           FBTSHZ    ANDGE#DATE
      *
     C                     MOVE *BLANK    @OP
     C                     MOVE FBTOKU    @TOKU
     C                     MOVE FBNONY    @NONY
     C                     MOVE FBNKOJ    @NKOJ
     C                     MOVE FBNUKE    @NUKE
     C                     MOVE FBMHN1    @MHN1
     C                     MOVE FBMHN2    @MHN2
     C                     MOVE FBMHN3    @MHN3
     C                     MOVE FBMHN4    @MHN4
     C                     MOVE '-'       WKF3
     C                     MOVE '-'       WKF4
     C                     MOVE '-'       WKF5
     C           @MHN4     IFEQ *BLANK
     C                     MOVE *BLANK    WKF5
     C                     END
     C           @MHN3     IFEQ *BLANK
     C                     MOVE *BLANK    WKF4
     C                     END
     C                     Z-ADDFBNTAN    @TNK
     C                     Z-ADDFBTKHZ    @SYMD
      *
     C                     MOVE FBTOKU    KTOKU
     C                     MOVE FBNONY    KNONY
     C                     MOVE FBNKOJ    KNKOJ
     C                     MOVE FBNUKE    KNUKE
     C                     MOVE FBMHN1    KMHN1
     C                     MOVE FBMHN2    KMHN2
     C                     MOVE FBMHN3    KMHN3
     C                     MOVE FBMHN4    KMHN4
     C                     MOVE FBTKYY    KTKYY
     C                     MOVE FBTKMM    KTKMM
     C                     MOVE FBTKDD    KTKDD
      *
      *
     C                     ADD  1         @CNT
     C                     ADD  1         RRN1
     C           @CNT      IFEQ 1
     C                     Z-ADDRRN1      @SFRC1
     C                     ENDIF
      *
     C                     WRITESFL1
TCHK1C*
TCHK1C                     ELSE
TCHK1C                     ITER
TCHK1C*
     C                     ENDIF
TCHK1C*
TCHK1C                     END
TCHK1C                     ENDDO
      *
JW5  C                     Z-ADDRRN1      MAX1    40
      *
     C           KEYFB3    SETGTFBCPL051
     C           KEYFB1    READEFBCPL051                 82
     C           *IN82     IFEQ *OFF
     C                     MOVE FBTOKU    #KTOKU
     C                     MOVE FBNONY    #KNONY
     C                     MOVE FBNKOJ    #KNKOJ
     C                     MOVE FBNUKE    #KNUKE
     C                     MOVE FBMHN1    #KMHN1
     C                     MOVE FBMHN2    #KMHN2
     C                     MOVE FBMHN3    #KMHN3
     C                     MOVE FBMHN4    #KMHN4
     C           KEYFB3    SETGTFBCPL051
     C                     ENDIF
      *
     C           @CNT      IFEQ 10
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADDRRN1      @@RRN
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   SECOND SCREEN                                  *
      *----------------------------------------------------*
     C           #SCRN2    BEGSR
     C                     SETON                     7015
     C                     SETOF                     16
      *
     C           RRN1      IFLE MAX1
     C                     MOVE *OFF      JW      1
     C                     ELSE
     C                     MOVE *ON       JW
     C                     ENDIF
      *
     C                     WRITEDSP02
     C                     WRITEDSP03
     C                     WRITEDSP04
     C                     EXFMTCTL1
     C                     SETOF                     70
      *
     C                     Z-ADD@@REC     @SFRC1
     C                     SETOF                     9936
     C                     MOVEL*BLANK    @ERR
      * CMD-1
     C                     SELEC
     C           *IN01     WHEQ '1'
     C                     MOVE '99'      @@ID
     C                     MOVE '1'       PCMD
      * CMD-3
     C           *IN03     WHEQ '1'
     C                     MOVE '01'      @@ID
      *-------------------*
      * ROLL-UP           *
      *-------------------*
     C           *IN51     WHEQ *ON
     C**JW1      *IN81     ANDEQ*OFF
JW1  C           *IN82     ANDEQ*OFF
     C           KEYFB3    SETGTFBCPL051
     C                     EXSR #SET11
     C                     OTHER
     C                     EXSR #CHK2
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   CHECK 2ND SCREEN                               *
      *----------------------------------------------------*
     C           #CHK2     BEGSR
      *
     C                     Z-ADD0         X       40
     C           *IN23     DOUEQ*ON
     C                     ADD  1         X
     C           X         CHAINSFL1                 23
     C           *IN23     IFEQ '0'
     C           @OP       IFEQ 'M'
     C                     MOVE *BLANK    @OP
     C                     UPDATSFL1
     C                     EXSR #SET2
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   SET DATA FOR 3RD SCREEN                        *
      *----------------------------------------------------*
     C           #SET2     BEGSR
      *
     C                     SETON                     73
     C                     WRITECTL2
     C                     SETOF                     73
     C                     Z-ADD0         RRN2    40
     C                     Z-ADD1         @SFRC2
     C                     Z-ADD0         @NO1
     C                     MOVE '03'      @@ID
      *
     C                     MOVE KTOKU     @TOKUD
     C                     MOVE KNONY     @NONYD
     C                     MOVE KNKOJ     @NKOJD
     C                     MOVE KNUKE     @NUKED
     C                     MOVE KMHN1     @MHN1D
     C                     MOVE KMHN2     @MHN2D
     C                     MOVE KMHN3     @MHN3D
     C                     MOVE KMHN4     @MHN4D
     C                     MOVE '-'       WKF6
     C                     MOVE '-'       WKF7
     C                     MOVE '-'       WKF8
     C           @MHN4     IFEQ *BLANK
     C                     MOVE *BLANK    WKF8
     C                     END
     C           @MHN3     IFEQ *BLANK
     C                     MOVE *BLANK    WKF7
     C                     END
      *
     C           KEYFB2    SETLLFBCPL031
     C           *IN82     DOUEQ*ON
     C           KEYFB2    READEFBCPL031                 82
     C           *IN82     IFEQ *OFF
     C           FBSKJY    ANDEQ*BLANK
     C                     ADD  1         @NO1
     C                     Z-ADDFBNTAN    @TANK1
     C                     Z-ADDFBTKHZ    @SYMD1
     C                     Z-ADDFBTSHZ    @EYMD1
JW3  C                     Z-ADDFBKODT    @UYMD1
 |   C                     Z-ADDFBKOTM    @UTIM1
JW3  C                     MOVELFBKOME    @UID1
      *
JW3  C           FBTSHZ    IFEQ 99999999
 |   C                     MOVE *ON       *IN85
 |   C                     MOVE *ON       @85
 |   C                     ELSE
 |   C                     MOVE *OFF      *IN85
 |   C                     MOVE *OFF      @85
JW3  C                     ENDIF
      *
     C                     ADD  1         RRN2
     C                     WRITESFL2
     C                     ENDIF
     C                     ENDDO
      *
JW5  C                     Z-ADDRRN2      MAX2    40
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   3RD SCREEN                                     *
      *----------------------------------------------------*
     C           #SCRN3    BEGSR
      *
JW3  C                     SETOF                     15
JW3  C                     SETON                     16
     C                     SETON                     72
     C                     WRITEDSP03
     C                     WRITEDSP04
     C                     EXFMTCTL2
     C                     SETOF                     72
      *
     C                     SELEC
      * CMD-1
     C           *IN01     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     MOVE '1'       PCMD
      * CMD-3
     C           *IN03     WHEQ *ON
     C                     MOVE '02'      @@ID
     C                     OTHER
     C                     MOVE '02'      @@ID
     C                     EXSR #CHK2
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  UNIT PRICE MASTER FILE READ                       *
      *----------------------------------------------------*
     CSR         $SB900    BEGSR
     C                     MOVE '0'       GETFLG  1
     C                     SETOF                     66
     C           KEYFB1    READEFBCPL051                 81
     C           *IN81     IFEQ '0'
     C           FBSKJY    ANDEQ'D'
     C           FBSKHZ    ANDLEHYMD8
     C                     SETON                     66
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN66     ANDEQ'0'
      * RECEVING CO. CHECK
     C           @NOCD     IFEQ 0
     C                     MOVE '1'       GETFLG
     C                     ELSE
     C           @NOCD     IFEQ FBNONY
     C                     MOVE '1'       GETFLG
     C                     END
     C                     END
      * FACTORY CHECK
     C           GETFLG    IFEQ '1'
     C                     MOVE '0'       GETFLG
     C           @NKOJ     IFEQ *BLANK
     C                     MOVE '1'       GETFLG
     C                     ELSE
     C           @NKOJ     IFEQ FBNKOJ
     C                     MOVE '1'       GETFLG
     C                     END
     C                     END
     C                     END
      * RECEVING CHECK
     C           GETFLG    IFEQ '1'
     C                     MOVE '0'       GETFLG
     C           @NUKE     IFEQ *BLANK
     C                     MOVE '1'       GETFLG
     C                     ELSE
     C           @NUKE     IFEQ FBNUKE
     C                     MOVE '1'       GETFLG
     C                     END
     C                     END
     C                     END
      *
     C           GETFLG    IFEQ '1'
     C                     MOVE '0'       GETFLG
     C                     MOVE '1'       SVFLG
      *
     C           BKSW      IFEQ *BLANK
     C                     MOVE CHKFLD    BKFLD
     C                     MOVE '1'       BKSW    1
     C                     END
      *
     C           SVFLD     IFNE INFLD
     C                     MOVE '1'       GETFLG
     C                     END
      *
     C                     END
      *
     C                     END
      *
     C           *IN81     IFEQ '1'
     C           SVFLG     ANDEQ'1'
     C                     MOVE *BLANK    BKSW
      *
     C           @TKCD     IFEQ WKTOKU
     C           @MHN1     ANDEQWKMHN1
     C           @MHN2     ANDEQWKMHN2
     C           @MHN3     ANDEQWKMHN3
     C           @MHN4     ANDEQWKMHN4
     C                     MOVE '1'       GETFLG
     C                     END
      *
     C           GETFLG    IFEQ '1'
     C                     MOVE '0'       GETFLG
     C           @NOCD     IFEQ 0
     C                     MOVE '1'       GETFLG
     C                     ELSE
     C           @NOCD     IFEQ WKNONY
     C                     MOVE '1'       GETFLG
     C                     END
     C                     END
     C                     END
      *
     C           GETFLG    IFEQ '1'
     C                     MOVE '0'       GETFLG
     C           @NKOJ     IFEQ *BLANK
     C                     MOVE '1'       GETFLG
     C                     ELSE
     C           @NKOJ     IFEQ WKNKOJ
     C                     MOVE '1'       GETFLG
     C                     END
     C                     END
     C                     END
      *
     C           GETFLG    IFEQ '1'
     C                     MOVE '0'       GETFLG
     C           @NUKE     IFEQ *BLANK
     C                     MOVE '1'       GETFLG
     C                     ELSE
     C           @NUKE     IFEQ WKNUKE
     C                     MOVE '1'       GETFLG
     C                     END
     C                     END
     C                     END
      *
     C                     END
     CSR         $S900E    ENDSR
** ERR MSG
E01 ENTER CUSTOMER !
E02 NO DATA IN DETAIL M/F
E03 ENTER USER PART NUBER !
E04 ENTER DELIVERY !
E05 PART NOT FOUND IN UNIT PRICE M/F !
E06 DIVISION INSTRUCTION IS < ' ' , 'M'  >
E07 PRICE DATA NOT FOUND ! CHECK ENTERED DATA OR EFFECTIVE DATE...
