     H            Y.
     F** FBCR30N ***********************************************
     A*  SALES EXPANSION PRTS DATA MAINTENANCE                 *
     F*                           2004.02.05                   *
     F* %0001 T.SAKAKI            2016.07.20                   *
     F* JW    2022.09.09 ADD EFFECTIVE DATE AS A KEY FIELD     *
     F**********************************************************
     FFBCPW30NCF  E                    WORKSTN
     FFBCPL21 UF  E           K        DISK                      A
     FFBCPP25 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
      *---------------------------------------------------------------
     E                    CMD     1   2 78
     E                    TAB1    1   3  1   TAB2   10
     E                    MSG     1  15 75
      *---------------------------------------------------------------
     I            DS
     I                                        1   60W@YM
     I                                        1   40W@Y
     I                                        5   60W@M
     I            DS
     I                                        1   80@YMD
     I                                        1   40@@Y
     I                                        5   60@@M
     I                                        7   80@@D
     I                                        1   60@@YM
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *----------------------------------------------------*
      * PARM LIST                                          *
      *----------------------------------------------------*
     C           P2FB35    PLIST
     C                     PARM           PSLSP  10
      *----------------------------------------------------*
      *   MAIN                                             *
      *----------------------------------------------------*
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C           @@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *----------------------------------------------------*
      * INITIALIZE                                         *
      *----------------------------------------------------*
     C           *INZSR    BEGSR
      *
     C           K#GAD0    KLIST
     C                     KFLD           K@TOKU  40
     C           K#GAD     KLIST
     C                     KFLD           K@TOKU  40
     C                     KFLD           K@NONY  40
     C           K#GAD1    KLIST
     C                     KFLD           K@TOKU  40
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C           K#GAD2    KLIST
     C                     KFLD           K@TOKU  40
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C           K#FBC2    KLIST
     C                     KFLD           K@TOKU
     C                     KFLD           K@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C                     KFLD           D@MHN1
     C                     KFLD           D@MHN2
     C                     KFLD           D@MHN3
     C                     KFLD           D@MHN4
     C           K#FBC     KLIST
     C                     KFLD           K@TOKU
     C                     KFLD           K@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C                     KFLD           D@MHN1
     C                     KFLD           D@MHN2
     C                     KFLD           D@MHN3
     C                     KFLD           D@MHN4
     C                     KFLD           D@USID
     C           K#AGD     KLIST
     C                     KFLD           W@Y
     C                     KFLD           W@M
      *
     C                     MOVE '01'      @@ID    2
     C                     Z-ADD*DATE     @YMD
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   1ST SCREEN                                       *
      *----------------------------------------------------*
     C           #SCRN1    BEGSR
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKL     WHEQ *ON
     C                     MOVELD@USID    PSLSP
     C                     CALL 'FBCR35'  P2FB35
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKL     IFEQ *ON
     C                     CALL 'FBCR35'  P2FB35
     C                     ELSE
     C                     EXSR #SET
     C                     MOVE '02'      @@ID
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  CHECK
      *----------------------------------------------------*
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
      * USER ID
     C           D@USID    SETLLRGAPL11
     C           *IN90     DOUEQ*ON
     C           D@USID    READERGAPL11                  90
     C           *IN90     IFEQ *OFF
     C           J8SKJY    ANDEQ*BLANK
     C                     MOVELJ8NAME    D@USNM
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN90     IFEQ *ON
     C                     SETON                     6199
     C                     MOVE MSG,1     D@MSG
     C                     ELSE
     C                     MOVELD@USID    PSLSP
     C                     ENDIF
      *
      * CUSTOMER
     C           D@CUST    IFEQ *BLANK
     C  N99                MOVE MSG,2     D@MSG
     C                     SETON                     6299
     C                     ENDIF
     C**         D@NONY    IFEQ *BLANK
     C**N99                MOVE MSG,3     D@MSG
     C**                   SETON                     6399
     C**                   ENDIF
      *
     C           *IN99     IFEQ *OFF
     C                     MOVE D@CUST    K@TOKU
     C                     MOVE D@NONY    K@NONY
     C                     MOVE D@NKOJ    K@NKOJ
     C                     MOVE D@NUKE    K@NUKE
     C                     SETON                     90
     C                     SELEC
     C           D@NONY    WHEQ *BLANK
     C           K#GAD0    CHAINFGBPL01              91
     C           *IN91     IFEQ *OFF
     C           B2SKJY    ANDEQ*BLANK
     C                     MOVELB2SMEI    D@CSNM
     C                     ENDIF
     C           D@NKOJ    WHEQ *BLANK
     C           K#GAD     CHAINGADPL11              90
     C  N90                MOVELB5KMEI    D@CSNM
     C           D@NUKE    WHEQ *BLANK
     C           K#GAD1    CHAINGADPL11              90
     C  N90                MOVELB5KMEI    D@CSNM
     C                     OTHER
     C           K#GAD2    CHAINGADPL11              90
     C  N90                MOVELB5KMEI    D@CSNM
     C                     ENDSL
      *
     C           D@CSNM    IFEQ *BLANK
     C  N99                MOVE MSG,2     D@MSG
     C                     SETON                     626399
     C                     ENDIF
      *
     C                     ENDIF
      * PART NUMBER
     C           D@MHN1    IFEQ *BLANK
     C  N99                MOVE MSG,4     D@MSG
     C                     SETON                     6699
     C                     ENDIF
      * UPDATE ID
     C           D@UPID    LOKUPTAB1      TAB2           90
     C           *IN90     IFEQ *OFF
     C  N99                MOVE MSG,5     D@MSG
     C                     SETON                     6799
     C                     ELSE
     C                     MOVELTAB2      D@UPDC
     C                     ENDIF
      * READ FBCPP20
     C           K#FBC2    SETLLFBCPL21
     C           *IN90     DOUEQ*ON
     C           K#FBC2    READEFBCPL21             N    90
     C           *IN90     IFEQ *OFF
     C           F2SKJY    ANDEQ*BLANK
     C           F2SLSP    IFNE D@USID
     C  N99      MSG,7     CAT  F2SLSP:1  D@MSG     P
     C                     MOVEA'111111'  *IN,61
     C                     MOVE *ON       *IN99
     C                     ENDIF
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           D@UPID    IFEQ '0'
     C           D@UPID    OREQ '1'
     C           *IN90     IFEQ *ON
     C  N99                MOVE MSG,8     D@MSG
     C                     SETON                     6799
     C                     ENDIF
     C                     ENDIF
      *
     C           D@UPID    IFEQ '2'
     C           *IN90     ANDEQ*OFF
     C  N99                MOVE MSG,9     D@MSG
     C                     SETON                     6799
     C                     ENDIF
JW    * START MONTH
 .   C           D@STRM    IFNE 0
 .   C                     Z-ADDD@STRM    W@YM
 .   C           K#AGD     CHAINAGDPL12              90
 .   C           *IN90     IFEQ *ON
 .   C  N99                MOVE MSG,11    D@MSG
 .   C                     SETON                     6899
 .   C                     ENDIF
JW   C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------*
      * CLEAR
      *----------------------------------------------------*
     C           #CLR      BEGSR
      *
     C                     MOVE *BLANK    D@MSG
     C                     MOVEA'00000000'*IN,60
     C                     MOVE *OFF      *IN68
     C                     MOVE *OFF      *IN99
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   SET DATA                                         *
      *----------------------------------------------------*
     C           #SET      BEGSR
      *
     C                     SELEC
     C           D@UPID    WHEQ '2'
     C                     Z-ADD*ZERO     D@STRD
     C                     Z-ADD*ZERO     D@END
     C                     MOVE *BLANK    D@RMK1
     C                     MOVE *BLANK    D@RMK2
     C                     MOVE *BLANK    D@CLAS
     C                     MOVE *BLANK    D@CDES
     C                     Z-ADD*ZERO     D@UPRC
      *
     C                     OTHER
     C                     Z-ADDF2STYM    D@STRD
     C                     Z-ADDF2ENYM    D@END
     C                     Z-ADDF2UPRC    D@UPRC
     C                     MOVELF2CLAS    D@CLAS
     C                     MOVE *BLANK    D@CDES
     C           F2CLAS    IFNE *ZERO
     C           F2CLAS    CHAINFBCPP25              95
     C           *IN95     IFEQ *OFF
     C           F5SKJY    ANDEQ*BLANK
     C                     MOVELF5DESC    D@CDES
     C                     ENDIF
     C                     ENDIF
     C                     MOVELF2RMK1    D@RMK1
     C                     MOVELF2RMK2    D@RMK2
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   2ND SCREEN                                       *
      *----------------------------------------------------*
     C           #SCRN2    BEGSR
      *
     C                     MOVE CMD,2     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP02
      *
     C                     SELEC
      * F1 END
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
      * F3 BACK
     C           *INKC     WHEQ *ON
     C                     MOVE '01'      @@ID
      * F9 PART CLAS INQ
     C           *INKI     WHEQ *ON
     C                     CALL 'FBCR33'
      * F10 PART CLAS ENTRY
     C           *INKJ     WHEQ *ON
     C                     CALL 'FBCR32'
      * ENTER/F5
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD
     C                     MOVE '01'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  CHECK
      *----------------------------------------------------*
     C           #CHK2     BEGSR
      *
     C                     EXSR #CLR
     C           D@STRD    IFEQ *ZERO
     C                     SETON                     6199
     C                     MOVE MSG,6     D@MSG
     C                     ENDIF
     C           D@END     IFLE D@STRD
     C  N99                MOVE MSG,6     D@MSG
     C                     SETON                     616299
     C                     ENDIF
      *
     C                     Z-ADDD@STRD    W@YM
     C           K#AGD     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C  N99                MOVE MSG,6     D@MSG
     C                     SETON                     6199
     C                     ENDIF
      *
     C           D@CLAS    IFNE *ZERO
     C           D@CLAS    CHAINFBCPP25              90
     C           *IN90     IFEQ *ON
     C  N99                MOVE MSG,10    D@MSG
     C                     SETON                     6399
     C                     ELSE
     C           F5SKJY    IFNE *BLANK
     C  N99                MOVE MSG,10    D@MSG
     C                     SETON                     6399
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  UPDATE
      *----------------------------------------------------*
     C           #UPD      BEGSR
      *
     C                     SELEC
     C           D@UPID    WHEQ '2'
     C           K#FBC     CHAINFBCPL21              90
     C           *IN90     IFEQ *OFF
     C           F2SKJY    IFEQ 'D'
     C                     MOVEL*BLANK    F2SKJY
     C                     Z-ADD*ZERO     F2SYMD
     C                     TIME           F2KTIM
     C                     MOVEL#USER     F2KOME
     C                     Z-ADDD@STRD    F2STYM
     C                     Z-ADDD@END     F2ENYM
     C                     Z-ADDD@UPRC    F2UPRC
     C                     MOVE D@CLAS    F2CLAS
     C                     MOVELD@RMK1    F2RMK1
     C                     MOVELD@RMK2    F2RMK2
     C                     UPDATFBCPP201
     C                     ENDIF
      *
     C                     ELSE
     C                     CLEARFBCPP201
     C                     Z-ADD*DATE     F2KYMD
     C                     TIME           F2KTIM
     C                     MOVEL#USER     F2KOME
     C                     MOVE D@CUST    F2TOKU
     C                     MOVE D@NONY    F2NONY
     C                     MOVE D@NKOJ    F2NKOJ
     C                     MOVE D@NUKE    F2NUKE
     C                     MOVE D@MHN1    F2MHN1
     C                     MOVE D@MHN2    F2MHN2
     C                     MOVE D@MHN3    F2MHN3
     C                     MOVE D@MHN4    F2MHN4
     C                     MOVE D@USID    F2SLSP
     C                     Z-ADDD@STRD    F2STYM
     C                     Z-ADDD@END     F2ENYM
     C                     Z-ADDD@UPRC    F2UPRC
     C                     MOVE D@CLAS    F2CLAS
     C                     MOVELD@RMK1    F2RMK1
     C                     MOVELD@RMK2    F2RMK2
     C                     WRITEFBCPP201
     C                     ENDIF
      *
     C           D@UPID    WHEQ '0'
     C           K#FBC     CHAINFBCPL21              90
     C           *IN90     IFEQ *OFF
     C           F2SKJY    ANDEQ*BLANK
     C                     MOVE 'D'       F2SKJY
     C                     Z-ADD*DATE     F2SYMD
     C                     Z-ADD*DATE     F2KYMD
     C                     TIME           F2KTIM
     C                     MOVEL#USER     F2KOME
     C                     UPDATFBCPP201
     C                     ENDIF
      *
     C           D@UPID    WHEQ '1'
     C           K#FBC     CHAINFBCPL21              90
     C           *IN90     IFEQ *OFF
     C           F2SKJY    ANDEQ*BLANK
     C                     TIME           F2KTIM
     C                     MOVEL#USER     F2KOME
     C                     Z-ADDD@STRD    F2STYM
     C                     Z-ADDD@END     F2ENYM
     C                     Z-ADDD@UPRC    F2UPRC
     C                     MOVE D@CLAS    F2CLAS
     C                     MOVELD@RMK1    F2RMK1
     C                     MOVELD@RMK2    F2RMK2
     C                     UPDATFBCPP201
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------*
** CMD
  F1:END                                       F12:MASTER INQUIRY
F1:END   F3:GO BACK   F5:UPDATE   F9:PART CLAS INQ   F10:PART CLAS REGISTRATION
** TAB1 / TAB1
00-DELETE
11-CHANGE
22-ADD
** MSG (75A) ......2.........3.........4.........5.........6.........7.....
USER ID ERROR!                                                              01
CUSTOMER CODE ERROR!                                                        02
DELIVERY CODE ERROR!                                                        03
PART NUMBER ERORR!                                                          04
UPDATE ID ERROR!                                                            05
DATE ERROR!                                                                 06
ALREADY REGISTERED UNDER ANOTHER SALES PERSON!                              07
NO RECORD!                                                                  08
ALREADY REGISTERED!                                                         09
PART CLASS ERROR!                                                           10
START MONTH IS NOT VALID!                                                   11
                                                                            12
                                                                            13
                                                                            14
                                                                            15
