     H            Y.
     F****************************************************************
     F*  PROGRAM    : FBCR73                                         *
     F*  WRITTEN    : 04/05/2016                                     *
     F*  WRITTEN BY : JW (SRA)                                       *
     F*  FUNCTION   : GET CURRENT EFFECTIVE DATE FROM FBCPP01        *
     F*             : IF ERROR, RTN=1                                *
     F*             : EXTERNAL SUBROUTINE                            *
     F*  CALLING SEQ:                                                *
     F*                    CALL 'FBCR73'
     F*                    PARM           @CUST   4
     F*                    PARM           @DELV   4
     F*                    PARM           @FACT   1
     F*                    PARM           @DOCK   4
     F*                    PARM           @MHN1   5
     F*                    PARM           @MHN2   5
     F*                    PARM           @MHN3   5
     F*                    PARM           @MHN4   5
     F*                    PARM           #EFDAT  8
     F*                    PARM           #RTN    1
     F****************************************************************
     FFBCPL03 IF  E           K        DISK
      *---------------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ******************************************************
      *                    MAIN PROCESS
      ******************************************************
      * Initial Process
     C                     EXSR @INIT
      * LOOP
     C                     MOVEL@CUST     KBTOKU
     C                     MOVEL@DELV     KBNONY
     C                     MOVEL@FACT     KBNKOJ
     C                     MOVEL@DOCK     KBNUKE
     C                     MOVEL@MHN1     KBMHN1
     C                     MOVEL@MHN2     KBMHN2
     C                     MOVEL@MHN3     KBMHN3
     C                     MOVEL@MHN4     KBMHN4
     C           KEY       SETLLFBCPL03
     C           *IN91     DOWEQ*OFF
     C           KEY       READEFBCPL03                  91
     C           *IN91     IFEQ *OFF
     C           FBSKJY    ANDEQ' '
     C                     MOVELFBTKHZ    #EFDAT
     C                     ENDIF
     C                     ENDDO
      * If No Error
     C           #EFDAT    IFEQ '00000000'
     C                     MOVE '1'       #RTN
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      ******************************************************
      *                  INITIAL ROUTINE
      ******************************************************
     C           @INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           @CUST   4
     C                     PARM           @DELV   4
     C                     PARM           @FACT   1
     C                     PARM           @DOCK   4
     C                     PARM           @MHN1   5
     C                     PARM           @MHN2   5
     C                     PARM           @MHN3   5
     C                     PARM           @MHN4   5
     C                     PARM           #EFDAT  8
     C                     PARM           #RTN    1
      *
     C           KEY       KLIST
     C                     KFLD           KBTOKU
     C                     KFLD           KBNONY
     C                     KFLD           KBNKOJ
     C                     KFLD           KBNUKE
     C                     KFLD           KBMHN1
     C                     KFLD           KBMHN2
     C                     KFLD           KBMHN3
     C                     KFLD           KBMHN4
      *
     C           *LIKE     DEFN FBTOKU    KBTOKU
     C           *LIKE     DEFN FBNONY    KBNONY
     C           *LIKE     DEFN FBNKOJ    KBNKOJ
     C           *LIKE     DEFN FBNUKE    KBNUKE
     C           *LIKE     DEFN FBMHN1    KBMHN1
     C           *LIKE     DEFN FBMHN2    KBMHN2
     C           *LIKE     DEFN FBMHN3    KBMHN3
     C           *LIKE     DEFN FBMHN4    KBMHN4
      *
     C                     MOVE *ALL'0'   #EFDAT
     C                     CLEAR#RTN
     C                     Z-ADD*DATE     @DATE   80
     C                     TIME           @TIME   60
      *
     C                     ENDSR
