     H            Y.
     F** FBCR17 ****************************************
     F* ..SALES UNIT PRICE MASTER LIST <EXCEPTIONAL>.. *
     F*     MSK KUNIEDA               2000.03.31       *
     F**************************************** FBCR17 **
     FFBCWP17 IP  F     100            DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     IFBCWP17 AA  01
     I                                        1   40ITOKU L1
     I                                        5   80INONY L1
     I                                        9   9 INKOJ L1
     I                                       10  13 INUKE L1
     I                                       14  18 IMHN1 L1
     I                                       19  23 IMHN2 L1
     I                                       24  28 IMHN3 L1        10
     I                                       29  33 IMHN4 L1        11
     I                                       34  435IOTAN
     I                                       44  535INTAN
     I                                       54  610ITKHZ
     I                                       62  690ITSHZ
      *
     C                     SETOF                     30
     C                     TIME           WTIME   60
     C  N31                SETON                     3031
      *
     C                     SETOF                     40
     C                     MOVE *BLANK    WTMEI  15
     C           ITOKU     CHAINFGBPL011             40
     C           *IN40     IFEQ '0'
     C                     MOVELB2SMEI    WTMEI
     C                     END
      *
     C                     SETOF                     40
     C                     MOVE *BLANK    WNMEI  15
     C           INONY     CHAINFGBPL011             40
     C           *IN40     IFEQ '0'
     C                     MOVELB2SMEI    WNMEI
     C                     END
      *
     OQPRINT  H  102   30
     O       OR        OF
     O                                  131 '.....................'
     O        H  1     30
     O       OR        OF
     O                                  131 '.         .         .'
     O        H  1     30
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O        H  2     30
     O       OR        OF
     O                                   10 'FBCR17-1'
     O                                   48 '**  SALES UNIT'
     O                                   61 'PRICE MASTER'
     O                                   72 'LIST**'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        H  2     30
     O       OR        OF
     O                                   24 'EXCEPTIONAL UNIT PRICE'
     O        H  1     30
     O       OR        OF
     O                                   96 'REVISED'
     O                                  108 'EFFECTIVE'
     O                                  120 'EXPIRATION'
     O        H  2     30
     O       OR        OF
     O                                   10 'CUSTOMER'
     O                                   31 'DELIVERY'
     O                                   51 'FACTORY'
     O                                   56 'DOCK'
     O                                   72 'USER PARTS NO.'
     O                                   96 'UNIT PRICE'
     O                                  108 'DATE'
     O                                  120 'DATE'
     O        T  2     L1
     O                         ITOKU      6
     O                                    7 '-'
     O                         WTMEI     22
     O                         INONY     27
     O                                   28 '-'
     O                         WNMEI     43
     O                         INKOJ     48
     O                         INUKE     56
     O                         IMHN1     63
     O                                   64 '-'
     O                         IMHN2     69
     O                N10                70 '-'
     O                         IMHN3     75
     O                N11                76 '-'
     O                         IMHN4     81
     O                         INTAN 3   96
     O                         ITKHZ    108 '    .  .  '
     O                         ITSHZ    120 '    .  .  '
