     H            Y.
     F** FBCR05 ***********************************************
     F*   SALES UNIT PRICE MASTER ADDITION
     F*   UNIT PRICE IN MASS PRODUCTION
     F*       MSK.KUNIEDA         2000.03.29
JW1  F*   J.WATANABE 2016.07.26 ADD INDIVIDUAL FLAG
JW2  F*   J.WATANABE 2017.06.01 FIX CHECKING DATA ROUTINE
JW3  F*   J.WATANABE 2018.09.13 CHG FBCPL03 TO FBCPL18
JW4  F*   J.WATANABE 2018.10.19 USE SYSTEM DATE INSTEAD OF *DATE
JW5  F*   J.WATANABE 2019.10.02 ADD FBCPP05 (PRICE CHG LOG)
JW5  F*                         DLT @2IND
JW6  F*   JW         2020.09.02 FIX BUG (LOOP WHEN ERROR OCCURED)
     F*********************************************************
     FFBCPW05 CF  E                    WORKSTN
     FFBCPL18 UF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
JW5  FFBCPP05 O   E                    DISK
      *
     E**JW1               $ER     1  18 60
JW1  E                    $ER     1  20 60
      *
     I            DS
     I                                        1  23 @MHIN
     I                                        1   5 @MHN1
     I                                        6   6 WKF1
     I                                        7  11 @MHN2
     I                                       12  12 WKF2
     I                                       13  17 @MHN3
     I                                       18  18 WKF3
     I                                       19  23 @MHN4
      *
     I            DS
     I                                        1  20 WKMHIN
     I                                        1   5 WMHN1
     I                                        6  10 WMHN2
     I                                       11  15 WMHN3
     I                                       16  20 WMHN4
      *
     I            DS
     I                                        1   80WKYMD
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
JW6  I            DS
 |   I                                        1   80#KHHZ
 |   I                                        1   40#KHYY
 |   I                                        5   60#KHMM
JW6  I                                        7   80#KHDD
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     I            DS
     I                                        1   80@2SYMD
     I                                        1   40@2SYY
     I                                        5   60@2SMM
     I                                        7   80@2SDD
      *
     I            DS
     I                                        1   80@2EYMD
     I                                        1   40@2EYY
     I                                        5   60@2EMM
     I                                        7   80@2EDD
      *
     I            DS
     I                                        1   60TIME
     I                                        1   20TIMEHH
     I                                        3   40TIMESS
JW4   * SYSTEM DATE
 |   I            DS
 |   I                                        1  140SDATE
 |   I                                        1   60NOW
JW4  I                                        7  140TODAY
      *
JW2  I            DS
 |   I                                        1   80FBTKHZ
 |   I                                        1   40FBTKYY
 |   I                                        5   60FBTKMM
JW2  I                                        7   80FBTKDD
JW2  I            DS
 |   I                                        1   80FBTSHZ
 |   I                                        1   40FBTSYY
 |   I                                        5   60FBTSMM
JW2  I                                        7   80FBTSDD
      *
     I            DS
     I                                        1   80HYMD8
     I                                        3   80HYMD6
     I                                        1   40HYY
     I                                        5   60HMM
     I                                        7   80HDD
      *
     I            DS
     I                                        1  12 FBSHIN
     I                                        1   5 FBSHN1
     I                                        6  10 FBSHN2
     I                                       11  12 FBSHN3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
     C           *ENTRY    PLIST
     C                     PARM           PUSER  10
      *----------------------------------------------------*
      *   KEY LIST                                         *
      *----------------------------------------------------*
     C           KEYFB1    KLIST
     C                     KFLD           #KTOKU  40
     C                     KFLD           #KNONY  40
     C                     KFLD           #KNKOJ  1
     C                     KFLD           #KNUKE  4
     C                     KFLD           #KMHN1  5
     C                     KFLD           #KMHN2  5
     C                     KFLD           #KMHN3  5
     C                     KFLD           #KMHN4  5
      *
     C           KEYFB2    KLIST
     C                     KFLD           #KTOKU  40
     C                     KFLD           #KNONY  40
     C                     KFLD           #KNKOJ  1
     C                     KFLD           #KNUKE  4
     C                     KFLD           #KMHN1  5
     C                     KFLD           #KMHN2  5
     C                     KFLD           #KMHN3  5
     C                     KFLD           #KMHN4  5
     C                     KFLD           #KHYY
     C                     KFLD           #KHMM
     C                     KFLD           #KHDD
      *
     C           KEYB21    KLIST
     C                     KFLD           #KCODE  40
      *
     C           KEYB51    KLIST
     C                     KFLD           #KTOKU
     C                     KFLD           #KNONY
     C                     KFLD           #KNKOJ
     C                     KFLD           #KNUKE
      *
     C           KEYF81    KLIST
     C                     KFLD           #KHYY   40
     C                     KFLD           #KHMM   20
     C                     KFLD           #KHDD   20
      *
      *----------------------------------------------------*
      *----------------------------------------------------*
     C                     EXSR $SB100
     C           *IN01     DOWEQ'0'
     C                     EXSR $SB200
     C                     END
     C                     EXSR $SB300
      *----------------------------------------------------*
      *----------------------------------------------------*
     CSR         $SB100    BEGSR
     C                     TIME           TIME
      *
JW4  C**JW4                Z-ADD*DATE     HYMD8
"    C                     TIME           SDATE
"    C                     Z-ADDTODAY     HYMD8
      *
     C                     MOVEL*BLANK    @ERR
     C                     Z-ADD0         WHY     40
     C                     Z-ADD0         WHM     20
     C                     Z-ADD0         WHD     20
     C                     Z-ADD0         URU     40
     C                     Z-ADD0         AMA     40
     C                     Z-ADD0         URU1    40
     C                     Z-ADD0         AMA1    40
     C                     Z-ADD0         URU2    40
     C                     Z-ADD0         AMA2    40
     C                     Z-ADD0         X       10
     C                     MOVE '1'       DSPSW1  1
     C                     MOVE '0'       DSPSW2  1
     CSR         $S100E    ENDSR
      *----------------------------------------------------*
      *----------------------------------------------------*
     CSR         $SB200    BEGSR
     C           *IN01     DOWEQ'0'
     C           DSPSW1    ANDEQ'1'
     C                     EXSR $SB210
     C                     END
      *
     C           *IN03     DOWEQ'0'
JW6  C**         *IN05     ANDEQ'0'
     C           DSPSW2    ANDEQ'1'
     C                     EXSR $SB220
     C                     END
      *
     CSR         $S200E    ENDSR
      *----------------------------------------------------*
      * FCBPW041                                           *
      *----------------------------------------------------*
     CSR         $SB210    BEGSR
     C                     EXFMTFBCPW051
     C                     SETOF                     313233
     C                     SETOF                     343599
     C                     SETOF                     0519
     C                     MOVEL*BLANK    @ERR
      * F1: END
     C           *IN01     IFEQ '1'
     C                     GOTO $S210E
     C                     END
      *
     C           @TOKU     IFEQ 0
     C                     SETON                     3599
     C                     MOVEL$ER,1     @ERR
     C                     GOTO $S210E
     C                     END
     C                     MOVE @TOKU     #KCODE
     C                     EXSR $SB900
     C           *IN21     IFEQ '1'
     C                     SETON                     9935
     C                     MOVEL$ER,2     @ERR
     C                     GOTO $S210E
     C                     END
      *
     C           @NONY     IFEQ 0
     C                     SETON                     3199
     C                     MOVEL$ER,3     @ERR
     C                     GOTO $S210E
     C                     END
     C                     MOVE @NONY     #KCODE
     C                     EXSR $SB900
     C           *IN21     IFEQ '1'
     C                     SETON                     9931
     C                     MOVEL$ER,4     @ERR
     C                     GOTO $S210E
     C                     END
      *
     C           @MHN1     IFEQ *BLANK
     C           @MHN2     ANDEQ*BLANK
     C           @MHN3     ANDEQ*BLANK
     C           @MHN4     ANDEQ*BLANK
     C                     MOVEL$ER,6     @ERR
     C                     SETON                     9934
     C                     GOTO $S210E
     C                     END
      *-------------------*
      * NEXT SCREEN ITEM  *
      *-------------------*
JW1  C                     MOVE 'Y'       @2IND   1
     C                     Z-ADD0         @2TNK
     C                     Z-ADD0         @2SYY
     C                     Z-ADD0         @2SMM
     C                     Z-ADD0         @2SDD
     C                     Z-ADD0         @2EYY
     C                     Z-ADD0         @2EMM
     C                     Z-ADD0         @2EDD
     C                     MOVE @TOKU     @TOKUD
     C                     MOVE @NONY     @NONYD
     C                     MOVE @NKOJ     @NKOJD
     C                     MOVE @NUKE     @NUKED
     C                     MOVE '-'       WKF1
     C                     MOVE '-'       WKF2
     C                     MOVE '-'       WKF3
     C           @MHN4     IFEQ *BLANK
     C                     MOVE *BLANK    WKF3
     C                     END
     C           @MHN3     IFEQ *BLANK
     C                     MOVE *BLANK    WKF2
     C                     END
     C           @MHN2     IFEQ *BLANK
     C                     MOVE *BLANK    WKF1
     C                     END
     C                     MOVE @MHIN     @MHIND
      *
     C                     MOVE @TOKU     #KTOKU
     C                     MOVE @NONY     #KNONY
     C                     MOVE @NKOJ     #KNKOJ
     C                     MOVE @NUKE     #KNUKE
     C                     MOVE @MHN1     #KMHN1
     C                     MOVE @MHN2     #KMHN2
     C                     MOVE @MHN3     #KMHN3
     C                     MOVE @MHN4     #KMHN4
      *
     C                     SETOF                     8167
     C           KEYFB1    SETGTFBCPL18
     C                     Z-ADD0         @1TNK
     C                     Z-ADD0         @1SYMD
     C                     Z-ADD0         @1EYMD
     C                     Z-ADD2         X
      *
     C                     DO   *HIVAL
     C           KEYFB1    REDPEFBCPL18                  81
     C                     SETOF                     66
      *
     C           *IN81     IFEQ '0'
     C           FBSKJY    ANDEQ'D'
     C**JW4      FBSKHZ    ANDLE*DATE
JW4  C           FBSKHZ    ANDLETODAY
     C                     SETON                     66
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN66     ANDEQ'0'
      *
     C           X         IFEQ 2
     C                     Z-ADDFBNTAN    @2TNK
JW1  C**                   MOVELFBIND     @2IND
     C                     Z-ADDFBTKYY    WKYY
     C                     Z-ADDFBTKMM    WKMM
     C                     Z-ADDFBTKDD    WKDD
     C                     MOVE WKYMD     @2SYMD
     C                     Z-ADD@2SYMD    SVYMD
     C                     Z-ADDFBTSYY    WKYY
     C                     Z-ADDFBTSMM    WKMM
     C                     Z-ADDFBTSDD    WKDD
     C                     MOVE WKYMD     @2EYMD
     C                     END
     C           X         IFEQ 1
     C                     SETON                     67
     C                     Z-ADDFBNTAN    @1TNK
     C                     Z-ADDFBTKYY    WKYY
     C                     Z-ADDFBTKMM    WKMM
     C                     Z-ADDFBTKDD    WKDD
     C                     MOVE WKYMD     @1SYMD
     C           SVYMD     IFEQ 0
     C                     Z-ADD@1SYMD    SVYMD
     C                     END
     C                     Z-ADDFBTSYY    WKYY
     C                     Z-ADDFBTSMM    WKMM
     C                     Z-ADDFBTSDD    WKDD
     C                     MOVE WKYMD     @1EYMD
     C                     END
     C                     SUB  1         X
      *
     C                     END
      *
     C  N81N67             END
      *
     C           *IN81     IFEQ '1'
     C           X         ANDEQ2
     C                     SETON                     313233
     C                     SETON                     343599
     C                     MOVE $ER,15    @ERR
     C                     GOTO $S210E
     C                     END
      *
     C           @1TNK     IFNE 0
     C                     SETON                     19
     C                     END
      *
     C                     MOVE '1'       DSPSW2
     C                     MOVE '0'       DSPSW1
      *
     CSR         $S210E    ENDSR
      *----------------------------------------------------*
      *    SCREEN2      (GDGPW802)                         *
      *----------------------------------------------------*
     CSR         $SB220    BEGSR
     C                     EXFMTFBCPW052
     C                     SETOF                     373839
JW1  C                     SETOF                     40
     C                     SETOF                     9936
     C                     MOVEL*BLANK    @ERR
      * F3: BACK
     C           *IN03     IFEQ '1'
     C                     MOVE '1'       DSPSW1
     C                     MOVE '0'       DSPSW2
     C                     EXSR $SB400
     C                     CLEARFBCPW052
     C                     SETOF                     03
     C                     GOTO $S220E
     C                     END
      * THIS START DATE SAVE
     C*          FSW       IFEQ *BLANK
     C*                    MOVE @2SYMD    SVYMD   80
     C*                    MOVE '1'       FSW     1
     C*                    END
      *
     C**JW6      @KUBN     IFNE *BLANK
     C**         @KUBN     ANDNE'0'
JW6  C           @KUBN     IFNE '0'
     C           @KUBN     ANDNE'1'
     C                     SETON                     3699
     C                     MOVEL$ER,14    @ERR
     C                     GOTO $S220E
     C                     END
     C           @KUBN     IFEQ '1'
      *
     C           @2TNK     IFEQ 0
     C                     SETON                     3799
     C                     MOVEL$ER,7     @ERR
     C                     GOTO $S220E
     C                     END
      *
     C           @2SYY     IFEQ 0
     C           @2SMM     ANDEQ0
     C           @2SDD     ANDEQ0
     C                     SETON                     3899
     C                     MOVEL$ER,8     @ERR
     C                     GOTO $S220E
     C                     END
     C                     MOVE @2SYY     #KHYY
     C                     MOVE @2SMM     #KHMM
     C                     MOVE @2SDD     #KHDD
     C**                   EXSR $SB901
JW6  C                     EXSR $SB903
     C           *IN21     IFEQ '1'
     C                     SETON                     3899
     C                     MOVEL$ER,9     @ERR
     C                     GOTO $S220E
     C                     END
      *
JW6  C           @2SYY     IFEQ 9999
 |   C                     SETON                     3899
 |   C                     MOVEL$ER,9     @ERR
 |   C                     GOTO $S220E
JW6  C                     ENDIF
      *
     C           @2EYY     IFEQ 0
     C           @2EMM     ANDEQ0
     C           @2EDD     ANDEQ0
     C                     SETON                     3999
     C                     MOVEL$ER,10    @ERR
     C                     GOTO $S220E
     C                     END
      *
     C           @2EYY     IFEQ 9999
     C           @2EMM     ANDEQ99
     C           @2EDD     ANDEQ99
     C                     ELSE
     C                     MOVE @2EYY     #KHYY
     C                     MOVE @2EMM     #KHMM
     C                     MOVE @2EDD     #KHDD
     C**                   EXSR $SB901
JW6  C                     EXSR $SB903
     C           *IN21     IFEQ '1'
     C                     SETON                     3999
     C                     MOVEL$ER,11    @ERR
     C                     GOTO $S220E
     C                     END
     C                     END
      *
     C           @2SYMD    IFGT @2EYMD
     C                     SETON                     383999
     C                     MOVEL$ER,12    @ERR
     C                     GOTO $S220E
     C                     END
     C           @2SYMD    IFLE @1SYMD
     C                     SETON                     38  99
     C                     MOVEL$ER,13    @ERR
     C                     GOTO $S220E
     C                     END
      *
     C           @2SYMD    IFLE @1SYMD
     C                     SETON                     383999
     C                     MOVEL$ER,16    @ERR
     C                     GOTO $S220E
     C                     END
JW1   * INDIVIDUAL FLAG
 |   C***        @2IND     IFEQ *BLANK
 |   C                     MOVE 'Y'       @2IND
 |   C***                  ENDIF
 |   C***        @2IND     IFNE 'Y'
 |   C***        @2IND     ANDNE'N'
 |   C***                  SETON                     40  99
 |   C***                  MOVEL$ER,19    @ERR
 |   C***                  GOTO $S220E
JW1  C***                  ENDIF
      *---------------------*
      * LAST TOME EXIT DATE *
      *---------------------*
     C           @1EYMD    IFNE 0
     C                     MOVE @2SYY     #KHYY
     C                     MOVE @2SMM     #KHMM
     C                     MOVE @2SDD     #KHDD
     C                     EXSR $SB910
     C                     Z-ADDWHY       WKYY
     C                     Z-ADDWHM       WKMM
     C                     Z-ADDWHD       WKDD
     C                     MOVE WKYMD     @1EYMD
     C                     END
      *
     C                     END
      *
     C                     MOVE @TOKU     #KTOKU
     C                     MOVE @NONY     #KNONY
     C                     MOVE @NKOJ     #KNKOJ
     C                     MOVE @NUKE     #KNUKE
     C                     MOVE @MHN1     #KMHN1
     C                     MOVE @MHN2     #KMHN2
     C                     MOVE @MHN3     #KMHN3
     C                     MOVE @MHN4     #KMHN4
     C                     MOVE SVYMD     WKYMD
     C                     MOVE WKYY      #KHYY
     C                     MOVE WKMM      #KHMM
     C                     MOVE WKDD      #KHDD
      *
     C                     SETOF                     21
     C           KEYFB1    CHAINFBCPL181             21
     C           *IN21     IFEQ '0'
     C           FBSKJY    ANDEQ'D'
     C**JW4      FBSKHZ    ANDLE*DATE
JW4  C           FBSKHZ    ANDLETODAY
     C                     SETON                     21
     C                     END
     C           *IN21     IFEQ '1'
     C                     SETON                     3699
     C           @KUBN     IFEQ '0'
     C                     MOVEL$ER,17    @ERR
     C                     END
     C           @KUBN     IFEQ '1'
     C                     MOVEL$ER,18    @ERR
     C                     END
     C                     GOTO $S220E
     C                     END
JW6   * IF NO ERROR...
 |   C           *IN05     IFEQ '0'
 |   C                     MOVEL$ER,20    @ERR
JW6  C                     ENDIF
      * F5: UPDATE
     C           *IN05     IFEQ '1'
     C                     EXSR $SB500
     C                     EXSR $SB400
     C                     CLEARFBCPW052
     C                     MOVE '0'       DSPSW2
     C                     MOVE '1'       DSPSW1
     C                     SETOF                     05
     C                     END
      *
     CSR         $S220E    ENDSR
      *----------------------------------------------------*
      *     EXIT                                           *
      *----------------------------------------------------*
     CSR         $SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         $S300E    ENDSR
      *----------------------------------------------------*
      *     SCREEN CLEAR                                   *
      *----------------------------------------------------*
     CSR         $SB400    BEGSR
     C                     Z-ADD0         @TOKU
     C                     Z-ADD0         @NONY
     C                     MOVE *BLANK    @NKOJ
     C                     MOVE *BLANK    @NUKE
     C                     MOVE *BLANK    @MHN1
     C                     MOVE *BLANK    @MHN2
     C                     MOVE *BLANK    @MHN3
     C                     MOVE *BLANK    @MHN4
     C                     MOVE *ZERO     SVYMD   80
     C*                    MOVE *BLANK    FSW
     C                     Z-ADD0         X
     CSR         $S400E    ENDSR
      *----------------------------------------------------*
      *  UNIT PRICE AMSTER  ADDITION                       *
      *----------------------------------------------------*
     CSR         $SB500    BEGSR
     C                     MOVE @2SYY     #KHYY
     C                     MOVE @2SMM     #KHMM
     C                     MOVE @2SDD     #KHDD
     C                     EXSR $SB910
      *
      *--------------------------*
      * LAST TIME RECORD UP-DATE *
      *--------------------------*
     C                     MOVE @1SYMD    WKYMD
     C                     MOVE WKYY      #KHYY
     C                     MOVE WKMM      #KHMM
     C                     MOVE WKDD      #KHDD
     C                     SETOF                     81
     C           KEYFB2    CHAINFBCPL18              81
      *
     C           *IN81     IFEQ '0'
     C           FBSKJY    ANDEQ'D'
     C**JW4      FBSKHZ    ANDLE*DATE
JW4  C           FBSKHZ    ANDLETODAY
     C                     SETON                     81
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           @KUBN     ANDEQ'1'
     C                     MOVE HYY       FBKOYY
     C                     MOVE HMM       FBKOMM
     C                     MOVE HDD       FBKODD
     C                     Z-ADDTIMEHH    FBKOHH
     C                     Z-ADDTIMESS    FBKOSS
     C                     MOVELPUSER     FBKOME
      *
     C                     Z-ADDWHY       FBTSYY
     C                     Z-ADDWHM       FBTSMM
     C                     Z-ADDWHD       FBTSDD
      *
     C                     UPDATFBCPL181
JW1   * OUT LOG#
"    C                     MOVE 'C'       LOGFLG  1
"    C                     EXSR #LOG
     C                     END
      *
      *--------------------------*
      * TJIS TIME RECORD UP-DATE *
      *--------------------------*
     C                     MOVE SVYMD     WKYMD
     C                     MOVE WKYY      #KHYY
     C                     MOVE WKMM      #KHMM
     C                     MOVE WKDD      #KHDD
     C                     SETOF                     81
     C           KEYFB2    CHAINFBCPL18              81
      *
     C           *IN81     IFEQ '0'
     C           FBSKJY    ANDEQ'D'
     C**JW4      FBSKHZ    ANDLE*DATE
JW4  C           FBSKHZ    ANDLETODAY
     C                     SETON                     81
     C                     END
      *
     C           *IN81     IFEQ '0'
     C                     MOVE HYY       FBKOYY
     C                     MOVE HMM       FBKOMM
     C                     MOVE HDD       FBKODD
     C                     Z-ADDTIMEHH    FBKOHH
     C                     Z-ADDTIMESS    FBKOSS
     C                     MOVELPUSER     FBKOME
      *
     C           @KUBN     IFEQ '0'
     C                     MOVE 'D'       FBSKJY
     C                     MOVE HYY       FBSKYY
     C                     MOVE HMM       FBSKMM
     C                     MOVE HDD       FBSKDD
     C                     END
      *
     C           @KUBN     IFEQ '1'
     C                     Z-ADD@2SYY     FBTKYY
     C                     Z-ADD@2SMM     FBTKMM
     C                     Z-ADD@2SDD     FBTKDD
     C                     Z-ADD@2EYY     FBTSYY
     C                     Z-ADD@2EMM     FBTSMM
     C                     Z-ADD@2EDD     FBTSDD
     C                     Z-ADD@2TNK     FBNTAN
JW1  C                     MOVEL@2IND     FBIND
     C                     END
      *
     C                     UPDATFBCPL181
JW1   * OUT LOG#
"    C           FBSKJY    IFEQ ' '
"    C                     MOVE 'C'       LOGFLG  1
"    C                     ELSE
"    C                     MOVE 'D'       LOGFLG
"    C                     ENDIF
"    C                     EXSR #LOG
     C                     END
      *
     CSR         $S500E    ENDSR
      *----------------------------------------------------*
      *  DETAIL M/F FILE READ                              *
      *----------------------------------------------------*
     C           $SB900    BEGSR
     C                     SETOF                       21
     C           KEYB21    CHAINFGBPL011             21
     C           *IN21     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLEHYMD8
     C                     SETON                     21
     C                     END
     CSR         $S900E    ENDSR
      *----------------------------------------------------*
JW6   *  CALENDAR  CHECK (NEW)                             *
 |    *----------------------------------------------------*
 |   C           $SB903    BEGSR
 |    *
 |   C           #KHHZ     IFNE 99999999
 |   C                     MOVEL#KHHZ     $SRC      P
 |   C                     CALL 'UTLR01'
 |   C                     PARM           $SRC   10
 |   C                     PARM           $TRUE   8
 |   C                     PARM           $RTN1   1
 |   C           $RTN1     IFEQ ' '
 |   C                     SETOF                     21
 |   C                     ELSE
 |   C                     SETON                     21
 |   C                     ENDIF
 |   C                     ENDIF
 |    *
JW6  C                     ENDSR
      *----------------------------------------------------*
      *  CALENDAR  CHECK                                   *
      *----------------------------------------------------*
     CSR         $SB901    BEGSR
     C                     SETOF                     21
     C           #KHMM     IFEQ 01
     C           #KHMM     OREQ 03
     C           #KHMM     OREQ 05
     C           #KHMM     OREQ 07
     C           #KHMM     OREQ 08
     C           #KHMM     OREQ 10
     C           #KHMM     OREQ 12
     C           #KHDD     IFGT 31
     C                     SETON                     21
     C                     GOTO $S901E
     C                     END
     C                     END
     C           #KHMM     IFEQ 04
     C           #KHMM     OREQ 06
     C           #KHMM     OREQ 09
     C           #KHMM     OREQ 11
     C           #KHDD     IFGT 30
     C                     SETON                     21
     C                     GOTO $S901E
     C                     END
     C                     END
      *
     C                     Z-ADD0         WHD
     C                     Z-ADD0         URU
     C                     Z-ADD0         AMA
     C                     Z-ADD0         URU1
     C                     Z-ADD0         AMA1
     C                     Z-ADD0         URU2
     C                     Z-ADD0         AMA2
     C           #KHMM     IFEQ 02
     C                     Z-ADD28        WHD
     C           #KHYY     DIV  4         URU     40
     C                     MVR            AMA     40
     C           AMA       IFEQ 0
     C                     Z-ADD29        WHD
     C           #KHYY     DIV  100       URU1    40
     C                     MVR            AMA1    40
     C           #KHYY     DIV  400       URU2    40
     C                     MVR            AMA2    40
      *
     C           AMA1      IFEQ 0
     C           AMA2      ANDNE0
     C                     Z-ADD28        WHD
     C                     END
      *
     C                     END
     C           #KHDD     IFGT WHD
     C                     SETON                       21
     C                     GOTO $S901E
     C                     END
      *
     C                     END
     CSR         $S901E    ENDSR
      *----------------------------------------------------*
      *  DATE CALCULATION                                  *
      *----------------------------------------------------*
     CSR         $SB910    BEGSR
     C                     Z-ADD#KHYY     WHY     40
     C                     Z-ADD#KHMM     WHM     20
     C                     Z-ADD#KHYY     WHD     20
     C           #KHDD     SUB  1         WHD
      *
     C           WHD       IFEQ 0
     C           #KHMM     SUB  1         WHM
     C                     END
      *
     C           WHM       IFEQ 0
     C           #KHYY     SUB  1         WHY
     C                     END
      *
     C           WHM       IFEQ 0
     C                     Z-ADD12        WHM
     C                     END
      *
     C           WHD       IFEQ 0
      *
     C           WHM       IFEQ 01
     C           WHM       OREQ 03
     C           WHM       OREQ 05
     C           WHM       OREQ 07
     C           WHM       OREQ 08
     C           WHM       OREQ 10
     C           WHM       OREQ 12
     C                     Z-ADD31        WHD
     C                     END
      *
     C           WHM       IFEQ 04
     C           WHM       OREQ 06
     C           WHM       OREQ 09
     C           WHM       OREQ 11
     C                     Z-ADD30        WHD
     C                     END
      *
     C           WHM       IFEQ 02
     C                     Z-ADD28        WHD
     C           WHY       DIV  4         URU     40
     C                     MVR            AMA     40
     C           AMA       IFEQ 0
     C                     Z-ADD29        WHD
     C           WHY       DIV  100       URU1    40
     C                     MVR            AMA1    40
     C           WHY       DIV  400       URU2    40
     C                     MVR            AMA2    40
      *
     C           AMA1      IFEQ 0
     C           AMA2      ANDNE0
     C                     Z-ADD28        WHD
     C                     END
      *
     C                     END
     C                     END
      *
     C                     END
      *
     CSR         $S910E    ENDSR
     C*-----------------------------------------------------
JW3  C* OUT LOG FILE
     C*-----------------------------------------------------
     C           #LOG      BEGSR
      *
     C                     CLEARFBCPP051
      *
     C                     MOVELFBSKJY    F5SKJY
     C                     Z-ADDFBTOKU    F5TOKU
     C                     Z-ADDFBNONY    F5NONY
     C                     MOVELFBNKOJ    F5NKOJ
     C                     MOVELFBNUKE    F5NUKE
     C                     MOVELFBMHN1    F5MHN1
     C                     MOVELFBMHN2    F5MHN2
     C                     MOVELFBMHN3    F5MHN3
     C                     MOVELFBMHN4    F5MHN4
     C                     MOVELFBSHN1    F5SHN1
     C                     MOVELFBSHN2    F5SHN2
     C                     MOVELFBSHN3    F5SHN3
      *
     C                     Z-ADDFBNTAN    F5NTAN
     C                     Z-ADDFBTKHZ    F5TKHZ
     C                     Z-ADDFBTSHZ    F5TSHZ
      *
     C                     TIME           SDATE
     C                     Z-ADDTODAY     F5PRHZ
     C                     Z-ADDNOW       F5PRTM
     C                     MOVEL#USER     F5PRUS
     C                     MOVEL#PGM      F5PRPG
      *
     C                     SELEC
     C           LOGFLG    WHEQ 'A'
     C                     MOVEL'ADD'     F5PTYP
     C                     Z-ADDTODAY     F5CRHZ
     C                     Z-ADDNOW       F5CRTM
     C                     MOVEL#USER     F5CRUS
     C                     MOVEL#PGM      F5CRPG
     C           LOGFLG    WHEQ 'C'
     C                     MOVEL'CHG'     F5PTYP
     C                     Z-ADDTODAY     F5CHHZ
     C                     Z-ADDNOW       F5CHTM
     C                     MOVEL#USER     F5CHUS
     C                     MOVEL#PGM      F5CHPG
     C           LOGFLG    WHEQ 'D'
     C                     MOVEL'DLT'     F5PTYP
     C                     Z-ADDTODAY     F5DLHZ
     C                     Z-ADDNOW       F5DLTM
     C                     MOVEL#USER     F5DLUS
     C                     MOVEL#PGM      F5DLPG
     C                     ENDSL
      *
     C                     WRITEFBCPP051
      *
JW3  C                     ENDSR
** ERR(60A) .......2.........3.........4.........5.........6
ENTER CUSTOMER CODE!                                          01
REGISTER CUSTOMER CODE TO SHIPPING MASTER!                    02
ENTER DELIVERY CODE!                                          03
REGISTER DELEIVERY CODE TO SHIPPING MASTER!                   04
NO DATA IN SHIPPING MASTER!                                   05
ENTER USER PARTS NO!                                          06
ENTER REVISED UNIT PRICE!                                     07
ENTER START DATE!                                             08
START DATE (YYYYMMDD) IS INVALID!                             09
ENTER EXP DATE!                                               10
EXP DATE (YYYYMMDD) IS INVALID!                               11
START DATE > EXP DATE!                                        12
START DATE IS LESS THAN OR EQUAL TO LAST START DATE!          13
OPTION SHOULD BE 0 OR 1                                       14
DATA NOT FOUND IN SALES PRICE MASTER!                         15
START DATE IS LESS THAN OR EQUAL TO LAST START DATE!          16
CANNOT CANCEL BECAUSE M/F DOES NOT EXIST                      17
CANNOT CHANGE BECAUSE M/F DOES NOT EXIST                      18
INDIVIDULAL FLAG SHOULD BE Y OR N !                           19
PRESS F5 TO UPDATE...                                         20
