     H            Y.
     F** FBCR10 **************************************************
     F*    GET SALES UNIT PRICE                                  *
     F*    I-HASADA         97.07.31                             *
      *----------------------------------------------------------*
     F*                    CALL 'FBCR10'
     F*                    PARM           PTOKU   4        IN
     F*                    PARM           PNONY   4        "
     F*                    PARM           PNKOJ   1        "
     F*                    PARM           PNUKE   4        "
     F*                    PARM           PMHIN  20        "
     F*                    PARM           PNOHZ   8        "
     F*                    PARM           PTANK  105       OUT
     F*                    PARM           PCHEK   1        "
     F*--------------------------------------------------------- *
     F*  JW1   2023.09.27 ADD EDTR02B - REMOVE - OR BLANK        *
     F*  JW2   2025.01.13 FIX BUG                                *
     F************************************************************
     FFBCPL01 IF  E           K        DISK
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I            DS
     I                                        1  20 WMHIN
     I                                        1   5 WMHN1
     I                                        6  10 WMHN2
     I                                       11  15 WMHN3
     I                                       16  20 WMHN4
      ****************************************************
     C           KEY1      KLIST
     C                     KFLD           WTOKU
     C                     KFLD           WNONY
     C                     KFLD           WNKOJ
     C                     KFLD           WNUKE
     C                     KFLD           WMHN1
     C                     KFLD           WMHN2
     C                     KFLD           WMHN3
     C                     KFLD           WMHN4
      *
     C           *ENTRY    PLIST
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           PMHIN  20
     C                     PARM           PNOHZ   8
     C                     PARM           PTANK  105
     C                     PARM           PCHEK   1
      ***************
JW2  C                     TIME           SDATE
     C                     MOVE PTOKU     WTOKU   40
     C                     MOVE PNONY     WNONY   40
     C                     MOVE PNKOJ     WNKOJ   1
     C                     MOVE PNUKE     WNUKE   4
     C                     MOVELPMHIN     WMHIN
     C                     EXSR #GETP
      *
     C           PTANK     IFEQ 0
      * ADJUST MHIN
     C                     MOVELPMHIN     $FLD1
     C                     CALL 'EDTR02C'
     C                     PARM           $FLD1  25
     C                     PARM           $FLD2  25
     C                     MOVEL$FLD2     WMHIN
     C                     EXSR #GETP
     C                     ENDIF
      *
     C           PTANK     IFEQ 0
     C                     MOVE '*'       PCHEK
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *================================================
      *  GET PRICE
      *================================================
     C           #GETP     BEGSR
      *
     C                     MOVELPNOHZ     WNOHZ   80
      *
      * 1. GET PRICE BY TOKU/NONY/NKOJ/NUKE/MHIN
     C                     Z-ADD0         PTANK
     C                     MOVE *BLANK    PCHEK
      *
     C           KEY1      SETGTFBCPL011
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      REDPEFBCPL011                 10
JW2  C   10                LEAVE
      *
     C           *IN10     IFEQ '0'
     C           FBSKJY    ANDEQ'D'
     C           FBSKHZ    ANDLETODAY
     C                     ELSE
      *
     C           WNOHZ     IFGE FBTKHZ
     C           WNOHZ     ANDLEFBTSHZ
     C                     Z-ADDFBNTAN    PTANK
JW2  C                     LEAVE
     C                     ENDIF
     C                     ENDIF
JW2  C                     ENDDO
      *
      *
     C           PTANK     IFEQ 0
     C                     MOVE *BLANK    WNUKE
      *
      * 2. GET PRICE BY TOKU/NONY/NKOJ/.../MHIN
     C           KEY1      SETGTFBCPL011
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      REDPEFBCPL011                 10
JW2  C   10                LEAVE
      *
     C           *IN10     IFEQ '0'
     C           FBSKJY    ANDEQ'D'
     C           FBSKHZ    ANDLETODAY
     C                     ELSE
      *
     C           WNOHZ     IFGE FBTKHZ
     C           WNOHZ     ANDLEFBTSHZ
     C                     Z-ADDFBNTAN    PTANK
JW2  C                     LEAVE
     C                     ENDIF
     C                     ENDIF
JW2  C                     ENDDO
      *
     C                     ENDIF
      *
     C           PTANK     IFEQ 0
     C                     MOVE *BLANK    WNKOJ
      *
      * 3. GET PRICE BY TOKU/NONY/.../.../MHIN
     C           KEY1      SETGTFBCPL011
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      REDPEFBCPL011                 10
JW2  C   10                LEAVE
      *
     C           *IN10     IFEQ '0'
     C           FBSKJY    ANDEQ'D'
     C           FBSKHZ    ANDLETODAY
     C                     ELSE
      *
     C           WNOHZ     IFGE FBTKHZ
     C           WNOHZ     ANDLEFBTSHZ
     C                     Z-ADDFBNTAN    PTANK
JW2  C                     LEAVE
     C                     ENDIF
     C                     ENDIF
JW2  C                     ENDDO
      *
     C                     ENDIF
      *
     C           PTANK     IFEQ 0
     C                     MOVE *BLANK    WMHN3
     C                     MOVE *BLANK    WMHN4
     C                     MOVE PNKOJ     WNKOJ   1
     C                     MOVE PNUKE     WNUKE   4
      *
      * 4. GET PRICE BY TOKU/NONY/NKOJ/NUKE/MHN1.2
     C           KEY1      SETGTFBCPL011
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      REDPEFBCPL011                 10
JW2  C   10                LEAVE
      *
     C           *IN10     IFEQ '0'
     C           FBSKJY    ANDEQ'D'
     C           FBSKHZ    ANDLETODAY
     C                     ELSE
      *
     C           WNOHZ     IFGE FBTKHZ
     C           WNOHZ     ANDLEFBTSHZ
     C                     Z-ADDFBNTAN    PTANK
JW2  C                     LEAVE
     C                     ENDIF
     C                     ENDIF
JW2  C                     ENDDO
     C                     ENDIF
      *
     C           PTANK     IFEQ 0
     C                     MOVE *BLANK    WNUKE
      *
      * 5. GET PRICE BY TOKU/NONY/NKOJ/../MHN1.2
     C           KEY1      SETGTFBCPL011
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      REDPEFBCPL011                 10
JW2  C   10                LEAVE
      *
     C           *IN10     IFEQ '0'
     C           FBSKJY    ANDEQ'D'
     C           FBSKHZ    ANDLETODAY
     C                     ELSE
      *
     C           WNOHZ     IFGE FBTKHZ
     C           WNOHZ     ANDLEFBTSHZ
     C                     Z-ADDFBNTAN    PTANK
JW2  C                     LEAVE
     C                     ENDIF
     C                     ENDIF
JW2  C  N10                ENDDO
      *
     C                     ENDIF
      *
     C           PTANK     IFEQ 0
     C                     MOVE *BLANK    WNKOJ
      *
      * 6. GET PRICE BY TOKU/NONY/.../../MHN1.2
     C           KEY1      SETGTFBCPL011
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      REDPEFBCPL011                 10
JW2  C   10                LEAVE
      *
     C           *IN10     IFEQ '0'
     C           FBSKJY    ANDEQ'D'
     C           FBSKHZ    ANDLETODAY
     C                     ELSE
      *
     C           WNOHZ     IFGE FBTKHZ
     C           WNOHZ     ANDLEFBTSHZ
     C                     Z-ADDFBNTAN    PTANK
JW2  C                     LEAVE
     C                     ENDIF
     C                     ENDIF
JW2  C                     ENDDO
      *
     C                     ENDIF
      *
     C                     ENDSR
