     H            Y.
     F** FBCR72B *****************************************************
     F*  WRITTEN    : JW 2024.04.23                                  *
     F*  FUNCTION   : GET NEAREST EFFECTIVE DATE FROM FBCPP01        *
     F*--------------------------------------------------------      *
     F*  CALLING SEQ:                                                *
     F*                    CALL 'FBCR72B'
     F*                    PARM           $NONY   4
     F*                    PARM           $MHIN  20
     F*                    PARM           $DAT1   8
     F*                    PARM           $EFHZ   8
     F*                    PARM           $PRC   10
     F*   IN  $NONY:  4A DELIVERY CODE
     F*   "   $MHIN: 20A USER PART#
     F*   "   $DAT1   8A NEW DATE
     F*  OUT  $EFHZ:  8A NEAREST EFFECTIVE DATE
     F*   "   $RPC : 10A NEAREST PRICE (5,5 = 00000.00000)
     F******************************************************
     FFBCPL01CIF  E           K        DISK
      ******************************************************
      *                    MAIN PROCESS
      ******************************************************
      * Initial Process
     C                     EXSR @INIT
      * LOOP
     C                     MOVEL$NONY     KBNONY
     C                     MOVEL$MHIN     KBMHIN
     C                     Z-ADD0         KBDAT1
     C           KEY1      SETLLFBCPL01C
     C                     DO   *HIVAL
     C           KEY2      READEFBCPL01C                 98
     C   98                LEAVE
      *
     C           FBSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           FBTKHZ    IFGT @DAT1
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVELFBTKHZ    $EFHZ
     C                     MOVELFBNTAN    $PRC
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      ******************************************************
      *                  INITIAL ROUTINE
      ******************************************************
     C           @INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $MHIN  20
     C                     PARM           $DAT1   8
     C                     PARM           $EFHZ   8
     C                     PARM           $PRC   10
      *
     C           KEY1      KLIST
     C                     KFLD           KBNONY  40
     C                     KFLD           KBMHIN 20
     C                     KFLD           KBDAT1  80
      *
     C           KEY2      KLIST
     C                     KFLD           KBNONY
     C                     KFLD           KBMHIN
      *
     C                     MOVEL$DAT1     @DAT1   80
     C                     MOVE *ZERO     $EFHZ
     C                     MOVE *ZERO     $PRC
      *
     C                     ENDSR
