     H            Y.
     FFBCWP99 IP  E                    DISK
     FAGDPL12 IF  E           K        DISK
     FFBCPP01 O   E                    DISK                      A
      *
     C           KEY       KLIST
     C                     KFLD           XBTKYY
     C                     KFLD           XBTKMM
     C                     KFLD           XBTKDD
      *
     C           XBSKJY    IFEQ *BLANK
      *
     C                     MOVE XBSKJY    FBSKJY
     C                     Z-ADDXBSKYY    FBSKYY
     C                     Z-ADDXBSKMM    FBSKMM
     C                     Z-ADDXBSKDD    FBSKDD
     C                     Z-ADDXBKOYY    FBKOYY
     C                     Z-ADDXBKOMM    FBKOMM
     C                     Z-ADDXBKODD    FBKODD
     C                     Z-ADDXBKOHH    FBKOHH
     C                     Z-ADDXBKOSS    FBKOSS
     C                     MOVE XBKOME    FBKOME
     C                     Z-ADDXBTOKU    FBTOKU
     C                     Z-ADDXBNONY    FBNONY
     C                     MOVE XBNKOJ    FBNKOJ
     C                     MOVE XBNUKE    FBNUKE
     C                     MOVE XBMHN1    FBMHN1
     C                     MOVE XBMHN2    FBMHN2
     C                     MOVE XBMHN3    FBMHN3
     C                     MOVE XBMHN4    FBMHN4
     C                     MOVE XBSHN1    FBSHN1
     C                     MOVE XBSHN2    FBSHN2
     C                     MOVE XBSHN3    FBSHN3
     C                     Z-ADDXBNTAN    FBNTAN
     C                     Z-ADDXBTKYY    FBTKYY
     C                     Z-ADDXBTKMM    FBTKMM
     C                     Z-ADDXBTKDD    FBTKDD
     C                     Z-ADDXBTSYY    FBTSYY
     C                     Z-ADDXBTSMM    FBTSMM
     C                     Z-ADDXBTSDD    FBTSDD
     C                     WRITEFBCPP011
      *
     C           XBOTAN    IFNE 0
     C                     Z-ADDXBOTAN    FBNTAN
     C                     Z-ADD1997      FBTKYY
     C                     Z-ADD04        FBTKMM
     C                     Z-ADD01        FBTKDD
      *
     C           KEY       SETLLAGDPL121
     C                     SETOF                     10
     C                     READPAGDPL121                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDF8KAYY    FBTSYY
     C                     Z-ADDF8KAMM    FBTSMM
     C                     Z-ADDF8KADD    FBTSDD
     C                     END
      *
     C                     WRITEFBCPP011
      *
     C                     END
     C                     END
