     H            Y.
     F** FCCR82 **************************************
     F*  KANBAN M/F INPUT NO. FILE REFORMATION
     F*       I-HASADA                 91.06.28      *
     F************************************** FCCR82 **
     FFCCPP32 IP  E                    DISK
     FFCCWP82 O   E                    DISK
     I            DS
     I                                        1   80WYMD
     I                                        1   40WYY
     I                                        5   60WMM
     I                                        7   80WDD
     C           *ENTRY    PLIST
     C                     PARM           PHIZK   8
     C                     PARM           PRECD   7
     C                     PARM           PKENS   7
     C                     MOVE PHIZK     WYMD
      *
     C                     ADD  1         WRECD   70
      *
     C                     SELEC
     C           WMM       WHEQ 12
     C           B4MMRD    IFEQ 01
     C           B4MMRD    OREQ 02
     C                     ADD  1         WKENS   70
     C                     WRITEFCCWP821
     C                     END
     C           WMM       WHEQ 11
     C           B4MMRD    IFEQ 12
     C           B4MMRD    OREQ 01
     C                     ADD  1         WKENS   70
     C                     WRITEFCCWP821
     C                     END
     C                     OTHER
      *
     C           B4MMRD    IFGT WMM
     C                     ADD  1         WKENS   70
     C                     WRITEFCCWP821
     C                     END
     C                     ENDSL
      *
     CLR                   MOVE WRECD     PRECD
     CLR                   MOVE WKENS     PKENS
