     H            Y.
     F** FCCR10 ****************************************
     F*   KANBAN M/F LIST                              *
     F*                                                *
     F* DATE (CODING):K.OKACHI        1997.05.07       *
     F*                                                *
     F* ADD SORTING OPTION                             *
     F*      08/13/01(TCH)                             *
     F**************************************** FCCR10 **
     FFCCPW10 CF  E                    WORKSTN
     FFCCPL11 IF  E           K        DISK
     FFCCPL14 IF  E           K        DISK
     FFCCWP10 O   F     128            DISK                      A
     E                    ER      1  20 60
      *
     I            DS
     I                                        1   80B4SKHZ
     I                                        1   40B4SKYY
     I                                        5   60B4SKMM
     I                                        7   80B4SKDD
     I            DS
     I                                        1   80B4SRHZ
     I                                        1   40B4SRYY
     I                                        5   60B4SRMM
     I                                        7   80B4SRDD
      *
     C           *ENTRY    PLIST
     C                     PARM           NURI    2
     C                     PARM           OPTN    1
     C                     PARM           ENDID   1
      *
     C                     MOVE NURI      @RUI    20
     C                     MOVE NURI      #MM
      *
     C           STEP1     TAG
     C                     EXFMTFCCPW101
     C                     SETOF                     010203
     C                     SETOF                     040599
     C                     SETOF                     06
     C                     MOVE *BLANK    MSG
      *
     C           *INKA     IFEQ '1'
     C                     MOVE '1'       ENDID
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           #MM       IFEQ 0
     C                     MOVE ER,01     MSG
     C                     SETON                     0199
     C                     GOTO STEP1
     C                     END
     C           #CUST     IFNE *ZERO
     C           KEY2      CHAINFCCPL141             90
     C           *IN90     IFEQ *ON
     C                     SETON                     0699
     C                     MOVE ER,07     MSG
     C                     ENDIF
     C                     ENDIF
     C           #NONY     IFNE *ZERO
     C           KEY1X     CHAINFCCPL141             90
     C           *IN90     IFEQ *ON
     C                     SETON                     0299
     C           MSG       IFEQ *BLANK
     C                     MOVE ER,02     MSG
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C*          #NONY     IFEQ *BLANK
     C*                    MOVE ER,02     MSG
     C*                    SETON                     0299
     C*                    GOTO STEP1
     C*                    END
     C*          #KOJ      IFEQ *BLANK
     C*                    MOVE ER,03     MSG
     C*                    SETON                     0399
     C*                    GOTO STEP1
     C*                    END
     C*          #UKE      IFEQ *BLANK
     C*                    MOVE ER,04     MSG
     C*                    SETON                     0499
     C*                    GOTO STEP1
     C*                    END
     C*          #SBAN     IFEQ *BLANK
     C*                    MOVE ER,05     MSG
     C*                    SETON                     0599
     C*                    GOTO STEP1
     C*                    END
     C           #OPT      IFLT '1'
     C           #OPT      ORGT '3'
     C                     SETON                     0599
     C                     MOVE ER,08     MSG
     C                     GOTO STEP1
     C                     ENDIF
      *
     C           *INKE     IFNE '1'
     C                     GOTO STEP1
     C                     END
      *
     C                     MOVE #OPT      OPTN
     C                     MOVE #NONY     WNONY   40
     C           KEY1      KLIST
     C                     KFLD           @RUI
     C                     KFLD           WNONY
     C                     KFLD           #KOJ
     C                     KFLD           #UKE
     C*                    KFLD           #SBAN
     C           KEY1X     KLIST
     C                     KFLD           @RUI
     C                     KFLD           WNONY
     C           KEY2      KLIST
     C                     KFLD           @RUI
     C                     KFLD           #CUST
      *
     C                     MOVE *BLANK    FLG     1
     C           #CUST     IFNE *ZERO
     C           KEY2      SETLLFCCPL141
     C                     ELSE
     C           KEY1      SETLLFCCPL111
     C                     ENDIF
      *
     C           *IN10     DOUEQ*ON
     C           #CUST     IFNE *ZERO
     C           KEY2      READEFCCPL141                 10
     C                     ELSE
     C           @RUI      READEFCCPL111                 10
     C                     ENDIF
     C           *IN10     IFEQ *OFF
      *
     C           #NONY     IFNE *ZERO
     C           #NONY     ANDNEB4NONY
     C                     LEAVE
     C                     ENDIF
      *
     C           B4SKBN    IFEQ 'D'
     C           B4SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
      *
     C           #KOJ      IFNE *BLANK
     C           #KOJ      ANDNEB4NKOJ
     C                     ITER
     C                     ENDIF
      *
     C           #UKE      IFNE *BLANK
     C           #UKE      ANDNEB4NUKE
     C                     ITER
     C                     ENDIF
      *
     C                     MOVE '*'       FLG
     C                     EXCPTDAT
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           FLG       IFNE '*'
     C                     MOVE ER,06     MSG
     C                     SETON                     010203
     C                     SETON                     040599
     C                     GOTO STEP1
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
     OFCCWP10 EADD             DAT
     O                         B4SBAN     4
     O                         B4TOKU     8
     O                         B4TKOJ     9
     O                         B4TMEI    24
     O                         #NONY     28
     O                         B4NKOJ    29
     O                         B4NUKE    33
     O                         B4NMEI    48
     O                         B4MHN1    53
     O                         B4MHN2    58
     O                         B4MHN3    63
     O                         B4MHN4    68
     O                         B4SHN1    73
     O                         B4SHN2    78
     O                         B4SHN3    80
     O                         B4OSRO    85
     O                         B4NSRO    90
     O                         B4SRHZ    98
     O                         B4UTKR   108
**  ER
E-01 INPUT ERROR (MONTH)
E-02 INPUT ERROR (RECEIVING CO.)
E-03 INPUT ERROR (FACTORY)
E-04 INPUT ERROR (DOCK CODE)
E-05 INPUT ERROR (KANBAN NO.)
E-06 NO DATA
E-07 INPUT ERROR (CUSTOMER)
E-08 INPUT ERROR (OPTION)
