     H            Y.
     F** FCDR11 ********************************************
     F* MATERIAL COIL WEIGHT M/F UPDATE                            *
     F*              M-OKUDA          1986.01.22           *
     F******************************************************
     FFCDPW11 CF  E                    WORKSTN
     FFCDPL11 UF  E           K        DISK                      A
     FFGBPL01 IF  E           K        DISK
     E                    ER      1  15 60               ERROR MSG
     I            DS
     I                                        1   80R3SKHZ
     I                                        1   40R3SKYY
     I                                        5   60R3SKMM
     I                                        7   80R3SKDD
     I            DS
     I                                        1   80R3KOHZ
     I                                        1   40R3KOYY
     I                                        5   60R3KOMM
     I                                        7   80R3KODD
     I            DS
     I                                        1   40R3KOTI
     I                                        1   20R3KOJI
     I                                        3   40R3KOFN
     I            DS
     I                                        1   60UTIME
     I                                        1   20UJI
     I                                        3   40UFN
     I                                        1   40UTI4
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
     C                     TIME           UTIME
     C                     MOVE *DATE     UHIZK   80
     C                     MOVE *BLANK    MENT    1
     C                     MOVE *BLANK    KMEI    5
     C                     MOVE *BLANK    CMNT    4
     C                     MOVE *BLANK    R3KANR  1
     C                     MOVE *BLANK    R3ZCOD 15
     C                     Z-ADD0         R3ZKEI  52
     C           STEP01    TAG
     C                     EXFMTFCDPW111
     C   KA                GOTO END
     C                     SETOF                     010203
     C                     SETOF                     919293
     C                     SETOF                     9499
     C           MENT      IFEQ '0'
     C                     SETON                     01
     C                     MOVE 'CNCL'    CMNT
     C                     GOTO STEP02
     C                     ELSE
     C           MENT      IFEQ '1'
     C                     SETON                     02
     C                     MOVE 'CHG '    CMNT
     C                     GOTO STEP02
     C                     ELSE
     C           MENT      IFEQ '2'
     C                     SETON                     03
     C                     MOVE 'ADD '    CMNT
     C                     GOTO STEP02
     C                     ELSE
     C                     SETON                     9199
     C                     MOVE ER,1      MSG
     C                     GOTO STEP01
     C                     END
     C                     END
     C                     END
     C           STEP02    TAG
     C           ZKEY      KLIST
     C                     KFLD           R3KANR
     C                     KFLD           R3ZCOD
     C                     KFLD           R3ZKEI
     C                     SETOF                     04
     C           ZKEY      CHAINFCDPL111             04
     C           *IN01     IFEQ '1'
     C           *IN04     IFEQ '1'
     C                     SETON                     9199
     C                     MOVE ER,2      MSG
     C                     GOTO STEP01
     C                     ELSE
     C           R3SKBN    IFEQ 'D'
     C                     SETON                     9199
     C                     MOVE ER,3      MSG
     C                     GOTO STEP01
     C                     END
     C                     END
     C                     END
     C           *IN02     IFEQ '1'
     C           *IN04     IFEQ '1'
     C                     SETON                     9199
     C                     MOVE ER,4      MSG
     C                     GOTO STEP01
     C                     ELSE
     C           R3SKBN    IFEQ 'D'
     C                     SETON                     9199
     C                     MOVE ER,5      MSG
     C                     GOTO STEP01
     C                     END
     C                     END
     C                     END
     C           *IN03     IFEQ '1'
     C           *IN04     IFEQ '0'
     C           R3SKBN    IFNE 'D'
     C                     SETON                     9199
     C                     MOVE ER,6      MSG
     C                     GOTO STEP01
     C                     END
     C                     END
     C                     END
     C           R3KANR    IFNE 'K'                        ibfh
     C           R3KANR    IFNE 'B'                        ﾃcﾌﾞb
     C                     SETON                     9299
     C                     MOVE ER,7      MSG
     C                     GOTO STEP01
     C                     END
     C                     END
     C           R3KANR    IFEQ 'K'                        ibfh
     C                     MOVE 'PLAN '   KMEI
     C                     ELSE
     C           R3KANR    IFEQ 'B'                        ﾃcﾌﾞb
     C                     MOVE 'PCHS'    KMEI
     C                     END
     C                     END
     C           R3ZCOD    IFEQ *BLANK
     C                     SETON                     9399
     C                     MOVE ER,8      MSG
     C                     GOTO STEP01
     C                     END
     C           R3ZKEI    IFEQ 0
     C                     SETON                     9499
     C                     MOVE ER,9      MSG
     C                     GOTO STEP01
     C                     END
     C                     MOVE *BLANK    MEMEI
     C                     MOVE *BLANK    SIMEI
     C                     MOVE *BLANK    UKMEI
     C           *IN03     IFEQ '1'
     C                     Z-ADD0         R3BKEI
     C                     Z-ADD0         R3JRYO
     C                     Z-ADD0         R3MEIK
     C                     Z-ADD0         R3UKEI
     C                     Z-ADD0         R3SIRE
     C                     ELSE
     C           R3MEIK    IFGT 0
     C                     SETOF                     05
     C           R3MEIK    CHAINFGBPL011             05
     C           *IN05     IFEQ '0'
     C                     MOVELB2SMEI    MEMEI
     C                     END
     C                     END
     C           R3SIRE    IFGT 0
     C                     SETOF                     05
     C           R3SIRE    CHAINFGBPL011             05
     C           *IN05     IFEQ '0'
     C                     MOVELB2SMEI    SIMEI
     C                     END
     C                     END
     C           R3UKEI    IFGT 0
     C                     SETOF                     05
     C           R3UKEI    CHAINFGBPL011             05
     C           *IN05     IFEQ '0'
     C                     MOVELB2SMEI    UKMEI
     C                     END
     C                     END
     C                     END
     C******************************************************
     C* M-NO               uﾇj- ﾉ pｬcﾒｭh                   *
     C******************************************************
     C           STEP03    TAG
     C                     EXFMTFCDPW112
     C           *INKC     IFEQ '1'
     C                     MOVE *BLANK    KMEI
     C                     MOVE *BLANK    MENT
     C                     MOVE *BLANK    CMNT
     C                     MOVE *BLANK    R3KANR
     C                     MOVE *BLANK    R3ZCOD
     C                     Z-ADD0         R3ZKEI
     C                     GOTO STEP01
     C                     END
     C                     SETOF                     909596
     C                     SETOF                     979899
     C*          R3BKEI    IFEQ 0
     C*                    SETON                     9099
     C*                    MOVE ER,14     MSG
     C*                    GOTO STEP03
     C*                    END
     C           R3BKEI    IFGT 0
     C           R3BKEI    IFLT R3ZKEI
     C                     SETON                     9099
     C                     MOVE ER,15     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C           R3JRYO    IFEQ 0
     C                     SETON                     9599
     C                     MOVE ER,10     MSG
     C                     GOTO STEP03
     C                     END
     C*          R3MEIK    IFEQ 0
     C*                    SETON                     9699
     C*                    MOVE ER,11     MSG
     C*                    GOTO STEP03
     C*                    END
     C                     MOVE *BLANK    MEMEI
     C           R3MEIK    IFGT 0
     C                     SETOF                     05
     C           R3MEIK    CHAINFGBPL011             05
     C           *IN05     IFEQ '0'
     C                     MOVELB2SMEI    MEMEI
     C                     END
     C                     END
     C*          R3SIRE    IFEQ 0
     C*                    SETON                     9799
     C*                    MOVE ER,12     MSG
     C*                    GOTO STEP03
     C*                    END
     C                     MOVE *BLANK    SIMEI
     C           R3SIRE    IFGT 0
     C                     SETOF                     05
     C           R3SIRE    CHAINFGBPL011             05
     C           *IN05     IFEQ '0'
     C                     MOVELB2SMEI    SIMEI
     C                     END
     C                     END
     C*          R3UKEI    IFEQ 0
     C*                    SETON                     9899
     C*                    MOVE ER,13     MSG
     C*                    GOTO STEP03
     C*                    END
     C                     MOVE *BLANK    UKMEI
     C           R3UKEI    IFGT 0
     C                     SETOF                     05
     C           R3UKEI    CHAINFGBPL011             05
     C           *IN05     IFEQ '0'
     C                     MOVELB2SMEI    UKMEI
     C                     END
     C                     END
     C           *INKE     CABEQ'0'       STEP03
     C                     MOVE PUS       R3KOME
     C                     Z-ADDUHIZK     R3KOHZ
     C                     Z-ADDUTI4      R3KOTI
     C           *IN01     IFEQ '1'
     C                     MOVE 'D'       R3SKBN
     C                     Z-ADDUHIZK     R3SKHZ
     C                     ELSE
     C                     MOVE *BLANK    R3SKBN
     C                     Z-ADD0         R3SKHZ
     C                     END
     C           *IN04     IFEQ '1'
     C                     WRITEFCDPL111
     C                     ELSE
     C                     UPDATFCDPL111
     C                     END
     C                     MOVE *BLANK    KMEI
     C                     MOVE *BLANK    MENT
     C                     MOVE *BLANK    CMNT
     C                     MOVE *BLANK    R3KANR
     C                     MOVE *BLANK    R3ZCOD
     C                     Z-ADD0         R3ZKEI
     C                     GOTO STEP01
     C           END       TAG
     C                     SETON                     LR
**
E-01 UPDATE INST MUST BE < 0=CANCEL . 1=CHANGE . 2=ADD >
E-02 CANCEL IS APPOINTED , BUT THERE IS NOT M/F CANCELLED
E-03 CANCEL IS APPOINTED, BUT M/F IS CANCELLED ALREADY
E-04 A CHANGE IS APPOINTED, BUT THERE IS NOT M/F
E-05 A CHANGE IS APPOINTED, BUT M/F IS CANCELLED ALREADY
E-06 ADD IS APPOINTED , BUT M/F IS INPUT ALREADY
E-07 MANAGEMENT DEPT IS WRONG < K=PLAN . B=PURCHASE >
E-08 MATERIAL CODE ISN'T INPUT
E-09 FINISHING WIRE DIAMETER ISN'T INPUT
E-10 COIL WEIGHT ISN'T INPUT
E-11 MATERIAL PURCHASE POINT ISN'T INPUT
E-12 MATERIAL SUPPLIER DEPARTMENT ISN'T INPUT
E-13 MATERIAL RECEIVING POINT ISN'T INPUT
E-14 WIRE DIAMETER ISN'T INPUT
E-15 INPUT WIRE DIAMETER IS THINNER THAN FINISHING DIAMETER
