     H            Y.
     F***************************************************
     F*  TS LINE MACHINE# M/F UPDATE                    *
     F*                                                 *
     F* TCHK1 09/21/10 CREATE                           *
     F***************************************************
     FFCDPW9A CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL010
     F                                              KINFDS @INFDS
     FFCDPP9A UF  E           K        DISK                      A
      *------------------------------------------------------------
     E                    EMSG    1  10 78
      *------------------------------------------------------------
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME(6) + DATE(6)
     I            DS
     I                                        1  140WWTIME
     I                                        1   60WTIME
     I                                        1   40WTIM4
     I                                        7  120WSDATE
     I                                        9  120@@YM4
     I                                        7  120@@YM6
     I                                        7  140@@YMD
     I                                        7  100@@YY
     I                                       11  120@@MM
     I                                       13  140@@DD
     I            DS
     I                                        1  12 D@PRT
     I                                        1   5 D@PRT1
     I                                        6  10 D@PRT2
     I                                       11  12 D@PRT3
      ******************************************************
      *  MAIN
      ******************************************************
     C*
     C                     TIME           WWTIME
     C                     EXSR @P1INT
     C                     EXSR @P1SET
      *
     C                     DO   *HIVAL
      *
     C                     WRITEFMT019
     C                     Z-ADDW@RRN1    #RCN01
     C                     EXFMTCTL010
     C   KA                LEAVE
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W@RRN1
     C                     END
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      W#P1ER  1
      * add new pattern
     C           *INKH     IFEQ *ON
     C                     EXSR @P2ADD
     C   KA                LEAVE
     C                     EXSR @P1INT
     C                     EXSR @P1SET
     C                     ITER
     C                     END
      * change pattern
     C                     EXSR @P2DLT
     C   KA                LEAVE
     C                     EXSR @P1INT
     C                     EXSR @P1SET
     C                     ITER
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C*----------------------------------------------------*
      *  1ST SCREEN INITIAL SET
     C*----------------------------------------------------*
     C           @P1INT    BEGSR
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL010
     C                     MOVEL*OFF      *IN41
      *
     C                     Z-ADD1         W@RRN1  40
     C                     MOVEL*OFF      *IN49
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  1ST SCREEN DATA SET
     C*----------------------------------------------------*
     C           @P1SET    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1    40
     C           *LOVAL    SETLLFCDPP9A
      *
     C                     DO   *HIVAL
      *
     C                     READ FCDPP9A             N    91
     C   91                LEAVE
     C           F9SKBN    IFNE *BLANK
     C                     ITER
     C                     END
      *
     C                     CLEARSFL010
     C                     MOVELF9MCN#    S1MCN#
     C                     ADD  1         RRN1
     C                     WRITESFL010
     C*
     C           RRN1      IFEQ 9999
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C           RRN1      IFEQ *ZERO
     C                     CLEARSFL010
     C                     MOVEL*ON       *IN32
     C                     Z-ADD1         RRN1
     C                     WRITESFL010
     C                     MOVEL*OFF      *IN32
     C                     MOVELEMSG,1    MSG
     C                     MOVEL*ON       *IN49
     C                     END
     C           RRN1      IFEQ 9999
     C                     MOVELEMSG,2    MSG
     C                     MOVEL*ON       *IN49
     C                     END
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  NEW MACHINE#
     C*----------------------------------------------------*
     C           @P2ADD    BEGSR
      *
     C                     EXSR @P2INT
     C                     MOVEL'ADD'     F2ACTN    P
      *
     C                     DO   *HIVAL
      *
     C                     EXFMTFMT020
     C   KA
     COR KL                LEAVE
      *
     C                     SETOF                     5169
     C                     MOVEL*BLANK    MSG
      *
     C           F2MCN#    IFEQ *BLANK
     C                     SETON                     5169
     C                     MOVELEMSG,3    MSG
     C                     ITER
     C                     END
      *
     C           F2MCN#    CHAINFCDPP9A              91
     C           *IN91     IFEQ *OFF
     C           F9SKBN    ANDEQ*BLANK
     C                     SETON                     5169
     C                     MOVELEMSG,4    MSG
     C                     ITER
     C                     END
      *
     C           *INKE     IFEQ *ON
     C                     EXSR @ADDF
     C                     LEAVE
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  INITIAL SET TO FMT020
     C*----------------------------------------------------*
     C           @P2INT    BEGSR
      *
     C                     MOVEL*OFF      *IN51
     C                     SETOF                     616269
     C                     MOVEL*BLANK    F2MCN#
     C                     MOVEL*BLANK    MSG
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  CREATE NEW
     C*----------------------------------------------------*
     C           @ADDF     BEGSR
      *
     C                     CLEARFCDPP9A1
      *
     C                     Z-ADD@@YMD     F9KODT
     C                     Z-ADDWTIM4     F9KOTM
     C                     MOVEL#PGM      F9KOPG
     C                     MOVEL#WSID     F9KOWS
     C                     MOVEL#USER     F9KOID
      *
     C                     MOVELF2MCN#    F9MCN#
      *
     C           *IN91     IFEQ *OFF
     C                     UPDATFCDPP9A1
     C                     ELSE
     C                     WRITEFCDPP9A1
     C                     END
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  DELETE MACHINE#
     C*----------------------------------------------------*
     C           @P2DLT    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN1
     C           RRN1      CHAINSFL010               91
     C   91                LEAVE
     C           S1SEL     IFEQ *BLANK
     C                     ITER
     C                     END
      *
     C                     EXSR @P2CDP
     C   KA                LEAVE
      *
     C                     MOVEL*BLANK    S1SEL
     C                     MOVEL*ON       *IN31
     C                     UPDATSFL010
     C                     MOVEL*OFF      *IN31
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  DELETE MACHINE#
     C*----------------------------------------------------*
     C           @P2CDP    BEGSR
      *
     C                     EXSR @P2INT
     C*
     C                     MOVEL'DELETE'  F2ACTN    P
     C                     MOVEL*ON       *IN62
     C                     MOVELS1MCN#    F2MCN#
      *
     C                     DO   *HIVAL
      *
     C                     EXFMTFMT020
     C   KA
     COR KL                LEAVE
      *
     C           *INKE     IFEQ *ON
     C                     EXSR @CHGF
     C                     LEAVE
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  DELETE UPDATE
     C*----------------------------------------------------*
     C           @CHGF     BEGSR
      *
     C                     DO
      *
     C           F2MCN#    CHAINFCDPP9A              91
     C           *IN91     IFEQ *ON
     C                     LEAVE
     C                     END
      *
     C                     MOVEL'D'       F9SKBN
     C                     Z-ADD@@YMD     F9SKDT
     C                     Z-ADDWTIM4     F9SKTM
     C                     MOVEL#USER     F9SKID                        -
     C                     MOVEL#WSID     F9SKWS
     C                     MOVEL#PGM      F9SKPG
      *
     C                     UPDATFCDPP9A1
     C                     LEAVE
      *
     C                     ENDDO
      *
     C                     ENDSR
** EMSG
NO DATA !!!
THE LIMIT OVER(MAX=9999). ASK TO IT.
MACHINE# is blank.
MACHINE# SOMEONE ALREADY CREATED.





