     H            Y.
     F** FCER28 **************************************
     F* USER APPOINTMENT SUPPLIES PART NO. LIST <2> *
     F*         S.YAMAGAMI 92.01.20                  *
     F************************************************
     FFCEWP28 IP  F      40            DISK
     FRGAPL11 IF  E           K        DISK
     FFCEPR28 O   E             50     PRINTER
     E                    TK1     1   2  1   TK2    12
     E                    WTNK        6  9
     I*
     IFCEWP28 AA
     I                                        1   1 WOKIBAL2
     I                                        2   7 WTOKORL1
     I                                        2   2 WTKR1
     I                                        3   4 WTKR2
     I                                        5   6 WTKR3
     I                                        7   7 WTKR4
     I                                        8  122WKTE
     I                                       13  24 WHIN  L1
     I                                       13  17 WHIN1
     I                                       18  22 WHIN2
     I                                       23  24 WHIN3
     I                                       25  25 WKOJO
      *
     I            DS
     I                                        1  54 @TNK
     I                                        1  54 WTNK
     I                                        1   9 WTNK1
     I                                        1   4 WT1
     I                                        5   8 WN1
     I                                        9   9 WK1
     I                                       10  18 WTNK2
     I                                       10  13 WT2
     I                                       14  17 WN2
     I                                       18  18 WK2
     I                                       19  27 WTNK3
     I                                       19  22 WT3
     I                                       23  26 WN3
     I                                       27  27 WK3
     I                                       28  36 WTNK4
     I                                       28  31 WT4
     I                                       32  35 WN4
     I                                       36  36 WK4
     I                                       37  45 WTNK5
     I                                       37  40 WT5
     I                                       41  44 WN5
     I                                       45  45 WK5
     I                                       46  54 WTNK6
     I                                       46  49 WT6
     I                                       50  53 WN6
     I                                       54  54 WK6
      *
     C           *ENTRY    PLIST
     C                     PARM           PARM1  54
     C                     PARM           PUS    10
      *
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     60
     C           PUS       CHAINRGAPL111             60
     C           *IN60     IFEQ '0'
     C           J8SKJY    ANDNE'D'
     C                     MOVELJ8NAME    WNAME
     C                     END
     C                     MOVE PARM1     @TNK
     C                     Z-ADD1         B       20
     C           1         DO   6         B
     C           WTNK,B    IFNE *BLANK
     C                     MOVE '1'       *IN,B
     C                     END
     C                     END
     C                     END
      *
     C           *INL2     IFEQ '1'
     C           *IN50     OREQ '1'
     C                     GOTO STEP1
     C                     END
      *
     C                     GOTO STEP2
      *
     C           STEP1     TAG
      *
     C                     SETOF                     4050
     C                     Z-ADD1         A       20
     C           WOKIBA    LOKUPTK1,A                    40
     C           *IN40     IFEQ '1'
     C                     MOVELTK2,A     WKOJYO
     C                     END
      *
     C                     WRITEFCEPR281
      *
     C           STEP2     TAG
      *
     C           *INL1     IFEQ '1'
     C                     MOVE WKOJO     TKOJO   1
     C                     ELSE
     C           WKOJO     IFNE TKOJO
     C                     MOVE '*'       WAST
     C                     END
     C                     END
      *
     C                     Z-ADDWKTE      WWKTE
      *
     C                     ADD  1         CNT
     CL1                   WRITEFCEPR282
     CL1                   MOVE *BLANK    WAST
     CL1                   Z-ADD0         WWKTE
     CL2                   WRITEFCEPR283
     CL2                   Z-ADD0         CNT     40
     CL2                   Z-ADD0         PAGE
**  TK1/TK2
HOGUCHI FCTR
GGOJYOGAWA F
