     H            Y.                                                      EHD020
     F**FCER38*****************************************
     F*             ...PLATING HANDLING CODE LIST ...               *
     F*            I-HASADA            S.56.04.06     *
     F*****************************************FCER38**
     FFCETL10 IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I*************************************************
     I*             ...xlg  ﾆﾑﾒﾃ-nﾞ...                *
     I*************************************************
     IFCETL101    01
     I                                              A2MEK1L3
     I                                              A2MEK2L2
     I                                              A2MEK1L1
     I            DS
     I                                        1   4 A2MEK1
     I                                        5   6 A2MEK2
     I                                        7   7 A2MEK3
     I                                        1   7 MEKCOD
     C                     SETOF                     10
     C   L1                SETON                     10
     OQPRINT  H  204   1P
     O       OR        OF
     O                                   39 '*** PLATING HANDLING'
     O                                   53 ' CODE LIST ***'
     O                                   67 'DATE'
     O                         UDATE Y   76
     O                                   83 'PAGE'
     O                         PAGE  Z   87
     O                                  100 'RPG/FCER38'
     O*                                 100 'FCE-1-K6H1'
     O        H  2     1P
     O       OR        OF
     O                                   40 'PLATING HANDLING CODE'
     O                                   61 'PLATING HANDLING '
     O                                   70 'CODE NAME'
     O        D  1     10
     O                         MEKCOD    30
     O                         A2MMEI    74
