     H            Y.                                                      MCR020
     F***FCER16**************************************
     F* COMPONENTS M/F LIST                               *
     F* A.SATOH S53.10.20                           *
     F***********************************************
     FFCEPL01 IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I            DS
     I                                        1   80KDATE
     I                                        1   40A2GKYY
     I                                        5   60A2GKMM
     I                                        7   80A2GKDD
     I                                        9  160SDATE
     I                                        9  120A2GSYY
     I                                       13  140A2GSMM
     I                                       15  160A2GSDD
     C                     SETOF                     091011
     C                     SETOF                     212223
     C                     SETOF                     242526
     C                     SETOF                     272829
     C                     SETOF                     30
     C                     TIME           WTIME   60
     C           A2GSKD    COMP 'D'                  0909
     C  N09      SDATE     COMP *DATE                  1111
     C  N11      A2TEHI    COMP 'Z'                      11
     C   11                GOTO END
     C           A21HB5    COMP *BLANK               2525
     C  N25      A24HB5    COMP *BLANK               2525
     C  N25      A27HB5    COMP *BLANK               2525
     C  N25      A210H5    COMP *BLANK               2525
     C           A22HB5    COMP *BLANK               2626
     C           A25HB5    COMP *BLANK               2727
     C           A28HB5    COMP *BLANK               2828
     C           A211H5    COMP *BLANK               2929
     C           A2BHB3    COMP *BLANK               1010
     C           A23HB2    COMP *BLANK               2121
     C           A26HB2    COMP *BLANK               2222
     C           A29HB2    COMP *BLANK               2323
     C           A212H2    COMP *BLANK               2424
     C  N11 25N31          SETON                     3031
     C           END       TAG
     OQPRINT  H  102   30
     O       OR        OF
     O                                  131 '.....................'
     O        H  1     30
     O       OR        OF
     O                                  131 '.         .         .'
     O        H  1     30
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME Y   98
     O                                  131 '.         .         .'
     O        H  2     30
     O       OR        OF
     O                                   10 'FCER16-1'
     O                                   54 '** COMPONENTS '
     O                                   65 'M/F LIST **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        H  2     30
     O       OR        OF
     O                                   24 'PART NO - PARENT-'
     O                                   50 'COMPT P/N 1....SHEETS'
     O                                   72 'COMPT P/N 2....SHEETS'
     O                                   94 'COMPT P/N 3....SHEETS'
     O                                  116 'COMPT P/N 4....SHEETS'
     O                                  128 'INPUT DATE'
     O        D  1    N11 25
     O                         A2BHB1    15
     O                                   16 '-'
     O                         A2BHB2    21
     O                 10                22 '-'
     O                 10      A2BHB3    24
     O                         A21HB5    35
     O                 26                36 '-'
     O                         A22HB5    41
     O                 21                42 '-'
     O                 21      A23HB2    44
     O                         A2SYK1Z   48
     O                         A24HB5    57
     O                 27                58 '-'
     O                         A25HB5    63
     O                 22                64 '-'
     O                 22      A26HB2    66
     O                         A2SYK2Z   70
     O                         A27HB5    79
     O                 28                80 '-'
     O                         A28HB5    85
     O                 23                86 '-'
     O                 23      A29HB2    88
     O                         A2SYK3Z   92
     O                         A210H5   101
     O                 29               102 '-'
     O                         A211H5   107
     O                 24               108 '-'
     O                 24      A212H2   110
     O                         A2SYK4Z  114
     O                         KDATE Y  126
