     H            Y/
     F** FCER64 *****************************************
     F*  SERVICE PART REPORT (LATEST SHIP YEAR/MONTH)   *
     F*                                                 *
     F* JW    06/07/2016 WRITTEN                        *
     F***************************************************
     FFCEPL30 IF  E           K        DISK
     FMBDPL14 IF  E           K        DISK
     FFCEWP64 O   E                    DISK
      *------------------------------------------------------------
     E                    TS         12  7 0
     I            DS
     I                                        1   60FYM
     I                                        1   40FWTYY
     I                                        5   60FWTMM
     I            DS
     I                                        1   60XYM
     I                                        1   40XWTYY
     I                                        5   60XWTMM
     I            DS
     I                                        1  840TS
     I                                        1   70F4TS01
     I                                        8  140F4TS02
     I                                       15  210F4TS03
     I                                       22  280F4TS04
     I                                       29  350F4TS05
     I                                       36  420F4TS06
     I                                       43  490F4TS07
     I                                       50  560F4TS08
     I                                       57  630F4TS09
     I                                       64  700F4TS10
     I                                       71  770F4TS11
     I                                       78  840F4TS12
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
      *
     C                     MOVE *OFF      *IN91
     C           *IN91     DOWEQ*OFF
     C                     READ FCEPL30                  91
     C           *IN91     IFEQ *OFF
     C           F3GSKD    ANDNE'D'
      *
     C                     MOVE 'Y'       FIRST   1
     C                     MOVE F3BHB1    K@PRT1
     C                     MOVE F3BHB2    K@PRT2
     C                     MOVE F3BHB3    K@PRT3
     C           KEY       SETLLMBDPL14
     C                     MOVE *OFF      *IN92
     C           *IN92     DOWEQ*OFF
     C           KEY       READEMBDPL14                  92
     C           *IN92     IFEQ *OFF
      * FIRST?
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     Z-ADDF4NONY    SVNONY  40
     C                     Z-ADD0         FWTYY
     C                     Z-ADD0         FWTMM
     C                     Z-ADD0         FWQTY
     C                     ENDIF
      * BREAK?
     C           F4NONY    IFNE SVNONY
     C                     EXSR #WRT
     C                     ENDIF
      * DETAIL
     C                     Z-ADDF4TNEN    XWTYY
     C                     Z-ADD13        IX      20
     C                     DO   12
     C                     SUB  1         IX
     C           TS,IX     IFNE 0
     C                     Z-ADDIX        XWTMM
     C                     Z-ADDTS,IX     XWQTY   70
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      * COMPARE DOCK
     C           XYM       IFGT FYM
     C                     Z-ADDXWTYY     FWTYY
     C                     Z-ADDXWTMM     FWTMM
     C                     Z-ADDXWQTY     FWQTY
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      * LAST BREAK?
     C           FIRST     IFEQ 'N'
     C                     EXSR #WRT
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  BREAK
      *------------------------------------------------------
     C           #WRT      BEGSR
      *
     C                     MOVELF4SHN1    FWBHB1
     C                     MOVELF4SHN2    FWBHB2
     C                     MOVELF4SHN3    FWBHB3
     C                     MOVELSVNONY    FWNONY
     C                     WRITEFCEWP641
      *
     C                     Z-ADDF4NONY    SVNONY
     C                     Z-ADD0         FWTYY
     C                     Z-ADD0         FWTMM
     C                     Z-ADD0         FWQTY
      *
     C                     ENDSR
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           KEY       KLIST
     C                     KFLD           K@PRT1  5
     C                     KFLD           K@PRT2  5
     C                     KFLD           K@PRT3  2
      *
     C                     ENDSR
      *
