     H            Y.
     F** FCER31 *************************
     F*  PART LIST BY MCN/LOC           *
     F*    08/18/03     TCH
     F*                                 *
     F************************* FCER31 **
     FFCEPW31 CF  E                    WORKSTN
     FFCEWP31 IF  E           K        DISK                      A
     FFCEWL31 IF  E           K        DISK
     F            FCEWP311                          KRENAMEFCEWLR
     FAAFPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FAAPPL03 IF  E           K        DISK
     FADHPL03 IF  E           K        DISK
     FABHPL03 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FGHCTL21 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *--------------------------------------------------
     E                    PRC        15  3               PROCESS
     E                    LOC        15  6               LOCATION
     E                    KK         15  1               KANBAN
     E                    MCN        15  3               MACHINE
      *--------------------------------------------------
     I            DS
     I                                        1  45 PRC
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  90 LOC
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  15 KK
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  45 MCN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1   6 F1LOC
     I                                        1   1 F1LOC1
     I                                        2   2 LL
     I                                        2   3 F1LOC2
     I                                        4   5 F1LOC3
     I                                        6   6 F1LOC4
     I            DS
     I                                        1   6 NLOC
     I                                        1   1 NLOC1
     I                                        2   3 NLOC2
     I                                        4   5 NLOC3
     I                                        6   6 NLOC4
     I            DS
     I                                        1   2 MDMBN2
     I                                        1   1 MDMD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------
     C           K#KEY     KLIST
     C                     KFLD           F1PAR1
     C                     KFLD           F1PAR2
     C                     KFLD           F1PAR3
     C           K#LOC     KLIST
     C                     KFLD           F1LOC1
     C                     KFLD           F1LOC2
     C                     KFLD           F1LOC3
     C                     KFLD           F1LOC4
     C           K#FW      KLIST
     C                     KFLD           @@GROP
     C                     KFLD           MDMSNO
     C                     KFLD           MDMBN1
     C                     KFLD           MDMBN2
     C                     KFLD           MDMBN3
     C                     KFLD           MDMBN4
      *
     C                     MOVE '01'      @@ID    2
     C                     MOVE *ALL'-'   @@LIN  79
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #SCRN1    BEGSR
      *-----------------------------------------------
      *
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
      *
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #WRT
     C           D@OP11    IFNE *BLANK
     C                     MOVE *ON       *IN01
     C                     ELSE
     C                     MOVE *ON       *IN02
     C                     ENDIF
     C                     EXSR #OUT
      *
     C                     MOVE '99'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #CHK1     BEGSR
      *-----------------------------------------------
      *
     C                     SETOF                     619962
     C                     SETOF                     63
      *
     C           D@OP11    IFNE *BLANK
     C           D@OP12    ANDNE*BLANK
     C           D@OP11    OREQ *BLANK
     C           D@OP12    ANDEQ*BLANK
     C                     SETON                     6199
     C                     ENDIF
      *
     C           D@HD      IFEQ *BLANK
     C           D@RL      ANDEQ*BLANK
     C           D@ST      ANDEQ*BLANK
     C           D@ALL     ANDEQ*BLANK
     C                     SETON                     6299
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #WRT      BEGSR
      *-----------------------------------------------
     C                     TIME           @@TIME  60
      *
     C           *LOVAL    SETLLGHCTL21
     C           *IN90     DOUEQ*ON
     C                     READ GHCTL21                  90
     C           *IN90     IFEQ *OFF
     C                     SELEC
     C           MDMD      WHEQ 'H'
     C           MDMD      OREQ 'N'
     C           D@HD      IFEQ *BLANK
     C           D@ALL     ANDEQ*BLANK
     C                     ITER
     C                     ENDIF
     C                     MOVEL'HD'      @@GROP  3
      *
     C           MDMD      WHEQ 'T'
     C           MDMD      OREQ 'L'
     C           MDMD      OREQ 'F'
     C           MDMD      OREQ 'J'
     C           D@RL      IFEQ *BLANK
     C           D@ALL     ANDEQ*BLANK
     C                     ITER
     C                     ENDIF
     C                     MOVEL'RL'      @@GROP
      *
     C           MDMD      WHEQ 'E'
     C           MDMD      OREQ 'G'
     C           D@ST      IFEQ *BLANK
     C           D@ALL     ANDEQ*BLANK
     C                     ITER
     C                     ENDIF
     C                     MOVEL'ST'      @@GROP
      *
     C                     OTHER
     C                     ITER
     C                     ENDSL
      *
     C           K#FW      CHAINFCEWP31              95
     C  N95                ITER
      *
     C                     MOVEL@@GROP    F1GROP
     C                     MOVELMDMHN1    F1PAR1
     C                     MOVELMDMHN2    F1PAR2
     C                     MOVELMDMHN3    F1PAR3
     C                     MOVELMDMSNO    F1MCHN
     C                     MOVELMDMBN1    F1LOC1
     C                     MOVELMDMBN2    F1LOC2
     C                     MOVELMDMBN3    F1LOC3
     C                     MOVELMDMBN4    F1LOC4
     C                     MOVELMDMKTE    F1PROC
     C                     WRITEFCEWP311
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     CLOSEFCEWP31
     C                     OPEN FCEWP31
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #OUT      BEGSR
      *-----------------------------------------------
     C                     MOVE *BLANK    @@GRP   3
      *
     C           *IN01     IFEQ *ON
     C           *LOVAL    SETLLFCEWP31
     C                     ELSE
     C           *LOVAL    SETLLFCEWL31
     C                     ENDIF
      *
     C           *IN90     DOUEQ*ON
     C           *IN01     IFEQ *ON
     C                     READ FCEWP31                  90
     C                     ELSE
     C                     READ FCEWL31                  90
     C                     ENDIF
      *
     C           *IN90     IFEQ *OFF
      *
     C           *IN01     IFEQ *ON
     C           F1MCHN    ANDEQ*BLANK
     C                     ITER
     C                     ENDIF
      *
     C*          *IN98     IFEQ *OFF
     C*          *INOF     OREQ *ON
     C*  01                EXCPT@HED1
     C*  02                EXCPT@HED2
     C**                   ENDIF
      *
     C* N98                MOVE *ON       *IN98
     C                     Z-ADD*ZERO     @@MAX   70
      *
     C           F1GROP    IFNE @@GRP
     C           *INOF     OREQ *ON
     C   01                EXCPT@HED1
     C   02                EXCPT@HED2
     C                     EXCPT@LIN
     C                     ENDIF
      *
     C                     MOVE F1GROP    @@GRP
      *
     C           K#KEY     CHAINAAMPL11              10
      *
     C           *IN10     IFEQ *OFF
     C           1         DO   15        X       20
     C           LOC,X     IFEQ F1LOC
     C           PRC,X     ANDEQF1PROC
     C           MCN,X     ANDEQF1MCHN
     C                     MOVE KK,X      @@KAN   1
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     SELEC
     C           @@KAN     WHEQ 'A'
     C           K#LOC     SETLLABHPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READEABHPL03                  95
     C           *IN95     IFEQ *OFF
     C           M6HIN1    ANDEQF1PAR1
     C           M6HIN2    ANDEQF1PAR2
     C           M6HIN3    ANDEQF1PAR3
     C           M6SKJY    IFEQ 'D'
     C           M6STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDM6KMAX    @@MAX   70
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           @@KAN     WHEQ 'B'
     C           K#LOC     SETLLADHPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READEADHPL03                  95
     C           *IN95     IFEQ *OFF
     C           J6SHN1    ANDEQF1PAR1
     C           J6SHN2    ANDEQF1PAR2
     C           J6SHN3    ANDEQF1PAR3
     C           J6SKJY    IFEQ 'D'
     C           J6STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDJ6KMAX    @@MAX   70
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           @@KAN     WHEQ 'C'
     C           K#LOC     SETLLAAFPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READEAAFPL03                  95
     C           *IN95     IFEQ *OFF
     C           A31HB5    ANDEQF1PAR1
     C           A32HB5    ANDEQF1PAR2
     C           A33HB2    ANDEQF1PAR3
     C           A3SKJY    IFEQ 'D'
     C           A3STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDA3KMAX    @@MAX   70
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           @@KAN     WHEQ 'D'
     C           K#LOC     SETLLAAGPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READEAAGPL03                  95
     C           *IN95     IFEQ *OFF
     C           O4SHN1    ANDEQF1PAR1
     C           O4SHN2    ANDEQF1PAR2
     C           O4SHN3    ANDEQF1PAR3
     C           O4SKJY    IFEQ 'D'
     C           O4STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDO4KMAX    @@MAX
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           @@KAN     WHEQ 'E'
     C           K#LOC     SETLLAAHPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READEAAHPL03                  95
     C           *IN95     IFEQ *OFF
     C           L6SHN1    ANDEQF1PAR1
     C           L6SHN2    ANDEQF1PAR2
     C           L6SHN3    ANDEQF1PAR3
     C           L6SKJY    IFEQ 'D'
     C           L6STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDL6KMAX    @@MAX
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           @@KAN     WHEQ '0'
     C           K#LOC     SETLLAAPPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READEAAPPL03                  95
     C           *IN95     IFEQ *OFF
     C           L5SHN1    ANDEQF1PAR1
     C           L5SHN2    ANDEQF1PAR2
     C           L5SHN3    ANDEQF1PAR3
     C           L5SKJY    IFEQ 'D'
     C           L5STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDL5KMAX    @@MAX
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSL
      *
     C   01                EXCPT@DTL1
     C   02                EXCPT@DTL2
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
     OQPRINT  E   01           @HED1
     O                         #PGM       9
     O                         UDATE Y   57
     O                         @@TIME    68 '  :  :  '
     O                                   74 'P.'
     O                         PAGE  Z   78
     O        E   02           @HED1
     O                                   30 'PARTS LIST BY MACHINE#:'
     O                         F1GROP    34
     O        E   04           @HED1
     O                                    5 'MCN'
     O                                   12 'PART#'
     O                                   27 'LOC'
     O                                   38 '# KB'
     O        E   01           @HED2
     O                         #PGM       9
     O                                   54 'P.'
     O                         PAGE  Z   58
     O                         UDATE Y   67
     O                         @@TIME    78 '  :  :  '
     O        E   02           @HED2
     O                                   30 'PARTS LIST BY LOCATION:'
     O                         F1GROP    34
     O        E   04           @HED2
     O                                    6 'LOC'
     O                                   15 'PART#'
     O                                   33 '# KB'
     O                                   38 'MCN'
     O        E 1              @LIN
     O                         @@LIN     80
     O        E 1              @DTL1
     O                         F1MCHN     5
     O                         F1PAR1    12
     O                         F1PAR2    18
     O                         F1PAR3    21
     O                         F1LOC2    26
     O                                   27 '-'
     O                         F1LOC3    29
     O                         @@MAX 4   38
     O        E 1              @DTL2
     O                         F1LOC2     5
     O                                    6 '-'
     O                         F1LOC3     8
     O                         F1PAR1    15
     O                         F1PAR2    21
     O                         F1PAR3    24
     O                         @@MAX 4   33
     O                         F1MCHN    38
