     H            Y.                                                      MER040
     F***********************************************
     F* PART# LIST FOR DOWNLOADING                                         *
     F*        MAY/23/2002                          *
     F***********************************************
     FMBDPP01 IP  E                    DISK
     FFGBPL01 IF  E           K        DISK
     FFCEWP45 O   E                    DISK
     IMBDPP011    01
     I                                              F3TOKUL1
     I                                              F3MHN1L1
     I                                              F3MHN2L1
     I                                              F3MHN3L1
     I                                              F3MHN4L1
      *
     I            DS
     I                                        1  25 FWMHIN
     I                                        1   5 @MHN1
     I                                        6   6 @M1
     I                                        7  11 @MHN2
     I                                       12  12 @M2
     I                                       13  17 @MHN3
     I                                       18  18 @M3
     I                                       19  23 @MHN4
     I            DS
     I                                        1  15 FWSHIN
     I                                        1   5 @SHN1
     I                                        6   6 @S1
     I                                        7  11 @SHN2
     I                                       12  12 @S2
     I                                       13  14 @SHN3
     CL1                   EXSR #WRT
      *-------------------------------------------------------
     C           #WRT      BEGSR
      *
     C                     CLEARFCEWP451
     C           F3TOKU    CHAINFGBPL01              90
      *
     C                     MOVELF3TOKU    FWCUST
     C                     MOVELB2SMEI    FWNAME
     C                     MOVELF3MHN1    @MHN1
     C                     MOVELF3MHN2    @MHN2
     C                     MOVELF3MHN3    @MHN3
     C                     MOVELF3MHN4    @MHN4
     C           @MHN2     COMP *BLANK               1010
     C   10                MOVE '-'       @M1
     C           @MHN3     COMP *BLANK               1010
     C   10                MOVE '-'       @M2
     C           @MHN4     COMP *BLANK               1010
     C   10                MOVE '-'       @M3
     C                     MOVELF3SHN1    @SHN1
     C                     MOVELF3SHN2    @SHN2
     C                     MOVELF3SHN3    @SHN3
     C           @SHN2     COMP *BLANK               1010
     C   10                MOVE '-'       @S1
     C           @SHN3     COMP *BLANK               1010
     C   10                MOVE '-'       @S2
     C                     WRITEFCEWP451
      *
     C                     ENDSR
