     H            Y.
     F******************************************************
     F*  IZAPP01       UPDATE
     F*  COST DATA(PC) UPDATE PROCESS                      *
     F******************************************************
      ************************************
     FAGDPL12 IF  E           K        DISK
     FIZAPL01 UF  E           K        DISK                      A
     FIZAPL10 IF  E           K        DISK
      ************************************
     FIZAPPNO UF  F       4            DISK                      A
     FIZBPL20 IF  E           K        DISK
      ************************************
     IIZAPPNO AA  01
     I                                        1   4 @BRECD
      *
     I            DS
     I                                        1   80ZBSKHZ
     I                                        1   40ZBSKYY
     I                                        5   60ZBSKMM
     I                                        7   80ZBSKDD
     I            DS
     I                                        1   80ZBKOHZ
     I                                        1   40ZBKOYY
     I                                        5   60ZBKOMM
     I                                        7   80ZBKODD
     I            DS
     I                                        1   60ZBKOTM
     I                                        1   20ZBKOHH
     I                                        3   40ZBKOSS
     I            DS
     I                                        1   80ZASKHZ
     I                                        1   40ZASKYY
     I                                        5   60ZASKMM
     I                                        7   80ZASKDD
     I            DS
     I                                        1   80ZAKOHZ
     I                                        1   40ZAKOYY
     I                                        5   60ZAKOMM
     I                                        7   80ZAKODD
     I            DS
     I                                        1   60ZAKOTM
     I                                        1   20ZAKOHH
     I                                        3   40ZAKOSS
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
     I            DS
     I                                        1   80ZCKOHZ
     I                                        1   40ZCKOYY
     I                                        5   60ZCKOMM
     I                                        7   80ZCKODD
     I            DS
     I                                        1   60ZCKOTM
     I                                        1   20ZCKOHH
     I                                        3   40ZCKOSS
     I            DS
     I                                        1   80ZCUKHZ
     I                                        1   40ZCUKYY
     I                                        5   60ZCUKMM
     I                                        7   80ZCUKDD
     I            DS
     I                                        1   80ZCSTHZ
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
     I            DS
     I                                        1   80ZHSKHZ
     I                                        1   40ZHSKYY
     I                                        5   60ZHSKMM
     I                                        7   80ZHSKDD
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
     I                                        9  100WKBI
     I            DS
     I                                        1   80WZYMD
     I                                        1   40WZYY
     I                                        5   60WZMM
     I                                        7   80WZDD
     I            DS
     I                                        1  28 W2KEY
     I                                        1  15 A2ZANM
     I                                       16  202A2KAZI
     I                                       21  240A2UKER
     I                                       25  280A2SIRE
     I            DS
     I                                        1  28 WPKEY
     I                                        1  15 @ZANM
     I                                       16  202@KAZI
     I                                       21  240@UKER
     I                                       25  280@SIRE
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *================================================================
      *           完成材かんばんマスター更新              *
      *================================================================
     C                     MOVE *BLANK    WFLG    1
      *
     C                     Z-ADD*DATE     WKHZ
     C                     Z-ADD01        WKBI
     C                     Z-ADD0         WZYMD
     C           KEY1      KLIST
     C                     KFLD           WKYY
     C                     KFLD           WKMM
     C                     KFLD           WKDD
     C           KEY1      SETLLAGDPL121
     C                     SETOF                     10
     C                     READPAGDPL121                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDF8KAYY    WZYY
     C                     Z-ADDF8KAMM    WZMM
     C                     Z-ADDF8KADD    WZDD
     C                     END
      *
     C           *LOVAL    SETLLIZAPL01
      *-------------------------
S1   C                     DO   *HIVAL
     C                     READ IZAPL01                  90
     C   90                LEAVE
      *
 S2  C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ITER
 E2  C                     ENDIF
     C***
     C                     EXSR #PP10
     C***
 S2  C           *DATE     IFGE ZCUKHZ
     C           *DATE     ANDLEZCSTHZ
     C*<<      >>
     C*****PP10無
  S3 C           CFLG      IFEQ *BLANK                     失効
     C                     Z-ADD*DATE     ZCKOHZ
     C                     TIME           ZCKOTM
     C                     MOVEL@@USER    ZCKOME
     C                     MOVE 'Z'       ZCKOME
     C                     Z-ADDWZYMD     ZCSTHZ
     C                     Z-ADD01        ZCSBIN
     C                     UPDATIZAPL011
  X3 C                     ELSE
     C*****PP10あり
  S4 C           ZCMSJR    IFNE WBMSJR
     C                     MOVE *BLANK    ZCSKJY
     C                     Z-ADD0         ZCSKHZ
     C                     Z-ADD*DATE     ZCKOHZ
     C                     TIME           ZCKOTM
     C                     MOVEL@@USER    ZCKOME
     C                     MOVE 'Z'       ZCKOME
     C                     Z-ADDWBMSJR    ZCMSJR
  S5 C           ZCDTKO    IFNE '2'
     C                     MOVE '3'       ZCDTKO
  E5 C                     END
     C                     MOVE *BLANK    ZCDTHE
     C                     UPDATIZAPL011
  E4 C                     ENDIF
  E3 C                     ENDIF
     C*****
 X2  C                     ELSE
     C*<<      >>
  S3 C           ZCUKHZ    IFEQ *DATE
  E3 C                     END
     C***
 E2  C                     ENDIF
      *
E1   C                     ENDDO
      *-------------------------
      *-------------------------
     C           KEY02     KLIST
     C                     KFLD           K@ZAIS 15        MATERIAL
     C                     KFLD           K@ZAIK  52       DTAMETER
     C                     KFLD           K@KOJE  40       PLANT COAD
     C                     KFLD           K@KAKE  40       SUPPLIER
     C           *LOVAL    SETLLIZAPL10
      *-------------------------
S1   C                     DO   *HIVAL
     C                     READ IZAPL10                  90
     C   90                LEAVE
 S2  C           ZBSKJY    IFEQ 'D'
     C           ZBSKHZ    ANDLE*DATE
     C                     ITER
 E2  C                     ENDIF
     C*
     C                     MOVELZBZAIS    K@ZAIS 15        MATERIAL
     C                     Z-ADDZBZAIK    K@ZAIK  52       DTAMETER
     C                     Z-ADDZBKOJE    K@KOJE  40       PLANT COAD
     C                     Z-ADDZBKAKE    K@KAKE  40       SUPPLIER
     C                     Z-ADDZBBZIK    K@BZIK  52       DIAMETER OF ROD
     C                     MOVE *BLANK    CFLG    1
     C                     Z-ADD0         WBMSJR  80
     C*
     C           KEY02     SETLLIZAPL10
 S2  C                     DO   *HIVAL
     C           KEY02     READEIZAPL10                  91
     C   91                LEAVE
  S3 C           ZBSKJY    IFEQ 'D'
     C           ZBSKHZ    ANDLE*DATE
     C                     ITER
  E3 C                     ENDIF
     C                     ADD  ZBMSJR    WBMSJR
     C                     MOVE '*'       CFLG
 E2  C                     ENDDO
     C*
     C           CFLG      IFEQ '*'
     C                     EXSR #PP01
     C                     ENDIF
     C*
     C           KEY02     SETGTIZAPL10
E1   C                     ENDDO
      *-------------------------
      *
     C                     SETON                     LR
     C                     RETRN
      *================================================================
      * FINISHED MATERIAL KANBAN MASTER FILE *
      *================================================================
     C           #PP10     BEGSR
      *
     C           KEY01     KLIST
     C                     KFLD           ZCZAIS
     C                     KFLD           ZCZAIK
     C                     KFLD           ZCKOJE
     C                     KFLD           ZCKAKE
      *
     C                     Z-ADD0         WBMSJR  80
     C                     MOVE *BLANK    CFLG    1
     C           KEY01     SETLLIZAPL101
      *-------------------------
S1   C                     DO   *HIVAL
     C           KEY01     READEIZAPL101                 91
     C   91                LEAVE
 S2  C           ZBSKJY    IFEQ 'D'
     C           ZBSKHZ    ANDLE*DATE
 X2  C                     ELSE
     C                     MOVE '*'       CFLG
     C                     ADD  ZBMSJR    WBMSJR
 E2  C                     ENDIF
E1   C                     ENDDO
      *-------------------------
     C                     ENDSR
      *================================================================
      * FINISHED MATERIAL KANBAN MASTER FILE *
      *================================================================
     C           #PP01     BEGSR
      *
     C                     MOVE *BLANK    WFLG    1
     C           KEY02     SETLLIZAPL01
      *-------------------------
S1   C                     DO   *HIVAL
     C           KEY02     READEIZAPL01                  92
     C   92                LEAVE
 S2  C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ITER
 E2  C                     ENDIF
     C***
 S2  C           *DATE     IFGE ZCUKHZ
     C           *DATE     ANDLEZCSTHZ
     C                     MOVE '*'       WFLG
     C                     LEAVE
 E2  C                     ENDIF
     C***
E1   C                     ENDDO
      *-------------------------
      *
S1   C           WFLG      IFEQ *BLANK
     C                     MOVE *BLANK    ZCSKJY
     C                     Z-ADD0         ZCSKHZ
     C                     Z-ADD*DATE     ZCKOHZ
     C                     TIME           ZCKOTM
     C                     MOVEL@@USER    ZCKOME
     C                     MOVE 'Z'       ZCKOME
     C                     Z-ADDK@KOJE    ZCKOJE
     C                     MOVELK@ZAIS    ZCZAIS
     C                     Z-ADDK@ZAIK    ZCZAIK
     C                     Z-ADDK@KAKE    ZCKAKE
     C                     MOVE 'W'       ZCKNO2
     C                     Z-ADDWBMSJR    ZCMSJR
     C                     Z-ADDK@BZIK    ZCBZIK
     C                     Z-ADD*DATE     ZCUKHZ
     C                     Z-ADD01        ZCUBIN
     C                     Z-ADD99999999  ZCSTHZ
     C                     Z-ADD99        ZCSBIN
     C                     MOVE '2'       ZCDTKO
     C                     MOVE *BLANK    ZCDTHE
     C                     MOVE '0'       ZCKOSN
     C                     Z-ADD0         ZCSRMS
     C                     Z-ADD0         ZCALHK
     C                     Z-ADD0         ZCMXHK
     C                     MOVE *BLANK    ZCKSHK
     C                     MOVE *BLANK    ZCKOUT
     C                     MOVE *BLANK    ZCDOUT
      *
     C                     SETOF                     11
     C           1         CHAINIZAPPNO              11
 S2  C           *IN11     IFEQ '0'
     C                     MOVE @BRECD    #BRECD  40
     C                     ADD  1         #BRECD
     C                     MOVE #BRECD    @BRECD
     C                     EXCPTUPZA
 X2  C                     ELSE
      *
     C                     MOVE '0001'    @BRECD
     C                     EXCPTWTZA
 E2  C                     ENDIF
      *
     C                     MOVE @BRECD    ZCKNO3
      *
     C                     MOVE *BLANK    ZCKOJK
     C                     MOVE *BLANK    ZCKAKK
     C                     MOVE *BLANK    ZCKNO1
     C                     MOVE *BLANK    ZCKNOE
     C                     Z-ADD0         ZCTKJR
     C                     Z-ADD0         ZCNISG
     C                     EXSR #SB110
     C                     MOVE WZIRO     ZCZIRO
     C                     Z-ADD0         ZCMKJR
     C                     MOVE *BLANK    ZCADR1
     C                     MOVE *BLANK    ZCADR2
     C                     MOVE *BLANK    ZCADR3
     C                     MOVE *BLANK    ZCADR4
     C                     MOVE *BLANK    ZCUKIR
     C                     Z-ADD0         ZCLOTO
     C                     Z-ADD0         ZCMSSU
     C                     Z-ADD0         ZCSLTM
     C                     Z-ADD0         ZCKEIS
     C                     Z-ADD0         ZCSETI
     C                     Z-ADD0         ZCKMAL
     C                     Z-ADD0         ZCKMMN
     C                     Z-ADD0         ZCKMMX
     C                     Z-ADD0         ZCCHOS
     C                     MOVE *BLANK    ZCYOSI
     C                     MOVE *BLANK    ZCBAD1
     C                     MOVE *BLANK    ZCBAD2
     C                     MOVE *BLANK    ZCBAD3
     C                     MOVE *BLANK    ZCBAD4
     C                     MOVE *BLANK    ZCKIBN
     C                     MOVE *BLANK    ZCSNJ1
     C                     MOVE *BLANK    ZCSNJ2
     C                     MOVE *BLANK    ZCSNJ3
     C                     MOVE *BLANK    ZCSNJ4
     C                     MOVE *BLANK    ZCKHKO
     C                     MOVE *BLANK    ZCDHKO
     C                     Z-ADD0         ZCBZJR
     C                     WRITEIZAPL011
E1   C                     ENDIF
      *-------------------------
     C                     ENDSR
      *================================================================
      *-----------------------------------------------------*
      *                 材料色サブルーチン                *
      *-----------------------------------------------------*
     C           #SB110    BEGSR
     C                     SETOF                     11
     C                     MOVE *BLANK    WZIRO  10
     C           K@ZAIS    CHAINIZBPL201             11
     C           *IN11     IFEQ '0'
     C           ZHSKJY    ANDEQ'D'
     C           ZHSKHZ    ANDLE*DATE
     C                     SETON                     11
     C                     END
     C           *IN11     IFEQ '0'
     C                     MOVE ZHZIRO    WZIRO
     C                     END
     C           ESB110    ENDSR
      *================================================================
     OIZAPPNO E                UPZA
     O                         @BRECD     4
     O        EADD             WTZA
     O                         @BRECD     4
      *
