     H            Y.                                                      EHD020
     F**FCER39*****************************************
     F* PART LOCATION BY MACHINE #                                  *
     F*         JAN/08/2003                           *
     F*****************************************FCER39**
     FFCEPW39 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FAGDPL12 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAB#PL18 IF  E           K        DISK
     FFCEWP39 IF  E           K        DISK                      A
     FAAFPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FAAPPL03 IF  E           K        DISK
     FADHPL03 IF  E           K        DISK
     FABHPL03 IF  E           K        DISK
     FCADPL03 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *------------------------------------------------------------
     E                    CMD     1   1 78
     E                    ERR     1   2 78
     E                    TTL     1   1 32
     E                    LOC        15  6               LOCATION
     E                    MCN        15  3               MACHINE
     E                    KAN        15  1                KANABA TYPE
     E                    @M        100  3               MACHINE
      *------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
      *------------------------------------------------------
     I            DS
     I                                        1  90 LOC
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  45 MCN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  15 KAN
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1   6 F9LOC
     I                                        1   1 F9LOC1
     I                                        2   3 F9LOC2
     I                                        4   5 F9LOC3
     I                                        6   6 F9LOC4
     I            DS
     I                                        1   80K@NODT
     I                                        1   40K@NOYY
     I                                        5   60K@NOMM
     I                                        7   80K@NODD
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80F8DAT
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80BADAT
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
      *
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #OUT1
     C                     EXSR #OUT2
     C                     MOVE '99'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     SETOF                     619930
     C                     MOVE *BLANK    D@ERR
     C                     MOVE *BLANK    @M
     C                     Z-ADD*ZERO     X
     C                     Z-ADD*ZERO     @RRN    40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @RRN
     C           @RRN      CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C                     MOVE *OFF      *IN61
     C           S@MCN     IFNE *BLANK
     C  N30                MOVE *ON       *IN30
     C           S@MCN     LOKUP@M                       10
     C           *IN10     IFEQ *ON
     C  N99                MOVE ERR,1     D@ERR
     C                     SETON                     6199
     C                     ELSE
     C                     ADD  1         X
     C                     MOVE S@MCN     @M,X
     C                     ENDIF
     C                     ENDIF
     C                     UPDATSFL01
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN30     IFEQ *OFF
     C                     MOVE ERR,2     D@ERR
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  OUTPUT
      *------------------------------------------------------
     C           #OUT1     BEGSR
      *
     C           *LOVAL    SETLLAAMPL11
     C           *IN92     DOUEQ*ON
     C                     READ AAMPL11                  92
     C           *IN92     IFEQ *OFF
     C           CKSKJY    ANDEQ*BLANK
     C           1         DO   15        X
     C           MCN,X     IFNE *BLANK
     C                     MOVE MCN,X     F9MCHN
     C                     MOVE LOC,X     F9LOC
     C                     MOVE KAN,X     F9KAN
     C           LOC,X     IFEQ '------'
     C                     Z-ADDX         Y       20
     C           X         DO   15        Y       20
     C           LOC,Y     IFNE '------'
     C                     MOVE LOC,Y     F9LOC
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           KAN,X     IFEQ *BLANK
     C                     Z-ADDX         Y       20
     C           X         DO   15        Y       20
     C           KAN,Y     IFNE *BLANK
     C                     MOVE KAN,Y     F9KAN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     MOVE CKHIN1    F9PAR1
     C                     MOVE CKHIN2    F9PAR2
     C                     MOVE CKHIN3    F9PAR3
     C                     WRITEFCEWP391
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     CLOSEFCEWP39
     C                     OPEN FCEWP39
      *
     C                     ENDSR
      *------------------------------------------------------
      *  OUTPUT
      *------------------------------------------------------
     C           #OUT2     BEGSR
      * 10 DAYS
     C                     Z-ADD0         @W10    31
     C                     Z-ADD*DATE     K@YMD
     C           K#AGD     SETGTAGDPL121
     C                     DO   10
     C                     READPAGDPL121                 90
     C           *IN90     IFEQ *OFF
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ITER
     C                     ENDIF
      *
     C                     Z-ADDF8DAT     @10DT   80
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         @W10
     C                     ELSE
     C                     ADD  0.5       @W10
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADD*ZERO     @RRN    40
     C                     MOVE *OFF      *IN98
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @RRN
     C           @RRN      CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@MCN     ANDNE*BLANK
      *
     C                     EXSR #WP39
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  OUTPUT -2
      *------------------------------------------------------
     C           #WP39     BEGSR
      *
     C                     Z-ADD*ZERO     @@TOT   71
     C                     Z-ADD*ZERO     @@KTOT  40
     C                     MOVE *OFF      *IN97
     C           S@MCN     SETLLFCEWP39
     C           *IN92     DOUEQ*ON
     C           S@MCN     READEFCEWP39                  92
     C           *IN92     IFEQ *OFF
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     MOVE *OFF      *IN97
     C                     ENDIF
     C  N98                MOVE *ON       *IN98
      *
     C                     EXSR #ACT
     C                     EXSR #KAN
      *
     C                     EXCPT@DTL
     C  N97                MOVE *ON       *IN97
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN97     IFEQ *ON
     C           @@TOT     IFNE *ZERO
     C   OF                EXCPT@HED
     C                     EXCPT@STOT
     C                     ENDIF
     C                     EXCPT@SKP
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #ACT      BEGSR
      *------------------------------------------------------
     C                     Z-ADD*ZERO     @ACQY   90
      *
     C                     Z-ADD@10DT     K@NODT
     C           K#AB18    SETLLAB#PL18
     C           *IN26     DOUEQ*ON
     C           K#FCX     READEAB#PL18                  26
     C           *IN26     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BADAT     IFGT *DATE
     C                     LEAVE
     C                     ENDIF
      *
     C                     ADD  BASRYO    @ACQY
     C                     ENDIF
     C                     ENDDO
      *
     C           K#FCX     CHAINFCEPL01              26
     C           @ACQY     DIV  A2SSYS    @ABOX   70
     C                     MVR            @@MVR   70
     C           @@MVR     IFGT *ZERO
     C                     ADD  1         @ABOX
     C                     ENDIF
      *
     C           @W10      IFNE *ZERO
     C           @ABOX     DIV  @W10      @ACTB   41H
     C                     ADD  @ACTB     @@TOT
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #KAN      BEGSR
      *------------------------------------------------------
     C                     Z-ADD*ZERO     @KAN    30
      *
     C                     SELEC
      *
     C           F9KAN     WHEQ 'A'
     C           K#LOC     SETLLABHPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READEABHPL03                  95
     C           *IN95     IFEQ *OFF
     C           M6HIN1    ANDEQF9PAR1
     C           M6HIN2    ANDEQF9PAR2
     C           M6HIN3    ANDEQF9PAR3
     C           M6SKJY    IFEQ 'D'
     C           M6STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDM6KMAX    @KAN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           F9KAN     WHEQ 'C'
     C           K#LOC     SETLLAAFPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READEAAFPL03                  95
     C           *IN95     IFEQ *OFF
     C           A31HB5    ANDEQF9PAR1
     C           A32HB5    ANDEQF9PAR2
     C           A33HB2    ANDEQF9PAR3
     C           A3SKJY    IFEQ 'D'
     C           A3STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDA3KMAX    @KAN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           F9KAN     WHEQ 'B'
     C           K#LOC     SETLLADHPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READEADHPL03                  95
     C           *IN95     IFEQ *OFF
     C           J6SHN1    ANDEQF9PAR1
     C           J6SHN2    ANDEQF9PAR2
     C           J6SHN3    ANDEQF9PAR3
     C           J6SKJY    IFEQ 'D'
     C           J6STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDJ6KMAX    @KAN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           F9KAN     WHEQ 'D'
     C           K#LOC     SETLLAAGPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READEAAGPL03                  95
     C           *IN95     IFEQ *OFF
     C           O4SHN1    ANDEQF9PAR1
     C           O4SHN2    ANDEQF9PAR2
     C           O4SHN3    ANDEQF9PAR3
     C           O4SKJY    IFEQ 'D'
     C           O4STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDO4KMAX    @KAN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           F9KAN     WHEQ 'E'
     C           K#LOC     SETLLAAHPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READEAAHPL03                  95
     C           *IN95     IFEQ *OFF
     C           L6SHN1    ANDEQF9PAR1
     C           L6SHN2    ANDEQF9PAR2
     C           L6SHN3    ANDEQF9PAR3
     C           L6SKJY    IFEQ 'D'
     C           L6STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDL6KMAX    @KAN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           F9KAN     WHEQ 'F'
     C           K#LOC     SETLLCADPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READECADPL03                  95
     C           *IN95     IFEQ *OFF
     C           C2SHN1    ANDEQF9PAR1
     C           C2SHN2    ANDEQF9PAR2
     C           C2SHN3    ANDEQF9PAR3
     C           C2SKJY    IFEQ 'D'
     C           C2STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDC2KMAX    @KAN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           F9KAN     WHEQ '0'
     C           K#LOC     SETLLAAPPL03
     C           *IN95     DOUEQ*ON
     C           K#LOC     READEAAPPL03                  95
     C           *IN95     IFEQ *OFF
     C           L5SHN1    ANDEQF9PAR1
     C           L5SHN2    ANDEQF9PAR2
     C           L5SHN3    ANDEQF9PAR3
     C           L5SKJY    IFEQ 'D'
     C           L5STHZ    ORNE 99999999
     C                     ITER
     C                     ENDIF
     C                     Z-ADDL5KMAX    @KAN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSL
      *
     C                     ADD  @KAN      @@KTOT
      *
     C                     ENDSR
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
     C                     KFLD           K@DD    20
     C           K#FCX     KLIST
     C                     KFLD           F9PAR1
     C                     KFLD           F9PAR2
     C                     KFLD           F9PAR3
     C           K#AB18    KLIST
     C                     KFLD           F9PAR1
     C                     KFLD           F9PAR2
     C                     KFLD           F9PAR3
     C                     KFLD           K@NOYY  40
     C                     KFLD           K@NOMM  20
     C                     KFLD           K@NODD  20
     C           K#LOC     KLIST
     C                     KFLD           F9LOC1
     C                     KFLD           F9LOC2
     C                     KFLD           F9LOC3
     C                     KFLD           F9LOC4
      *
     C                     MOVE '01'      @@ID    2
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
     C           1         DO   100       X       30
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDDO
      *
     C                     TIME           W@TIME  60
     C                     MOVE *ALL'-'   W@LINE 60
      *
     C                     ENDSR
      *------------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         UDATE Y   87
     O                         W@TIME    97 '  :  :  '
     O                                  107 'PAGE.'
     O                         PAGE  Z  111
     O        E   02           @HED
     O                         TTL,1     45
     O        E   04           @HED
     O                                    8 'MACHINE#'
     O                                   18 'LOCATION'
     O                                   27 'PART#'
     O                                   47 'SHIP/DAY'
     O                                   60 '# OF KANBAN'
     O        E   05           @HED
     O                         W@LINE    60
     O        E 1              @DTL
     O                      N97F9MCHN     5
     O                         F9LOC1    11
     O                         F9LOC2    14
     O                         F9LOC3    17
     O                         F9LOC4    19
     O                         F9PAR1    27
     O                         F9PAR2    33
     O                         F9PAR3    36
     O                         @ACTB 1   47
     O                         @KAN  1   60
     O        E 1              @STOT
     O                                   36 'TOTAL'
     O                         @@TOT 1   47
     O                         @@KTOT1   60
     O        E 1              @SKP
     O                         W@LINE    60
** CMD
F1:END      F5:PRINT
** ERR
MACHINE# IS DUPLICATE.
TYPE AT LEAST ONE MACHINE#.
** TTL
<< LOCATION LIST BY MACHINE# >>
