     H            Y.
     F**         *******************************************
     F*  COST DATA(PC) UPDATE PROCESS                      *
     F*                                                    *
     F* TCHK1 04/02/10 CREATE                              *
     F******************************************************
     FTAN400F IF  E                    DISK
     FFCEPL50 UF  E           K        DISK                      A
     F*TAN4001FO   E                    DISK
      *--------------------------------------------------------
     C           1         SETLLTAN400F
     C*
     C                     DO   *HIVAL
     C*
     C                     READ TAN400F                  99
     C   99                LEAVE
     C*
     C           K#P50     KLIST
     C                     KFLD           T4SHN1
     C                     KFLD           T4SHN2
     C                     KFLD           T4SHN3
     C                     KFLD           T4PROC
     C                     KFLD           T4MCN#
     C                     KFLD           K@VLDT
     C                     Z-ADD20150101  K@VLDT  80
     C           K#P50     CHAINFCEPL50              98
     C           *IN98     IFEQ *ON
     C                     CLEARFCEPP501
     C                     Z-ADD20150310  F5KODT
     C                     Z-ADD080000    F5KOTM
     C                     MOVEL'I0777'   F5KOME
     C                     MOVELT4SHN1    F5PRT1
     C                     MOVELT4SHN2    F5PRT2
     C                     MOVELT4SHN3    F5PRT3
     C                     MOVELT4PROC    F5PROC
     C                     MOVELT4MCN#    F5MCHN
     C                     MOVELT4BMON    F5DEPT
     C                     Z-ADDT4COST    F5COST
     C                     Z-ADD20150101  F5VLDT
     C                     WRITEFCEPP501
     C                     ITER
     C                     END
     C           *IN98     IFEQ *OFF
     C                     CLEARFCEPP501
     C                     Z-ADD20150310  F5KODT
     C                     Z-ADD080000    F5KOTM
     C                     MOVEL'I0777'   F5KOME
     C                     MOVELT4SHN1    F5PRT1
     C                     MOVELT4SHN2    F5PRT2
     C                     MOVELT4SHN3    F5PRT3
     C                     MOVELT4PROC    F5PROC
     C                     MOVELT4MCN#    F5MCHN
     C                     MOVELT4BMON    F5DEPT
     C                     Z-ADDT4COST    F5COST
     C                     Z-ADD20150101  F5VLDT
     C                     UPDATFCEPP501
     C                     ITER
     C                     END
     C*
     C                     ENDDO
     C*
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C*
