     H            Y.
     FFCEPL01 IF  E           K        DISK
     C           *ENTRY    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@GEKN  90
      *
     C                     MOVE P@HIN1    K@HIN1  5
     C                     MOVE P@HIN2    K@HIN2  5
     C                     MOVE P@HIN3    K@HIN3  2
     C                     Z-ADD0         P@GEKN
      *
     C           KEY       KLIST
     C                     KFLD           K@HIN1
     C                     KFLD           K@HIN2
     C                     KFLD           K@HIN3
      *
     C           KEY       CHAINFCEPL01              55
     C           *IN55     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C                     SETON                     55
     C                     END
     C                     END
     C           *IN55     IFEQ '0'
     C                     Z-ADDA2GEKN    P@GEKN
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
