     H            Y.                                                      MER040
     F***********************************************
     F* COMMON PART M/F LIST -INTRAL COMPANY PART NUMBER ORDER             *
     F* A.MAMIYA  2000.11.08 COPY FROM FCER43       *
     F***********************************************
     FFAAPL04 IP  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFCEWP43 O   F     256            DISK
     IFAAPL041    01
     I                                              B7TOKUL1
     I                                              B7SHN3          10
     IFGBPL011    03
     IFCEPL011    05
     I            DS
     I                                        1  20 MHBAN
     I                                        1   5 B7MHN1
     I                                        6  10 B7MHN2
     I                                       11  15 B7MHN3
     I                                       16  20 B7MHN4
     I                                       21  280WDATE
     I                                       21  240A2TRYY
     I                                       25  260A2TRMM
     I                                       27  280A2TRDD
     I                                       29  360SDATE
     I                                       29  320A2SYYY
     I                                       33  340A2SYMM
     I                                       35  360A2SYDD
     I                                       37  440SHIZU
     I                                       37  400B7SKYY
     I                                       41  420B7SKMM
     I                                       43  440B7SKDD
     C  N90                EXCPTHD
     C  N90                SETON                     90
     C                     SETOF                     505130
     C                     TIME           WTIME   60
     C           B7SKBN    COMP 'D'                      50
     C   50      SHIZU     COMP *DATE                  5151
     C   01N51N31          SETON                     3031
     C   L1                SETOF                     12
     C           B7NONY    CHAINFGBPL01              04
     C  N04      B2SKJY    COMP 'D'                      04
     C                     SETOF                     202114
     C           WKEY      KLIST
     C                     KFLD           B7SHN1
     C                     KFLD           B7SHN2
     C                     KFLD           B7SHN3
     C           WKEY      CHAINFCEPL01              14
     C  N14      A2GSKD    COMP 'D'                      14
     C  N14      SDATE     COMP *DATE                222323
     C  N14 22             Z-ADDA2KSYS    WSYUY   50
     C  N14 23             Z-ADDA2SSYS    WSYUY
     C   14                Z-ADD0         WSYUY
     C  N14      WDATE     COMP *DATE                202121
     C   20                MOVE A2KTRK    B1      1
     C   20                MOVE A2KTRT    B2      2
     C   20                MOVE A2KTRR    B3      2
     C   20                MOVE A2KTRD    B4      1
     C   21                MOVE A2STRK    B1
     C   21                MOVE A2STRT    B2
     C   21                MOVE A2STRR    B3
     C   21                MOVE A2STRD    B4
     C   01N51   1         ADD  W         W       40
     C                     SETOF                     13
     C   01N12             SETON                     13
     C   01                SETON                     12
     C   01N51             EXCPTDT
     OFCEWP43 E                HD
     O                                      'CUSTOMER'
     O                                      ';'
     O                                      'DELIVERY'
     O                                      ';'
     O                                      'DELIVERY NAME '
     O                                      ';'
     O                                      'FACTORY'
     O                                      ';'
     O                                      'RECEIVE'
     O                                      ';'
     O                                      'USER PART NO.'
     O                                      ';'
     O                                      'IAF PART NO.'
     O        E                DT
     O                 13      B7TOKU
     O                                      ';'
     O                         B7NONY
     O                                      ';'
     O                         B2SMEI
     O                                      ';'
     O                         B7NKJO
     O                                      ';'
     O                         B7NUKE
     O                                      ';'
     O                         MHBAN
     O                                      ';'
     O                         B7SHN1
     O                                      '-'
     O                         B7SHN2
     O                N10                   '-'
     O                         B7SHN3
