     H            Y.
     F*** FCER60 *****************************
     F* SERVICE PARTS M/F MAINTENANCE      *
     F*                                      *
     F***************************** FCER60 ***
     FFCEPP30 UP  E                    DISK
     I            DS
     I                                        1   2 F3STRR
     I                                        1   1 F1
     I                                        2   2 F2
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *****************************************************
      *  MAIN ROUTINE
      *****************************************************
      *
     C           F2        IFEQ *BLANK
     C                     MOVE F1        F2
     C                     MOVE '0'       F1
     C                     UPDATFCEPP301
     C                     ENDIF
      *
