     H            Y.
     F** FCER27 **************************************
     F* USER APPOINTMENT SUPPLIES PART NO LIST <1> *
     F*         S.YAMAGAMI 92.01.20                  *
     F************************************************
     FMBDPP01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FALAPP06 IF  E           K        DISK
     FFCEPW27 CF  E                    WORKSTN
     FFCEWP27 O   F      40            DISK
      *
     E                    ER      1   6 60
     E                    #TNK        6  9
      *
     I            DS
     I                                        1  54 #TNK
     I                                        1   9 #TNK1
     I                                       10  18 #TNK2
     I                                       19  27 #TNK3
     I                                       28  36 #TNK4
     I                                       37  45 #TNK5
     I                                       46  54 #TNK6
     I            DS
     I                                        1   9 WTNK
     I                                        1   4 WTKUI
     I                                        5   8 WNONY
     I                                        9   9 WKOJO
     I            DS
     I                                        1   9 @TNK
     I                                        1   4 @TKUI
     I                                        5   8 @NONY
     I                                        9   9 @KOJO
     I            DS
     I                                        1   9 @@TNK
     I                                        1   40@@TKUI
     I                                        5   80@@NONY
     I                                        9   9 @@KOJO
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80TQSKHZ
     I                                        1   40TQSKYY
     I                                        5   60TQSKMM
     I                                        7   80TQSKDD
     I            DS
     I                                        1   6 WTOKOR
     I                                        1   1 WTOK1
     I                                        2   3 WTOK2
     I                                        4   5 WTOK3
     I                                        6   6 WTOK4
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   6 A2KTKR
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
     I            DS
     I                                        1   6 A2STKR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
      *
     C           *ENTRY    PLIST
     C                     PARM           PARM1  54
     C                     PARM           PUS    10
      *
     C           KEY1      KLIST
     C                     KFLD           F3SHN1
     C                     KFLD           F3SHN2
     C                     KFLD           F3SHN3
      *
     C           KEY2      KLIST
     C                     KFLD           WTOK1
     C                     KFLD           WTOK2
      *
     C           KEY3      KLIST
     C                     KFLD           @@TKUI
     C                     KFLD           @@NONY
     C                     KFLD           @@KOJO
     C                     KFLD           F3NUKE
      *
      *
     C           STEPA     TAG
     C                     Z-ADD0         B       20
     C                     MOVE *BLANK    #TNK
     C           STEP1     TAG
     C                     MOVE *BLANK    @TKUI
     C                     MOVE *BLANK    @NONY
     C                     MOVE *BLANK    @KOJO
     C           STEP2     TAG
     C                     EXFMTFCEPW271
     C                     SETOF                     010203
     C                     SETOF                     99
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LRU1
     C                     RETRN
     C                     END
      *
     C           *INKE     IFEQ '1'
     C           B         ANDGE1
     C                     GOTO STEP3
     C                     END
      *
     C           @TKUI     IFEQ *BLANK
     C                     MOVE ER,1      MSG
     C                     SETON                     0199
     C                     GOTO STEP2
     C                     END
     C                     MOVE @TKUI     @@TKUI  40
      *
     C           @NONY     IFEQ *BLANK
     C                     MOVE ER,2      MSG
     C                     SETON                     0299
     C                     GOTO STEP2
     C                     END
     C                     MOVE @NONY     @@NONY  40
      *
     C           @KOJO     IFEQ *BLANK
     C                     MOVE ER,3      MSG
     C                     SETON                     0399
     C                     GOTO STEP2
     C                     END
      *
     C                     SETOF                     11
     C                     Z-ADD1         A       30
     C           @TNK      LOKUP#TNK,A                   11
     C           *IN11     IFEQ '1'
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVE ER,4      MSG
     C                     GOTO STEP2
     C                     ELSE
     C           B         IFGE 6
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVE ER,5      MSG
     C                     GOTO STEP2
     C                     END
     C                     ADD  1         B
     C                     MOVE @TNK      #TNK,B
     C                     END
      *
     C                     GOTO STEP1
     C           STEP3     TAG
      *
     C                     MOVEL*BLANK    SW      1
      * ~~~~~~~~~~~~
      *  mﾞｰj qgjﾞﾆ
      * ____________
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C                     READ MBDPP011                 10
     C           *IN10     IFEQ '1'
     C                     GOTO @@END
     C                     END
      *
     C                     MOVE F3TOKU    WTKUI
     C                     MOVE F3NONY    WNONY
     C                     MOVE F3NKOJ    WKOJO
      *
     C                     Z-ADD1         C       20
     C                     SETOF                     15
     C           WTNK      LOKUP#TNK,C                   15
     C           *IN15     IFEQ '0'
     C                     GOTO @@END
     C                     END
     C                     MOVE #TNK,C    @@TNK
      *
     C                     SETOF                     20
     C           KEY1      CHAINFCEPL011             20
     C           *IN20     IFEQ '1'
     C                     GOTO @@END
     C                     ELSE
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     GOTO @@END
     C                     END
     C                     END
      *
     C                     SETOF                     60
     C           KEY3      CHAINGADPL111             60
     C           *IN60     IFEQ '0'
     C           B5SKJY    ANDEQ'D'
     C           B5SKHZ    ANDLE*DATE
     C                     SETON                     60
     C                     END
     C           *IN60     IFEQ '1'
     C                     GOTO @@END
     C                     END
      * ﾆｬcﾑcﾇc
     C           A2SYHZ    IFGT *DATE
     C                     Z-ADDA2KSYS    WSYU    50       gｬc
     C                     ELSE
     C                     Z-ADDA2SSYS    WSYU             ﾆ]
     C                     END
      *
     C           WSYU      IFEQ 0
     C                     GOTO @@END
     C                     END
      * nﾃﾜﾌﾞ]k
     C           A2TRHZ    IFGT *DATE
     C                     MOVELA2KTKR    WTOKOR  6        gｬc
     C                     ELSE
     C                     MOVELA2STKR    WTOKOR           ﾆ]
     C                     END
      *
     C           A2GEKN    DIV  WSYU      WKOTA1  90
     C           WKOTA1    DIV  20        WKOTA2 101
     C           WKOTA2    DIV  2         WKOTAE  52
      *
     C                     SETOF                     30
     C           KEY2      CHAINALAPP061             30
     C           *IN30     IFEQ '1'
     C                     GOTO @@END
     C                     END
      *
     C           *IN30     IFEQ '0'
     C           TQSKJY    ANDEQ'D'
     C           TQSKHZ    ANDLE*DATE
     C                     GOTO @@END
     C                     END
      *
     C           TQYSCD    IFEQ '1'
     C           TQYSCD    OREQ '3'
     C                     MOVEL'H'       WOKIBA  1        t]ﾆｫ
     C                     EXCPTDT1
     C                     MOVEL'*'       SW
     C                     END
      *
     C           TQYSCD    IFEQ '2'
     C                     MOVEL'G'       WOKIBA           五条川
     C                     EXCPTDT1
     C                     MOVEL'*'       SW
     C                     END
      *
     C           @@END     TAG
     C  N10                END
      *
      *
     C           SW        IFEQ *BLANK
     C                     SETON                     99
     C                     MOVE ER,6      MSG
     C                     GOTO STEPA
     C                     END
      *
     C                     MOVEA#TNK      PARM1  54
     C                     SETON                     LR
     C                     RETRN
     OFCEWP27 E                DT1
     O                         WOKIBA     1
     O                         WTOKOR     7
     O                         WKOTAE    12
     O                         F3SHN1    17
     O                         F3SHN2    22
     O                         F3SHN3    24
     O                         F3NKOJ    25
**  ER (ERROR MESSAGE )
E-01 INPUT CUSTOMER
E-02 INPUT RECEIVING CO.
E-03 INPUT FACTORY
E-04 IT IS INPUT ALREADY
E-05 INPUT IS UNTIL 6 TIMES
E-06 THERE IS NOT DATA REVERSED
