     H            Y/
     F***************************************************
     F*   ASJ HALF PRODUCT/IAF PART TABLE MAINTENANCE   *
     F*                                                 *
     F*                                                 *
     F*   MODIFICAITON:                                 *
     F*                                                 *
     F*                                                 *
     F***************************************************
     FFCEPW50 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FFCEPL40 UF  E           K        DISK                      A
     F                                              KINFDS @INFDA
     FFCEPL41 IF  E           K        DISK
     F            FCEPP401                          KRENAMEFCEPL411
     F                                              KINFDS @INFDB
     FFCEPL01 IF  E           K        DISK
      *------------------------------------------------------------
     E                    CMD     1   2 78
     E                    MSG     1   4 78
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I@INFDA      DS
     I                                    B 397 4000@@RCA
     I@INFDB      DS
     I                                    B 397 4000@@RCB
     I            DS
     I                                        1  140W@TIME
     I                                        1   60W@HMS
     I                                        7  140W@YMD
     I                                        7  100W@YY
     I                                       11  120W@MM
     I                                       13  140W@DD
     I            DS
     I                                        1   60@@MDY
     I                                        1   20@@MM
     I                                        3   40@@DD
     I                                        5   60@@YY
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C           W@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#FCEP    KLIST
     C                     KFLD           K@PRT1  5
     C                     KFLD           K@PRT2  5
     C                     KFLD           K@PRT3  2
      *
     C                     Z-ADD*ZERO     RRN1    40
     C                     Z-ADD*ZERO     @@RRN   40
     C                     MOVEL'01'      W@ID    2
      *
     C                     EXSR #SET
      *
     C                     ENDSR
      *------------------------------------------------------
      *  SET DATA FOR SUBFILE
      *------------------------------------------------------
     C           #SET      BEGSR
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1
      *
     C           *LOVAL    SETLLFCEPL40
     C           *IN90     DOUEQ*ON
     C                     READ FCEPL40             N    90
     C           *IN90     IFEQ *OFF
     C           F4GSKD    ANDEQ*BLANK
     C                     ADD  1         RRN1
     C                     Z-ADDRRN1      S@NBR
     C                     MOVE F4PRT1    S@PRT1
     C                     MOVE F4PRT2    S@PRT2
     C                     MOVE F4PRT3    S@PRT3
     C                     MOVE F4HPR1    S@HPR1
     C                     MOVE F4HPR2    S@HPR2
     C                     MOVE F4HPR3    S@HPR3
     C                     MOVE F4PRT1    H@PRT1
     C                     MOVE F4PRT2    H@PRT2
     C                     MOVE F4PRT3    H@PRT3
     C                     MOVE F4HPR1    H@HPR1
     C                     MOVE F4HPR2    H@HPR2
     C                     MOVE F4HPR3    H@HPR3
     C                     Z-ADD@@RCA     H@RCNO
     C                     WRITESFL01
     C                     ENDIF
     C                     ENDDO
      *
     C           RRN1      IFEQ *ZERO
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDIF
      *
     C           @@RRN     IFEQ *ZERO
     C                     Z-ADD1         #RCNO
     C                     ELSE
     C                     Z-ADD@@RRN     #RCNO
     C                     ENDIF
      *
     C                     Z-ADD*ZERO     D@NBR
     C                     MOVE *BLANK    D@OPTN
      *
     C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE *OFF      *IN50
     C                     MOVELCMD,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     WRITECTL01
     C                     MOVE *OFF      *IN51
     C                     Z-ADD@@REC     #RCNO
     C                     EXFMTDSP01
      *
     C                     SELEC
      * F3:END
     C           *INKC     WHEQ *ON
JW   C           *INKA     OREQ *ON
     C                     MOVEL'99'      W@ID
JW    * F7:DOWNLOAD
     C           *INKG     WHEQ *ON
     C                     CALL 'FCEC51'
     C                     MOVEL'99'      W@ID
      * ENTR
     C                     OTHER
     C                     EXSR #CHK1
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
      *
     C                     SELEC
     C           D@OPTN    WHEQ '0'
     C           D@OPTN    OREQ '1'
     C           D@NBR     IFEQ *ZERO
     C                     MOVEA'11'      *IN,61
     C                     MOVE *ON       *IN99
     C                     MOVE MSG,1     D@MSG
     C                     ELSE
     C           D@NBR     CHAINSFL01                90
     C           *IN90     IFEQ *ON
     C                     MOVE *ON       *IN62
     C                     MOVE *ON       *IN99
     C                     MOVE MSG,2     D@MSG
     C                     ELSE
     C                     MOVE S@PRT1    D@PRT1
     C                     MOVE S@PRT2    D@PRT2
     C                     MOVE S@PRT3    D@PRT3
     C                     MOVE S@HPR1    D@HPR1
     C                     MOVE S@HPR2    D@HPR2
     C                     MOVE S@HPR3    D@HPR3
     C                     Z-ADDH@RCNO    XXREC   90
     C                     MOVE '02'      W@ID
     C                     ENDIF
     C                     ENDIF
      *
     C           D@OPTN    WHEQ '2'
     C                     CLEARDSP02
     C                     MOVE '02'      W@ID
     C                     ENDSL
      *
     C                     ENDSR
      *
      *------------------------------------------------------
      *  CLEAR
      *------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    D@MSG
     C                     MOVEA'00000000'*IN,60
      *
     C                     ENDSR
      *------------------------------------------------------
      *   2ND SCREEN
      *------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVE *ON       *IN50
     C                     MOVELCMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     WRITECTL01
     C                     MOVE *OFF      *IN51
     C                     Z-ADD@@REC     #RCNO
     C                     WRITEDSP01
     C                     EXFMTDSP02
      *
     C                     SELEC
      * F3
     C           *INKC     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C           *INKL     WHEQ *ON
     C                     MOVEL'01'      W@ID
     C                     EXSR #CLR
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD
     C                     EXSR #SET
     C                     MOVE '01'      W@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CHECK
      *------------------------------------------------------
     C           #CHK2     BEGSR
      *
     C                     EXSR #CLR
      *
     C                     MOVE D@PRT1    K@PRT1
     C                     MOVE D@PRT2    K@PRT2
     C                     MOVE D@PRT3    K@PRT3
     C           K#FCEP    SETLLFCEPL40
     C           *IN90     DOUEQ*ON
     C           K#FCEP    READEFCEPL40             N    90
     C           *IN90     IFEQ *OFF
     C           F4GSKD    ANDEQ*BLANK
     C           F4HPR1    ANDEQD@HPR1
     C           F4HPR2    ANDEQD@HPR2
     C           F4HPR3    ANDEQD@HPR3
      * NEW
     C           D@OPTN    IFEQ '2'
     C                     MOVE *ON       *IN63
     C                     MOVE *ON       *IN99
     C                     MOVE MSG,3     D@MSG
     C                     LEAVE
     C                     ENDIF
      * CHANGE
     C           D@OPTN    IFEQ '1'
     C           @@RCA     ANDNEXXREC
     C                     MOVE *ON       *IN63
     C  N99                MOVE MSG,3     D@MSG
     C                     MOVE *ON       *IN99
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           K#FCEP    CHAINFCEPL01              90
     C           *IN90     IFEQ *ON
     C                     MOVE *ON       *IN63
     C  N99                MOVE MSG,4     D@MSG
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     MOVE D@HPR1    K@PRT1
     C                     MOVE D@HPR2    K@PRT2
     C                     MOVE D@HPR3    K@PRT3
     C           K#FCEP    CHAINFCEPL01              90
     C           *IN90     IFEQ *ON
     C                     MOVE *ON       *IN64
     C  N99                MOVE MSG,4     D@MSG
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           K#FCEP    SETLLFCEPL41
     C           *IN90     DOUEQ*ON
     C           K#FCEP    READEFCEPL41                  90
     C           *IN90     IFEQ *OFF
     C           F4GSKD    ANDEQ*BLANK
     C           F4PRT1    ANDEQD@PRT1
     C           F4PRT2    ANDEQD@PRT2
     C           F4PRT3    ANDEQD@PRT3
      *
     C           D@OPTN    IFEQ '2'
     C                     MOVE *ON       *IN64
     C  N99                MOVE MSG,3     D@MSG
     C                     MOVE *ON       *IN99
     C                     LEAVE
     C                     ENDIF
      * CHANGE
     C           D@OPTN    IFEQ '1'
     C           @@RCB     ANDNEXXREC
     C                     MOVE *ON       *IN64
     C  N99                MOVE MSG,3     D@MSG
     C                     MOVE *ON       *IN99
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  UPDATE
      *------------------------------------------------------
     C           #UPD      BEGSR
      *
     C                     MOVE H@PRT1    K@PRT1
     C                     MOVE H@PRT2    K@PRT2
     C                     MOVE H@PRT3    K@PRT3
      * DELETE
     C                     SELEC
     C           D@OPTN    WHEQ '0'
     C           K#FCEP    SETLLFCEPL40
     C           *IN90     DOUEQ*ON
     C           K#FCEP    READEFCEPL40                  90
     C           *IN90     IFEQ *OFF
     C           F4GSKD    ANDEQ*BLANK
     C                     MOVE 'D'       F4GSKD
     C                     Z-ADD*DATE     F4GSDT
     C                     Z-ADD*DATE     F4GKDT
     C                     TIME           F4GTIM
     C                     MOVEL#USER     F4GKNM
     C                     UPDATFCEPP401
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      * CHANGE
     C           D@OPTN    WHEQ '1'
     C           K#FCEP    SETLLFCEPL40
     C           *IN90     DOUEQ*ON
     C           K#FCEP    READEFCEPL40                  90
     C           *IN90     IFEQ *OFF
     C           F4GSKD    ANDEQ*BLANK
     C                     Z-ADD*DATE     F4GKDT
     C                     TIME           F4GTIM
     C                     MOVEL#USER     F4GKNM
     C                     MOVELD@PRT1    F4PRT1
     C                     MOVELD@PRT2    F4PRT2
     C                     MOVELD@PRT3    F4PRT3
     C                     MOVELD@HPR1    F4HPR1
     C                     MOVELD@HPR2    F4HPR2
     C                     MOVELD@HPR3    F4HPR3
     C                     UPDATFCEPP401
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      * ADD
     C           D@OPTN    WHEQ '2'
     C                     CLEARFCEPP401
     C                     Z-ADD*DATE     F4GKDT
     C                     TIME           F4GTIM
     C                     MOVEL#USER     F4GKNM
     C                     MOVELD@PRT1    F4PRT1
     C                     MOVELD@PRT2    F4PRT2
     C                     MOVELD@PRT3    F4PRT3
     C                     MOVELD@HPR1    F4HPR1
     C                     MOVELD@HPR2    F4HPR2
     C                     MOVELD@HPR3    F4HPR3
     C                     WRITEFCEPP401
      *
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
**  CMD
F3: EXIT   F7: DOWNLOAD TO CSV   ENTER: NEXT
F3: EXIT   F5: UPDATE    F12: GO BACK
**  MSG
PLS ENTER ONE OF THE NUMBERS.
THE NUMBER IS WRONG.
ALREADY EXISTS IN THE FILE.
PART# ERROR.
