     H            Y.
     FFCEPL01 IF  E           K        DISK
     C           *ENTRY    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@ZETI  4
      *
     C                     MOVE *BLANK    P@ZETI
      *
     C                     MOVE P@HIN1    K@HIN1  5
     C                     MOVE P@HIN2    K@HIN2  5
     C                     MOVE P@HIN3    K@HIN3  2
      *
     C           KEY       KLIST
     C                     KFLD           K@HIN1  5
     C                     KFLD           K@HIN2  5
     C                     KFLD           K@HIN3  2
      *
     C           KEY       CHAINFCEPL01              77
     C           *IN77     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C                     SETON                     77
     C                     END
     C                     END
      *
     C           *IN77     IFEQ '0'
     C                     MOVE A2ZETI    P@ZETI
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
