     H            Y/
     F***************************************************
     F*   ASJ PRICE INQUIRY                             *
     F*       MAR/24/2003       TCH                     *
     F*                                                 *
     F*   MODIFICAITON:                                 *
     F*                                                 *
     F*                                                 *
     F***************************************************
     FFCEPW47 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                        RRN2  KSFILE SFL02
     F                                              KINFDS @INFDS
     FBBCDDM  IF  E           K        DISK
     FBBDDDM  IF  E           K        DISK
     FGKGDDM  IF  E           K        DISK
      *------------------------------------------------------------
     E                    CMD     1   2 78
     E                    MSG     1   1 78
     E                    TTL     1   4 20
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1  12 A2PART
     I                                        1   5 A2BHB1
     I                                        6  10 A2BHB2
     I                                       11  12 A2BHB3
     I            DS
     I                                        1   60K@YYMM
     I                                        1   40K@YY
     I                                        5   60K@MM
     I            DS
     I                                        1   60E@YYMM
     I                                        1   40E@YY
     I                                        5   60E@MM
     I            DS
     I                                        1   80WSTART
     I                                        1   40A2TAYY
     I                                        5   60A2TAMM
     I                                        7   80A2TADD
     I            DS
     I                                        1   80WEND
     I                                        1   40A2UTYY
     I                                        5   60A2UTMM
     I                                        7   80A2UTDD
     I            DS
     I                                        1   80WVALD
     I                                        1   40BCKSY4
     I                                        5   60BCKSMM
     I                                        7   80BCKSDD
     I            DS
     I                                        1   80WVALD2
     I                                        1   40BDKSY4
     I                                        5   60BDKSMM
     I                                        7   80BDKSDD
     I            DS
     I                                        1   80WTO
     I                                        1   40BCKEY4
     I                                        5   60BCKEMM
     I                                        7   80BCKEDD
     I            DS
     I                                        1   80WTO2
     I                                        1   40BDKEY4
     I                                        5   60BDKEMM
     I                                        7   80BDKEDD
     I            DS
     I                                        1   80WVALD3
     I                                        1   40GKSTYY
     I                                        5   60GKSTMM
     I                                        7   80GKSTDD
     I            DS
     I                                        1   80WTO3
     I                                        1   40GKEDYY
     I                                        5   60GKEDMM
     I                                        7   80GKEDDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C           W@ID      CASEQ'02'      #SCRN2
     C           W@ID      CASEQ'03'      #SCRN3
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#KC      KLIST
     C                     KFLD           D@KAT1
     C                     KFLD           D@KAT2
     C                     KFLD           D@KAT3
     C           K#KD      KLIST
     C                     KFLD           D@WHN1
     C                     KFLD           D@WHN2
     C                     KFLD           D@WHN3
     C                     KFLD           K@TOKU
     C           K#KE      KLIST
     C                     KFLD           D@PHN1
     C                     KFLD           D@PHN2
     C                     KFLD           D@PHN3
     C                     KFLD           K@TOKU
      *
     C                     Z-ADD0111      K@TOKU  40
     C                     Z-ADD0111      K@NONY  40
     C                     MOVE '01'      W@ID    2
      *
     C                     ENDSR
      *------------------------------------------------------
      *  1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           D@KAT1    IFNE *BLANK
     C                     MOVE '02'      W@ID
     C                     ELSE
     C                     MOVE '03'      W@ID
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
      *
     C                     MOVE *ON       *IN99
     C                     SELEC
     C           D@KAT1    WHNE *BLANK
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
      *
     C           K#KC      SETGTGKGDDM
     C           *IN90     DOUEQ*ON
     C           K#KC      REDPEGKGDDM                   90
     C           *IN90     IFEQ *OFF
     C           GKSKJY    ANDEQ*BLANK
     C*****      WTO3      ANDGE*DATE
     C           RRN1      IFEQ *ZERO
     C                     MOVELTTL,1     D@NAME    P
     C           D@KAT1    CAT  '-':0     D@CODE    P
     C           D@CODE    CAT  D@KAT2:0  D@CODE    P
     C           D@KAT3    IFNE *BLANK
     C           D@CODE    CAT  '-':0     D@CODE    P
     C           D@CODE    CAT  D@KAT3:0  D@CODE    P
     C                     ENDIF
     C                     ENDIF
     C                     CLEARSFL01
     C                     Z-ADDGKNHTN    S@PRCE
     C                     Z-ADDWVALD3    S@FROM
     C                     Z-ADDWTO3      S@TO
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     MOVE *OFF      *IN99
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           D@WHN1    WHNE *BLANK
     C                     MOVE *ON       *IN54
     C                     WRITECTL02
     C                     MOVE *OFF      *IN54
     C                     Z-ADD*ZERO     RRN2    40
      *
     C           K#KD      SETGTBBCDDM
     C           *IN90     DOUEQ*ON
     C           K#KD      REDPEBBCDDM                   90
     C           *IN90     IFEQ *OFF
     C           BCSKJY    ANDEQ*BLANK
     C********   WTO       ANDGE*DATE
     C           RRN2      IFEQ *ZERO
     C                     MOVELTTL,2     D@NAME    P
     C           D@WHN1    CAT  '-':0     D@CODE    P
     C           D@CODE    CAT  D@WHN2:0  D@CODE    P
     C           D@WHN3    IFNE *BLANK
     C           D@CODE    CAT  '-':0     D@CODE    P
     C           D@CODE    CAT  D@WHN3:0  D@CODE    P
     C                     ENDIF
     C                     ENDIF
     C                     CLEARSFL02
     C                     ADD  1         RRN2
     C                     Z-ADDBCKTNK    S@UPRC
     C                     Z-ADDWVALD     S@FROM
     C                     Z-ADDWTO       S@TO
     C                     WRITESFL02
     C                     MOVE *OFF      *IN99
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN99     IFEQ *ON
     C           K#KD      SETGTBBDDDM
     C           *IN90     DOUEQ*ON
     C           K#KD      REDPEBBDDDM                   90
     C           *IN90     IFEQ *OFF
     C           BDSKJY    ANDEQ*BLANK
     C******     WTO2      ANDGE*DATE
     C           RRN2      IFEQ *ZERO
     C                     MOVELTTL,2     D@NAME    P
     C           D@WHN1    CAT  '-':0     D@CODE    P
     C           D@CODE    CAT  D@WHN2:0  D@CODE    P
     C           D@WHN3    IFNE *BLANK
     C           D@CODE    CAT  '-':0     D@CODE    P
     C           D@CODE    CAT  D@WHN3:0  D@CODE    P
     C                     ENDIF
     C                     ENDIF
     C                     CLEARSFL02
     C                     MOVELTTL,4     S@TRL
     C                     Z-ADDBDKTNK    S@UPRC
     C                     Z-ADDWVALD2    S@FROM
     C                     Z-ADDWTO2      S@TO
     C                     ADD  1         RRN2
     C                     WRITESFL02
     C                     MOVE *OFF      *IN99
      *
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
      *
     C           D@PHN1    WHNE *BLANK
     C                     MOVE *ON       *IN54
     C                     WRITECTL02
     C                     MOVE *OFF      *IN54
     C                     Z-ADD*ZERO     RRN2    40
     C           K#KE      SETGTBBCDDM
     C           *IN90     DOUEQ*ON
     C           K#KE      REDPEBBCDDM                   90
     C           *IN90     IFEQ *OFF
     C           BCSKJY    ANDEQ*BLANK
     C*******    WTO       ANDGE*DATE
     C           RRN2      IFEQ *ZERO
     C                     MOVELTTL,3     D@NAME    P
     C           D@PHN1    CAT  '-':0     D@CODE    P
     C           D@CODE    CAT  D@PHN2:0  D@CODE    P
     C           D@PHN3    IFNE *BLANK
     C           D@CODE    CAT  '-':0     D@CODE    P
     C           D@CODE    CAT  D@PHN3:0  D@CODE    P
     C                     ENDIF
     C                     ENDIF
     C                     CLEARSFL02
     C                     Z-ADDBCKTNK    S@UPRC
     C                     Z-ADDWVALD     S@FROM
     C                     Z-ADDWTO       S@TO
     C                     ADD  1         RRN2
     C                     WRITESFL02
     C                     MOVE *OFF      *IN99
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN99     IFEQ *ON
     C           K#KE      SETGTBBDDDM
     C           *IN90     DOUEQ*ON
     C           K#KE      REDPEBBDDDM                   90
     C           *IN90     IFEQ *OFF
     C           BDSKJY    ANDEQ*BLANK
     C********   WTO2      ANDGE*DATE
     C           RRN2      IFEQ *ZERO
     C                     MOVELTTL,3     D@NAME    P
     C           D@PHN1    CAT  '-':0     D@CODE    P
     C           D@CODE    CAT  D@PHN2:0  D@CODE    P
     C           D@PHN3    IFNE *BLANK
     C           D@CODE    CAT  '-':0     D@CODE    P
     C           D@CODE    CAT  D@PHN3:0  D@CODE    P
     C                     ENDIF
     C                     ENDIF
     C                     CLEARSFL02
     C                     Z-ADDBDKTNK    S@UPRC
     C                     Z-ADDWVALD2    S@FROM
     C                     Z-ADDWTO2      S@TO
     C                     MOVELTTL,4     S@TRL
     C                     ADD  1         RRN2
     C                     WRITESFL02
     C                     MOVE *OFF      *IN99
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     ENDSL
      *
     C           *IN99     IFEQ *ON
     C                     MOVE *ON       *IN99
     C                     MOVE MSG,1     D@MSG
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CLEAR
      *------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVE *BLANK    D@MSG
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00000000'*IN,60
      *
     C                     ENDSR
      *
      *------------------------------------------------------
      *   2ND SCREEN
      *------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVELCMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SELEC
      *
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C           *INKL     WHEQ *ON
     C                     MOVEL'01'      W@ID
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *   3RD SCREEN
      *------------------------------------------------------
     C           #SCRN3    BEGSR
      *
     C                     MOVELCMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN53
     C                     EXFMTCTL02
     C                     MOVE *OFF      *IN53
      *
     C                     SELEC
      *
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C           *INKL     WHEQ *ON
     C                     MOVEL'01'      W@ID
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
**  CMD
F1:END    ENTER:NEXT
F1:END    F12:GO BACK
**  MSG
NO DATA
**  TTL
<< DIE >>
<< WASHER >>
<< PASS THROUGH >>
(TRIAL PRICE)
