     H            Y.                                                      MER040
     F***********************************************
     F* COMMON PART M/F LIST -USER PART NUMBER ORDER *
     F* A.SATOH 1982.02.02                          *
     F***********************************************
     FFAAPL05 IP  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     IFAAPL051    01
     I                                              B7TOKUL1
     I                                              B7SHN3          10
     IFGBPL011    03
     IFCEPL011    05
     I            DS
     I                                        1  20 MHBAN
     I                                        1   5 B7MHN1
     I                                        6  10 B7MHN2
     I                                       11  15 B7MHN3
     I                                       16  20 B7MHN4
     I                                       21  280WDATE
     I                                       21  240A2TRYY
     I                                       25  260A2TRMM
     I                                       27  280A2TRDD
     I                                       29  360SDATE
     I                                       29  320A2SYYY
     I                                       33  340A2SYMM
     I                                       35  360A2SYDD
     I                                       37  440SHIZU
     I                                       37  400B7SKYY
     I                                       41  420B7SKMM
     I                                       43  440B7SKDD
     C                     SETOF                     505130
     C                     TIME           WTIME   60
     C           B7SKBN    COMP 'D'                      50
     C   50      SHIZU     COMP *DATE                  5151
     C   01N51N31          SETON                     3031
     C   L1                SETOF                     12
     C           B7NONY    CHAINFGBPL01              04
     C  N04      B2SKJY    COMP 'D'                      04
     C                     SETOF                     202114
     C           WKEY      KLIST
     C                     KFLD           B7SHN1
     C                     KFLD           B7SHN2
     C                     KFLD           B7SHN3
     C   14                MOVE *BLANK    JYOTAI  8
     C           WKEY      CHAINFCEPL01              14
     C           *IN14     IFEQ '1'
     C                     MOVE 'NO DEPT.'JYOTAI
     C                     ELSE
     C           A2GSKD    IFEQ 'D'
     C                     MOVE 'DELETED 'JYOTAI
     C                     ELSE
     C           A2TEHI    IFEQ 'G'
     C                     MOVE 'VOL.PROD'JYOTAI
     C                     END
     C           A2TEHI    IFEQ 'Z'
     C                     MOVE 'LIMITAT.'JYOTAI
     C                     END
     C           A2TEHI    IFEQ 'S'
     C                     MOVE 'TRIALMFG'JYOTAI
     C                     END
     C                     END
     C                     END
     C  N14      A2GSKD    COMP 'D'                      14
     C  N14      SDATE     COMP *DATE                222323
     C  N14 22             Z-ADDA2KSYS    WSYUY   50
     C  N14 23             Z-ADDA2SSYS    WSYUY
     C   14                Z-ADD0         WSYUY
     C  N14      WDATE     COMP *DATE                202121
     C   20                MOVE A2KTRK    B1      1
     C   20                MOVE A2KTRT    B2      2
     C   20                MOVE A2KTRR    B3      2
     C   20                MOVE A2KTRD    B4      1
     C   21                MOVE A2STRK    B1
     C   21                MOVE A2STRT    B2
     C   21                MOVE A2STRR    B3
     C   21                MOVE A2STRD    B4
     C   01N51   1         ADD  W         W       40
     C                     SETOF                     13
     C   01N12             SETON                     13
     C   01                SETON                     12
     CL0 OF                SETOF                     12
     OQPRINT  H  102   30
     O       OR        OF
     O                                  131 '+-------------------+'
     O        H  1     30
     O       OR        OF
     O                                  131 '|         |         |'
     O        H  1     30
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME Y   98
     O                                  131 '|         |         |'
     O        H  2     30
     O       OR        OF
     O                                   10 'FCER44-1'
     O                                   30 'ORDER BY USER P/N'
     O                                   56 '** COMMON PART NO.'
     O                                   76 'M/F ACCOUNT BOOK **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        H  2     30
     O       OR        OF
     O                                    8 'CUSTOMER'
     O                                   14 'DELV.'
     O                                   27 'DELV.CO.NAME'
     O                                   32 'F'
     O                                   38 'RCV.'
     O                                   53 'USER PART NO.'
     O                                   83 'INTRAL CO.PART NO.'
     O                                   93 'LOCATION'
     O                                  106 'ACCOM.QTY.'
     O                                  116 'M STATUS'
     O        D 1      01N51
     O                 13      B7TOKU     6
     O                         B7NONY    13
     O                         B2SMEI    30
     O                         B7NKJO    32
     O                         B7NUKE    38
     O                         MHBAN     60
     O                         B7SHN1    70
     O                                   71 '-'
     O                         B7SHN2    76
     O                N10                77 '-'
     O                         B7SHN3    79
     O                N14 05   B1        86
     O                                   87 '-'
     O                N14 05   B2        89
     O                                   90 '-'
     O                N14 05   B3        92
     O                                   93 '-'
     O                N14 05   B4        94
     O                         WSYUY 2  105
     O                         JYOTAI   116
     O        T   64   LR
     O                                   65 'M/F COUNT'
     O                         W     Z   70
