     H            Y.
     F** FCERS4 *************************************
     F* ZETI -> INT. PART NO.                       *
     F* 2021.03.09 T.SAKASHITA                      *
     F************************************* FCER11 **
     FFCEPL07 IF  E           K        DISK
      *
     C           *ENTRY    PLIST
     C                     PARM           P@ZETI  4
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
      *
     C                     MOVE P@ZETI    K@ZETI  4
      *
     C                     MOVE *BLANK    P@HIN1
     C                     MOVE *BLANK    P@HIN2
     C                     MOVE *BLANK    P@HIN3
      *
     C           KEY       KLIST
     C                     KFLD           K@ZETI  4
      *
     C           KEY       CHAINFCEPL07              77
     C           *IN77     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C                     SETON                     77
     C                     END
     C                     END
      *
     C           *IN77     IFEQ '0'
     C                     MOVE A2BHB1    P@HIN1
     C                     MOVE A2BHB2    P@HIN2
     C                     MOVE A2BHB3    P@HIN3
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
