     H            Y.
     F**FCHR22************************************************
     F*     ...gfbﾉcﾒﾑhuﾇj- f[ ﾑﾒﾑhﾆﾞf] ﾑﾒﾑhﾇc ﾉ ibﾅ]...     *
     F*        I-HASADA                      85.01.09        *
     F*        T.TODA   CHANGES(20199)     2021.06.01        *
     F************************************************FCHR22**
     FMFAPP21 IF  E                    DISK
     F***FCHPL11 IF  E           K        DISK
     FGHCTL22 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     FFCHNP26 O   E                    DISK
     E                    SU         12  9 0             1-12 ﾆﾞlﾈgﾇc
     IFCHDS2     UDS
     I                                        1   10FNO
     I                                        2   2 FYN
     I                                        3   5 FZAC1
     I                                        6   8 FZAC2
     I                                        9  11 FZAC3
     I                                       12  152FKAZ1
     I                                       16  192FKAZ2
     I                                       20  20 FP1
     I                                       21  22 FCD11
     I                                       23  23 FCD12
     I                                       24  24 FCD13
     I                                       25  26 FCD21
     I                                       27  27 FCD22
     I                                       28  28 FCD23
     I                                       29  332FKUB1
     I                                       34  382FKUB2
     I                                       39  39 FP2
     I                                       40  441FZUR1
     I                                       45  491FZUR2
     I                                       50  521FKIK1
     I                                       53  53 FP3
     I                                       54  581FHKS1
     I                                       59  631FHKS2
     I                                       64  661FTUS1
     I                                       67  691FTUS2
     I                                       70  70 FP4
     I                                       71  75 FHIN1
     I                                       76  80 FHIN2
     I                                       81  82 FHIN3
     I                                       83  872FGK11
     I                                       88  902FGK12
     I                                       91  932FGK13
     I                                       94  982FGK21
     I                                       99 1012FGK22
     I                                      102 1042FGK23
     I                                      105 1100FYM
     I                                      105 1080FYY
     I                                      109 1100FMM
     I                                      111 1120FCD
     I                                      113 1162FIA11
     I                                      117 1192FIA12
     I                                      120 1222FIA13
     I                                      123 1262FIA21
     I                                      127 1292FIA22
     I                                      130 1322FIA23
     I                                      133 133 FSET
     I                                      134 136 FKOT1
     I                                      137 140 FKBM1
     I                                      141 143 FKOT2
     I                                      144 147 FKBM2
     I                                      148 150 FKOT3
     I                                      151 154 FKBM3
     I                                      155 157 FKOT4
     I                                      158 161 FKBM4
     I                                      162 164 FKNO1
     I                                      165 167 FKNO2
     I                                      168 170 FKNO3
     I                                      171 173 FKNO4
     I                                      174 176 FKNO5
     I                                      177 179 FKNO6
     I                                      180 182 FKNO7
     I                                      183 185 FKNO8
     I                                      186 1881FKIK2
     I            DS
     I                                        1   40WYHM
     I                                        1   20WYHH
     I                                        3   40WYMM
     I            DS
     I                                        7  140M@SKHZ
     I                                        7  100M@SKYY
     I                                       11  120M@SKMM
     I                                       13  140M@SKDD
     I            DS
     I                                        7  120M8SKHZ
     I                                        7   80M8SKYY
     I                                        9  100M8SKMM
     I                                       11  120M8SKDD
      *
     C           KEY       KLIST
     C                     KFLD           M@KOJY
     C                     KFLD           M@KBN1
      *
     C           BKEY      KLIST
     C                     KFLD           FYY
     C                     KFLD           MCJHN1
     C                     KFLD           MCJHN2
     C                     KFLD           MCJHN3
      *
     C           *NAMVAR   DEFN           FCHDS2
     C           *LOCK     IN   *NAMVAR
     C                     Z-ADDFMM       D       20
      *
     C           VTP1      TAG
     C                     SETOF                     04
     C                     READ MFAPP211                 04
     C   04                GOTO END
     C           M@SKJY    IFEQ 'D'
     C           M@SKHZ    IFLE UDATE
     C                     GOTO VTP1
     C                     END
     C                     END
      *
     C           KEY       SETLLGHCTL221
     C           STP12     TAG
     C                     SETOF                     01
     C                     READ GHCTL221                 01
     C   01                GOTO END
     C           M@KOJY    IFEQ MCMBMN
     C           M@KBN1    IFEQ MCMSNO
     C                     GOTO STP1
     C                     END
     C                     END
     C                     GOTO END
      *
     C           STP1      TAG
     C                     SETOF                     10
     C                     Z-ADD0         WSTSS   20
     C                     Z-ADD0         WSTHH   20
     C                     Z-ADD0         WKADO   52
     C                     Z-ADD0         WSPCY   50
     C***        KEY       CHAINFCHPL111             10
     C*          *IN10     IFEQ '0'
     C*          M8SKJY    ANDEQ'D'
     C*          M8SKHZ    ANDLEUDATE
     C*                    SETON                     10
     C*                    END
     C*          *IN10     IFEQ '0'
     C*                    Z-ADDM8STSS    WSTSS
     C*                    Z-ADDM8STHH    WSTHH
     C*                    Z-ADDM8KADO    WKADO
     C*                    Z-ADDM8SPCY    WSPCY
     C***                  END
      *
     C                     SETOF                     01
     C           BKEY      CHAINMBEPL051             01
     C   01                GOTO STP12
      *
     C                     Z-ADDI6SRO1    SU,1
     C                     Z-ADDI6SRO2    SU,2
     C                     Z-ADDI6SRO3    SU,3
     C                     Z-ADDI6SRO4    SU,4
     C                     Z-ADDI6SRO5    SU,5
     C                     Z-ADDI6SRO6    SU,6
     C                     Z-ADDI6SRO7    SU,7
     C                     Z-ADDI6SRO8    SU,8
     C                     Z-ADDI6SRO9    SU,9
     C                     Z-ADDI6SROA    SU,10
     C                     Z-ADDI6SROB    SU,11
     C                     Z-ADDI6SROC    SU,12
     C                     ADD  SU,D      TTSU    90
     C                     GOTO STP12
     C           END       TAG
      *
     C           TTSU      DIV  FCD       KD      90
     C           WSTSS     IFEQ 0
     C                     Z-ADD0         WJKAN   42
     C                     ELSE
     C           WSTSS     DIV  0.6       WJKAN
     C                     END
      *
     C           WJKAN     ADD  WSTHH     WJKAN   42
     C           WKADO     DIV  100       WR1     54
     C           WSPCY     MULT WR1       WHDKA   90
     C                     Z-ADD0         KST1
     C           WHDKA     IFNE 0
     C           KD        DIV  WHDKA     KST1    42
     C                     END
      *
     C                     SETOF                     0203
     C                     Z-ADD0         WYHM
     C                     MOVE *BLANK    WYKB    1
     C           WJKAN     SUB  KST1      YRK     42   0302
     C   03                MOVE '-'       WYKB
     C           *IN02     IFEQ '0'
     C           YRK       MULT 60        WTF     40
     C           WTF       IFNE 0
     C           WTF       DIV  60        WYHH
     C                     MVR            WYMM
     C                     END
     C                     END
      *
     C           YRK       MULT WHDKA     WYSU    90
     C                     Z-ADDM@KOJY    O7CODE
     C                     MOVE M@KBN1    O7KIBA
     C           KST1      MULT 100       O7STHS
     C                     MOVE WYKB      O7YOKB
     C                     Z-ADDWYHM      O7YOHM
     C                     Z-ADDWYSU      O7YOSU
      *
     C                     WRITEFCHNP261
      *
     C                     Z-ADD0         TTSU
     C                     Z-ADD0         WSTSS
     C                     Z-ADD0         WSTHH
     C                     Z-ADD0         WKADO
     C                     Z-ADD0         WSPCY
      *
     C           *IN04     IFEQ '1'
     C                     OUT  *NAMVAR
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     GOTO VTP1
