     H            Y.
     F***FCHR31*********************************************
     F* MACHINE ABILITY M/F UPDATE                                  *
     F*            M-OKUDA             1983.06.16          *
     F******************************************************
     FFCHPW31 CF  E                    WORKSTN
     FFCHPL11 UF  E           K        DISK                      A
     FFGBPL01 IF  E           K        DISK
     FGHCTL22 IF  E           K        DISK
     FFCETL03 IF  E           K        DISK
     E                    ER      1  27 60               d[-xlﾈbﾆﾞ
     I            DS
     I                                        1   80SHIZK
     I                                        1   40M8SKYY
     I                                        5   60M8SKMM
     I                                        7   80M8SKDD
     I                                        9  160KHIZK
     I                                        9  120M8KOYY
     I                                       13  140M8KOMM
     I                                       15  160M8KODD
     I                                       17  220WTIME
     I                                       17  200KTIME
     I                                       17  180M8KOJJ
     I                                       19  200M8KOFF
     I                                       21  220WBYO
     I                                       23  25 KBAN
     I                                       23  23 K1
     I                                       24  24 K2
     I                                       25  25 K3
     C           *ENTRY    PLIST
     C                     PARM           PUSER  10
     C                     Z-ADD0         BMON
     C                     Z-ADD0         KHIZK
     C           STEP1     TAG
     C                     EXFMTFCHPW311
     C   KA                GOTO END
     C                     SETOF                     010203
     C                     SETOF                     99
     C           MENT      COMP '0'                      01nﾒiﾆ
     C  N01      MENT      COMP '1'                      02s]ﾃc
     C  N01N02   MENT      COMP '2'                      03lbf
     C  N01N02N03          SETON                     99
     C   99                MOVELER,1      MSG
     C   99                GOTO STEP1
     C   01                MOVE 'CNCL'    CMT     4
     C   02                MOVE 'CHG '    CMT
     C   03                MOVE 'ADD '    CMT
     C           BMON      CHAINFGBPL011             99
     C   99                MOVE ER,2      MSG
     C   99                GOTO STEP1
     C                     MOVELB2SMEI    BMEI   10
     C           KBAN      COMP *BLANK                   99
     C   99                MOVELER,3      MSG
     C   99                GOTO STEP1
     C           K1        COMP *BLANK                   99
     C   99                MOVELER,14     MSG
     C   99                GOTO STEP1
     C           K2        COMP *BLANK                   99
     C   99                MOVELER,15     MSG
     C   99                GOTO STEP1
     C           K3        COMP *BLANK                   99
     C   99                MOVELER,16     MSG
     C   99                GOTO STEP1
     C           KKEY      KLIST
     C                     KFLD           BMON
     C                     KFLD           KBAN
     C                     SETOF                     040506
     C           KKEY      CHAINFCHPL111             04
     C  N04      M8SKJY    COMP 'D'                      05
     C   05      SHIZK     COMP *DATE                  0606 06nﾒiﾆﾇﾞv
     C   01 06             SETON                     99
     C   99                MOVELER,4      MSG
     C   99                GOTO STEP1
     C   01 04             SETON                     99
     C   99                MOVELER,5      MSG
     C   99                GOTO STEP1
     C   02 04             SETON                     99
     C   99                MOVELER,6      MSG
     C   99                GOTO STEP1
     C   02 06             SETON                     99
     C   99                MOVELER,7      MSG
     C   99                GOTO STEP1
     C   03N04N06          SETON                     99
     C   99                MOVELER,8      MSG
     C   99                GOTO STEP1
     C           KBKEY     KLIST
     C                     KFLD           BMON
     C                     KFLD           KBAN
     C                     Z-ADD0         HCTR
     C                     Z-ADD0         WNSRYO
     C           KBKEY     SETLLGHCTL221
     C           STEP3     TAG
     C                     READ GHCTL221                 08
     C   08                GOTO STEP4
     C           BMON      CABNEMCMBMN    STEP4
     C           KBAN      CABNEMCMSNO    STEP4
     C           1         ADD  HCTR      HCTR    30
     C           MCSRYO    ADD  WNSRYO    WNSRYO  90
     C                     GOTO STEP3
     C           STEP4     TAG
     C                     Z-ADDHCTR      M8HKAT
     C                     Z-ADDWNSRYO    M8NAIJ
     C  N03                GOTO STEP2
     C                     MOVE *BLANK    M8KOTE
     C                     Z-ADD0         M8LOT1
     C                     Z-ADD0         M8LOT2
     C                     Z-ADD0         M8LOT3
     C                     Z-ADD0         M8LOT4
     C                     Z-ADD0         M8LOT5
     C                     Z-ADD0         M8ANZ1
     C                     Z-ADD0         M8ANZ2
     C                     Z-ADD0         M8ANZ3
     C                     Z-ADD0         M8ANZ4
     C                     Z-ADD0         M8ANZ5
     C                     MOVE *BLANK    M8KKR1
     C                     MOVE *BLANK    M8KKR2
     C                     MOVE *BLANK    M8KKR3
     C                     MOVE *BLANK    M8TOR1
     C                     MOVE *BLANK    M8TOR2
     C                     MOVE *BLANK    M8GRUP
     C                     Z-ADD0         M8SAIZ
     C                     Z-ADD0         M8KONY
     C                     Z-ADD0         M8KMIN
     C                     Z-ADD0         M8KMAX
     C                     Z-ADD0         M8DNJJ
     C                     Z-ADD0         M8DNMM
     C                     Z-ADD0         M8SPDI
     C                     Z-ADD0         M8SPCY
     C                     Z-ADD0         M8SPSY
     C                     Z-ADD0         M8KADO
     C                     MOVE *BLANK    M8KINO
     C                     MOVE *BLANK    M8KSIK
     C                     Z-ADD0         M8SEYY
     C                     Z-ADD0         M8SEMM
     C                     Z-ADD0         M8STHH
     C                     Z-ADD0         M8STSS
     C                     Z-ADD0         M8SESU
     C                     MOVE *BLANK    M8TANH
     C                     MOVE *BLANK    M8TANY
     C                     Z-ADD0         M8NORY
     C           STEP2     TAG
     C                     EXFMTFCHPW312
     C                     SETOF                     9907
     C   KC                MOVE *BLANK    MENT
     C   KC                Z-ADD0         BMON
     C   KC                MOVE *BLANK    KBAN
     C   KC                GOTO STEP1
     C   KJ                SETON                     07
     C   KJ                GOTO STEP2
     C           M8KKR1    COMP *BLANK                   99
     C   99                MOVELER,12     MSG
     C   99                GOTO STEP2
     C           M8KOTE    COMP *BLANK                   99
     C   99                MOVELER,13     MSG
     C   99                GOTO STEP2
     C           M8KOTE    CHAINFCETL031             99
     C   99                MOVELER,9      MSG
     C   99                GOTO STEP2
     C           M8KMIN    COMP M8KMAX               99
     C   99                MOVELER,25     MSG
     C   99                GOTO STEP2
     C           M8LOT1    COMP 0                        99
     C   99                MOVELER,10     MSG
     C   99                GOTO STEP2
     C           M8LOT2    COMP 0                        99
     C   99                MOVELER,17     MSG
     C   99                GOTO STEP2
     C           M8LOT3    COMP 0                        99
     C   99                MOVELER,18     MSG
     C   99                GOTO STEP2
     C           M8LOT4    COMP 0                        99
     C   99                MOVELER,19     MSG
     C   99                GOTO STEP2
     C           M8LOT5    COMP 0                        99
     C   99                MOVELER,20     MSG
     C   99                GOTO STEP2
     C           M8ANZ1    COMP 0                        99
     C   99                MOVELER,11     MSG
     C   99                GOTO STEP2
     C           M8ANZ2    COMP 0                        99
     C   99                MOVELER,21     MSG
     C   99                GOTO STEP2
     C           M8ANZ3    COMP 0                        99
     C   99                MOVELER,22     MSG
     C   99                GOTO STEP2
     C           M8ANZ4    COMP 0                        99
     C   99                MOVELER,23     MSG
     C   99                GOTO STEP2
     C           M8ANZ5    COMP 0                        99
     C   99                MOVELER,24     MSG
     C   99                GOTO STEP2
     C           M8STHH    COMP 24                   99
     C   99                MOVELER,26     MSG
     C   99                GOTO STEP2
     C           M8STSS    COMP 59                   99
     C   99                MOVELER,27     MSG
     C   99                GOTO STEP2
     C  NKE                GOTO STEP2
     C                     MOVE *DATE     KHIZK
     C   01                MOVE *DATE     SHIZK
     C  N01                Z-ADD0         SHIZK
     C   01                MOVE 'D'       M8SKJY
     C  N01                MOVE *BLANK    M8SKJY
     C                     MOVE PUSER     M8KMEI
     C                     TIME           WTIME
     C   03                MOVE BMON      M8BMON
     C   03                MOVE KBAN      M8KBAN
     C   04                WRITEFCHPL111
     C  N04                UPDATFCHPL111
     C                     MOVE *BLANK    MENT
     C                     MOVE *BLANK    KBAN
     C                     Z-ADD0         BMON
     C                     GOTO STEP1
     C           END       TAG
     C                     SETON                     LR
**
E-01 UPDATE INSTRUCTION IS NOT EITHER OF 0.1.2
E-02 THERE IS NOT SECTION CODE THAT INPUT
E-03 MACHINE NO ISN'T INPUT
E-04 CANCEL WAS APPOINTED,BUT IT IS CANCELLED ALREADY
E-05 CANCEL WAS APPOINTED,BUT M/F NOT EXIST
E-06 CHANGE WAS APPOINTED,BUT M/F NOT EXIST
E-07 CHANGE WAS APPOINTED,BUT M/F IS CANCELLED ALREADY
E-08 ADD WAS APPOINTED, BUT M/F IS INPUT ALREADY
E-09 THERE IS NOT PROCESS CODE THAT INPUT
E-10 LOT COEFFICIENT < 0- 1 > ISN'T INPUT
E-11 STANDARD COEFFICIENT < 0- 1 > ISN'T INPUT
E-12 TEAM CODE OF SET UP DEPARTMENT ISN'T INPUT
E-13 PROCESS CODE ISN'T INPUT
E-14 THE FIRST COLUMN OF MACHINE NO IS BLANK
E-15 THE SECOND COLUMN OF MACHINE NO  IS BLANK
E-16 THE THIRD COLUMN OF MACHINE NO  IS BLANK
E-17 LOT COEFFICIENT < 1- 3 > ISN'T INPUT
E-18 LOT COEFFICIENT <4-10> ISN'T INPUT
E-19 LOT COEFFICIENT <11-25> ISN'T INPUT
E-20 LOT COEFFICIENT <26-99> ISN'T INPUT
E-21 STANDARD COEFFICIENT < 1- 3 > ISN'T INPUT
E-22 STANDARD COEFFICIENT <4-10> ISN'T INPUT
E-23 STANDARD COEFFICIENT <11-25> ISN'T INPUT
E-24 STANDARD COEFFICIENT <26-99> ISN'T INPUT
E-25 MIN VALUE IS BIGGER THAN MAX VALUE BY NOMINAL LENGTH
E-26 HH OF SETTING TIME IS BIGGER THAN 24
E-27 MM OF SETTING TIME IS BIGGER THAN 59
