     H           _Y.
     F** FCHR21 ***************************
     F* ... MACHINE ABILITY EXAMINATION LIST *
     F*     NO.1 LIST
     F*     I-HASADA         85.01.11     *
     F*     T.TODA         2021.06.01     *
     F*       CHANGES(20199)              *
     F*************************** FCHR21 **
     FFCHNL20 IF  E           K        DISK                           UC
     FFCHNL21 IF  E           K        DISK                           UC
     FFCHNL22 IF  E           K        DISK                           UC
     FFCHNL23 IF  E           K        DISK                           UC
     FFCHNL24 IF  E           K        DISK                           UC
     FFGBPL01 IF  E           K        DISK
     FMFAPL22 IF  E           K        DISK
     FMFBPL20 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     FFCHNL26 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FGHCPL21 IF  E           K        DISK
     FFCJPPAT UF  F      12            DISK
     FQPRINT  O   F     132     OF     PRINTER                        UC
     E                    CKT         4  3               ﾃcmb
     E                    CKB         4  4               ﾎﾞy]
     E                    FKT         4  3               ﾃcmb s]f]
     E                    FKB         4  4 0             ﾎﾞy] s]f]
     E                    KOT        15  3               ﾃcmb uﾇj-
     E                    KBM        15  4 0             ﾎﾞy] uﾇj-
     E                    NAM        15  8               ﾎﾞy]xb
     E                    TKR        15  9               nﾃﾜﾌﾞ]k
     E                    SU         12  9 0             1-12 ﾆﾞlﾈgﾇc
     IFCJPPAT AA  48
     I                                        1  12 HINB
     IFCHDS2     UDS
     I                                        1   10FNO
     I                                        2   2 FYN
     I                                        3   5 FZAC1
     I                                        6   8 FZAC2
     I                                        9  11 FZAC3
     I                                       12  152FKAZ1
     I                                       16  192FKAZ2
     I                                       20  20 FP1
     I                                       21  22 FCD11
     I                                       23  23 FCD12
     I                                       24  24 FCD13
     I                                       25  26 FCD21
     I                                       27  27 FCD22
     I                                       28  28 FCD23
     I                                       29  332FKUB1
     I                                       34  382FKUB2
     I                                       39  39 FP2
     I                                       40  441FZUR1
     I                                       45  491FZUR2
     I                                       50  521FKIK1
     I                                       53  53 FP3
     I                                       54  581FHKS1
     I                                       59  631FHKS2
     I                                       64  661FTUS1
     I                                       67  691FTUS2
     I                                       70  70 FP4
     I                                       71  75 FHIN1
     I                                       76  80 FHIN2
     I                                       81  82 FHIN3
     I                                       83  872FGK11
     I                                       88  902FGK12
     I                                       91  932FGK13
     I                                       94  982FGK21
     I                                       99 1012FGK22
     I                                      102 1042FGK23
     I                                      105 1100FYM
     I                                      105 1080FYY
     I                                      109 1100FMM
     I                                      111 1120FCD
     I                                      113 1162FIA11
     I                                      117 1192FIA12
     I                                      120 1222FIA13
     I                                      123 1262FIA21
     I                                      127 1292FIA22
     I                                      130 1322FIA23
     I                                      133 133 FSET
     I                                      134 136 FKOT1
     I                                      137 140 FKBM1
     I                                      141 143 FKOT2
     I                                      144 147 FKBM2
     I                                      148 150 FKOT3
     I                                      151 154 FKBM3
     I                                      155 157 FKOT4
     I                                      158 161 FKBM4
     I                                      162 164 FKNO1
     I                                      165 167 FKNO2
     I                                      168 170 FKNO3
     I                                      171 173 FKNO4
     I                                      174 176 FKNO5
     I                                      177 179 FKNO6
     I                                      180 182 FKNO7
     I                                      183 185 FKNO8
     I                                      186 1881FKIK2
     I*
     I            DS
     I                                        1  12 CKT
     I                                        1   3 CKOT1
     I                                        4   6 CKOT2
     I                                        7   9 CKOT3
     I                                       10  12 CKOT4
     I*
     I            DS
     I                                        1  16 CKB
     I                                        1   4 CKBM1
     I                                        5   8 CKBM2
     I                                        9  12 CKBM3
     I                                       13  16 CKBM4
     I*
     I            DS
     I                                        1  45 KOT
     I                                        1   3 O7KOT1
     I                                        4   6 O7KOT2
     I                                        7   9 O7KOT3
     I                                       10  12 O7KOT4
     I                                       13  15 O7KOT5
     I                                       16  18 O7KOT6
     I                                       19  21 O7KOT7
     I                                       22  24 O7KOT8
     I                                       25  27 O7KOT9
     I                                       28  30 O7KO10
     I                                       31  33 O7KO11
     I                                       34  36 O7KO12
     I                                       37  39 O7KO13
     I                                       40  42 O7KO14
     I                                       43  45 O7KO15
     I*
     I            DS
     I                                        1  600KBM
     I                                        1   40O7KBM1
     I                                        5   80O7KBM2
     I                                        9  120O7KBM3
     I                                       13  160O7KBM4
     I                                       17  200O7KBM5
     I                                       21  240O7KBM6
     I                                       25  280O7KBM7
     I                                       29  320O7KBM8
     I                                       33  360O7KBM9
     I                                       37  400O7KB10
     I                                       41  440O7KB11
     I                                       45  480O7KB12
     I                                       49  520O7KB13
     I                                       53  560O7KB14
     I                                       57  600O7KB15
     I*
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I                                        9  160M@SKHZ
     I                                        9  120M@SKYY
     I                                       13  140M@SKMM
     I                                       15  160M@SKDD
     I                                       17  19 LKBAN
     I                                       17  17 LKB1
     I                                       18  19 LKB2
     I                                       20  230WYHM
     I                                       20  210WYHH
     I                                       22  230WYMM
     I            DS
     I                                        1   9 WTKRO
     I                                        1   1 WTKR1
     I                                        2   2 WT1
     I                                        3   4 WTKR2
     I                                        5   5 WT2
     I                                        6   7 WTKR3
     I                                        8   8 WT3
     I                                        9   9 WTKR4
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     SETOF                     08
     C           US        CHAINRGAPL111             08
     C           *IN08     IFEQ '0'
     C           J8SKJY    IFEQ *BLANK
     C                     MOVELJ8NAME    WUS    15
     C                     MOVELJ8NAME    WNS     9
     C                     END
     C                     END
     C           *NAMVAR   DEFN           FCHDS2
     C           *LOCK     IN   *NAMVAR
     C                     Z-ADDFMM       D       20
     C                     Z-ADD0         RCD
     C                     MOVE FKOT1     CKOT1
     C                     MOVE FKOT2     CKOT2
     C                     MOVE FKOT3     CKOT3
     C                     MOVE FKOT4     CKOT4
     C                     MOVE FKBM1     CKBM1
     C                     MOVE FKBM2     CKBM2
     C                     MOVE FKBM3     CKBM3
     C                     MOVE FKBM4     CKBM4
     C                     MOVE '-'       WT1
     C                     MOVE '-'       WT2
     C                     MOVE '-'       WT3
     C*
     C*
     C           FNO       COMP 1                        01
     C           FNO       COMP 2                        02
     C           FNO       COMP 3                        03
     C           FNO       COMP 4                        04
     C           FNO       COMP 5                        46
     C   01                OPEN FCHNL20
     C   02                OPEN FCHNL21
     C   03                OPEN FCHNL22
     C   04                OPEN FCHNL23
     C   46                OPEN FCHNL24
     C           STP1      TAG
     C                     SETOF                     0708
     C   01                READ FCHNL201                 07
     C   02                READ FCHNL211                 07
     C   03                READ FCHNL221                 07
     C   04                READ FCHNL231                 07
     C   46                READ FCHNL241                 07
     C   07                GOTO END
     C*
     C*-----------------------------------*
     C*     ...ﾅﾞbﾒﾑcﾃ-nﾞ  ﾉ  kdlh...     *
     C*-----------------------------------*
     C           FZAC1     IFNE *BLANK
     C           FZAC1     CABEQO7ZAIC    STP8       0808
     C                     END
     C           FZAC2     IFNE *BLANK
     C           FZAC2     CABEQO7ZAIC    STP8       0808
     C                     END
     C           FZAC3     IFNE *BLANK
     C           FZAC3     CABEQO7ZAIC    STP8       0808
     C                     END
     C   08                GOTO STP1
     C           STP8      TAG
     C*
     C*---------------------------------*
     C*     ...ﾍ]xbﾃ-nﾞ  ﾉ  kdlh...     *
     C*---------------------------------*
     C                     SETOF                     080910
     C                     SETOF                     11
     C           FCD11     IFNE *BLANK
     C                     SETON                     11
     C           FCD11     COMP O7BHIN               0808
     C                     END
     C           FCD12     IFNE *BLANK
     C                     SETON                     11
     C           FCD12     COMP O7BTIU               0909
     C                     END
     C           FCD13     IFNE *BLANK
     C                     SETON                     11
     C           FCD13     COMP O7BDAI               1010
     C                     END
     C           *IN11     IFEQ '1'
     C           *IN08     IFEQ '0'
     C           *IN09     IFEQ '0'
     C           *IN10     IFEQ '0'
     C                     GOTO VTP1
     C                     END
     C                     END
     C                     END
     C                     GOTO STP1
     C                     END
     C*
     C*
     C           FCD21     IFNE *BLANK
     C           FCD21     CABNEO7BHIN    STP1
     C                     END
     C           FCD22     IFNE *BLANK
     C           FCD22     CABNEO7BTIU    STP1
     C                     END
     C           FCD23     IFNE *BLANK
     C           FCD23     CABNEO7BDAI    STP1
     C                     END
     C           VTP1      TAG
     C*
     C*----------------------------------*
     C*     ...f]ﾈbﾅﾞbib  ﾉ  kdlh...     *
     C*----------------------------------*
     C                     SETOF                     08
     C           FKAZ1     IFNE 0
     C           O7KAZI    COMP FKAZ1                  08
     C                     END
     C  N08      FKAZ2     IFNE 0
     C           O7KAZI    COMP FKAZ2                08
     C                     END
     C           FP1       IFNE *BLANK
     C           *IN08     IFEQ '1'
     C           FP1       CABNE'N'       STP1
     C                     ELSE
     C           FP1       CABNE'Y'       STP1
     C                     END
     C                     END
     C*
     C*------------------------------*
     C*     ...hﾍﾞﾆj  ﾉ  kdlh...     *
     C*------------------------------*
     C                     SETOF                     08
     C           FKUB1     IFNE 0
     C           O7KUBI    COMP FKUB1                  08
     C                     END
     C  N08      FKUB2     IFNE 0
     C           O7KUBI    COMP FKUB2                08
     C                     END
     C           FP2       IFNE *BLANK
     C           *IN08     IFEQ '1'
     C           FP2       CABNE'N'       STP1
     C                     ELSE
     C           FP2       CABNE'Y'       STP1
     C                     END
     C                     END
     C*
     C*------------------------------*
     C*     ...gﾑcnﾞ  ﾉ  kdlh...     *
     C*------------------------------*
     C                     SETOF                     08
     C           FKIK1     IFNE 0
     C           O7KIKI    COMP FKIK1                  08
     C                     END
     C  N08      FKIK2     IFNE 0
     C           O7KIKI    COMP FKIK2                08
     C                     END
     C           FP3       IFNE *BLANK
     C           *IN08     IFEQ '1'
     C           FP3       CABNE'N'       STP1
     C                     ELSE
     C           FP3       CABNE'Y'       STP1
     C                     END
     C                     END
     C*
     C*---------------------------------*
     C*     ...lcﾆﾑcﾅbﾇﾞ ﾉ  kdlh...     *
     C*---------------------------------*
     C                     SETOF                     08
     C           FTUS1     IFNE 0
     C           O7TUSZ    COMP FTUS1                  08
     C                     END
     C  N08      FTUS2     IFNE 0
     C           O7TUSZ    COMP FTUS2                08
     C                     END
     C           FP4       IFNE *BLANK
     C           *IN08     IFEQ '1'
     C           FP4       CABNE'N'       STP1
     C                     ELSE
     C           FP4       CABNE'Y'       STP1
     C                     END
     C                     END
     C*
     C*--------------------------------*
     C*     ...ﾆﾞﾏcﾒﾑc  ﾉ  kdlh...     *
     C*--------------------------------*
     C                     SETOF                     08
     C           FZUR1     IFNE 0
     C           O7ZURY    COMP FZUR1                  08
     C                     END
     C  N08      FZUR2     IFNE 0
     C           O7ZURY    COMP FZUR2                08
     C                     END
     C   08                GOTO STP1
     C*
     C*---------------------------------*
     C*     ...ﾍajﾒﾌﾃﾇc  ﾉ  kdlh...     *
     C*---------------------------------*
     C                     SETOF                     08
     C           FHKS1     IFNE 0
     C           O7HKSU    COMP FHKS1                  08
     C                     END
     C  N08      FHKS2     IFNE 0
     C           O7HKSU    COMP FHKS2                08
     C                     END
     C   08                GOTO STP1
     C*
     C*----------------------------------*
     C*     ...ﾃcmb-ﾎﾞy]  ﾉ  kdlh...     *
     C*----------------------------------*
     C           FSET      CABEQ*BLANK    STP2
     C                     Z-ADD1         I
     C                     Z-ADD0         A       10
     C           1         DO   4         I
     C           CKT,I     IFEQ *BLANK
     C           CKB,I     IFEQ *BLANK
     C                     GOTO CTP1
     C                     END
     C                     END
     C                     ADD  1         A
     C                     MOVE CKT,I     FKT,A
     C                     MOVE CKB,I     FKB,A
     C           CTP1      TAG
     C                     END
     C*
     C*
     C                     SETON                     09
     C                     SETOF                     10
     C                     Z-ADD1         Y       10
     C                     Z-ADD1         I       20
     C                     Z-ADD0         L       20
     C           1         DO   15        I
     C           Y         CABGT4         STP2
     C           FKT,Y     IFEQ *BLANK
     C           FKB,Y     IFEQ 0
     C                     GOTO STP2
     C                     END
     C                     END
     C           FSET      IFEQ 'N'
     C           FKT,Y     IFNE *BLANK
     C           FKT,Y     CABNEKOT,I     STP4
     C                     END
     C           FKB,Y     IFNE 0
     C           FKB,Y     CABNEKBM,I     STP4
     C                     END
     C                     SETOF                     09
     C                     GOTO STP3
     C           STP4      TAG
     C   09                GOTO STP3
     C                     SETOF                     10
     C                     ADD  1         Y
     C           Y         CABGT4         STP2
     C           FKT,Y     IFNE *BLANK
     C                     SETON                     10
     C           FKT,Y     CABNEKOT,I     STP5
     C                     END
     C           FKB,Y     IFNE 0
     C                     SETON                     10
     C           FKB,Y     CABNEKBM,I     STP5
     C                     END
     C  N10                GOTO STP2
     C                     GOTO STP3
     C           STP5      TAG
     C                     SUB  1         Y
     C*
     C*
     C                     ELSE
     C           Y         CABGT4         STP2
     C           FKT,Y     IFNE *BLANK
     C           FKT,Y     CABNEKOT,I     STP6
     C                     END
     C           FKB,Y     IFNE 0
     C           FKB,Y     CABNEKBM,I     STP6
     C                     END
     C                     SETOF                     09
     C                     SETON                     10
     C                     ADD  1         Y
     C                     ADD  1         L
     C                     GOTO STP3
     C           STP6      TAG
     C   10                SUB  1         Y
     C   10                SETOF                     10
     C           L         IFGE 2
     C                     GOTO STP1
     C                     END
     C           STP3      TAG
     C                     END
     C                     END
     C*
     C*
     C           *IN09     IFEQ '1'
     C                     GOTO STP1
     C                     END
     C                     ADD  1         Y
     C           Y         IFLE 4
     C           FKT,Y     CABNE*BLANK    STP1
     C           FKB,Y     CABNE0         STP1
     C                     END
     C           STP2      TAG
     C*
     C*-----------------------------*
     C*     ...gﾌﾞ]  ﾉ  kdlh...     *
     C*-----------------------------*
     C                     SETOF                     08
     C           FKNO1     IFNE *BLANK
     C           FKNO1     CABEQO7KBAN    STP9       0808
     C                     END
     C           FKNO2     IFNE *BLANK
     C           FKNO2     CABEQO7KBAN    STP9       0808
     C                     END
     C           FKNO3     IFNE *BLANK
     C           FKNO3     CABEQO7KBAN    STP9       0808
     C                     END
     C           FKNO4     IFNE *BLANK
     C           FKNO4     CABEQO7KBAN    STP9       0808
     C                     END
     C           FKNO5     IFNE *BLANK
     C           FKNO5     CABEQO7KBAN    STP9       0808
     C                     END
     C           FKNO6     IFNE *BLANK
     C           FKNO6     CABEQO7KBAN    STP9       0808
     C                     END
     C           FKNO7     IFNE *BLANK
     C           FKNO7     CABEQO7KBAN    STP9       0808
     C                     END
     C           FKNO8     IFNE *BLANK
     C           FKNO8     CABEQO7KBAN    STP9       0808
     C                     END
     C   08                GOTO STP1
     C*
     C*
     C           STP9      TAG
     C           *IN12     IFEQ '0'
     C                     SETON                     1213
     C                     OPEN QPRINT
     C                     TIME           WTIME   60
     C                     EXCPTM1P
     C                     EXCPTMDS
     C                     END
     C*
     C*
     C                     SETOF                     080944
     C                     SETOF                     45
     C           O7KBAN    COMP WKBAN                0808
     C           O7MHIN    COMP WMHIN                0909
     C           AKEY      KLIST
     C                     KFLD           O7JHN1
     C                     KFLD           O7JHN2
     C                     KFLD           O7JHN3
     C                     KFLD           J       20
     C                     KFLD           WHKBN
     C                     MOVE *BLANK    WHKBN   1
     C                     MOVE *BLANK    TKR
     C                     SETOF                     47
     C           1         CHAINFCJPPAT              47
     C                     Z-ADD1         J
     C           1         DO   15        J
     C                     SETOF                     47
     C           AKEY      CHAINGHCPL211             47
     C           *IN47     IFEQ '1'
     C                     GOTO AP3
     C                     END
     C                     MOVE M7MBN1    WTKR1
     C                     MOVE M7MBN2    WTKR2
     C                     MOVE M7MBN3    WTKR3
     C                     MOVE M7MBN4    WTKR4
     C                     MOVE WTKRO     TKR,J
     C                     END
     C           AP3       TAG
     C                     EXCPTUP
     C*
     C*----------------------------------------------*
     C*     ...gﾌﾞ] ﾍ]ﾌﾞ] fﾞ fﾝljng p ﾒﾇnalﾎﾟ...     *
     C*----------------------------------------------*
     C           *IN13     IFEQ '0'
     C           *IN08     IFEQ '1'
     C                     SETON                     45
     C                     EXCPT
     C                     SETOF                     45
     C                     GOTO EX1
     C                     END
     C           *IN09     IFEQ '1'
     C                     SETON                     4445
     C                     EXCPT
     C                     SETOF                     4445
     C                     END
     C                     END
     C           EX1       TAG
     C   08N13             EXSR SUBRTN
     C*
     C*
     C                     Z-ADDO7BMON    WBMON   40
     C                     MOVE O7KBAN    WKBAN   3
     C                     MOVE O7MHIN    WMHIN  12
     C           *IN13     IFEQ '0'
     C           *IN08     IFEQ '1'
     C                     ADD  3         RCD     20
     C                     GOTO STP13
     C                     END
     C           *IN09     IFEQ '1'
     C                     ADD  2         RCD
     C                     END
     C           STP13     TAG
     C                     END
     C*
     C*
     C                     SETOF                     13
     C                     SETOF                     212223
     C                     SETOF                     242526
     C                     SETOF                     272829
     C                     SETOF                     303132
     C                     SETOF                     333435
     C                     SETOF                     363839
     C                     SETOF                     40
     C                     MOVE O7KBAN    LKBAN
     C                     Z-ADDO7SOZI    WSOZI   52
     C                     Z-ADDO7KASI    WKASI   52
     C           O7KUBN    COMP 'D'                      38
     C           O7MHN3    COMP *BLANK               3939
     C*
     C*--------------------------------*
     C*     ...ﾆﾞlﾈgﾇc  ･  ynxﾓ...     *
     C*--------------------------------*
     C           GKY       KLIST
     C                     KFLD           FYY
     C                     KFLD           O7JHN1
     C                     KFLD           O7JHN2
     C                     KFLD           O7JHN3
     C           GKY       CHAINMBEPL051             40
     C   40                GOTO FHP2
     C                     Z-ADDI6SRO1    SU,1
     C                     Z-ADDI6SRO2    SU,2
     C                     Z-ADDI6SRO3    SU,3
     C                     Z-ADDI6SRO4    SU,4
     C                     Z-ADDI6SRO5    SU,5
     C                     Z-ADDI6SRO6    SU,6
     C                     Z-ADDI6SRO7    SU,7
     C                     Z-ADDI6SRO8    SU,8
     C                     Z-ADDI6SRO9    SU,9
     C                     Z-ADDI6SROA    SU,10
     C                     Z-ADDI6SROB    SU,11
     C                     Z-ADDI6SROC    SU,12
     C                     ADD  SU,D      TTSU    90
     C           FHP2      TAG
     C  N08      O7JHIN    IFEQ WJHIN
     C                     GOTO STP1
     C                     END
     C                     MOVE O7JHIN    WJHIN  12
     C*
     C*---------------------------------*
     C*     ...ﾎﾞy]xb  ﾉ  ﾆﾏlﾒﾑh...     *
     C*---------------------------------*
     C                     Z-ADD1         F       20
     C                     Z-ADD20        G       20
     C                     MOVE *BLANK    NAM
     C           1         DO   15        F
     C           KBM,F     CABEQ0         STP11
     C           F         COMP 8                    36
     C                     ADD  1         G
     C                     MOVE '1'       *IN,G
     C                     Z-ADDKBM,F     WCODE   40
     C                     SETOF                     14
     C           WCODE     CHAINFGBPL011             14
     C   14                GOTO STP12
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    IFLE *DATE
     C                     GOTO STP12
     C                     END
     C                     END
     C                     MOVELB2SMEI    NAM,F
     C           STP12     TAG
     C                     END
     C           STP11     TAG
     C*
     C*
     C           *IN08     IFEQ '0'
     C                     GOTO STP14
     C                     END
     C           RCD       IFGT 51
     C                     Z-ADD1         RCD
     C                     TIME           WTIME   60
     C                     EXCPTMDS
     C                     END
     C*
     C*
     C                     SETOF                     4041
     C           MKY       KLIST
     C                     KFLD           O7BMON
     C                     KFLD           O7KBAN
     C           MKY       CHAINFCHNL261             40
     C           *IN40     IFEQ '1'
     C                     Z-ADD0         O7STHS
     C                     MOVE *BLANK    O7YOKB
     C                     Z-ADD0         O7YOHM
     C                     Z-ADD0         O7YOSU
     C                     END
     C           O7YOSU    COMP 0                      41
     C                     ADD  1         RCD
     C                     EXCPTDT1
     C           STP14     TAG
     C*
     C*
     C           RCD       IFGT 51
     C                     Z-ADD1         RCD
     C                     TIME           WTIME
     C                     EXCPTMDS
     C                     EXCPTDT1
     C                     END
     C                     ADD  4         RCD
     C                     EXCPTDT2
     C*
     C*
     C           *IN36     IFEQ '1'
     C           RCD       IFGT 51
     C                     Z-ADD1         RCD
     C                     TIME           WTIME
     C                     EXCPTMDS
     C                     EXCPTDT1
     C                     END
     C                     ADD  3         RCD
     C                     EXCPTDT3
     C                     END
     C*
     C*
     C                     ADD  O7JISU    TJISU  100
     C                     ADD  O7JISU    ZJISU  100
     C                     ADD  O7HKSU    THKSU   61
     C                     ADD  O7HKSU    ZHKSU   61
     C                     ADD  O7ZURY    TZURY   81
     C                     ADD  O7ZURY    ZZURY   81
     C                     GOTO STP1
     C*
     C*
     C           END       TAG
     C           *IN12     IFEQ '1'
     C                     SETOF                     44
     C                     SETON                     45
     C                     EXCPT
     C                     SETOF                     45
     C                     EXSR SUBRTN
     C                     CLOSEQPRINT
     C                     END
     C   01                CLOSEFCHNL20
     C   02                CLOSEFCHNL21
     C   03                CLOSEFCHNL22
     C   04                CLOSEFCHNL23
     C   46                CLOSEFCHNL24
     C                     OUT  *NAMVAR
     C                     SETON                     LR
     C                     RETRN
     C*
     C*-------------------------------------------------*
     C*              ...ﾅ ﾎﾞ ﾓ - k ]...                 *
     C*     ...ﾑﾒﾑhﾆﾞf] ﾑﾒﾑhﾇc fnﾞcﾆﾞf]  ﾉ  kdlh...     *
     C*-------------------------------------------------*
     C           SUBRTN    BEGSR
     C                     SETOF                     3740
     C                     MOVE *BLANK    WYKB
     C                     Z-ADD0         WYHM
     C                     Z-ADD0         WYSU
     C           FKY       KLIST
     C                     KFLD           WBMON
     C                     KFLD           WKBAN
     C           FKY2      KLIST
     C                     KFLD           WBMON
     C                     KFLD           FYY
     C                     KFLD           FMM
     C                     KFLD           WKBAN
     C           FKY2      CHAINMFBPL201             40
     C   40                Z-ADD0         M2SIRT
     C                     SETOF                     40
     C           FKY       CHAINMFAPL221             40
     C   40                GOTO FHP1
     C           M@SKJY    IFEQ 'D'
     C           M@SKHZ    IFLE *DATE
     C                     GOTO FHP1
     C                     END
     C                     END
     C           TTSU      DIV  FCD       KD      90
     C                     Z-ADD16        WJKAN   42
     C           M2SIRT    IFEQ 0
     C                     Z-ADD0         WHDKA
     C                     ELSE
     C           M2SIRT    DIV  100       WR1     54
     C           M@RPMH    MULT WR1       WHDKA   90
     C                     END
     C                     Z-ADD0         KST1
     C           WHDKA     IFNE 0
     C           KD        DIV  WHDKA     KST1    42
     C                     END
     C                     SETOF                     4243
     C                     Z-ADD0         WYHM
     C                     MOVE *BLANK    WYKB    1
     C           WJKAN     SUB  KST1      YRK     42   4342
     C   43                MOVE '-'       WYKB
     C           *IN42     IFEQ '0'
     C           YRK       MULT 60        WTF     40
     C           WTF       IFNE 0
     C           WTF       DIV  60        WYHH
     C                     MVR            WYMM
     C                     END
     C                     END
     C           YRK       MULT WHDKA     WYSU    90
     C           FHP1      TAG
     C           WYSU      COMP 0                      37
     C                     EXCPTTKNO
     C                     Z-ADD0         TTSU
     C                     ENDSR
     OQPRINT  E  102           M1P
     O                                  131 '+--------------------+'
     O*
     O        E  1             M1P
     O                                  131 '| CHARGE  | PUBLISHER|'
     O*
     O        E  1             M1P
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '|         |          |'
     O                         WNS      130
     O*
     O        E  2             M1P
     O                                   10 'FCHR21-1'
     O                 01                28 'IN-CO.P/N ODR'
     O                 02                29 'MATL CD ODR'
     O                 03                27 'BOX/DAY ODR'
     O                 04                32 'SPRING WASHER P/N ODR'
     O                 05                32 'PLAIN WASHER P/N ODR'
     O                 06                26 'WEIGHT ODR'
     O                 46                30 'NOMINAL LENGTH ODR'
     O                                   58 '*MCH ABILITY EXAMINATION'
     O                                   67 'LIST NO1'
     O                                   84 'BY COND SETTING*'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+--------------------+'
     O*
     O        E  2             M1P
     O                                   69 '*MCH ABILITY EXAMINATION'
     O                                   87 'LIST BY CONDITION'
     O                                  110 'SETTING *  FMT FCHPW20'
     O*
     O        E  2             M1P
     O                                   40 'MATERIAL CD 1 '
     O                         FZAC1     44
     O                                   47 '2'
     O                         FZAC2     52
     O                                   57 '3'
     O                         FZAC3     62
     O                                   74 'CPLT W-DIAM'
     O                         FKAZ1 4   81
     O                                   83 '-'
     O                         FKAZ2 4   89
     O                                   95 '---P.'
     O                         FP1       97
     O                                  103 'Y-YES'
     O*
     O        E  1             M1P
     O                                   48 'S   T   D'
     O                                   62 'S   T   D'
     O                                  102 'N-NO'
     O*
     O        E  2             M1P
     O                                   37 'PART NAME CD 1'
     O                         FCD11     40
     O                                   42 '-'
     O                         FCD12     44
     O                                   46 '-'
     O                         FCD13     48
     O                                   51 '2'
     O                         FCD21     54
     O                                   56 '-'
     O                         FCD22     58
     O                                   60 '-'
     O                         FCD23     62
     O                                   72 'NOM_L'
     O                         FKUB1 4   79
     O                                   81 '-'
     O                         FKUB2 4   88
     O                                   95 '---P.'
     O                         FP2       97
     O*
     O        E  2             M1P
     O                                   37 'MATERIAL WEIGHT'
     O                         FZUR1 4   47
     O                                   49 '-'
     O                         FZUR2 4   56
     O                                   72 'STRENGTH'
     O                         FKIK1 4   79
     O                                   81 '-'
     O                         FKIK2 4   88
     O                                   95 '---P.'
     O                         FP3       97
     O*
     O        E  2             M1P
     O                                   37 'BOXES / DAY'
     O                         FHKS1 4   47
     O                                   49 '-'
     O                         FHKS2 4   54
     O                                   72 'GENERAL SIZE'
     O                         FTUS1 4   79
     O                                   81 '-'
     O                         FTUS2 4   88
     O                                   95 '---P.'
     O                         FP4       97
     O*
     O        E  1             M1P
     O                                   37 'WASHER PART NO'
     O                         FHIN1     46
     O                                   48 '-'
     O                         FHIN2     54
     O                                   56 '-'
     O                         FHIN3     59
     O                                   72 'OUTER DIAM'
     O                         FGK11 4   79
     O                                   81 '+'
     O                         FGK12 4   86
     O                                   88 '-'
     O                         FGK21 4   95
     O                                   97 '+'
     O                         FGK22 4  102
     O*
     O        E  2             M1P
     O                                   81 '-'
     O                         FGK13 4   86
     O                                   97 '-'
     O                         FGK23 4  102
     O*
     O        E  1             M1P
     O                                   43 'RESULT MONTH SETTING'
     O*
     O        E  1             M1P
     O                                   38 'RESULT MONTH'
     O                         FYM       47
     O                                   55 'OPE DAY'
     O                         FCD   Z   60
     O                                   75 'PLATE THICKNESS'
     O                         FIA11 4   81
     O                                   83 '+'
     O                         FIA12 4   88
     O                                   90 '-'
     O                         FIA21 4   97
     O                                   99 '+'
     O                         FIA22 4  104
     O*
     O        E  2             M1P
     O                                   47 'YYYYMM'
     O                                   83 '-'
     O                         FIA13 4   88
     O                                   99 '-'
     O                         FIA23 4  104
     O*
     O        E  1             M1P
     O                                   36 'SET ?'
     O                         FSET      41
     O                                   46 'Y.N.'
     O*
     O        E  2             M1P
     O                                   29 '1'
     O                         FKOT1     34
     O                                   36 '-'
     O                         FKBM1     41
     O                                   46 '2'
     O                         FKOT2     51
     O                                   53 '-'
     O                         FKBM2     58
     O                                   63 '3'
     O                         FKOT3     68
     O                                   70 '-'
     O                         FKBM3     75
     O                                   80 '4'
     O                         FKOT4     85
     O                                   87 '-'
     O                         FKBM4     92
     O*
     O        E  1             M1P
     O                                   42 'SETTING OF CREATING'
     O                                   49 'MCH NO'
     O*
     O        E  2             M1P
     O                                   29 '1'
     O                         FKNO1     34
     O                                   37 '2'
     O                         FKNO2     42
     O                                   45 '3'
     O                         FKNO3     50
     O                                   53 '4'
     O                         FKNO4     58
     O                                   61 '5'
     O                         FKNO5     66
     O                                   69 '6'
     O                         FKNO6     74
     O                                   77 '7'
     O                         FKNO7     82
     O                                   85 '8'
     O                         FKNO8     90
     O*
     O        E  103           MDS
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O*
     O        E  2             MDS
     O                                   10 'FCHR21-1'
     O                 01                28 'IN-CO.P/N ODR'
     O                 02                29 'MAT CD ODR'
     O                 03                27 'BOX/DAY ODR'
     O                 04                32 'SPRING WASHER P/N ODR'
     O                 05                31 'PLAIN WASHER P/N ODR'
     O                 06                26 'WEIGHT ODR'
     O                 46                30 'NOMINAL LENGTH ODR'
     O                                   58 '*MCH ABILITY EXAMINATION'
     O                                   67 'LIST NO1'
     O                                   84 'BY COND SETTING*'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  116 'PUBLIC'
     O                         WUS      132
     O*
     O        E  1             MDS
     O                                    7 'MCH NO'
     O                                   21 'MCH FORM-NO'
     O                                   32 'TURN NBR'
     O                                   45 'NET WK RATE'
     O                                   54 'OPE TIME'
     O                                   75 'SURPLUS ENERGY TIME'
     O                                   94 'SURPLUS ENERGY'
     O*
     O        E  1             MDS
     O                                   12 'P/N'
     O                                   28 'MAT'
     O                                   41 'WIRE DIAM'
     O                                   48 'NOM_L'
     O                                   57 'STRENGTH'
     O                                   62 'SIZE'
     O                                   75 'PART NAME'
     O                                   84 'M/UNW'
     O                                   93 'CPLT/UNW'
     O                         FMM   Z   98
     O                                  107 'RESULT/D/'
     O                         FCD   Z  109
     O                                  117 'BOXE/D'
     O                                  129 'MAT/KG'
     O*
     O        E  2             MDS
     O                                   13 'PROC-1.9'
     O                                   29 'PROC-2.10'
     O                                   44 'PROC-3.11'
     O                                   59 'PROC-4.12'
     O                                   74 'PROC-5.13'
     O                                   89 'PROC-6.14'
     O                                  104 'PROC-7.15'
     O                                  117 'PROC-8.'
     O*
     O        E  1             DT1
     O                         LKB1       3
     O                                    4 '-'
     O                         LKB2       6
     O                         O7KSIK    21
     O                         O7SPCY1   31
     O                         O7KADO1   42
     O                                   43 '%'
     O                         O7STHSY   53
     O                         O7YOKB    68
     O                         O7YOHMY   65
     O                N41      O7YOSU    90 '   ,   , 0 '
     O                 41      O7YOSU    90 '    ,   ,_0 '
     O*
     O        E  1             DT2
     O                 38                 4 'D'
     O                         O7JHN1    10
     O                                   11 '-'
     O                         O7JHN2    16
     O                 39                17 '-'
     O                         O7JHN3    19
     O                         O7ZANM    35
     O                         O7KAZI1   42
     O                         O7KUBI1   49
     O                         O7KIKI1   54
     O                         O7TUSZ1   60
     O                         O7DMEI    77
     O                         WSOZI 1   84
     O                         WKASI 1   93
     O                         O7JISU1  107
     O                         O7HKSU1  118
     O                         O7ZURY1  131
     O*
     O        E  1             DT2
     O                         O7KOT1     8
     O                 21                 9 '-'
     O                         NAM,1     17
     O                         O7KOT2    23
     O                 22                24 '-'
     O                         NAM,2     32
     O                         O7KOT3    38
     O                 23                39 '-'
     O                         NAM,3     47
     O                         O7KOT4    53
     O                 24                54 '-'
     O                         NAM,4     62
     O                         O7KOT5    68
     O                 25                69 '-'
     O                         NAM,5     77
     O                         O7KOT6    83
     O                 26                84 '-'
     O                         NAM,6     92
     O                         O7KOT7    98
     O                 27                99 '-'
     O                         NAM,7    107
     O                         O7KOT8   113
     O                 28               114 '-'
     O                         NAM,8    122
     O*
     O        E  1             DT2
     O                         O7KI01     8
     O                         O7KI02    23
     O                         O7KI03    38
     O                         O7KI04    53
     O                         O7KI05    68
     O                         O7KI06    83
     O                         O7KI07    98
     O                         O7KI08   113
     O*
     O        E  1             DT2
     O                         TKR,1     13
     O                         TKR,2     29
     O                         TKR,3     44
     O                         TKR,4     59
     O                         TKR,5     74
     O                         TKR,6     89
     O                         TKR,7    104
     O                         TKR,8    119
     O*
     O        E  1             DT3
     O                         O7KOT9     8
     O                 29                 9 '-'
     O                         NAM,9     17
     O                         O7KO10    23
     O                 30                24 '-'
     O                         NAM,10    32
     O                         O7KO11    38
     O                 31                39 '-'
     O                         NAM,11    47
     O                         O7KO12    53
     O                 32                54 '-'
     O                         NAM,12    62
     O                         O7KO13    68
     O                 33                69 '-'
     O                         NAM,13    77
     O                         O7KO14    83
     O                 34                84 '-'
     O                         NAM,14    92
     O                         O7KO15    98
     O                 35                99 '-'
     O                         NAM,15   107
     O*
     O        E  1             DT3
     O                         O7KI09     8
     O                         O7KI10    23
     O                         O7KI11    38
     O                         O7KI12    53
     O                         O7KI13    68
     O                         O7KI14    83
     O                         O7KI15    98
     O*
     O        E  1             DT3
     O                         TKR,9     13
     O                         TKR,10    29
     O                         TKR,11    44
     O                         TKR,12    59
     O                         TKR,13    74
     O                         TKR,14    89
     O                         TKR,15   104
     O*
     O        E  1    N44 45
     O       OR  2     44 45
     O                                   21 '* PART NO TOTAL *'
     O                         TJISU  B 107 ' ,   ,   , * '
     O                         THKSU  B 118 '  , * . '
     O                         TZURY  B 131 ' ,   , * . '
     O*
     O        E  2             TKNO
     O                                   21 '* MCH NO TOTAL *'
     O                         KST1  1   52
     O                         WYKB   B  60
     O                         WYHM  YB  65
     O                N37      WYSU   B  84 '   ,   , 0 '
     O                 37      WYSU   B  84 '    ,   ,_0 '
     O                         ZJISU  B 107 ' ,   ,   , * '
     O                         ZHKSU  B 118 '  , * . '
     O                         ZZURY  B 131 ' ,   , * . '
     OFCJPPAT E                UP
     O                         O7JHN1     5
     O                         O7JHN2    10
     O                         O7JHN3    12
