     H            Y.
     F** FCKR02 ****************************************************************
     F*  PROGRAM    : PRINT FA MASTER CHECK LIST 2                             *
     F*  WRITTEN    : 7/07/2017                                                *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FAAFPL02 IF  E           K        DISK
     FAARTL13 IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
     E                    TTL     1   3 50
     I            DS
     I                                        1   80A3UKHZ
     I                                        1   40A3UKYY
     I                                        5   60A3UKMM
     I                                        7   80A3UKDD
     I            DS
     I                                        1   80A3STHZ
     I                                        1   40A3STYY
     I                                        5   60A3STMM
     I                                        7   80A3STDD
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           *IN98     DOWEQ*OFF
     C                     READ AAFPL02                  98
      * END?
     C           *IN98     IFEQ *OFF
      * CHECK DELETE GLAG
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE@DATE
     C                     ITER
     C                     ENDIF
      * CHECK KANBAN TYPE
     C           A3KCD1    IFNE 'C'
     C           A3KCD2    ORNE 'A'
     C                     ITER
     C                     ENDIF
      * CHECK LINE
     C           A3RAIN    IFEQ ' '
     C           A3RAIN    OREQ 'O'
     C                     ITER
     C                     ENDIF
      * CHECK EFFECTIVE DATE
     C           A3UKHZ    IFLE @DATE
     C           A3STHZ    ANDGT@DATE
     C                     EXSR #WGT
     C                     ELSE
     C                     ITER
     C**                   MOVE *ON       *IN85
     C**                   MOVE 'EF'      ERR
     C                     ENDIF
      *
     C           *IN85     IFEQ *ON
     C                     EXSR #PRINT
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      * SET FLAG
     C           SEQ#      IFNE 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  CHECK UNIT WEIGHT                                 *
      *----------------------------------------------------*
     C           #WGT      BEGSR
      *
     C                     MOVE *OFF      *IN85
     C                     MOVE *BLANK    ERR     2
     C           K#AAR     CHAINAARTL13              99
      *
     C           *IN99     IFEQ *ON
     C                     MOVE *ON       *IN85
     C                     MOVE 'NP'      ERR
     C                     GOTO #WGTX
     C                     ENDIF
      *
     C           CSTANJ    IFEQ 0
     C                     MOVE *ON       *IN85
     C                     MOVE 'NW'      ERR
     C                     GOTO #WGTX
     C                     ENDIF
      *
     C           #WGTX     ENDSR
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C                     SELEC
     C           ERR       WHEQ 'NP'
     C                     MOVELTTL,1     XMSG
     C           ERR       WHEQ 'NW'
     C                     MOVELTTL,2     XMSG
     C           ERR       WHEQ 'EF'
     C                     MOVELTTL,3     XMSG
     C                     OTHER
     C                     MOVE *BLANK    XMSG
     C                     ENDSL
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $RTN    1
      *
     C           K#AAR     KLIST
     C                     KFLD           A31HB5
     C                     KFLD           A32HB5
     C                     KFLD           A33HB2
      *
     C                     Z-ADD*DATE     @DATE   80
     C                     TIME           @TIME   60
     C                     Z-ADD0         SEQ#    40
     C                     MOVE *BLANK    XMSG   60
      *
     C                     EXCPT@HDR
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   46 '** FA MASTER WEIGHT '
     O                                   66 'CHECK LIST ** (AAFPP'
     O                                   86 '01)                 '
     O                                   99 'DATE'
     O                         @DATE    102 '    .  .  '
     O                         @TIME    112 '  :  :  '
     O                                  115 'P.'
     O                         PAGE  Z  119
     O        E   03           @HDR
     O                                    7 'SEQ#'
     O                                   15 'PART1'
     O                                   23 'PART2'
     O                                   31 'PART3'
     O                                   36 'LINE'
     O                                   42 'LOC1'
     O                                   49 'LOC2'
     O                                   55 'LOC3'
     O                                   60 'LOC4'
     O                                   85 'EFFECTIVE DATE START/END'
     O                                   96 'ERROR MSG'
      *
     O        E   04           @HDR
     O        E 1              @DTL
     O                         SEQ#  Z +003
     O                         A31HB5  +003
     O                         A32HB5  +003
     O                         A33HB2  +003
     O                         A3RAIN  +006
     O                         A3ATK1  +005
     O                         A3ATK2  +005
     O                         A3ATK3  +004
     O                         A3ATK4  +004
     O                         A3UKHZY +002
     O                         A3STHZY +002
     O                         XMSG    +004
**
* PART NOT FOUND IN A/R PRICE M/F (AARPP11)!
* REGISTERED UNIT WEIGHT IS ZERO !
* EFFECTIVE DATE IS INVALID !
