     H            Y.
     F** FCQR40 ****************************
     F*  ..REFERENCE TO THE DIE SPECIFICATION MASTER..  *
     F*  ..132 LIN                         *
     F*     I-HASADA          94.07.04     *
     F*     GBC             2002.04.20  MARK 5 => 8
     F**************************** FCQR40 **
     FFCQWP35 IP  F     250            DISK
     FQPRINT  O   F     132     OF     PRINTER
     IFCQWP35 AA  01
     I                                        1  10 IPM1
     I                                       11  20 IPM2
     I                                       21  30 IPM3
     I                                       31  40 IPM4
     I                                       41  50 IPM5
     I                                       51  60 IPM6
     I                                       61  70 IPM7
     I                                       71  80 IPM8
     I                                       81  90 IPM9
     I                                       91  91 IKKBN
     I                                       92  93 Q4KAT1
     I                                       94  97 Q4KAT2
     I                                       98 112 Q4QKAT
     I                                      113 122 ISF1
     I                                      123 132 ISF2
     I                                      133 142 ISF3
     I                                      143 152 ISF4
     I                                      153 162 ISF5
     I                                      163 172 ISF6
     I                                      173 182 ISF7
     I                                      183 192 ISF8
     I                                      193 202 ISF9
     I            DS
     I                                        1 256 PDAT1
     I                                        1   2 KACD
     I                                        3  12 O9KANM
     I                                       13  30 NN01
     I                                       31  48 NN02
     I                                       49  66 NN03
     I                                       67  84 NN04
     I                                       85  892SU01A
     I                                       90  942SU01B
     I                                       95  992SU02A
     I                                      100 1042SU02B
     I                                      105 1092SU03A
     I                                      110 1142SU03B
     I                                      115 1192SU04A
     I                                      120 1242SU04B
     I                                      125 142 NN05
     I                                      143 160 NN06
     I                                      161 178 NN07
     I                                      179 196 NN08
     I                                      197 2012SU05A
     I                                      202 2062SU05B
     I                                      207 2112SU06A
     I                                      212 2162SU06B
     I                                      217 2212SU07A
     I                                      222 2262SU07B
     I                                      227 2312SU08A
     I                                      232 2362SU08B
     I                                      237 254 NN09
     I            DS
     I                                        1 256 PDAT2
     I                                        1  18 NN10
     I                                       19  36 NN11
     I                                       37  54 NN12
     I                                       55  592SU09A
     I                                       60  642SU09B
     I                                       65  692SU10A
     I                                       70  742SU10B
     I                                       75  792SU11A
     I                                       80  842SU11B
     I                                       85  892SU12A
     I                                       90  942SU12B
     I                                       95 112 NN13
     I                                      113 130 NN14
     I                                      131 148 NN15
     I                                      149 166 NN16
     I                                      167 171 AL01A
     I                                      172 176 AL01B
     I                                      177 181 AL02A
     I                                      182 186 AL02B
     I                                      187 191 AL03A
     I                                      192 196 AL03B
     I                                      197 201 AL04A
     I                                      202 206 AL04B
     I                                      207 224 NN17
     I                                      225 229 AL05A
     I                                      230 234 AL05B
     I                                      235 252 NN18
     I            DS
     I                                        1 256 PDAT3
     I                                        1  18 NN19
     I                                       19  28 ALFA1
     I                                       29  38 ALFB1
     I                                       39  48 ALFA2
     I                                       49  58 ALFB2
.    I                                       59  76 NN20
.    I                                       77  84 ALFA3
.    I                                       85  92 ALFB3
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
     C                     PARM           WSRTK   1
     C                     PARM           PDT1  256
     C                     PARM           PDT2  256
     C                     PARM           PDT3  256
     C                     MOVE PDT1      PDAT1
     C                     MOVE PDT2      PDAT2
     C                     MOVE PDT3      PDAT3
      *
     C                     SETOF                     30
     C                     TIME           WTIME   60
     C                     ADD  1         WKENS   40
      *
     C           *IN31     IFEQ '0'
     C                     SETON                     3031
      *
     C                     MOVE *BLANK    PUSNM  15
     C                     CALL 'APLR00'
     C                     PARM           PUS
     C                     PARM           PUSNM
     C                     MOVELPUSNM     WUSNM   9
      *
     C           WSRTK     IFEQ '*'
     C                     SETON                     32
     C                     END
      *
     C                     END
      *
     OQPRINT  H  102   30
     O                                  131 '......................'
     O        H  1     30
     O                                  131 '.SUPERVISOR. WORKER  .'
     O        H  1     30
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.          .         .'
     O                         WUSNM    130
     O        H  2     30
     O                                   10 'FCQR40-1'
     O                                   55 '** REFERENCE LIST OF'
     O                                   78 'DIE HANDLING MASTER **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '......................'
     O        H  2     30
     O                                   31 'DIE NO.'
     O                         KACD      35
     O                         O9KANM    46
     O        H  2     30
     O                                   41 'FIGURE ( XXX.XX )'
     O        H  1     30
     O                         NN01      41
     O                         NN02      61
     O                         NN03      81
     O                         NN04     101
     O        H  2     30
     O                         SU01A 4   32
     O                                   35 '-'
     O                         SU01B 4   42
     O                         SU02A 4   52
     O                                   55 '-'
     O                         SU02B 4   62
     O                         SU03A 4   72
     O                                   75 '-'
     O                         SU03B 4   82
     O                         SU04A 4   92
     O                                   95 '-'
     O                         SU04B 4  102
     O        H  1     30
     O                         NN05      41
     O                         NN06      61
     O                         NN07      81
     O                         NN08     101
     O        H  2     30
     O                         SU05A 4   32
     O                                   35 '-'
     O                         SU05B 4   42
     O                         SU06A 4   52
     O                                   55 '-'
     O                         SU06B 4   62
     O                         SU07A 4   72
     O                                   75 '-'
     O                         SU07B 4   82
     O                         SU08A 4   92
     O                                   95 '-'
     O                         SU08B 4  102
     O        H  1     30
     O                         NN09      41
     O                         NN10      61
     O                         NN11      81
     O                         NN12     101
     O        H  2     30
     O                         SU09A 4   32
     O                                   35 '-'
     O                         SU09B 4   42
     O                         SU10A 4   52
     O                                   55 '-'
     O                         SU10B 4   62
     O                         SU11A 4   72
     O                                   75 '-'
     O                         SU11B 4   82
     O                         SU12A 4   92
     O                                   95 '-'
     O                         SU12B 4  102
     O        H 12     30
     O                                   28 'ALPHANUMERIC CHARACTERS'
     O                                   39 '(5 DIGITS)'
     O        H  1     30
     O                         NN13      41
     O                         NN14      61
     O                         NN15      81
     O                         NN16     101
     O        H  2     30
     O                         AL01A     31
     O                                   34 '-'
     O                         AL01B     40
     O                         AL02A     51
     O                                   54 '-'
     O                         AL02B     60
     O                         AL03A     71
     O                                   74 '-'
     O                         AL03B     80
     O                         AL04A     91
     O                                   94 '-'
     O                         AL04B    100
     O        H  1     30
     O                         NN17      41
     O        H  2     30
     O                         AL05A     31
     O                                   34 '-'
     O                         AL05B     40
.    O        H 12     30
.    O                                   40 'CHARACTERS(8DIHITS)'
.    O        H  1     30
.    O                         NN20      45
.    O        H  2     30
.    O                         ALFA3     36
.    O                                   39 '- '
.    O                         ALFB3     50
     O        H 12     30
     O                                   28 'ALPHANUMERIC CHARACTERS'
     O                                   40 '(10 DIGITS)'
     O        H  1     30
     O                         NN18      45
     O                         NN19      73
     O        H  2     30
     O                         ALFA1     36
     O                                   39 '-'
     O                         ALFB1     50
     O                         ALFA2     64
     O                                   67 '-'
     O                         ALFB2     78
      *
     O        H  102   30
     O       OR        OF
     O                                  131 '.....................'
     O        H  1     30
     O       OR        OF
     O                 32                26 'PIN DIAMER IN ORDER OF'
     O                 32                39 'BASE OF NECK'
     O                N32                25 'IN ORDER OF NEW DIE NO.'
     O                                  131 '.SUPERVISOR. WORKER  .'
     O        H  1     30
     O       OR        OF
     O                                   19 'ORDINARY KANBAN'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O                         WUSNM    130
     O        H  2     30
     O       OR        OF
     O                                   10 'FCQR40-1'
     O                         KACD      16
     O                                   17 '-'
     O                         O9KANM    27
     O                                   56 '** DIE HANDLING MASTER'
     O                                   74 'REFERENCE LIST **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        H  1     30
     O       OR        OF
     O                                    5 'NEW'
     O                                   14 'OLD'
     O        H  2     30
     O       OR        OF
     O                                    9 'DIE NO.'
     O                                   18 'DIE NO.'
     O                         IPM1      38
     O                         IPM2      49
     O                         IPM3      60
     O                         IPM4      71
     O                         IPM5      82
     O                         IPM6      93
     O                         IPM7     104
     O                         IPM8     115
     O                         IPM9     126
     O        D  1     01
     O                         IKKBN      2
     O                         Q4KAT1     4
     O                                    5 '-'
     O                         Q4KAT2     9
     O                         Q4QKAT    26
     O                         ISF1      38
     O                         ISF2      49
     O                         ISF3      60
     O                         ISF4      71
     O                         ISF5      82
     O                         ISF6      93
     O                         ISF7     104
     O                         ISF8     115
     O                         ISF9     126
     O        T 1      LR
     O                                   57 'NAMBER OF DATA'
     O                         WKENS 1   64
