     H            Y.                                                      EER050
     F** FCQR42 ********************************************
     F*  LIST OF STANDARD DIE LISE SPAN                    *           > *
     F*  MSK.KUNIEDA                     1998.05.25        *
     F******************************************************
     FFCQPL41 IP  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FFCQPR42 O   E             55     PRINTER                        UC
     I            DS
     I                                        1  11 WKATA
     I                                        1   2 O7KAT1
     I                                        3   3 WKH1
     I                                        4   7 O7KAT2
     I                                        8   8 WKH2
     I                                        9   9 O7KAT3
     I                                       10  10 WKH3
     I                                       11  11 O7KAT4
     C           *ENTRY    PLIST
     C                     PARM           USER   10
      *-------------------*
      * HEADING           *
      *-------------------*
     C           OPNSW     IFEQ *BLANK
     C                     OPEN FCQPR42
     C                     TIME           @TIME
     C                     MOVE UDATE     @DATE
      *
     C                     SETOF                       21
     C                     MOVELUSER      @USER
     C           USER      CHAINRGAPL111             21
     C           *IN21     IFEQ '0'
     C                     MOVELJ8NAME    @USER
     C                     END
      *
     C                     WRITEFCQPR421
      *
     C                     MOVE '1'       OPNSW   1
     C                     SETOF                     111213
     C                     END
      *-------------------*
      * DETAILS           *
      *-------------------*
      *
     C                     ADD  1         CTRX    20
     C                     MOVE *BLANK    WKH1
     C                     MOVE *BLANK    WKH2
     C                     MOVE *BLANK    WKH3
      *
     C           CTRX      IFEQ 1
     C                     MOVE '-'       WKH1
     C                     MOVE '-'       WKH2
     C                     MOVE '-'       WKH3
     C                     MOVE O7MSRY    @1MSRY
     C                     MOVE WKATA     @1KATA
     C                     SETON                       11
     C                     END
     C           CTRX      IFEQ 2
     C                     MOVE '-'       WKH1
     C                     MOVE '-'       WKH2
     C                     MOVE '-'       WKH3
     C                     MOVE O7MSRY    @2MSRY
     C                     MOVE WKATA     @2KATA
     C                     SETON                       12
     C                     END
     C           CTRX      IFEQ 3
     C                     MOVE '-'       WKH1
     C                     MOVE '-'       WKH2
     C                     MOVE '-'       WKH3
     C                     MOVE O7MSRY    @3MSRY
     C                     MOVE WKATA     @3KATA
     C                     SETON                       13
      *-------------------*
      * DETAILS IS WRITE  *
      *-------------------*
     C                     WRITEFCQPR422
     C                     SETOF                     111213
     C                     Z-ADD0         CTRX
     C                     MOVE *ZERO     @1MSRY
     C                     MOVE *BLANK    @1KATA
     C                     MOVE *ZERO     @2MSRY
     C                     MOVE *BLANK    @2KATA
     C                     MOVE *ZERO     @3MSRY
     C                     MOVE *BLANK    @3KATA
     C                     END
      *-------------------*
      * OVERFLOW          *
      *-------------------*
     C           *IN55     IFEQ '1'
     C                     WRITEFCQPR421
     C                     SETOF                       55
     C                     END
     CLR         CTRX      IFNE 0
     CLR                   WRITEFCQPR422
     CLR                   END
