     H            Y.
     F** FCTR35 *******************************************
     F* ...SETTING NUMBER AUTOMATIC PART NUMBER INPUT ... *
     F*         I-HASADA                 85.04.19         *
     F******************************************* FCTR35 **
     FFCEPL01 UF  E           K        DISK
     FFCTPL41 UF  E           K        DISK
     FFCTPW35 CF  E                    WORKSTN
     E                    ER      1   4 60               d[- xlﾈ-ﾆﾞ
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1  12 FSHIN
     I                                        1   5 FSHN1
     I                                        6  10 FSHN2
     I                                       11  12 FSHN3
     C*-------------------------*
     C*     ...fﾞ x ]  1...     *
     C*-------------------------*
     C                     WRITEFCTPW356
     C           STP1      TAG
     C                     EXFMTFCTPW351
     C                     SETOF                     010399
     C   KA                SETON                     LR
     C   KA                RETRN
     C*
     C*
     C           FSHIN     IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     WRITEFCTPW354
     C                     GOTO STP1
     C                     END
     C*
     C*
     C           KEY       KLIST
     C                     KFLD           FSHN1
     C                     KFLD           FSHN2
     C                     KFLD           FSHN3
     C           KEY       CHAINFCEPL011             03
     C           *IN03     IFEQ '1'
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     WRITEFCTPW354
     C                     GOTO STP1
     C                     END
     C*
     C*
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    IFLE *DATE
     C                     SETON                     0199
     C                     MOVE ER,3      MSG
     C                     WRITEFCTPW354
     C                     GOTO STP1
     C                     END
     C                     END
     C                     WRITEFCTPW351
     C                     WRITEFCTPW355
     C*
     C*-------------------------*
     C*     ...fﾞ x ]  2...     *
     C*-------------------------*
     C           STP2      TAG
     C                     EXFMTFCTPW352
     C                     SETOF                     0299
     C   KC                MOVE *BLANK    FSHIN
     C   KC                WRITEFCTPW353
     C   KC                GOTO STP1
     C*
     C*
     C           A2AK11    IFNE 'J'
     C           A2AK11    IFNE *BLANK
     C                     SETON                     0299
     C                     MOVE ER,4      MSG
     C                     WRITEFCTPW354
     C                     GOTO STP2
     C                     END
     C                     END
     C*
     C           *INKE     IFEQ '0'
     C                     WRITEFCTPW355
     C                     GOTO STP2
     C                     END
     C*
     C                     SETOF                     04
     C           KEY       CHAINFCTPL411             04
     C           *IN04     IFEQ '0'
     C                     MOVE A2AK11    Q9TROK
     C                     UPDATFCTPL411
     C                     END
     C*
     C                     UPDATFCEPL011
     C                     WRITEFCTPW353
     C                     MOVE *BLANK    FSHIN
     C                     GOTO STP1
**  ER
E-01 INPUT INTRAL COMPANY PART NO
E-02 THERE IS NOT APPLICABLE KEY IN PART M/F
E-03 PART M/F IS CANCELLED ALREADY
E-04 AUTOMATIC INSTRUCTION IS < J.BLANK >'
