     H            Y.
     F*** FCWR01 ****************************************
     F*                                                 *
     F*  JUN/19/2003  ADD SETTING BOX/DAY               *
     F********************************* FCWR01 **********
     FFCEPL03 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAAFPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FAAPPL03 IF  E           K        DISK
     FAKBPL08 IF  E           K        DISK
     FAANPL03 IF  E           K        DISK
     FMCENP13 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *-----------------------------------------------------
     E                    NTKR       15  6                    LOCATION
     E                    NCKQ       15  1                KANABA TYPE
     E                    KANK       15 10 0
      *-----------------------------------------------------
     I            DS
     I                                        1  90 NTKR
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  15 NCKQ
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1 1500KANK
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1   6 @@TKR
     I                                        1   1 @@TK1
     I                                        2   3 @@TK2
     I                                        4   5 @@TK3
     I                                        6   6 @@TK4
     I            DS
     I                                        1  12 A2SHN
     I                                        1   5 A2BHB1
     I                                        6  10 A2BHB2
     I                                       11  12 A2BHB3
     I            DS
     I                                        1  100KHIB
     I                                        1   80KHIZ
     I                                        1   40KNE
     I                                        5   60KTU
     I                                        7   80KHI
     I                                        9  100KBIN
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *-----------------------------------------------------
     C           K#KEY     KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C           K#LOC     KLIST
     C                     KFLD           A2STRK
     C                     KFLD           A2STRT
     C                     KFLD           A2STRR
     C                     KFLD           A2STRD
     C           K#LOCX    KLIST
     C                     KFLD           K@LOC1
     C                     KFLD           K@LOC2  2
     C           K#FCEP    KLIST
     C                     KFLD           L1SHN1
     C                     KFLD           L1SHN2
     C                     KFLD           L1SHN3
     C           K#MC      KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
     C           K#TK      KLIST
     C                     KFLD           @@TK1
     C                     KFLD           @@TK2
     C                     KFLD           @@TK3
     C                     KFLD           @@TK4
      *
     C                     TIME           @@TIME  60
     C                     MOVE *ALL'-'   @@LIN  55
      *-----------------------------------------------------
      * FINISHED
     C                     MOVE '0'       K@LOC1  1
     C                     EXSR #FIN
     C                     MOVE '1'       K@LOC1  1
     C                     MOVE 'R3'      K@LOC2
     C                     EXSR #FIN2
      * WASHER
     C                     EXSR #WAS
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *----------------------------------------------------------
     C           #FIN      BEGSR
      *----------------------------------------------------------
     C                     Z-ADD*ZERO     W@ROW   70
     C           K@LOC1    SETLLFCEPL03
     C           *IN90     DOUEQ*ON
     C           K@LOC1    READEFCEPL03                  90
     C           *IN90     IFEQ *OFF
     C           A2GSKD    ANDEQ*BLANK
     C*
     C           K#KEY     CHAINAAMPL111             95
     C           *IN95     IFEQ *ON
     C           CKSKJY    ORNE *BLANK
     C                     ITER
     C                     ENDIF
      * SETTING # OF BOXES
     C                     Z-ADD*ZERO     @SETB
     C           A2SSYS    IFNE *ZERO
     C           A2GEKN    DIV  A2SSYS    @@BOX   90
     C                     MVR            @@BMVR  90
     C           @@BMVR    IFNE *ZERO
     C                     ADD  1         @@BOX
     C                     ENDIF
     C           @@BOX     DIV  20        @SETB   50
     C                     MVR            @@BMVR  90
     C           @@BMVR    IFNE *ZERO
     C                     ADD  1         @SETB
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE *BLANK    KAN
     C           1         DO   15        A       20
     C           NCKQ,A    IFEQ 'C'
     C           NCKQ,A    OREQ 'D'
     C           NCKQ,A    OREQ 'E'
     C           NCKQ,A    OREQ '0'
     C                     MOVELNTKR,A    @@TKR
     C                     MOVELNCKQ,A    KAN     1
     C                     Z-ADDKANK,A    KHIB
     C                     ENDIF
     C                     ENDDO
      * IAF
     C           KAN       IFNE *BLANK
     C                     EXSR #KAN
     C                     EXSR #PRT
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           W@ROW     IFNE *ZERO
     C                     EXCPT@STOT
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------------
     C           #FIN2     BEGSR
      *----------------------------------------------------------
     C                     Z-ADD*ZERO     W@ROW   70
     C           K#LOCX    SETLLFCEPL03
     C           *IN90     DOUEQ*ON
     C           K#LOCX    READEFCEPL03                  90
     C           *IN90     IFEQ *OFF
     C           A2GSKD    ANDEQ*BLANK
     C*
     C           K#KEY     CHAINAAMPL111             95
     C           *IN95     IFEQ *ON
     C           CKSKJY    ORNE *BLANK
     C                     ITER
     C                     ENDIF
      * SETTING # OF BOXES
     C                     Z-ADD*ZERO     @SETB
     C           A2SSYS    IFNE *ZERO
     C           A2GEKN    DIV  A2SSYS    @@BOX   90
     C                     MVR            @@BMVR  90
     C           @@BMVR    IFNE *ZERO
     C                     ADD  1         @@BOX
     C                     ENDIF
     C           @@BOX     DIV  20        @SETB   50
     C                     MVR            @@BMVR  90
     C           @@BMVR    IFNE *ZERO
     C                     ADD  1         @SETB
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE *BLANK    KAN
     C           1         DO   15        A       20
     C           NCKQ,A    IFEQ 'C'
     C           NCKQ,A    OREQ 'D'
     C           NCKQ,A    OREQ 'E'
     C           NCKQ,A    OREQ '0'
     C           NCKQ,A    OREQ '6'
     C                     MOVELNTKR,A    @@TKR
     C                     MOVELNCKQ,A    KAN     1
     C                     Z-ADDKANK,A    KHIB
     C                     ENDIF
     C                     ENDDO
      * IAF
     C           KAN       IFNE *BLANK
     C                     EXSR #KAN
     C                     EXSR #PRT
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           W@ROW     IFNE *ZERO
     C                     EXCPT@STOT
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------------
     C           #WAS      BEGSR
      *----------------------------------------------------------
     C                     Z-ADD*ZERO     W@ROW   70
     C           *LOVAL    SETLLAKBPL08
     C           *IN90     DOUEQ*ON
     C                     READ AKBPL08                  90
     C           *IN90     IFEQ *OFF
     C           L1SKJY    ANDEQ*BLANK
     C           L1STYY    ANDEQ9999
      *
     C                     Z-ADDL1KMAX    @MAXS
     C                     Z-ADDL1KMAX    @MAXX
      *
     C           @MAXS     DIV  32        @@ROW   30
     C                     MVR            @@MVR   30
      *
     C           @@MVR     IFGT *ZERO
     C                     ADD  1         @@ROW
     C                     ENDIF
     C                     ADD  @@ROW     W@ROW
      *
     C                     EXSR #SET
      *
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
     C  N98                MOVE *ON       *IN98
      *
     C                     EXCPT@DTLW
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           W@ROW     IFNE *ZERO
     C                     EXCPT@STOT
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------------
     C           #SET      BEGSR
      *----------------------------------------------------------
     C                     Z-ADD*ZERO     WWQTY  110
     C           K#FCEP    SETLLMCENP13
     C           *IN97     DOUEQ*ON
     C           K#FCEP    READEMCENP13                  97
B01  C           *IN97     IFEQ *OFF
      *
     C                     MOVE MCSHN1    K@SHN1
     C                     MOVE MCSHN2    K@SHN2
     C                     MOVE MCSHN3    K@SHN3
      *
     C           K#MC      CHAINFCEPL01              96
     C           *IN96     IFEQ *OFF
     C           A2GSKD    ANDEQ*BLANK
     C           K#MC      CHAINAAMPL11              96
     C           *IN96     IFEQ *OFF
     C                     ADD  A2GEKN    WWQTY
      *
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADD*ZERO     @SETB
     C           L1SYOS    IFNE *ZERO
     C           WWQTY     DIV  L1SYOS    @@BOX   90
     C                     MVR            @@BMVR  90
     C           @@BMVR    IFNE *ZERO
     C                     ADD  1         @@BOX
     C                     ENDIF
     C           @@BOX     DIV  20        @SETB   50
     C                     MVR            @@BMVR  90
     C           @@BMVR    IFNE *ZERO
     C                     ADD  1         @SETB
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------------
     C           #KAN      BEGSR
      *----------------------------------------------------------
     C                     MOVE *OFF      W@PT    1
     C                     SELEC
     C           KAN       WHEQ 'C'
     C           K#TK      SETLLAAFPL031
     C           *IN91     DOUEQ*ON
     C           K#TK      READEAAFPL031                 91
     C           *IN91     IFEQ *OFF
     C           A3SKJY    ANDEQ*BLANK
     C           A3SHIN    ANDEQA2SHN
     C           A3STYY    ANDEQ9999
      *
     C                     Z-ADDA3KMAX    @MAXS   50
     C                     Z-ADDA3KMAX    @MAXX   50
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           KAN       WHEQ 'D'
     C           K#TK      SETLLAAGPL031
     C           *IN91     DOUEQ*ON
     C           K#TK      READEAAGPL031                 91
     C           *IN91     IFEQ '0'
     C           O4SKJY    ANDEQ*BLANK
     C           O4SHIN    ANDEQA2SHN
     C           O4STYY    ANDEQ9999
     C                     Z-ADDO4KMAX    @MAXS
     C                     Z-ADDO4KMAX    @MAXX   50
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           KAN       WHEQ 'E'
     C           K#TK      SETLLAAHPL031
     C           *IN91     DOUEQ*ON
     C           K#TK      READEAAHPL031                 91
     C           *IN91     IFEQ *OFF
     C           L6SKJY    ANDEQ*BLANK
     C           L6SHIN    ANDEQA2SHN
     C           L6STYY    ANDEQ9999
      *
     C                     Z-ADDL6KMAX    @MAXS
     C                     Z-ADDL6KMAX    @MAXX
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           KAN       WHEQ '0'
     C           K#TK      SETLLAAPPL031
     C           *IN91     DOUEQ*ON
     C           K#TK      READEAAPPL031                 91
     C           *IN91     IFEQ *OFF
     C           L5SKJY    ANDEQ*BLANK
     C           L5SHIN    ANDEQA2SHN
     C           L5STYY    ANDEQ9999
      *
     C                     MOVE '1'       W@PT    1
     C           L5KSSU    DIV  L5SYOS    @@DAYQ 112
     C           @@DAYQ    IFLE 31
     C           L5KSSU    MULT 13        @@QTY  130
     C                     ELSE
     C           L5KSSU    MULT 5         @@QTY
     C                     ENDIF
      *
     C           @@QTY     DIV  L5SYOS    @MAXS
     C                     MVR            @MVR
     C           @MVR      IFGT *ZERO
     C                     ADD  1         @MAXS
     C                     ENDIF
      *
     C           L5KSSU    MULT L5LTIM    @@Q    130
     C           @@Q       DIV  L5SYOS    @MAXX   50
     C                     MVR            @MVR
     C           @MVR      IFGT *ZERO
     C                     ADD  1         @MAXX
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C*-------------------*
     C           KAN       WHEQ '6'
     C           K#TK      SETLLAANPL031
     C           *IN91     DOUEQ*ON
     C           K#TK      READEAANPL031                 91
     C           *IN91     IFEQ *OFF
     C           L7SKJY    ANDEQ*BLANK
     C           L7SHIN    ANDEQA2SHN
     C           L7STYY    ANDEQ9999
     C           L7BMON    IFEQ 0111
     C                     ITER
     C                     END
      *
     C                     MOVE '1'       W@PT    1
     C           L7KSSU    DIV  L7SYOS    @@DAYQ 112
     C           @@DAYQ    IFLE 31
     C           L7KSSU    MULT 13        @@QTY
     C                     ELSE
     C           L7KSSU    MULT 5         @@QTY
     C                     ENDIF
      *
     C           @@QTY     DIV  L7SYOS    @MAXS
     C                     MVR            @MVR    90
     C           @MVR      IFGT *ZERO
     C                     ADD  1         @MAXS
     C                     ENDIF
     C           L7KSSU    MULT L7LTIM    @@Q    130
     C           @@Q       DIV  L7SYOS    @MAXX   50
     C                     MVR            @MVR
     C           @MVR      IFGT *ZERO
     C                     ADD  1         @MAXX
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSL
      *
     C           W@PT      IFEQ '1'
     C           @MAXS     DIV  32        @@ROW   30
     C                     MVR            @@MVR   30
     C                     ELSE
     C           @MAXS     DIV  40        @@ROW
     C                     MVR            @@MVR   30
     C                     ENDIF
      *
     C           @@MVR     IFGT *ZERO
     C                     ADD  1         @@ROW
     C                     ENDIF
     C                     ADD  @@ROW     W@ROW
      *
     C                     ENDSR
      *----------------------------------------------------------
     C           #PRT      BEGSR
      *----------------------------------------------------------
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
     C  N98                MOVE *ON       *IN98
      *
     C                     EXCPT@DTL
      *
     C                     ENDSR
     C**************************************************************************
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O        E   02           @HED
     O                                   42 '# OF KANBANS/LOCATION'
     O                         UDATE     68 '  /  /  '
     O                         @@TIME    77 '  :  :  '
     O                                   84 'PAGE'
     O                         PAGE  Z   88
     O*
     O        E   04           @HED
     O                                    9 'LOCATION'
     O                                   17 'PART#'
     O                                   35 '# OF KAN'
     O                                   46 'BOXES/DAY'
     O                                   52 'ROWS'
     O        E   05           @HED
     O                         @@LIN     55
     O*
     O        E 1              @DTL
     O                         A2STRK     2
     O                         A2STRT     5
     O                         A2STRR     8
     O                         A2STRD    10
     O                         A2BHB1    17
     O                         A2BHB2    23
     O                         A2BHB3    26
     O                         @MAXX 4   33
     O                         @SETB 4   44
     O                         @@ROW 4   51
     O        E 1              @STOT
     O                                   30 'SUB TOTAL'
     O                         W@ROW 4   51
     O        E 1              @STOT
     O                         @@LIN     55
     O        E 1              @DTLW
     O                         L1TKR1     2
     O                         L1TKR2     5
     O                         L1TKR3     8
     O                         L1TKR4    10
     O                         L1SHN1    17
     O                         L1SHN2    23
     O                         L1SHN3    26
     O                         @MAXX 4   33
     O                         @SETB 4   44
     O                         @@ROW 4   51
