      **********************************************************
      *  PRINT CUSTOMER LIST                                   *
      *                                                        *
      **********************************************************
      * PROGRAM NAME         : FGBR20                          *
      **********************************************************
      * FILE   (INPUT)       : FGBPL01                         *
      *        (OUTPUT)      :                                 *
      **********************************************************
      * DATE   (CODING)      : 97.03.20             K.OKACHI   *
      *        (UPDATE)      :                                 *
      **********************************************************
     H            Y.
     FFGBPL01 IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     C           *IN10     IFEQ '0'
     C                     SETON                     10OF
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     MOVE *BLANK    USME   15
     C                     Z-ADD0         WTIME   60
     C                     TIME           WTIME
     C                     CALL 'APLR00'
     C                     PARM           US
     C                     PARM           USME
     C                     MOVELUSME      WUSME   9
     C                     END
      *
     C           *INOF     IFEQ '1'
     C                     SETOF                     OF
     C                     EXCPTMDS
     C                     END
      *
     C           B2SKJY    IFEQ ' '
     C           B2SKHZ    ORGT *DATE
     C                     EXCPTDT
     C                     END
      *
     OQPRINT  E  102           MDS
     O                                  131 '+-------------------+'
     O        E  1             MDS
     O                                  131 '|         |         |'
     O        E  1             MDS
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  121 '|         |'
     O                         WUSME    130
     O                                  131 '|'
     O        E  2             MDS
     O                                   12 'RPG-FGBR20'
     O                                   42 '***'
     O                                   60 'DETAIL M/F LIST'
     O                                   66 '***'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        E 11             MDS
     O                                    9 'DETAIL'
     O                                   43 'SOUND'
     O                                   62 'BUSINESS'
     O                                   78 'TRANSACTION'
     O                                   91 'TYPE OF'
     O        E  1             MDS
     O                                    8 'CODE'
     O                                   26 'DETAIL NAME'
     O                                   46 'INSTRUCTION'
     O                                   62 'CONTENTS'
     O                                   74 'FORM'
     O                                   92 'INDUSTRY'
     O                                  111 'CLASSIFICATION 1'
     O                                  130 'CLASSIFICATION 2'
     O        E  1             DT
     O                         B2CODE     8
     O                         B2SMEI    28
     O                         B2ONCD    41
     O                         B2TORI    58
     O                         B2GRUP    73
     O                         B2GYOS    88
     O                         B2TKEN   103
     O                         B2TIHO   123
