     H            Y.
     F** FINR00 **********************************
     F* CHARACTER STRING RETRIEVAL PROGRAM       *
     F*                                          *
     F*  CODING:A.MAMIYA          2001.05.09     *
     F********************************** FINR00 **
     FFINPW00 CF  E                    WORKSTN
      *
     E                    ER      1  20 60
     E                    CK     26  26  1
     E                    #FILE      20 10
     I            DS
     I                                        1 200 WWFIL
     I                                        1 200 #FILE
     I                                        1  10 FIL01
     I                                       11  20 FIL02
     I                                       21  30 FIL03
     I                                       31  40 FIL04
     I                                       41  50 FIL05
     I                                       51  60 FIL06
     I                                       61  70 FIL07
     I                                       71  80 FIL08
     I                                       81  90 FIL09
     I                                       91 100 FIL10
     I                                      101 110 FIL11
     I                                      111 120 FIL12
     I                                      121 130 FIL13
     I                                      131 140 FIL14
     I                                      141 150 FIL15
     I                                      151 160 FIL16
     I                                      161 170 FIL17
     I                                      171 180 FIL18
     I                                      181 190 FIL19
     I                                      191 200 FIL20
      *-----------*
      * PARAMETER *
      *-----------*
     C           *ENTRY    PLIST
     C                     PARM           PMOJI  50
     C                     PARM           PLIBL  10
      * DUMMY JW1
     C                     MOVE CK,1      JOEW    1
      *------------*
      * INITIALIZE *
      *------------*
     C           STEP0     TAG
     C                     MOVE *BLANK    #FILE
     C                     MOVE *BLANK    CODE
     C                     MOVE *BLANK    MOJI
     C                     MOVEL'HSRC1'   LIBL
      *----------*
      * SCREEN 1 *
      *----------*
     C           STEP1     TAG
     C                     EXFMTFINPW001
     C                     SETOF                     U11199
     C                     SETOF                     U31199
      *-------*
      * CMD-1 *
      *-------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LRU3
     C                     RETRN
     C                     END
      *------------*
      * CHECK CODE *
      *------------*
     C           CODE      IFEQ *BLANK
     C                     SETON                     1199
     C                     MOVE ER,1      MSG
     C                     GOTO STEP1
     C                     END
      *
     C           CODE      IFEQ '1'
     C           CODE      OREQ '2'
     C           CODE      OREQ '3'
     C           CODE      OREQ '4'
     C           CODE      OREQ '5'
     C           CODE      OREQ '6'
     C           CODE      OREQ '7'
     C                     ELSE
     C                     SETON                     1199
     C                     MOVE ER,2      MSG
     C                     GOTO STEP1
     C                     END
      *
     C                     SETOF                     232425
     C                     SETOF                     2627
     C                     MOVEL*BLANK    @FILE   9
     C           CODE      IFEQ '3'
     C                     SETON                     23
     C                     MOVEL'CLSRC'   @FILE
     C                     GOTO STEP3
     C                     END
     C           CODE      IFEQ '4'
     C                     SETON                     24
     C                     MOVEL'RPGSRC'  @FILE
     C                     GOTO STEP3
     C                     END
     C           CODE      IFEQ '5'
     C                     SETON                     25
     C                     MOVEL'DDSSRC'  @FILE
     C                     GOTO STEP3
     C                     END
     C           CODE      IFEQ '6'
     C                     SETON                     26
     C                     MOVEL'DSPSRC'  @FILE
     C                     GOTO STEP3
     C                     END
     C           CODE      IFEQ '7'
     C                     SETON                     27
     C                     MOVEL'PRTSRC'  @FILE
     C                     GOTO STEP3
     C                     END
      *
     C                     SETOF                     90
     C           CODE      IFEQ '1'
     C                     SETON                     90
     C                     END
      *----------*
      * SCREEN 2 *
      *----------*
     C           STEP2     TAG
     C                     EXFMTFINPW002
     C                     MOVEA'00000000'*IN,01
     C                     MOVEA'00000000'*IN,09
     C                     MOVEA'00000000'*IN,17
     C                     MOVEA'000'     *IN,18
     C                     SETOF                     212299
      *-------*
      * CMD-3 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO STEP0
     C                     END
      *-------------*
      * CHECK INPUT *
      *-------------*
     C           MOJI      IFEQ *BLANK
     C                     SETON                     2199
     C                     MOVE ER,3      MSG
     C                     GOTO STEP2
     C                     END
      *
     C           LIBL      IFEQ *BLANK
     C                     SETON                     2299
     C                     MOVE ER,4      MSG
     C                     GOTO STEP2
     C                     END
      *
     C                     MOVELLIBL      WLIB1   1
     C           WLIB1     IFGE '0'
     C           WLIB1     ANDLE'9'
     C                     SETON                     2299
     C                     MOVE ER,5      MSG
     C                     GOTO STEP2
     C                     END
      *
     C                     MOVEL*BLANK    WLIBL  10
     C                     MOVELLIBL      WLIBL
     C                     MOVEL*BLANK    WCHEK   1
     C                     CALL 'FINC04'
     C                     PARM           WLIBL
     C                     PARM           WCHEK
      *
     C           WCHEK     IFEQ '*'
     C                     SETON                     2299
     C                     MOVE ER,5      MSG
     C                     GOTO STEP2
     C                     END
      *
     C                     SETOF                     U1
     C           CODE      IFEQ '1'
     C                     SETON                     U1
     C                     MOVELMOJI      PMOJI
     C                     MOVELLIBL      PLIBL
     C                     END
      *
     C           CODE      IFEQ '2'
      *
     C           WWFIL     IFEQ *BLANK
     C                     SETON                     99
     C                     MOVE ER,6      MSG
     C                     GOTO STEP2
     C                     END
      *
     C                     Z-ADD1         A       20
     C                     DO   20        A
     C           #FILE,A   IFNE *BLANK
     C                     MOVEL#FILE,A   WFIL1   1
     C           WFIL1     IFGE '0'
     C           WFIL1     ANDLE'9'
     C                     MOVEA'1'       *IN,A
     C                     SETON                     99
     C                     MOVE ER,7      MSG
     C                     GOTO STEP2
     C                     END
     C                     MOVEL*BLANK    WLIBL  10
     C                     MOVEL*BLANK    WFILE  10
     C                     MOVEL*BLANK    WTYPE   7
     C                     MOVEL*BLANK    WCHEK   1
     C                     MOVELLIBL      WLIBL
     C                     MOVEL#FILE,A   WFILE
     C                     MOVEL'*FILE'   WTYPE
     C                     CALL 'FINC03'
     C                     PARM           WLIBL
     C                     PARM           WFILE
     C                     PARM           WTYPE
     C                     PARM           WCHEK
     C           WCHEK     IFEQ '*'
     C                     SETON                     99
     C                     MOVEA'1'       *IN,A
     C                     MOVE ER,7      MSG
     C                     GOTO STEP2
     C                     END
     C                     END
     C                     ENDDO
      *
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STEP2
     C                     END
      *
     C           CODE      IFEQ '2'
     C                     Z-ADD1         A       20
     C                     DO   20        A
     C           #FILE,A   IFNE *BLANK
     C                     MOVEL#FILE,A   FILE   10
     C                     CALL 'FINC02'
     C                     PARM           LIBL
     C                     PARM           FILE
     C                     PARM           MOJI
     C                     END
     C                     ENDDO
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *----------*
      * SCREEN 3 *
      *----------*
     C           STEP3     TAG
     C                     EXFMTFINPW003
     C                     SETOF                     212299
      *-------*
      * CMD-3 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO STEP0
     C                     END
      *-------------*
      * CHECK INPUT *
      *-------------*
     C           MOJI      IFEQ *BLANK
     C                     SETON                     2199
     C                     MOVE ER,3      MSG
     C                     GOTO STEP3
     C                     END
      *
     C           LIBL      IFEQ *BLANK
     C                     SETON                     2299
     C                     MOVE ER,4      MSG
     C                     GOTO STEP3
     C                     END
      *
     C                     MOVELLIBL      WLIB1   1
     C           WLIB1     IFGE '0'
     C           WLIB1     ANDLE'9'
     C                     SETON                     2299
     C                     MOVE ER,5      MSG
     C                     GOTO STEP3
     C                     END
      *
     C                     MOVEL*BLANK    WLIBL  10
     C                     MOVELLIBL      WLIBL
     C                     MOVEL*BLANK    WCHEK   1
     C                     CALL 'FINC04'
     C                     PARM           WLIBL
     C                     PARM           WCHEK
      *
     C           WCHEK     IFEQ '*'
     C                     SETON                     2299
     C                     MOVE ER,5      MSG
     C                     GOTO STEP3
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STEP3
     C                     END
      *
     C                     SETOF                     U1
      *
     C                     Z-ADD1         A       20
     C**                   DO   26        A
JW1  C                     DO   1         A
     C                     MOVEL*BLANK    @@FILE 10
     C**         CK,A      CAT  @FILE     @@FILE
JW1  C           'A'       CAT  @FILE     @@FILE
     C                     MOVEL*BLANK    WLIBL  10
     C                     MOVEL*BLANK    WFILE  10
     C                     MOVEL*BLANK    WTYPE   7
     C                     MOVEL*BLANK    WCHEK   1
     C                     MOVELLIBL      WLIBL
     C                     MOVEL@@FILE    WFILE
     C                     MOVEL'*FILE'   WTYPE
     C                     CALL 'FINC03'
     C                     PARM           WLIBL
     C                     PARM           WFILE
     C                     PARM           WTYPE
     C                     PARM           WCHEK
     C           WCHEK     IFEQ ' '
     C                     CALL 'FINC02'
     C                     PARM           WLIBL
     C                     PARM           WFILE
     C                     PARM           MOJI
     C                     END
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
**  ERROR
E-01 ENTER RETRIEVAL CONDITION
E-02 RETRIEVAL CONDITION SHOULD BE 1 TO 7
E-03 ENTER CHARACTER STRING.
E-04 ENTER LIBRARY.
E-05 LIBRARY DOES NOT EXIST.
E-06 ENTER ONE OR MORE FILES.
E-07 FILE DOES NOT EXIST IN LIBRARY.
** CK
ABCDEFGHIJKLMNOPQRSTUVWXYZ
