     H            Y.
     F***FIXR02  ***************************************************************
     F*  ADD PP10 TO PP2A (0232)                                               *
     F*  JW       2022.10.21                                                   *
     F**************************************************************************
     FAB#PL1O IF  E           K        DISK
     FAB#PLAD IF  E           K        DISK                      A
     FQPRINT  O   F     132     OF     PRINTER
     I            DS
     I                                        1   80WKNOHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1   80BAKOHZ
     I                                        1   40BAKOYY
     I                                        5   60BAKOMM
     I                                        7   80BAKODD
     I            DS
     I                                        1   40BAKOTM
     I                                        1   20BAKOHH
     I                                        3   40BAKOSS
     I            DS
     I                                        1  20 MHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           K#PL1O    SETLLAB#PL1O
     C                     DO   *HIVAL
     C           K#PL1O    READEAB#PL1O                  98
     C   98                LEAVE
      * IGNORE
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      * PPA1
     C           K#PLAD    CHAINAB#PLAD              99
     C           *IN99     IFEQ *ON
     C                     EXSR #PRINT
     C                     ADD  BASRYO    @TTL
      * UPDATE
     C           UPDFLG    IFEQ 'Y'
     C           BAKOME    ANDEQPAUSER
     C                     Z-ADDBAKOHZ    BACRHZ
     C           BAKOTM    MULT 100       BACRTM
     C                     MOVEL#USER     BACRME    P
     C                     MOVEL#PGM      BACRPG    P
     C                     MOVELMHIN      BAFLD2    P
     C                     WRITEAB#PPA11
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     EXCPT#GTL
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
      *
     C           LIN#      IFGE 66
     C                     EXCPT#HDR
     C                     Z-ADD3         LIN#
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPT#DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           PATOKU  4
     C                     PARM           PANONY  4
     C                     PARM           PANOHZ  8
     C                     PARM           PAUSER 10
     C                     PARM           UPDFLG  1
      *
     C           K#PL1O    KLIST
     C                     KFLD           KATOKU  40
     C                     KFLD           KANONY  40
     C                     KFLD           KANOYY  40
     C                     KFLD           KANOMM  20
     C                     KFLD           KANODD  20
      *
     C           K#PLAD    KLIST
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           BANOTM
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BANOBN
     C                     KFLD           BAODRN
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
      * SET KEY
     C                     MOVELPATOKU    KATOKU
     C                     MOVELPANONY    KANONY
     C                     MOVELPANOHZ    WKNOHZ
     C                     Z-ADDWKYY      KANOYY
     C                     Z-ADDWKMM      KANOMM
     C                     Z-ADDWKDD      KANODD
      *
     C           UPDFLG    IFEQ ' '
     C                     MOVEL'N'       UPDFLG
     C                     ENDIF
      *
     C                     TIME           SDATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD88        LIN#    30
     C                     Z-ADD0         @TTL    70
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           #HDR
     O                         #PGM      10
     O                                   19 'UPDATE='
     O                         UPDFLG    20
     O                                   45 '** MISSING PPA1 LIST'
     O                                   65 ' **                 '
     O                                   89 'DATE'
     O                         TODAY     92 '    .  .  '
     O                         NOW      102 '  :  :  '
     O                                  106 'P.'
     O                         PAGE  Z  110
     O        E   03           #HDR
     O                                    5 'SEQ#'
     O                                   10 'CUST'
     O                                   15 'DELV'
     O                                   31 'SHP_DATE'
     O                                   36 'BN'
     O                                   43 'ORDER#'
     O                                   58 'USER PART#'
     O                                   79 'QTY'
     O                                   87 'BAKOME'
     O        E 1              #DTL
     O                         SEQ#  1 +000
     O                         BATOKU  +001
     O                         BANONY  +001
     O                         BANKOJ  +001
     O                         BANUKE  +001
     O                         BANOHZ  +001 '    /  /  '
     O                         BANOBN  +001
     O                         BAODRN  +001
     O                         BAMHN1  +001
     O                         BAMHN2  +001
     O                         BAMHN3  +001
     O                         BASRYO1 +001
     O                         BAKOME  +002
     O        E 1              #GTL
     O                                   70 '** TOTAL **'
     O                         @TTL  1   79
