     H            Y.
     F** FIXR03  ***************************************************************
     F*  CHANGE BIN# OF PPA1                                                   *
     F*  JW     2024.10.29                                                     *
     F**************************************************************************
     FAB#PLAA UF  E           K        DISK
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C           K#PLA1    SETLLAB#PLAA
     C                     DO   *HIVAL
     C           K#PLA2    READEAB#PLAA                  98
     C   98                LEAVE
      * IGNORE
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      * PPA1
     C           $ODRN     IFNE *BLANK
     C           BAODRN    ANDNE$ODRN
     C                     ITER
     C                     ENDIF
      * UPDATE
     C                     ADD  1         CNT01
     C                     MOVEL$BINT     BANOBN
     C                     UPDATAB#PLAA1
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $NOHZ   8
     C                     PARM           $ODRN  10
     C                     PARM           $BINF   2
     C                     PARM           $BINT   2
      *
     C           K#PLA1    KLIST
     C                     KFLD           KANOHZ
     C                     KFLD           KANOBN
     C                     KFLD           KANONY
     C                     KFLD           KANKOJ
     C                     KFLD           KANUKE
     C                     KFLD           KAODRN
      *
     C           K#PLA2    KLIST
     C                     KFLD           KANOHZ
     C                     KFLD           KANOBN
     C                     KFLD           KANONY
     C                     KFLD           KANKOJ
     C                     KFLD           KANUKE
      *
     C           *LIKE     DEFN BANOHZ    KANOHZ
     C           *LIKE     DEFN BANOBN    KANOBN
     C           *LIKE     DEFN BANONY    KANONY
     C           *LIKE     DEFN BANKOJ    KANKOJ
     C           *LIKE     DEFN BANUKE    KANUKE
     C           *LIKE     DEFN BAODRN    KAODRN
      * SET KEY
     C                     MOVEL$NOHZ     KANOHZ
     C                     MOVEL$BINF     KANOBN
     C                     MOVEL$NONY     KANONY
     C                     MOVEL$NKOJ     KANKOJ
     C                     MOVEL$NUKE     KANUKE
     C                     MOVEL$ODRN     KAODRN
      *
     C                     Z-ADD0         CNT01   40
      *
     C                     ENDSR
