     H            Y.
     F***FIXR04  ***************************************************************
     F*  FIX JCMPP11                                                           *
     F*  JW       2025.04.14                                                   *
     F**************************************************************************
     FJCMPL11BUF  E           K        DISK
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     Z-ADD0         NUM9A   90
     C                     Z-ADD0         NUM9B   90
     C                     Z-ADD47625     @CTL#   90
     C                     MOVEL@CTL#     K#JCM  10
      *
     C           K#JCM     SETLLJCMPL11B
      *
     C                     DO   *HIVAL
     C                     READ JCMPL11B                 98
     C   98                LEAVE
      * END?
     C                     MOVELJ1KOME    CTL#    90
     C           CTL#      IFGT 48428
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVELJ1KOME    CTL#    90
     C           CTL#      SUB  5         CTL#2   90
     C                     MOVE *BLANK    $CTL#
     C                     MOVELCTL#2     $CTL#
     C                     CALL 'FIXR04A'
     C                     PARM           $CTL#  10
     C                     PARM           $CRME  10
     C                     PARM           $KOHZ   8
     C                     PARM           $KOTM   6
     C                     PARM           $SKME  10
      *
     C                     MOVEL$CRME     J1CRME
     C                     MOVEL$KOHZ     J1KOHZ
     C                     MOVEL$KOTM     J1KOTM
     C                     MOVEL$SKME     J1SKME
     C                     UPDATJCMPP111
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
