     H            Y.
      **FMAR41*******************************************************
      * PUBLICATION NISSHOIWAI KINZOKU HANBAI (CHIYODA KONPO) CAMI LBL *
      *  PROGRAM-ID.     :  FMAR41     <RPG>                        *
      *  CREATE DATE.    :  1995.JUL.31.                            *
      *  AUTHOR.         :  SHINICHIRO.OHTAKE                       *
      *  USER SECTION.   :  THE BUSINESS  SECTION.                  *
      *      THIS SOURCE IS COPYING FROM FMAR06.                    *
      *******************************************************FMAR41**
     FFMAWP41 IP  F     100            DISK
     FFMAPL01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFMAPR06 O   E                    PRINTER
     IFMAWP41 NS  01
     I                                        1   40TOKU
     I                                        5   9 HIN1
     I                                       10  14 HIN2
     I                                       15  16 HIN3
     I                                       17  240@YMD
     I                                       17  200YY
     I                                       21  220MM
     I                                       23  240DD
     I                                       25  300NOSU
     I                                       31  35 SHIN1
     I                                       36  40 SHIN2
     I                                       41  42 SHIN3
     I                                       43  460NOYY
     I                                       47  480NOMM
     I                                       49  500NODD
     I            DS
     I                                        1   5 FMSENO
     I                                        3   5 FMNO
     I            DS
     I                                        1   80FMSKHZ
     I                                        1   40FMSKYY
     I                                        5   60FMSKMM
     I                                        7   80FMSKDD
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1  12 HIZ1
     I                                        1   20MM1
     I                                        3   3 @AA
     I                                        4   50DD1
     I                                        6   6 @BB
     I                                        7   80@CC
     I                                        9  120YY1
     I            DS
     I                                        1  12 HIZ2
     I                                        1   20MM2
     I                                        3   3 #AA
     I                                        4   50DD2
     I                                        6   6 #BB
     I                                        7   80#CC
     I                                        9  120YY2
     I            DS
     I                                        1  11 SHN1
     I                                        1   5 SHN1A
     I                                        6   6 SHN1B
     I                                        7  11 SHN1C
     I            DS
     I                                        1  11 SHN2
     I                                        1   5 SHN2A
     I                                        6   6 SHN2B
     I                                        7  11 SHN2C
     I            DS
     I                                        1   9 TKR1
     I                                        1   1 TKR1A
     I                                        2   2 TKR1B
     I                                        3   4 TKR1C
     I                                        5   5 TKR1D
     I                                        6   7 TKR1E
     I                                        8   8 TKR1F
     I                                        9   9 TKR1G
     I            DS
     I                                        1   9 TKR2
     I                                        1   1 TKR2A
     I                                        2   2 TKR2B
     I                                        3   4 TKR2C
     I                                        5   5 TKR2D
     I                                        6   7 TKR2E
     I                                        8   8 TKR2F
     I                                        9   9 TKR2G
     C******************************************************
     C*  START PROGRAM  <FMAR06>                           *
     C******************************************************
     C  N01                GOTO @END
     C*
     C           *IN,90    IFEQ '0'
     C                     MOVE *BLANK    SW      1
     C                     MOVEA'1'       *IN,90
     C                     END
     C******************************************************
     C*  LET'S  PRINT-OUT                                  *
     C******************************************************
     C*
     C           KEY1      KLIST
     C                     KFLD           TOKU
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
     C*
     C           KEY2      KLIST
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
     C*
     C           KEY1      CHAINFMAPL011             10
     C           *IN,10    IFEQ '0'
     C           FMSKJY    ANDEQ'D'
     C           FMSKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,10
E001 C                     END
     C*
B001 C           *IN,10    IFEQ '0'
     C                     MOVELFMDESC    DESC   10
     C           FMSYOS    CABEQ0         @END
     C           NOSU      DIV  FMSYOS    XXX     30
E001 C                     END
     C*
     C                     Z-ADD0         CNT     20
B001 C                     DO   XXX       I       30
     C                     ADD  1         CNT
B002 C           CNT       IFEQ 1
     C                     MOVEA'0'       *IN,80
     C                     MOVELFMCHIN    CHIN1
     C                     Z-ADDFMSYOS    SYOS1
     C                     MOVELFMHIN1    HIN1A
     C                     MOVELFMHIN2    HIN1B
     C                     MOVELDESC      NAM1
     C                     Z-ADDNOYY      YY1
     C                     Z-ADDNOMM      MM1
     C                     Z-ADDNODD      DD1
     C                     Z-ADD19        @CC
     C                     MOVEL'/'       @AA
     C                     MOVEL'/'       @BB
     C                     Z-ADD@YMD      YMD1
     C                     MOVELFMNO      NO1
     C                     Z-ADDXXX       BNB1
     C                     Z-ADDI         X1
B003 C           FMYOR1    IFEQ '1'
     C                     MOVEL'YOR'     YOR1
X003 C                     ELSE
     C                     MOVE *BLANK    YOR1
E003 C                     END
     C*
B003 C           FMMII1    IFEQ '1'
     C                     MOVEL'M-II'    MI1
X003 C                     ELSE
     C                     MOVE *BLANK    MI1
E003 C                     END
     C*
     C                     MOVE *BLANK    SHN1
     C                     MOVELSHIN1     SHN1A
     C                     MOVELSHIN2     SHN1C
B003 C           SHN1C     IFNE *BLANK
     C                     MOVEL'-'       SHN1B
E003 C                     END
     C*
     C                     MOVE *BLANK    TKR1
     C           KEY2      CHAINFCEPL011             11
B003 C           *IN,11    IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,11
E003 C                     END
     C*
B003 C           *IN,11    IFEQ '0'
B004 C           A2TRHZ    IFGT *DATE
     C                     MOVELA2KTRK    TKR1A
     C                     MOVELA2KTRT    TKR1C
     C                     MOVELA2KTRR    TKR1E
     C                     MOVELA2KTRD    TKR1G
X004 C                     ELSE
     C                     MOVELA2STRK    TKR1A
     C                     MOVELA2STRT    TKR1C
     C                     MOVELA2STRR    TKR1E
     C                     MOVELA2STRD    TKR1G
E004 C                     END
B004 C           TKR1C     IFNE *BLANK
     C                     MOVEL'-'       TKR1B
E004 C                     END
     C*
B004 C           TKR1E     IFNE *BLANK
     C                     MOVEL'-'       TKR1D
E004 C                     END
     C*
B004 C           TKR1G     IFNE *BLANK
     C                     MOVEL'-'       TKR1F
E004 C                     END
E003 C                     END
     C*
     C                     MOVEL'*'       SW
E002 C                     END
     C*
B002 C           CNT       IFEQ 2
     C                     MOVEA'1'       *IN,80
     C                     MOVELFMCHIN    CHIN2
     C                     Z-ADDFMSYOS    SYOS2
     C                     MOVELFMHIN1    HIN2A
     C                     MOVELFMHIN2    HIN2B
     C                     MOVELDESC      NAM2
     C                     Z-ADDNOYY      YY2
     C                     Z-ADDNOMM      MM2
     C                     Z-ADDNODD      DD2
     C                     Z-ADD19        #CC
     C                     MOVEL'/'       #AA
     C                     MOVEL'/'       #BB
     C                     Z-ADD@YMD      YMD2
     C                     MOVELFMNO      NO2
     C                     Z-ADDXXX       BNB2
     C                     Z-ADDI         X2
B003 C           FMYOR1    IFEQ '1'
     C                     MOVEL'YOR'     YOR2
X003 C                     ELSE
     C                     MOVE *BLANK    YOR2
E003 C                     END
     C*
B003 C           FMMII1    IFEQ '1'
     C                     MOVEL'M-II'    MI2
X003 C                     ELSE
     C                     MOVE *BLANK    MI2
E003 C                     END
     C*
     C                     MOVE *BLANK    SHN2
     C                     MOVELSHIN1     SHN2A
     C                     MOVELSHIN2     SHN2C
B003 C           SHN2C     IFNE *BLANK
     C                     MOVEL'-'       SHN2B
E003 C                     END
     C*
     C                     MOVE *BLANK    TKR2
     C           KEY2      CHAINFCEPL011             12
B003 C           *IN,12    IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,12
E003 C                     END
     C*
B003 C           *IN,12    IFEQ '0'
B004 C           A2TRHZ    IFGT *DATE
     C                     MOVELA2KTRK    TKR2A
     C                     MOVELA2KTRT    TKR2C
     C                     MOVELA2KTRR    TKR2E
     C                     MOVELA2KTRD    TKR2G
X004 C                     ELSE
     C                     MOVELA2STRK    TKR2A
     C                     MOVELA2STRT    TKR2C
     C                     MOVELA2STRR    TKR2E
     C                     MOVELA2STRD    TKR2G
E004 C                     END
B004 C           TKR2C     IFNE *BLANK
     C                     MOVEL'-'       TKR2B
E004 C                     END
     C*
B004 C           TKR2E     IFNE *BLANK
     C                     MOVEL'-'       TKR2D
E004 C                     END
     C*
B004 C           TKR2G     IFNE *BLANK
     C                     MOVEL'-'       TKR2F
E004 C                     END
E003 C                     END
     C*
     C                     MOVEL*ALL'-'   SEN03
     C                     MOVEL*ALL'-'   SEN04
     C                     MOVEL*ALL'-'   SEN05
     C                     MOVEL*ALL'-'   SEN06
     C                     MOVEL*ALL'-'   SEN07
     C                     MOVEL*ALL'-'   SEN08
     C                     MOVEL*ALL'-'   SEN09
     C                     MOVEL*ALL'-'   SEN10
     C                     MOVEL*ALL'-'   SEN11
     C                     MOVEL*ALL'-'   SEN12
     C                     WRITEMID
     C                     MOVE *BLANK    SW
     C                     Z-ADD0         CNT
     C*  CLR
     C                     MOVE *BLANK    CHIN1
     C                     MOVE *BLANK    CHIN2
     C                     Z-ADD0         SYOS1
     C                     Z-ADD0         SYOS2
     C                     MOVE *BLANK    HIN1A
     C                     MOVE *BLANK    HIN1B
     C                     MOVE *BLANK    HIN2A
     C                     MOVE *BLANK    HIN2B
     C                     MOVE *BLANK    NAM1
     C                     MOVE *BLANK    NAM2
     C                     MOVE *BLANK    HIZ1
     C                     MOVE *BLANK    HIZ2
     C                     Z-ADD0         YMD1
     C                     Z-ADD0         YMD2
     C                     MOVE *BLANK    NO1
     C                     Z-ADD0         X1
     C                     Z-ADD0         BNB1
     C                     MOVE *BLANK    NO2
     C                     Z-ADD0         X2
     C                     Z-ADD0         BNB2
     C                     MOVE *BLANK    YOR1
     C                     MOVE *BLANK    YOR2
     C                     MOVE *BLANK    MI1
     C                     MOVE *BLANK    MI2
     C                     MOVE *BLANK    SHN1
     C                     MOVE *BLANK    SHN2
     C                     MOVE *BLANK    TKR1
     C                     MOVE *BLANK    TKR2
E002 C                     END
E001 C                     END
     C*
B001 C           SW        IFNE *BLANK
     C                     MOVEA'0'       *IN,80
     C                     MOVEL*ALL'-'   SEN03
     C                     MOVEL*ALL'-'   SEN04
     C                     MOVEL*ALL'-'   SEN05
     C                     MOVEL*ALL'-'   SEN06
     C                     MOVEL*ALL'-'   SEN07
     C                     MOVEL*ALL'-'   SEN08
     C                     MOVEL*ALL'-'   SEN09
     C                     MOVEL*ALL'-'   SEN10
     C                     MOVEL*ALL'-'   SEN11
     C                     MOVEL*ALL'-'   SEN12
     C                     WRITEMID
     C*  CLR
     C                     MOVE *BLANK    SW
     C                     Z-ADD0         CNT
     C                     MOVE *BLANK    CHIN1
     C                     Z-ADD0         SYOS1
     C                     MOVE *BLANK    HIN1A
     C                     MOVE *BLANK    HIN1B
     C                     MOVE *BLANK    NAM1
     C                     MOVE *BLANK    HIZ1
     C                     Z-ADD0         YMD1
     C                     MOVE *BLANK    NO1
     C                     Z-ADD0         X1
     C                     Z-ADD0         BNB1
     C                     MOVE *BLANK    YOR1
     C                     MOVE *BLANK    MI1
     C                     MOVE *BLANK    SHN1
     C                     MOVE *BLANK    TKR1
E001 C                     END
     C*
     C           @END      TAG
