     H            Y.
     F** FOAR16 *********************************************
     F*   DELIVERY MANEGEMENT MASTER LIST                 *
     F*       MSK......            2006.06.30               *
     F********************************************* FOAR16 **
     FFOAWP16 IP  F      50            DISK
     FRGAPL11 IF  E           K        DISK
     FFCQPL21 IF  E           K        DISK
     FFOAPR16 O   E             55     PRINTER
      *
     E                    ATM     1   4 16
      *
     IFOAWP16 AA  01
     I                                        1   2 INKAT1
     I                                        3   6 INKAT2
     I                                        7   7 INKAT3
     I                                        8   8 ING1SH
     I                                        9   9 ING2SH
     I                                       10  10 INZAKB
      *
     I            DS
     I                                        1   60@DATE
     I                                        1   20@YY
     I                                        3   40@MM
     I                                        5   60@DD
      *
     I            DS
     I                                        1   9 @KATA
     I                                        1   2 @KAT1
     I                                        3   3 WKF1
     I                                        4   7 @KAT2
     I                                        8   8 WKF2
     I                                        9   9 @KAT3
      *
     I            DS
     I                                        1   80WKDATE
     I                                        1   20WKDD
     I                                        3   40WKMM
     I                                        5   80WKYY
      *
     I           SDS
     I                                      254 263 @@USER
      *------------------------------------------------------*
      *  初期処理                                          *
      *------------------------------------------------------*
     C           INISW     IFEQ *BLANK
     C                     MOVE '1'       INISW   1
     C                     MOVE UDAY      @DD
     C                     MOVE UMONTH    @MM
     C                     MOVE *YEAR     @YY
     C                     SETOF                     21
     C           @@USER    CHAINRGAPL111             21
     C  N21                MOVELJ8NAME    @NAME
      *                ------------------
     C                     WRITEFOAPR161
      *                ------------------
     C                     END
      *----------------------------------------------------*
      *明細編集                                          *
      *----------------------------------------------------*
     C                     CLEARFOAPR162
     C                     CLEAR@KATA
     C                     MOVE INKAT1    @KAT1
     C                     MOVE '-'       WKF1
     C                     MOVE INKAT2    @KAT2
     C                     MOVE '-'       WKF2
     C                     MOVE INKAT3    @KAT3
     C           INKAT3    IFEQ *BLANK
     C                     MOVE *BLANK    WKF2
     C                     END
      *
     C                     MOVEL*BLANK    @KATNM
     C                     SETOF                       21
     C           INKAT1    CHAINFCQPL211             21
     C           *IN21     IFEQ '0'
     C           O9SKJY    ANDEQ'D'
     C           O9SKHZ    ANDLE*DATE
     C                     SETON                     21
     C                     END
     C  N21                MOVELO9KANM    @KATNM
      *
     C           ING1SH    IFEQ '1'
     C                     MOVELATM,1     @FIRST
     C                     END
     C           ING1SH    IFEQ '2'
     C                     MOVELATM,2     @FIRST
     C                     END
     C           ING1SH    IFEQ ' '
     C                     MOVELATM,3     @FIRST
     C                     END
      *
     C           ING2SH    IFEQ '1'
     C                     MOVELATM,1     @SECND
     C                     END
     C           ING2SH    IFEQ '2'
     C                     MOVELATM,2     @SECND
     C                     END
     C           ING2SH    IFEQ ' '
     C                     MOVELATM,3     @SECND
     C                     END
      *
     C           INZAKB    IFNE *BLANK
     C                     MOVELATM,4     @SPEC
     C                     END
      *                --------------------
     C                     WRITEFOAPR162
      *                --------------------
     C           *IN55     IFEQ '1'
     C                     WRITEFOAPR161
     C                     SETOF                       55
     C                     END
**
1 : REPRODUCTION
2 : TYPE MAKER
  : OTHERS
SPECIAL
