     H            Y.
     F** FOAR13 ************************************************
     F*     行き先票作成                                     *
     F*     MSK.......                    2006.03.02           *
     F************************************************ FOAR13 **
     FFOAPP10 IF  E           K        DISK
     FFOAPR13 O   E             55     PRINTER
      *
     E                    ATM     1   3 22
      *
     I            DS
     I                                        1   80OBSKHZ
     I                                        1   40OBSKYY
     I                                        5   60OBSKMM
     I                                        7   80OBSKDD
      *
     I            DS
     I                                        1   9 @KATA
     I                                        1   2 @KAT1
     I                                        3   3 WKF1
     I                                        4   7 @KAT2
     I                                        8   8 WKF3
     I                                        9   9 @KAT3
      *---------------------------------------------------------*
      *   TYPE MAKER ONLY                                       *
      *---------------------------------------------------------*
     C                     SETOF                         81
     C                     Z-ADD0         CTRX1   40
     C           *LOVAL    SETLLFOAPP101
     C                     DO   *HIVAL
     C                     READ FOAPP101                 81
     C   81                LEAVE
      *
     C           OBSKJY    IFEQ 'D'
     C           OBSKHZ    ANDLE*DATE
     C                     ITER
     C                     END
      *
     C           OBIKSK    IFNE '2'
     C                     ITER
     C                     END
      *
     C           OBLTKB    IFEQ 'N'                        行先票不要
     C                     ITER
     C                     END
      *
     C                     ADD  1         CTRX    40
      *
     C           CTRX      IFEQ 1
     C                     CLEAR@KATA
     C                     MOVE OBKAT1    @KAT1
     C                     MOVE '-'       WKF1
     C                     MOVE OBKAT2    @KAT2
     C                     MOVE '-'       WKF3
     C                     MOVE OBKAT3    @KAT3
     C           @KAT3     IFEQ *BLANK
     C                     MOVE *BLANK    WKF3
     C                     END
     C                     MOVE @KATA     @AKATA
     C                     Z-ADDOBSRYO    @ASRYO
     C                     MOVE *BLANK    @AATEN
     C           OBIKSK    IFEQ '1'
     C                     MOVELATM,1     @AATEN
     C                     END
     C           OBIKSK    IFEQ '2'
     C                     MOVELATM,2     @AATEN
     C                     END
     C           OBIKSK    IFEQ ' '
     C                     MOVELATM,3     @AATEN
     C                     END
      *
     C                     WRITEFOAPR131
     C                     CLEARFOAPR131
      *
     C                     END
      *
     C           CTRX      IFEQ 2
     C                     CLEAR@KATA
     C                     MOVE OBKAT1    @KAT1
     C                     MOVE '-'       WKF1
     C                     MOVE OBKAT2    @KAT2
     C                     MOVE '-'       WKF3
     C                     MOVE OBKAT3    @KAT3
     C           @KAT3     IFEQ *BLANK
     C                     MOVE *BLANK    WKF3
     C                     END
     C                     MOVE @KATA     @BKATA
     C                     Z-ADDOBSRYO    @BSRYO
     C                     MOVE *BLANK    @BATEN
     C           OBIKSK    IFEQ '1'
     C                     MOVELATM,1     @BATEN
     C                     END
     C           OBIKSK    IFEQ '2'
     C                     MOVELATM,2     @BATEN
     C                     END
     C           OBIKSK    IFEQ ' '
     C                     MOVELATM,3     @BATEN
     C                     END
      *
     C                     WRITEFOAPR132
     C                     CLEARFOAPR132
      *
     C                     END
      *
     C           CTRX      IFEQ 3
     C                     CLEAR@KATA
     C                     MOVE OBKAT1    @KAT1
     C                     MOVE '-'       WKF1
     C                     MOVE OBKAT2    @KAT2
     C                     MOVE '-'       WKF3
     C                     MOVE OBKAT3    @KAT3
     C           @KAT3     IFEQ *BLANK
     C                     MOVE *BLANK    WKF3
     C                     END
     C                     MOVE @KATA     @CKATA
     C                     Z-ADDOBSRYO    @CSRYO
     C                     MOVE *BLANK    @CATEN
     C           OBIKSK    IFEQ '1'
     C                     MOVELATM,1     @CATEN
     C                     END
     C           OBIKSK    IFEQ '2'
     C                     MOVELATM,2     @CATEN
     C                     END
     C           OBIKSK    IFEQ ' '
     C                     MOVELATM,3     @CATEN
     C                     END
      *
     C                     WRITEFOAPR133
     C                     CLEARFOAPR133
     C                     Z-ADD0         CTRX
      *
     C                     END
      *
     C                     ENDDO
      *
      *---------------------------------------------------------*
      *   REPRODUCTION                                          *
      *---------------------------------------------------------*
     C                     Z-ADD0         CTRX
     C                     SETOF                         81
     C           *LOVAL    SETLLFOAPP101
     C                     DO   *HIVAL
     C                     READ FOAPP101                 81
     C   81                LEAVE
      *
     C           OBSKJY    IFEQ 'D'
     C           OBSKHZ    ANDLE*DATE
     C                     ITER
     C                     END
      *
     C           OBLTKB    IFEQ 'N'                        行先票不要
     C                     ITER
     C                     END
      *
     C           OBIKSK    IFNE '1'
     C                     ITER
     C                     END
      *
     C                     ADD  1         CTRX    40
      *
     C           CTRX      IFEQ 1
     C                     SETON                       10
     C                     CLEAR@KATA
     C                     MOVE OBKAT1    @KAT1
     C                     MOVE '-'       WKF1
     C                     MOVE OBKAT2    @KAT2
     C                     MOVE '-'       WKF3
     C                     MOVE OBKAT3    @KAT3
     C           @KAT3     IFEQ *BLANK
     C                     MOVE *BLANK    WKF3
     C                     END
     C                     MOVE @KATA     @AKATA
     C                     Z-ADDOBSRYO    @ASRYO
     C                     MOVE *BLANK    @AATEN
     C           OBIKSK    IFEQ '1'
     C                     MOVELATM,1     @AATEN
     C                     END
     C           OBIKSK    IFEQ '2'
     C                     MOVELATM,2     @AATEN
     C                     END
     C           OBIKSK    IFEQ ' '
     C                     MOVELATM,3     @AATEN
     C                     END
      *
     C                     WRITEFOAPR131
     C                     CLEARFOAPR131
      *
     C                     END
      *
     C           CTRX      IFEQ 2
     C                     SETON                       10
     C                     CLEAR@KATA
     C                     MOVE OBKAT1    @KAT1
     C                     MOVE '-'       WKF1
     C                     MOVE OBKAT2    @KAT2
     C                     MOVE '-'       WKF3
     C                     MOVE OBKAT3    @KAT3
     C           @KAT3     IFEQ *BLANK
     C                     MOVE *BLANK    WKF3
     C                     END
     C                     MOVE @KATA     @BKATA
     C                     Z-ADDOBSRYO    @BSRYO
     C                     MOVE *BLANK    @BATEN
     C           OBIKSK    IFEQ '1'
     C                     MOVELATM,1     @BATEN
     C                     END
     C           OBIKSK    IFEQ '2'
     C                     MOVELATM,2     @BATEN
     C                     END
     C           OBIKSK    IFEQ ' '
     C                     MOVELATM,3     @BATEN
     C                     END
      *
     C                     WRITEFOAPR132
     C                     CLEARFOAPR132
      *
     C                     END
      *
     C           CTRX      IFEQ 3
     C                     CLEAR@KATA
     C                     MOVE OBKAT1    @KAT1
     C                     MOVE '-'       WKF1
     C                     MOVE OBKAT2    @KAT2
     C                     MOVE '-'       WKF3
     C                     MOVE OBKAT3    @KAT3
     C           @KAT3     IFEQ *BLANK
     C                     MOVE *BLANK    WKF3
     C                     END
     C                     MOVE @KATA     @CKATA
     C                     Z-ADDOBSRYO    @CSRYO
     C                     MOVE *BLANK    @CATEN
     C           OBIKSK    IFEQ '1'
     C                     MOVELATM,1     @CATEN
     C                     END
     C           OBIKSK    IFEQ '2'
     C                     MOVELATM,2     @CATEN
     C                     END
     C           OBIKSK    IFEQ ' '
     C                     MOVELATM,3     @CATEN
     C                     END
      *
     C                     WRITEFOAPR133
     C                     CLEARFOAPR133
      *
     C                     Z-ADD0         CTRX
     C                     END
     C                     ENDDO
      *
     C                     SETON                       LR
     C                     RETRN
      *
**
REPRODUCTION FACTORY
TYPEMAKER
OTHERS
