     H            Y.
     F** FQAR10 **********************************
     F* ..UPDATE OF THE FQA SERTIFICATION ITEM.. *
     F*     A.MAMIYA               98.04.03      *
     F********************************** FQAR10 **
     FFQAPW10 CF  E                    WORKSTN
     FFQAPL10 UF  E           K        DISK                      A
     E                    ER      1  20 60
      *
     I            DS
     I                                        1   80F1SKHZ
     I                                        1   40F1SKYY
     I                                        5   60F1SKMM
     I                                        7   80F1SKDD
     I            DS
     I                                        1   80F1KOHZ
     I                                        1   40F1KOYY
     I                                        5   60F1KOMM
     I                                        7   80F1KODD
     I            DS
     I                                        1   60WTIME
     I                                        1   20F1KOHH
     I                                        3   40F1KOSS
      *
     C           *ENTRY    PLIST
     C                     PARM           USER   10
      *
     C           STEP0     TAG
     C                     MOVE *BLANK    IKOS
     C                     MOVE *BLANK    ICODE
     C                     MOVE *BLANK    ICERT
      *
     C           STEP1     TAG
     C                     EXFMTFQAPW101
     C                     SETOF                     010299
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           IKOS      IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STEP1
     C                     END
      *
     C           IKOS      IFNE '0'
     C           IKOS      ANDNE'1'
     C           IKOS      ANDNE'2'
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     GOTO STEP1
     C                     END
      *
     C           ICODE     IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     GOTO STEP1
     C                     END
      *
     C                     SETOF                     10
     C           ICODE     CHAINFQAPL101             10
      *
     C           IKOS      IFEQ '0'
     C           IKOS      OREQ '1'
     C           *IN10     IFEQ '1'
     C                     SETON                     010299
     C                     MOVE ER,4      MSG
     C                     GOTO STEP1
     C                     END
      *
     C           *IN10     IFEQ '0'
     C           F1SKJY    IFEQ 'D'
     C           F1SKHZ    ANDLE*DATE
     C                     SETON                     010299
     C                     MOVE ER,4      MSG
     C                     GOTO STEP1
     C                     END
     C                     END
      *
     C                     MOVE F1CERT    ICERT
     C                     END
      *
     C           IKOS      IFEQ '2'
     C           *IN10     ANDEQ'0'
     C           F1SKJY    IFEQ 'D'
     C           F1SKHZ    ANDLE*DATE
     C                     ELSE
     C                     SETON                     010299
     C                     MOVE ER,5      MSG
     C                     GOTO STEP1
     C                     END
     C                     END
      *
     C           STEP2     TAG
     C                     EXFMTFQAPW102
     C                     SETOF                     0399
      *
     C           *INKC     IFEQ '1'
     C                     GOTO STEP0
     C                     ENDIF
      *
     C           ICERT     IFEQ *BLANK
     C                     SETON                     0399
     C                     MOVE ER,6      MSG
     C                     GOTO STEP2
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STEP2
     C                     END
      *
     C           IKOS      IFEQ '0'
     C                     MOVE 'D'       F1SKJY
     C                     Z-ADD*DATE     F1SKHZ
     C                     ELSE
     C                     MOVE ' '       F1SKJY
     C                     Z-ADD0         F1SKHZ
     C                     END
      *
     C           IKOS      IFEQ '1'
     C           IKOS      OREQ '2'
     C                     MOVE ICODE     F1CODE
     C                     MOVE ICERT     F1CERT
     C                     END
      *
     C                     Z-ADD*DATE     F1KOHZ
     C                     TIME           WTIME
     C                     MOVELUSER      F1KOME
      *
     C           *IN10     IFEQ '0'
     C                     UPDATFQAPL101
     C                     ELSE
     C                     WRITEFQAPL101
     C                     END
      *
     C                     GOTO STEP0
** ER
E-01 INPUT UPDATE CODE
E-02 UPDATE CODE IS NOT RIGHT <0.1.2>
E-03 INPUT TEST ITEM CODE
E-04 TEST CERTIFICATION STANDERD DATA IS NOT FOUND
E-05 THIS DATA HAS ALREADY BEEN REGISTERED
E-06 INPUT CERTIFICATION STANDERD
