     H            Y.
     F** GADR12 ********************************
     F* .. LIST BY SHIPMENT M/F MAKER *.
     F* I-HASADA                   97.01.22    *
     F* UPDATE:K.OKACHI    2002.05.27    %0001 *
     F******************************** GADR12 **
     FGADTL17 IP  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TB1     1   1 46               vjﾞﾆ
     E                    TB2     1   1 24               vjﾞﾆ
     I            DS
     I                                        1   80B5SKHZ
     I                                        1   40B5SKYY
     I                                        5   60B5SKMM
     I                                        7   80B5SKDD
     I            DS
     I                                        1   40B51UTM
     I                                        1   20B51UJI
     I                                        3   40B51UFN
     I            DS
     I                                        1   40B51STM
     I                                        1   20B51SJI
     I                                        3   40B51SFN
%0001 *
      * 02 BIN
     I            DS
     I                                        1   40B52UTM
     I                                        1   20B52UJI
     I                                        3   40B52UFN
     I            DS
     I                                        1   40B52STM
     I                                        1   20B52SJI
     I                                        3   40B52SFN
      * 03 BIN
     I            DS
     I                                        1   40B53UTM
     I                                        1   20B53UJI
     I                                        3   40B53UFN
     I            DS
     I                                        1   40B53STM
     I                                        1   20B53SJI
     I                                        3   40B53SFN
      * 04 BIN
     I            DS
     I                                        1   40B54UTM
     I                                        1   20B54UJI
     I                                        3   40B54UFN
     I            DS
     I                                        1   40B54STM
     I                                        1   20B54SJI
     I                                        3   40B54SFN
%0001 *
      *
     C                     SETOF                     020407
     C                     SETOF                     10
     C                     TIME           WTIME   60
      *
     C           *IN11     IFEQ '0'
     C                     SETON                     1011
     C                     Z-ADD0         WNONY   40
     C                     END
      *
     C           B5SKJY    IFEQ 'D'
     C           B5SKHZ    ANDLE*DATE
     C                     GOTO END
     C                     END
      *
     C                     SETON                     02
%0001 *
     C                     SETON                     03
     C           B53UCH    IFEQ 0
     C           B53UJI    ANDEQ0
     C           B53UFN    ANDEQ0
     C           B53SCH    ANDEQ0
     C           B53SJI    ANDEQ0
     C           B53SFN    ANDEQ0
     C           B54UCH    ANDEQ0
     C           B54UJI    ANDEQ0
     C           B54UFN    ANDEQ0
     C           B54SCH    ANDEQ0
     C           B54SJI    ANDEQ0
     C           B54SFN    ANDEQ0
     C                     SETOF                     03
     C                     END
%0001 *
     C           B5NONY    IFNE WNONY
     C                     Z-ADDB5NONY    WNONY
     C                     SETON                     04
      *
     C                     SETOF                     05
     C                     MOVE *BLANK    WSMEI  15
     C           B5NONY    CHAINFGBPL011             05
     C           *IN05     IFEQ '0'
     C                     MOVELB2SMEI    WSMEI
     C                     END
     C                     END
      *
     C   06                SETON                     04
     C   04                SETOF                     06
      *
     C   04
     COR OF                SETON                     07
      *
     C           END       TAG
      *
     CL0 OF                SETON                     06
      *
     OQPRINT  H  102   10
     O       OR        OF
     O                                  131 '+-------------------+'
     O        H  1     10
     O       OR        OF
     O                                  131 '|         |         |'
     O        H  1     10
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '|         |         |'
     O        H  2     10
     O       OR        OF
     O                                   10 'GADR12-1'
     O                         TB1,1     80
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        H  1     10
     O       OR        OF
     O                         TB2,1     70
     O                                  100 'SALES ADD UP-'
     O                                  118 'SHIPMENT--------'
     O        H  2     10
     O       OR        OF
     O                                   14 'RECEIVING CO.'
     O                                   31 'FACTORY'
     O                                   45 'RCV'
     O                                   52 'CUST'
     O                                   56 'SUP'
     O                                   64 'PROV'
     O                                   72 'CYCLE'
     O                                   82 'UWK N AT'
     O                                   93 'AJST DATE'
     O                                   98 'TIME'
     O                                  111 'AJST DATE'
     O                                  116 'TIME'
     O                                  132 'TRANS RATE UNP'
     O        D 1      02N04
     O       OR 2      02 04
     O                 07      B5NONY     6
     O                 07      WSMEI     22
     O                         B5NKOJ    25
     O*                        B5KMEI    41
     O                         B5NUKE    46
     O                         B5TOKU    52
     O                         B5SIRE    57
     O                                   58 '-'
     O                         B5SMEI    59
     O                         B5SKYU    64
     O                         B5HIZK    69
     O                                   70 '-'
     O                         B5KAIS    71
     O                                   72 '-'
     O                         B5NBIN    73
     O                         B5RNJI    79
%0001 *
     O***                      B51UCHZ   90
     O***                      B51UTM    99 '  :  '
     O***                      B51SCHZ  108
     O***                      B51STM   117 '  :  '
      * 01 BIN
     O                         B51UCHZ   84
     O                         B51UTM    90 '  :  '
     O                         B51SCHZ  102
     O                         B51STM   108 '  :  '
      * 02 BIN
     O                         B52UCHZ   93
     O                         B52UTM    99 '  :  '
     O                         B52SCHZ  112
     O                         B52STM   118 '  :  '
%0001 *
     O                         B5UTNK1  131
%0001 *
     O        D 1      02N04 03
      * 03 BIN
     O                         B53UCHZ   84
     O                         B53UTM    90 '  :  '
     O                         B53SCHZ  102
     O                         B53STM   108 '  :  '
      * 04 BIN
     O                         B54UCHZ   93
     O                         B54UTM    99 '  :  '
     O                         B54SCHZ  112
     O                         B54STM   118 '  :  '
%0001 *
      *
** TB1
                 LIST BY SHIPMENT M/F MAKER *
** TB2
      USER SETTING-----
