     H            Y.
     F** GADR11 ********************************
     F* .. SHIPMENT M/F UPDATE || *.           *
     F* I-HASADA 96.12.18 *                    *
     F* ---------------------------------------*
     F* UPDATE:K.OKACHI    2002.05.24    %0001 *
     F* UPDATE:A.AMANO     2002.10.30          *
JW1  F* JW     2018.05.14 CHG MESAGE                        *
JW2  F* JW     2022.06.29 ADD SHIPPINQ INQ                  *
     F*******************************************************
     FGADPW11 CF  E                    WORKSTN
     FGADPL11 UF  E           K        DISK                      A
     FGADWP11 IF  E           K        DISK                      A
     FFGBPL01 IF  E           K        DISK
     E                    HYB         7  1
     E                    ER      1  26 60
     I            DS
     I                                        1   80B5SKHZ
     I                                        1   40B5SKYY
     I                                        5   60B5SKMM
     I                                        7   80B5SKDD
     I            DS
     I                                        1   80B5KOHZ
     I                                        1   40B5KOYY
     I                                        5   60B5KOMM
     I                                        7   80B5KODD
     I            DS
     I                                        1   60WTIME
     I                                        1   20B5KOHH
     I                                        3   40B5KOSS
     I            DS
     I                                        1   7 HYB
     I                                        1   1 B5YOB1
     I                                        2   2 B5YOB2
     I                                        3   3 B5YOB3
     I                                        4   4 B5YOB4
     I                                        5   5 B5YOB5
     I                                        6   6 B5YOB6
     I                                        7   7 B5YOB7
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   40CTIME
     I                                        1   20CJI
     I                                        3   40CFN
     I            DS
     I                                        1   60B5SIKR
     I                                        1   20B5HIZK
     I                                        3   40B5KAIS
     I                                        5   60B5NBIN
     I            DS
     I                                        1   40B51UTI
     I                                        1   20B51UJI
     I                                        3   40B51UFN
     I            DS
     I                                        1   40B51STI
     I                                        1   20B51SJI
     I                                        3   40B51SFN
%0001 *
      * 02 BIN
     I            DS
     I                                        1   40B52UTI
     I                                        1   20B52UJI
     I                                        3   40B52UFN
     I            DS
     I                                        1   40B52STI
     I                                        1   20B52SJI
     I                                        3   40B52SFN
      * 03 BIN
     I            DS
     I                                        1   40B53UTI
     I                                        1   20B53UJI
     I                                        3   40B53UFN
     I            DS
     I                                        1   40B53STI
     I                                        1   20B53SJI
     I                                        3   40B53SFN
      * 04 BIN
     I            DS
     I                                        1   40B54UTI
     I                                        1   20B54UJI
     I                                        3   40B54UFN
     I            DS
     I                                        1   40B54STI
     I                                        1   20B54SJI
     I                                        3   40B54SFN
%0001 *
      *
     C           KEY1      KLIST
     C                     KFLD           B5TOKU
     C                     KFLD           B5NONY
     C                     KFLD           B5NKOJ
     C                     KFLD           B5NUKE
      *
     C           KEY2      KLIST
     C                     KFLD           DTOKU
     C                     KFLD           DNONY
     C                     KFLD           DNKOJ
      *
     C           K#GW      KLIST
     C                     KFLD           K@DATE  80
     C                     KFLD           B5TOKU
     C                     KFLD           B5NONY
     C                     KFLD           B5NKOJ
     C                     KFLD           B5NUKE
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *
     C                     Z-ADD0         B5SKHZ
      *
     C*--------------------------*
     C* MAIN                     *
     C*--------------------------*
     C           STP1      TAG
     C                     EXFMTGADPW111
     C                     SETOF                     010203
     C                     SETOF                     040594
     C                     SETOF                     99
      *  F3: EXIT
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
JW1   *  F10: SHIP MASTER INQ
 .   C           *INKJ     IFEQ *ON
 .   C                     CALL 'GADR10B'
 .   C                     GOTO STP1
JW1  C                     ENDIF
      *
     C                     MOVE ATOKU     DTOKU   40
     C                     MOVE ANONY     DNONY   40
     C                     MOVE B5NKOJ    DNKOJ   1
     C                     MOVE B5NUKE    DNUKE   4
      *
     C           AKOSN     IFEQ '2'
     C                     MOVE *BLANK    DKMEI  15
     C                     MOVE *BLANK    DSIRE   4
     C                     MOVE *BLANK    DSMEI   1
     C                     MOVE *BLANK    DSKYU   4
      *
     C           KEY2      SETLLGADPL111
     C                     SETOF                     92
     C           KEY2      READEGADPL111                 92
     C           *IN92     IFEQ '0'
     C                     UPDATGADPL111
     C                     MOVELB5KMEI    DKMEI
     C                     MOVE B5SIRE    DSIRE
     C                     MOVE B5SMEI    DSMEI
     C                     MOVE B5SKYU    DSKYU
     C                     END
     C                     END
      *
     C                     MOVE DNKOJ     B5NKOJ
     C                     MOVE DNUKE     B5NUKE
      *
     C*--------------------------*
     C* UPDATE                   *
     C*--------------------------*
     C           AKOSN     IFEQ '0'
     C                     MOVEL'CANCEL'  AKSNM
     C                     GOTO STP2
     C                     END
     C           AKOSN     IFEQ '1'
     C                     MOVE 'CHANGE'  AKSNM
     C                     GOTO STP2
     C                     END
     C           AKOSN     IFEQ '2'
     C                     MOVE 'ADD'     AKSNM
     C                     GOTO STP2
     C                     END
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C           STP2      TAG
      *
     C*------------------------*
     C* CUSTOMER               *
     C*------------------------*
     C           ATOKU     IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
     C                     MOVE ATOKU     B5TOKU
      *
     C                     SETOF                     92
     C           B5TOKU    CHAINFGBPL011             92
     C           *IN92     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    IFLE *DATE
     C                     SETON                     92
     C                     END
     C                     END
     C                     END
     C           *IN92     IFEQ '1'
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     END
      *
     C*------------------------*
     C* DELIVERY               *
     C*------------------------*
     C           ANONY     IFEQ *BLANK
     C                     SETON                     0399
     C                     MOVE ER,4      MSG
     C                     GOTO STP1
     C                     END
     C                     MOVE ANONY     B5NONY
      *
     C                     SETOF                     92
     C           B5NONY    CHAINFGBPL011             92
     C           *IN92     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    IFLE *DATE
     C                     SETON                     92
     C                     END
     C                     END
     C                     END
     C           *IN92     IFEQ '1'
     C                     SETON                     0399
     C                     MOVE ER,5      MSG
     C                     GOTO STP1
     C                     END
      *
     C*------------------------------*
     C* FACTORY                      *
     C*------------------------------*
     C           B5NKOJ    IFEQ *BLANK
     C                     SETON                     0499
     C                     MOVE ER,6      MSG
     C                     GOTO STP1
     C                     END
      *
     C*------------------------------*
     C* DOCK                         *
     C*------------------------------*
     C           B5NUKE    IFEQ *BLANK
     C                     SETON                     0599
     C                     MOVE ER,7      MSG
     C                     GOTO STP1
     C                     END
      *
     C                     SETOF                     9293
     C           KEY1      CHAINGADPL111             93
      *
     C*---------------------------------*
     C* DELETE CHECK                    *
     C*---------------------------------*
     C           *IN93     IFEQ '0'
     C           B5SKJY    IFEQ 'D'
     C           B5SKHZ    IFLE *DATE
     C                     SETON                     92
     C                     END
     C                     END
     C                     END
      *
     C           AKOSN     IFEQ '0'
     C           *IN93     IFEQ '1'
     C                     SETON                     010203
     C                     SETON                     040599
     C                     MOVE ER,8      MSG
     C                     GOTO STP1
     C                     END
     C           *IN92     IFEQ '1'
     C                     SETON                     010203
     C                     SETON                     040599
     C                     MOVE ER,9      MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C*--------------------------------*
     C* UPDATE CHECK                   *
     C*--------------------------------*
     C           AKOSN     IFEQ '1'
     C           *IN93     IFEQ '1'
     C                     SETON                     010203
     C                     SETON                     040599
     C                     MOVE ER,10     MSG
     C                     GOTO STP1
     C                     END
     C           *IN92     IFEQ '1'
     C                     SETON                     010203
     C                     SETON                     040599
     C                     MOVE ER,11     MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C*--------------------------------*
     C* ADD CHECK                      *
     C*--------------------------------*
     C           AKOSN     IFEQ '2'
     C           *IN92     IFEQ '0'
     C           *IN93     IFEQ '0'
     C                     SETON                     010203
     C                     SETON                     040599
     C                     MOVE ER,12     MSG
     C                     GOTO STP1
     C                     END
     C                     END
     C                     END
      *
     C           AKOSN     IFEQ '2'
     C                     MOVE *BLANK    B5SKJY
     C                     Z-ADD0         B5SKHZ
     C                     MOVE *BLANK    B5KMEI
     C                     Z-ADD0         B5SIKR
     C                     MOVE *BLANK    HYB
     C                     MOVE *BLANK    B5SIRE
     C                     MOVE *BLANK    B5SMEI
     C                     MOVE *BLANK    B5SKYU
     C                     MOVE *BLANK    B5UTKN
     C                     Z-ADD0         B5UTNK
     C                     MOVE *BLANK    B5RNJI
     C                     Z-ADD0         B51UCH
     C                     Z-ADD0         B51UJI
     C                     Z-ADD0         B51UFN
     C                     Z-ADD0         B51SCH
     C                     Z-ADD0         B51SJI
     C                     Z-ADD0         B51SFN
%0001 *
      * 02 BIN
     C                     Z-ADD0         B52UCH
     C                     Z-ADD0         B52UJI
     C                     Z-ADD0         B52UFN
     C                     Z-ADD0         B52SCH
     C                     Z-ADD0         B52SJI
     C                     Z-ADD0         B52SFN
      * 03 BIN
     C                     Z-ADD0         B53UCH
     C                     Z-ADD0         B53UJI
     C                     Z-ADD0         B53UFN
     C                     Z-ADD0         B53SCH
     C                     Z-ADD0         B53SJI
     C                     Z-ADD0         B53SFN
      * 04 BIN
     C                     Z-ADD0         B54UCH
     C                     Z-ADD0         B54UJI
     C                     Z-ADD0         B54UFN
     C                     Z-ADD0         B54SCH
     C                     Z-ADD0         B54SJI
     C                     Z-ADD0         B54SFN
%0001 *
     C                     MOVELDKMEI     B5KMEI
     C                     MOVE DSIRE     B5SIRE
     C                     MOVE DSMEI     B5SMEI
     C                     MOVE DSKYU     B5SKYU
     C                     ELSE
      *
     C                     MOVELB5KMEI    W5KMEI
     C                     MOVE B5HIZK    AHIZK
     C                     MOVE B5KAIS    AKAIS
     C                     MOVE B5NBIN    ANBIN
     C                     END
      *
     C           AKOSN     IFEQ '0'
     C                     SETON                     94
     C                     ELSE
     C           B5SKHZ    IFNE 0
     C                     SETON                     94
     C                     END
     C                     END
      *
     C*--------------------------*
     C* 2ND SCREEN               *
     C*--------------------------*
     C           STP3      TAG
     C                     EXFMTGADPW112
     C                     SETOF                     070809
     C                     SETOF                     101112
     C                     SETOF                     131415
     C                     SETOF                     161718
     C                     SETOF                     192021
     C                     SETOF                     222728
     C                     SETOF                     293233
%0001 *
     C                     MOVEA'000000'  *IN,34
     C                     MOVEA'000000'  *IN,40
%0001 *
     C                     SETOF                     99
      * F3: BACK
     C           *INKC     IFEQ '1'
     C                     EXSR SUBRTN
     C                     GOTO STP1
     C                     END
      * F6: --> *IN94=*ON
     C   KF                SETON                     94
      *
     C*----------------------------*
     C*                            *
     C*----------------------------*
      * F6: CAHNGE DELETE-DATE
     C           *IN94     IFEQ '1'
     C           B5SKHZ    IFEQ 0
     C                     Z-ADD*DATE     B5SKHZ
     C                     END
      *
     C           B5SKYY    IFGE 1997
     C           B5SKMM    IFLE 12
     C           B5SKMM    IFGE 01
     C           B5SKDD    IFLE 31
     C           B5SKDD    IFGE 01
     C                     GOTO SP1
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     SETON                     2799
     C                     MOVE ER,13     MSG
     C                     GOTO STP3
     C           SP1       TAG
     C                     END
      *
     C*------------------------*
     C*                        *
     C*------------------------*
     C           W5KMEI    IFEQ *BLANK
     C                     SETON                     0799
     C                     MOVE ER,14     MSG
     C                     GOTO STP3
     C                     END
      *
     C*--------------------------*
     C*                          *
     C*--------------------------*
     C           AHIZK     IFEQ *BLANK
     C                     SETON                     0899
     C                     MOVE ER,15     MSG
     C                     GOTO STP3
     C                     END
      *
     C           AKAIS     IFEQ *BLANK
     C                     SETON                     0999
     C                     MOVE ER,16     MSG
     C                     GOTO STP3
     C                     END
      *
     C           ANBIN     IFEQ *BLANK
     C                     SETON                     1099
     C                     MOVE ER,17     MSG
     C                     GOTO STP3
     C                     END
      *
     C                     MOVE AHIZK     B5HIZK
     C                     MOVE AKAIS     B5KAIS
     C                     MOVE ANBIN     B5NBIN
      *
     C*----------------------*
     C*                      *
     C*----------------------*
     C                     Z-ADD1         A       10
     C                     Z-ADD10        B       20
     C           1         DO   7         A
     C                     ADD  1         B
     C           HYB,A     IFNE *BLANK
      *
     C           HYB,A     IFNE 'A'
     C           HYB,A     IFNE 'B'
     C           HYB,A     IFNE 'C'
     C           HYB,A     IFNE 'D'
     C                     MOVE '1'       *IN,B
     C                     SETON                     99
     C                     MOVE ER,18     MSG
     C                     GOTO STP3
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
      *
     C*------------------------*
     C*                        *
     C*------------------------*
     C           B5SIRE    IFEQ *BLANK
     C                     SETON                     1899
     C                     MOVE ER,19     MSG
     C                     GOTO STP3
     C                     END
      *
     C*------------------------------*
     C*                              *
     C*------------------------------*
     C           B5SMEI    IFEQ *BLANK
     C                     MOVE '0'       B5SMEI
     C                     END
      *
     C*------------------------*
     C*                        *
     C*------------------------*
     C           B5SKYU    IFEQ *BLANK
     C                     SETON                     1999
     C                     MOVE ER,20     MSG
     C                     GOTO STP3
     C                     END
      *
     C*----------------------------------------*
     C*                                        *
     C*----------------------------------------*
     C           B5UTKN    IFEQ *BLANK
     C           B5UTNK    IFNE 0
     C                     SETON                     2099
     C                     MOVE ER,21     MSG
     C                     GOTO STP3
     C                     END
     C                     ELSE
      *
     C           B5UTNK    IFEQ 0
     C                     SETON                     2199
     C                     MOVE ER,22     MSG
     C                     GOTO STP3
     C                     END
     C                     END
      *
     C*--------------------------*
     C*     01 BIN               *
     C*--------------------------*
     C           B51UCH    IFEQ 0
     C           B51UTI    IFNE 0
     C                     SETON                     2899
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
     C                     ELSE
      *
     C           B51UTI    IFEQ 0
     C                     SETON                     2999
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
     C                     Z-ADDB51UTI    CTIME
      *
     C                     EXSR SUBJI
     C           *IN99     IFEQ '1'
     C                     SETON                     2999
     C                     MOVE ER,25     MSG
     C                     GOTO STP3
     C                     END
     C                     END
      *
     C*----------------------*
     C*                      *
     C*----------------------*
     C           B51SCH    IFEQ 0
     C                     SETON                     3299
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
      *
     C           B51STI    IFEQ 0
     C                     SETON                     3399
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
     C                     Z-ADDB51STI    CTIME
      *
     C                     EXSR SUBJI
     C           *IN99     IFEQ '1'
     C                     SETON                     3399
     C                     MOVE ER,25     MSG
     C                     GOTO STP3
     C                     END
%0001 *
     C*--------------------------*
     C* 02 BIN SALES AJST DATE   *
     C*--------------------------*
     C           B5KAIS    IFGE 2
     C           B52UCH    IFEQ 0
     C           B52UTI    IFNE 0
     C                     SETON                     3499
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
     C                     ELSE
      *
     C           B52UTI    IFEQ 0
     C                     SETON                     3599
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
     C                     Z-ADDB52UTI    CTIME
      *
     C                     EXSR SUBJI
     C           *IN99     IFEQ '1'
     C                     SETON                     3599
     C                     MOVE ER,25     MSG
     C                     GOTO STP3
     C                     END
     C                     END
      *
     C*-----------------------*
     C* 02 BIN SHIP AJST DATE *
     C*-----------------------*
     C           B52SCH    IFEQ 0
     C                     SETON                     3699
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
      *
     C           B52STI    IFEQ 0
     C                     SETON                     3799
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
     C                     Z-ADDB52STI    CTIME
      *
     C                     EXSR SUBJI
     C           *IN99     IFEQ '1'
     C                     SETON                     3799
     C                     MOVE ER,25     MSG
     C                     GOTO STP3
     C                     END
     C                     ELSE
     C           B52UCH    IFNE 0
     C           B52UTI    ORNE 0
     C           B52SCH    ORNE 0
     C           B52STI    ORNE 0
     C                     MOVEA'1111'    *IN,34
     C                     SETON                     99
     C                     MOVELER,26     MSG
JW   C                     MOVE 1         MSG
     C                     GOTO STP3
     C                     END
     C                     END
     C*--------------------------*
     C* 03 BIN SALES AJST DATE   *
     C*--------------------------*
     C           B5KAIS    IFGE 3
     C           B53UCH    IFEQ 0
     C           B53UTI    IFNE 0
     C                     SETON                     3899
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
     C                     ELSE
      *
     C           B53UTI    IFEQ 0
     C                     SETON                     3999
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
     C                     Z-ADDB53UTI    CTIME
      *
     C                     EXSR SUBJI
     C           *IN99     IFEQ '1'
     C                     SETON                     3999
     C                     MOVE ER,25     MSG
     C                     GOTO STP3
     C                     END
     C                     END
      *
     C*------------------------*
     C* 03 BIN SHIP AJST DATE  *
     C*------------------------*
     C           B53SCH    IFEQ 0
     C                     SETON                     4099
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
      *
     C           B53STI    IFEQ 0
     C                     SETON                     4199
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
     C                     Z-ADDB53STI    CTIME
      *
     C                     EXSR SUBJI
     C           *IN99     IFEQ '1'
     C                     SETON                     4199
     C                     MOVE ER,25     MSG
     C                     GOTO STP3
     C                     END
     C                     ELSE
     C           B53UCH    IFNE 0
     C           B53UTI    ORNE 0
     C           B53SCH    ORNE 0
     C           B53STI    ORNE 0
     C                     MOVEA'1111'    *IN,38
     C                     SETON                     99
     C                     MOVELER,26     MSG
JW   C                     MOVE 2         MSG
     C                     GOTO STP3
     C                     END
     C                     END
     C*--------------------------*
     C* 04 BIN SALES AJST DATE   *
     C*--------------------------*
     C           B5KAIS    IFGE 4
     C           B54UCH    IFEQ 0
     C           B54UTI    IFNE 0
     C                     SETON                     4299
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
     C                     ELSE
      *
     C           B54UTI    IFEQ 0
     C                     SETON                     4399
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
     C                     Z-ADDB54UTI    CTIME
      *
     C                     EXSR SUBJI
     C           *IN99     IFEQ '1'
     C                     SETON                     4399
     C                     MOVE ER,25     MSG
     C                     GOTO STP3
     C                     END
     C                     END
      *
     C*-----------------------*
     C* 04 BIN SHIP AJST DATE *
     C*-----------------------*
     C           B54SCH    IFEQ 0
     C                     SETON                     4499
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
      *
     C           B54STI    IFEQ 0
     C                     SETON                     4599
     C                     MOVE ER,24     MSG
     C                     GOTO STP3
     C                     END
     C                     Z-ADDB54STI    CTIME
      *
     C                     EXSR SUBJI
     C           *IN99     IFEQ '1'
     C                     SETON                     4599
     C                     MOVE ER,25     MSG
     C                     GOTO STP3
     C                     END
     C                     ELSE
     C           B54UCH    IFNE 0
     C           B54UTI    ORNE 0
     C           B54SCH    ORNE 0
     C           B54STI    ORNE 0
     C                     MOVEA'1111'    *IN,42
     C                     SETON                     99
     C                     MOVELER,26     MSG
JW   C                     MOVE 3         MSG
     C                     GOTO STP3
     C                     END
     C                     END
%0001 *
     C           *INKE     IFEQ '0'
     C                     GOTO STP3
     C                     END
      * F5:UPDATE
     C                     EXSR SUBUPD
     C                     EXSR SUBRTN
     C                     GOTO STP1
      *
      *
     C*----------------------------------*
     C*                                  *
     C* CLEAR                            *
     C*----------------------------------*
     C           SUBRTN    BEGSR
      *
     C                     MOVE *BLANK    AKOSN
     C                     MOVE *BLANK    ATOKU
     C                     MOVE *BLANK    ANONY
     C                     MOVE *BLANK    B5NKOJ
     C                     MOVE *BLANK    B5NUKE
     C                     Z-ADD0         B5TOKU
     C                     Z-ADD0         B5NONY
      *
     C                     ENDSR
      *
      *
     C*------------------------------*
     C*  UPDATE                      *
     C*------------------------------*
     C           SUBUPD    BEGSR
      *
     C                     MOVE AKSNM     BKSNM
     C                     MOVE B5TOKU    BTOKU
     C                     MOVE B5NONY    BNONY
     C                     MOVE B5NKOJ    BKOJO
     C                     MOVE B5NUKE    BNUKE
     C                     Z-ADD*DATE     B5KOHZ
     C                     TIME           WTIME
     C                     MOVELUS        B5KOME
     C                     MOVELW5KMEI    B5KMEI
      *
     C           AKOSN     IFEQ '0'
     C                     MOVE 'D'       B5SKJY
     C                     MOVELUS        B5SKME
     C                     END
      *
     C           *IN93     IFEQ '1'
     C                     WRITEGADPL111
     C                     ELSE
     C                     UPDATGADPL111
     C                     END
      *
     C           AKOSN     IFEQ '0'
     C           AKOSN     OREQ '2'
     C                     Z-ADD*DATE     K@DATE
     C           K#GW      CHAINGADWP11              90
     C           *IN90     IFEQ *OFF
     C           AKOSN     ANDEQWWTRAN
     C                     ELSE
     C                     CLEARGADWP111
     C                     Z-ADD*DATE     WWDATE
     C                     TIME           WWTIME
     C                     Z-ADDB5TOKU    WWTOKU
     C                     Z-ADDB5NONY    WWNONY
     C                     MOVE B5NKOJ    WWNKOJ
     C                     MOVELB5KMEI    WWKMEI
     C                     MOVE B5NUKE    WWNUKE
     C                     MOVE AKOSN     WWTRAN
     C                     WRITEGADWP111
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *
      *
     C*--------------------------------*
     C*                                *
     C*                                *
     C*--------------------------------*
     C           SUBJI     BEGSR
      *
     C           CJI       IFGE 01
     C           CJI       IFLE 24
     C           CFN       IFLE 60
     C                     GOTO SJ1
     C                     END
     C                     END
     C                     END
     C                     SETON                     99
      *
     C           SJ1       ENDSR
      *
** ER
E-01 INVALID UPDATE OPTION! <0= CANCEL. 1= CHANGE. 2= ADD>
E-02 ENTER CUSTOMER CODE!
E-03 CUSTOMER CODE NOT FOUND IN CUSTOMER DETAIL M/F!
E-04 ENTER DELIVERY CODE!
E-05 DELIVERY CODE NOT FOUND IN CUSTOMER DETAIL M/F!
E-06 ENTER FACTORY!
E-07 ENTER DOCK!
E-08 CANCEL: DATA NOT FOUND IN SHIPPING M/F!
E-09 CANCEL: DATA WAS CANCELLED ALREADY!
E-10 CHANGE: DATA NOT FOUND IN SHIPPING M/F!
E-11 CHANGE: DATA WAS CANCELLED ALREADY!
E-12 ADD: DATA IS EXIST IN SHIPPING M/F!
E-13 DELETE DUE DATE IS INVALID!
E-14 ENTER FACTORY NAME!
E-15 ENTER CYCLE (DAY)!
E-16 ENTER CYCLE (TIMES)!
E-17 ENTER CYCLE (BIN)!
E-18 DAY IN A WEEK IS INVALID! <BLANK / A / B / C / D>
E-19 ENTER SUPPLIER CODE!
E-20 ENTER PROVISION POINT!
E-21 ENTER TRANSPORTATION UNIT PRICE INSTRUCTION!
E-22 ENTER TRANSPORTATION RATE UNIT PRICE!
E-23 UNWORKING NIGHT ATTENDANCE INST IS INVELID ! <1 2 3 4 N>
E-24 REVERSED FIELD IS INVALID!
E-25 REVERSED FIELD OF TIME IS INVALID!
E-26 DATA SHOULD NOT BE LONGER THAN CYCLE(TIMES)!
