     H            Y.
     F** GAER20 **************************************
     F*  PROGRAM NAME.  :焼入かんばんマスターリスト*
     F*  PROGRAM ID.    :  ECQR30.      <RPG>        *
     F*  CREATE DATE.   :  MAR.15,'89.               *
     F*  AUTHOR.        :  E.KAWASHIMA  <G.B.C>      *
     F*----------+-----+----------+-----------------------------------*
     F*2021.03.02|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F******************************************************* GAER20 **
     FAAEWL01 IP  F     206            DISK
     FMBEPL05 IF  E           K        DISK
     FGAEPR20 O   E             88     PRINTER
     E                    SRY        12  9 0                  I6SRO1
     E                    AR1         3  1
     IAAEWL01 AA  01
     I                                        1   1 TFSKJY
     I                                        2   6 TFSHN1
     I                                        7  11 TFSHN2
     I                                       12  13 TFSHN3
     I                                       14  170TFSTYY
     I                                       18  190TFSTMM
     I                                       20  210TFSTDD
     I                                       22  24 TFATOK
     I                                       25  280TFATOB
     I                                       29  29 TFATYP
     I                                       30  30 TFATK1
     I                                       31  32 TFATK2
     I                                       33  34 TFATK3
     I                                       35  35 TFATK4
     I                                       36  38 TFMAEK
     I                                       39  420TFMAKB
     I                                       43  43 TFMTYP
     I                                       44  44 TFMTK1
     I                                       45  46 TFMTK2
     I                                       47  48 TFMTK3
     I                                       49  49 TFMTK4
     I                                       50  50 TFKCD1
     I                                       51  51 TFKCD2
     I                                       52  54 TFZACD
     I                                       55  560TFBASA
     I                                       57  600TFBAHA
     I                                       61  672TFSOZI
     I                                       68  740TFSYOS
     I                                       75  75 TFSYOT
     I                                       76  770TFLOTO
     I                                       78  800TFTSEI
     I                                       81  82 TFJOK1
     I                                       83  84 TFJOK2
     I                                       85  86 TFJOK3
     I                                       87  88 TFJOK4
     I                                       89  90 TFJOK5
     I                                       91  92 TFJOK6
     I                                       93  950TFKIK1
     I                                       97  980TFKIK2
     I                                       99 1000TFHOJI
     I                                      101 1030TFONDO
     I                                      104 1050TFSETO
     I                                      107 1081TFHKJR
     I                                      109 1100TFSITA
     I                                      111 1120TFOKIE
     I                                      113 116 TFRONOL1
     I                                      117 1180TFMKMS
     I                                      119 122 TFZETI
     I                                      123 1240TFSTI1
     I                                      125 125 TFKUBU
     I                                      126 1300TFKALL
     I                                      131 1350TFMAIS
     I                                      136 1400TFKMIN
     I                                      141 1450TFKMAX
     I                                      146 1500TFSRMS
     I                                      151 1550TFALHK
     I                                      156 1600TFMXHK
     I                                      161 161 TFKSHK
     I                                      162 1700TFKTSU
     I                                      171 1790TFKSSU
     I                                      180 1880TFRISU
     I                                      189 189 TFKOUT
     I                                      190 190 TFDOUT
     I                                      191 191 TFDTKO
     I                                      192 192 TFDTHE
     I                                      193 1950TFJDMS
     I                                      196 196 TFKEI1
     I                                      197 197 TFKEI2
     I                                      198 2010TFNKOJ
     I            DS
     I                                        1 1080SRY
     I                                        1   90I6SRO1
     I                                       10  180I6SRO2
     I                                       19  270I6SRO3
     I                                       28  360I6SRO4
     I                                       37  450I6SRO5
     I                                       46  540I6SRO6
     I                                       55  630I6SRO7
     I                                       64  720I6SRO8
     I                                       73  810I6SRO9
     I                                       82  900I6SROA
     I                                       91  990I6SROB
     I                                      100 1080I6SROC
     I            DS
     I                                        1  14 @HBAN
     I                                        1   5 #HBAN1
     I                                        6   6 #HBAN2
     I                                        7  11 #HBAN3
     I                                       12  12 #HBAN4
     I                                       13  14 #HBAN5
     I            DS
     I                                        1   9 @BANT1
     I                                        1   1 #BAN11
     I                                        2   2 #BAN12
     I                                        3   4 #BAN13
     I                                        5   5 #BAN14
     I                                        6   7 #BAN15
     I                                        8   8 #BAN16
     I                                        9   9 #BAN17
     I            DS
     I                                        1   9 @BANT2
     I                                        1   1 #BAN21
     I                                        2   2 #BAN22
     I                                        3   4 #BAN23
     I                                        5   5 #BAN24
     I                                        6   7 #BAN25
     I                                        8   8 #BAN26
     I                                        9   9 #BAN27
     I            DS
     I                                        1   60YYMM
     I                                        1   40YY
     I                                        5   60MM
     C******************************************************
     C*  START  PROGRAM  <GAER20>                          *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           @YYMM   6
     C                     MOVEL@YYMM     YYMM    60
     C*
     C           *IN,90    IFEQ '0'
     C                     MOVE *BLANK    SW      1
     C                     MOVEA'1'       *IN,90
     C                     END
     C*
     C                     MOVE UDATE     @DATE
     C                     TIME           @TIME
     C*
     C   L1                Z-ADD0         @JGOKE
     C   L1                Z-ADD0         @HGOKE
     C   L1                Z-ADD0         @NO
     C   L1                MOVE *BLANK    SW
     C   L1                WRITEGAEPR201
     C*
     C                     MOVEL'*'       SW
     C                     ADD  1         @NO
     C*--- ﾅﾞbﾒｭcxb ﾈｮn ---*
     C                     MOVE TFSHN1    #HIN1   5
     C                     MOVE TFSHN2    #HIN2   5
     C                     MOVE TFSHN3    #HIN3   2
     C* ﾆﾞｬcﾒｭc  ibﾅ] *
     C           TFKSSU    MULT TFSOZI    WJRYO  150
     C           WJRYO     IFEQ 0
     C                     Z-ADD0         WJRYO
     C                     Z-ADD0         WAMAR   10
     C                     ELSE
     C           WJRYO     DIV  1000      WJRYO
     C                     MVR            WAMAR
     C                     END
     C           WAMAR     IFGT 0
     C                     ADD  1         WJRYO
     C                     END
     C* ﾌﾃﾇc  ibﾅ] *
     C           TFKSSU    DIV  20        WKKSSU  70
     C           WKKSSU    IFEQ 0
     C                     Z-ADD0         WHAKO   52
     C                     ELSE
     C           TFSYOS    IFEQ 0
     C                     Z-ADD0         WHAKO
     C                     ELSE
     C           WKKSSU    DIV  TFSYOS    WHAKO
     C                     END
     C                     END
     C* ﾃﾞcib  ibﾅ] *
     C           WJRYO     ADD  @JGOKE    @JGOKE
     C           WHAKO     ADD  @HGOKE    @HGOKE
     C*
     C                     MOVE TFSHN1    #HBAN1
     C                     MOVE '-'       #HBAN2
     C                     MOVE TFSHN2    #HBAN3
     C           TFSHN3    IFNE *BLANK
     C                     MOVE '-'       #HBAN4
     C                     ELSE
     C                     MOVE *BLANK    #HBAN4
     C                     END
     C                     MOVE TFSHN3    #HBAN5
     C                     MOVE TFKSSU    @SETEI
     C                     MOVE TFSYOS    @SYUYO
     C                     MOVE TFKMAX    @MAIS
     C           KEYA      KLIST
     C                     KFLD           YY
     C                     KFLD           #HIN1
     C                     KFLD           #HIN2
     C                     KFLD           #HIN3
     C*
     C                     Z-ADD0         @SISEK
     C           KEYA      CHAINMBEPL051             11
     C  N11                Z-ADDSRY,MM    @SISEK
     C*
     C                     MOVE TFATK1    #BAN11
     C                     MOVE '-'       #BAN12
     C                     MOVE TFATK2    #BAN13
     C                     MOVE '-'       #BAN14
     C                     MOVE TFATK3    #BAN15
     C           TFATK4    IFNE *BLANK
     C                     MOVE '-'       #BAN16
     C                     ELSE
     C                     MOVE ' '       #BAN16
     C                     END
     C                     MOVE TFATK4    #BAN17
     C                     MOVE TFBAHA    @BASKT
     C                     MOVE TFLOTO    @LOT
     C                     MOVE TFMTK1    #BAN21
     C                     MOVE '-'       #BAN22
     C                     MOVE TFMTK2    #BAN23
     C                     MOVE '-'       #BAN24
     C                     MOVE TFMTK3    #BAN25
     C           TFMTK4    IFNE *BLANK
     C                     MOVE '-'       #BAN26
     C                     ELSE
     C                     MOVE ' '       #BAN26
     C                     END
     C                     MOVE TFMTK4    #BAN27
     C                     MOVE TFRONO    @ROBAN
     C*
     C                     MOVE WJRYO     @JRYO
     C                     MOVE WHAKO     @HAKO
     C                     MOVE TFBASA    @SASI
     C*
     C                     WRITEGAEPR202
     C                     EXSR $OV
     C                     WRITEGAEPR203
     C                     EXSR $OV
     CL1         SW        IFNE *BLANK
     CL1                   WRITEGAEPR204
     CL1                   EXSR $OV
     CL1                   END
     CSR         $OV       BEGSR
     C           *IN88     IFEQ '1'
     C                     WRITEGAEPR201
     C                     SETOF                       88
     C                     END
     CSR                   ENDSR
