     H            Y.
     F*******************************************************
     F* INQUIRY OF QUENCHING FURNACE HANDLING ABILITY GAER15 *
     F*                      M S K                 87.05.29 *
     F*******************************************************
     FGAEWL01 IF  E           K        DISK
     FGAEPW15 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL01
     E                    AR1        31  7 0
     E                    AR2        31  7 0
     I            DS
     I                                        1   1 WKIN
     I                                        2   5 WKTSUK
     I                                        6   6 WKOUT
     I                                        1   6 WKJIT
     I            DS
     I                                        1  10 WKT
     I                                        1   1 WKINP
     I                                        2   9 WKCONT
     I                                       10  10 WKOUP
     I            DS
     I                                        1   4 WSU1
     I                                        1   1 WSIN1
     I                                        2   3 WSK1
     I                                        4   4 WOUT1
     I            DS
     I                                        1   4 WSU2
     I                                        1   1 WSIN2
     I                                        2   3 WSK2
     I                                        4   4 WOUT2
     I            DS
     I                                        1   5 WKHIN1
     I                                        6   6 WKUND1
     I                                        7  11 WKHIN2
     I                                       12  12 WKUND2
     I                                       13  14 WKHIN3
     I                                        1  14 WKHBAN
     I            DS
     I                                        1   5 FWHIN1
     I                                        6  10 FWHIN2
     I                                       11  12 FWHIN3
     I                                        1  12 WHIN
     C           *ENTRY    PLIST
     C                     PARM           PJ      1         * ﾆﾞl & obﾆﾞ
     C                     PARM           PM      6         * r]iﾞl
     C                     PARM           PK      1         * hﾎﾞ]
     C                     PARM           PR      4         * ﾜﾌﾞ]
     C                     PARM           P1      8         * ﾍ  (1)
     C                     PARM           P2      8         * ﾍ  (2)
     C                     PARM           P3      8         * ﾍ  (3)
     C                     PARM           P4      8         * ﾍ  (4)
     C                     PARM           P5      8         * ﾍ  (5)
     C                     PARM           P6      8         * ﾍ  (6)
     C                     PARM           P7      8         * ﾍ  (7)
     C                     PARM           P8      8         * ﾍ  (8)
     C                     PARM           P9      8         * ﾍ  (9)
     C                     PARM           P10     8         * ﾍ  (10)
     C*----------------------------------------------------*
     C*   ﾆｭg ﾆﾑﾒ
     C*----------------------------------------------------*
     C                     TIME           @TIME
     C                     Z-ADD*DATE     @DATE
     C                     MOVE PM        HYM     60
     C                     MOVELHYM       HY      40
     C                     MOVE HYM       HM      20
     C                     MOVE P1        @SYMD
     C                     MOVE P10       @EYMD
     C                     MOVE P1        D1      20
     C                     MOVE P2        D2      20
     C                     MOVE P3        D3      20
     C                     MOVE P4        D4      20
     C                     MOVE P5        D5      20
     C                     MOVE P6        D6      20
     C                     MOVE P7        D7      20
     C                     MOVE P8        D8      20
     C                     MOVE P9        D9      20
     C                     MOVE P10       D10     20
     C                     MOVELD1        @M1
     C                     MOVE D6        @M1
     C                     MOVELD2        @M2
     C                     MOVE D7        @M2
     C                     MOVELD3        @M3
     C                     MOVE D8        @M3
     C                     MOVELD4        @M4
     C                     MOVE D9        @M4
     C                     MOVELD5        @M5
     C                     MOVE D10       @M5
     C                     MOVE PR        @ROBAN
     C           PJ        IFEQ 'N'
     C                     MOVE P1        SYMD    80
     C                     MOVE P10       EYMD    80
     C           SYMD      SUB  00000100  SYMD
     C           EYMD      SUB  00000100  EYMD
     C                     MOVE SYMD      @SYMD
     C                     MOVE EYMD      @EYMD
     C                     END
     C*----------------------------------------------------*
     C*  ﾜﾌﾞ] j]b ﾆﾞｮﾈg OR obﾆﾞﾇc ﾃﾞcib                    *
     C*----------------------------------------------------*
     C*--------------------*
     C*  ﾆﾞlﾈg             *
     C*--------------------*
     C           PJ        IFEQ 'N'
     C                     SETOF                       81
     C           @ROBAN    SETLLGAEWL011
     C                     DO   *HIVAL
     C           @ROBAN    READEGAEWL011                 81
     C           *IN81     IFEQ '0'
     C                     Z-ADDFWSETH    @NOURK
     C*-------------------*
     C*  ﾆﾞｮﾈg ﾍ j]b      *
     C*-------------------*
     C                     MOVE FWHJ01    AR1,1
     C                     MOVE FWHJ02    AR1,2
     C                     MOVE FWHJ03    AR1,3
     C                     MOVE FWHJ04    AR1,4
     C                     MOVE FWHJ05    AR1,5
     C                     MOVE FWHJ06    AR1,6
     C                     MOVE FWHJ07    AR1,7
     C                     MOVE FWHJ08    AR1,8
     C                     MOVE FWHJ09    AR1,9
     C                     MOVE FWHJ10    AR1,10
     C                     MOVE FWHJ11    AR1,11
     C                     MOVE FWHJ12    AR1,12
     C                     MOVE FWHJ13    AR1,13
     C                     MOVE FWHJ14    AR1,14
     C                     MOVE FWHJ15    AR1,15
     C                     MOVE FWHJ16    AR1,16
     C                     MOVE FWHJ17    AR1,17
     C                     MOVE FWHJ18    AR1,18
     C                     MOVE FWHJ19    AR1,19
     C                     MOVE FWHJ20    AR1,20
     C                     MOVE FWHJ21    AR1,21
     C                     MOVE FWHJ22    AR1,22
     C                     MOVE FWHJ23    AR1,23
     C                     MOVE FWHJ24    AR1,24
     C                     MOVE FWHJ25    AR1,25
     C                     MOVE FWHJ26    AR1,26
     C                     MOVE FWHJ27    AR1,27
     C                     MOVE FWHJ28    AR1,28
     C                     MOVE FWHJ29    AR1,29
     C                     MOVE FWHJ30    AR1,30
     C                     MOVE FWHJ31    AR1,31
     C*=====================================================*
     C                     ADD  AR1,D1    @H101
     C                     ADD  AR1,D2    @H102
     C                     ADD  AR1,D3    @H103
     C                     ADD  AR1,D4    @H104
     C                     ADD  AR1,D5    @H105
     C                     ADD  AR1,D6    @H106
     C                     ADD  AR1,D7    @H107
     C                     ADD  AR1,D8    @H108
     C                     ADD  AR1,D9    @H109
     C                     ADD  AR1,D10   @H110
     C                     END
     C  N81                END
     C                     END
     C*--------------------*
     C*  obﾆﾞ              *
     C*--------------------*
     C           PJ        IFEQ 'Y'
     C                     SETOF                       81
     C           @ROBAN    SETLLGAEWL011
     C                     DO   *HIVAL
     C           @ROBAN    READEGAEWL011                 81
     C           *IN81     IFEQ '0'
     C*-------------------*
     C*  obﾆﾞ  ﾍ j]b      *
     C*-------------------*
     C                     MOVE FWJU01    AR2,1
     C                     MOVE FWJU02    AR2,2
     C                     MOVE FWJU03    AR2,3
     C                     MOVE FWJU04    AR2,4
     C                     MOVE FWJU05    AR2,5
     C                     MOVE FWJU06    AR2,6
     C                     MOVE FWJU07    AR2,7
     C                     MOVE FWJU08    AR2,8
     C                     MOVE FWJU09    AR2,9
     C                     MOVE FWJU10    AR2,10
     C                     MOVE FWJU11    AR2,11
     C                     MOVE FWJU12    AR2,12
     C                     MOVE FWJU13    AR2,13
     C                     MOVE FWJU14    AR2,14
     C                     MOVE FWJU15    AR2,15
     C                     MOVE FWJU16    AR2,16
     C                     MOVE FWJU17    AR2,17
     C                     MOVE FWJU18    AR2,18
     C                     MOVE FWJU19    AR2,19
     C                     MOVE FWJU20    AR2,20
     C                     MOVE FWJU21    AR2,21
     C                     MOVE FWJU22    AR2,22
     C                     MOVE FWJU23    AR2,23
     C                     MOVE FWJU24    AR2,24
     C                     MOVE FWJU25    AR2,25
     C                     MOVE FWJU26    AR2,26
     C                     MOVE FWJU27    AR2,27
     C                     MOVE FWJU28    AR2,28
     C                     MOVE FWJU29    AR2,29
     C                     MOVE FWJU30    AR2,30
     C                     MOVE FWJU31    AR2,31
     C*=====================================================*
     C                     ADD  AR2,D1    @H101
     C                     ADD  AR2,D2    @H102
     C                     ADD  AR2,D3    @H103
     C                     ADD  AR2,D4    @H104
     C                     ADD  AR2,D5    @H105
     C                     ADD  AR2,D6    @H106
     C                     ADD  AR2,D7    @H107
     C                     ADD  AR2,D8    @H108
     C                     ADD  AR2,D9    @H109
     C                     ADD  AR2,D10   @H110
     C                     END
     C  N81                END
     C                     END
     C                     SETON                       70
     C                     WRITESFLREC
     C                     SETOF                       7081
     C*----------------------------------------------------*
     C*   ﾅﾎﾞﾎabﾓ  fgﾃv ﾆﾑﾒ  15i] j]b                      *
     C*----------------------------------------------------*
     C                     Z-ADD0         X       30
     C                     Z-ADD0         RRN     30
     C                     Z-ADD1         @SFRCD
     C           @ROBAN    SETLLGAEWL011
     C           $100S     TAG
     C           X         DOWLE5
     C           @ROBAN    READEGAEWL011                 81
     C           *IN81     IFEQ '0'
     C           SW        IFEQ *BLANK
     C                     MOVE WHIN      WKHIN  12
     C                     MOVE '*'       SW      1
     C                     END
     C*----------------------------------------------------*
     C*  ﾍ]ﾌﾞ]  j]b  ﾅﾎﾞﾎabﾓ  fgﾃv                         *
     C*----------------------------------------------------*
     C           WHIN      IFNE WKHIN
     C                     MOVELWKHIN     WKHIN1  5
     C                     MOVE WKHIN     WKXXXX  7
     C                     MOVELWKXXXX    WKHIN2  5
     C                     MOVE WKXXXX    WKHIN3  2
     C           WKHIN2    IFEQ *BLANK
     C                     MOVE ' '       WKUND1
     C                     ELSE
     C                     MOVE '-'       WKUND1
     C                     END
     C           WKHIN3    IFEQ *BLANK
     C                     MOVE ' '       WKUND2
     C                     ELSE
     C                     MOVE '-'       WKUND2
     C                     END
     C                     MOVE WKHBAN    @HINBN
     C                     Z-ADDWHM01     @HM01
     C                     Z-ADDWHM02     @HM02
     C                     Z-ADDWHM03     @HM03
     C                     Z-ADDWHM04     @HM04
     C                     Z-ADDWHM05     @HM05
     C                     Z-ADDWHM06     @HM06
     C                     Z-ADDWHM07     @HM07
     C                     Z-ADDWHM08     @HM08
     C                     Z-ADDWHM09     @HM09
     C                     Z-ADDWHM10     @HM10
     C                     ADD  1         RRN
     C                     ADD  1         X
     C                     WRITESFL01
     C                     Z-ADD0         WHM01
     C                     Z-ADD0         WHM02
     C                     Z-ADD0         WHM03
     C                     Z-ADD0         WHM04
     C                     Z-ADD0         WHM05
     C                     Z-ADD0         WHM06
     C                     Z-ADD0         WHM07
     C                     Z-ADD0         WHM08
     C                     Z-ADD0         WHM09
     C                     Z-ADD0         WHM10
     C                     END
     C*  obﾆﾞ
     C           PJ        IFEQ 'Y'
     C*-------------------*
     C*  obﾆﾞ  ﾍ j]b      *
     C*-------------------*
     C                     MOVE FWJU01    AR2,1
     C                     MOVE FWJU02    AR2,2
     C                     MOVE FWJU03    AR2,3
     C                     MOVE FWJU04    AR2,4
     C                     MOVE FWJU05    AR2,5
     C                     MOVE FWJU06    AR2,6
     C                     MOVE FWJU07    AR2,7
     C                     MOVE FWJU08    AR2,8
     C                     MOVE FWJU09    AR2,9
     C                     MOVE FWJU10    AR2,10
     C                     MOVE FWJU11    AR2,11
     C                     MOVE FWJU12    AR2,12
     C                     MOVE FWJU13    AR2,13
     C                     MOVE FWJU14    AR2,14
     C                     MOVE FWJU15    AR2,15
     C                     MOVE FWJU16    AR2,16
     C                     MOVE FWJU17    AR2,17
     C                     MOVE FWJU18    AR2,18
     C                     MOVE FWJU19    AR2,19
     C                     MOVE FWJU20    AR2,20
     C                     MOVE FWJU21    AR2,21
     C                     MOVE FWJU22    AR2,22
     C                     MOVE FWJU23    AR2,23
     C                     MOVE FWJU24    AR2,24
     C                     MOVE FWJU25    AR2,25
     C                     MOVE FWJU26    AR2,26
     C                     MOVE FWJU27    AR2,27
     C                     MOVE FWJU28    AR2,28
     C                     MOVE FWJU29    AR2,29
     C                     MOVE FWJU30    AR2,30
     C                     MOVE FWJU31    AR2,31
     C*=====================================================*
     C                     ADD  AR2,D1    WHM01   70
     C                     ADD  AR2,D2    WHM02   70
     C                     ADD  AR2,D3    WHM03   70
     C                     ADD  AR2,D4    WHM04   70
     C                     ADD  AR2,D5    WHM05   70
     C                     ADD  AR2,D6    WHM06   70
     C                     ADD  AR2,D7    WHM07   70
     C                     ADD  AR2,D8    WHM08   70
     C                     ADD  AR2,D9    WHM09   70
     C                     ADD  AR2,D10   WHM10   70
     C                     END
     C* ﾆﾞlﾈg
     C           PJ        IFEQ 'N'
     C*-------------------*
     C*  ﾆﾞｮﾈg ﾍ j]b      *
     C*-------------------*
     C                     MOVE FWHJ01    AR1,1
     C                     MOVE FWHJ02    AR1,2
     C                     MOVE FWHJ03    AR1,3
     C                     MOVE FWHJ04    AR1,4
     C                     MOVE FWHJ05    AR1,5
     C                     MOVE FWHJ06    AR1,6
     C                     MOVE FWHJ07    AR1,7
     C                     MOVE FWHJ08    AR1,8
     C                     MOVE FWHJ09    AR1,9
     C                     MOVE FWHJ10    AR1,10
     C                     MOVE FWHJ11    AR1,11
     C                     MOVE FWHJ12    AR1,12
     C                     MOVE FWHJ13    AR1,13
     C                     MOVE FWHJ14    AR1,14
     C                     MOVE FWHJ15    AR1,15
     C                     MOVE FWHJ16    AR1,16
     C                     MOVE FWHJ17    AR1,17
     C                     MOVE FWHJ18    AR1,18
     C                     MOVE FWHJ19    AR1,19
     C                     MOVE FWHJ20    AR1,20
     C                     MOVE FWHJ21    AR1,21
     C                     MOVE FWHJ22    AR1,22
     C                     MOVE FWHJ23    AR1,23
     C                     MOVE FWHJ24    AR1,24
     C                     MOVE FWHJ25    AR1,25
     C                     MOVE FWHJ26    AR1,26
     C                     MOVE FWHJ27    AR1,27
     C                     MOVE FWHJ28    AR1,28
     C                     MOVE FWHJ29    AR1,29
     C                     MOVE FWHJ30    AR1,30
     C                     MOVE FWHJ31    AR1,31
     C*=====================================================*
     C                     ADD  AR1,D1    WHM01
     C                     ADD  AR1,D2    WHM02
     C                     ADD  AR1,D3    WHM03
     C                     ADD  AR1,D4    WHM04
     C                     ADD  AR1,D5    WHM05
     C                     ADD  AR1,D6    WHM06
     C                     ADD  AR1,D7    WHM07
     C                     ADD  AR1,D8    WHM08
     C                     ADD  AR1,D9    WHM09
     C                     ADD  AR1,D10   WHM10
     C                     END
     C                     MOVE WHIN      WKHIN  12
     C                     END
     C  N81                END
     C*----------------------------------------------------*
     C*  ﾎｦbﾓ ﾃﾞcib  ﾅﾎﾞﾎabﾓ  fgﾃv                         *
     C*----------------------------------------------------*
     C           *IN81     IFEQ '1'
     C                     MOVELWKHIN     WKHIN1  5
     C                     MOVE WKHIN     WKXXXX  7
     C                     MOVELWKXXXX    WKHIN2  5
     C                     MOVE WKXXXX    WKHIN3  2
     C           WKHIN2    IFEQ *BLANK
     C                     MOVE ' '       WKUND1
     C                     ELSE
     C                     MOVE '-'       WKUND1
     C                     END
     C           WKHIN3    IFEQ *BLANK
     C                     MOVE ' '       WKUND2
     C                     ELSE
     C                     MOVE '-'       WKUND2
     C                     END
     C                     MOVE WKHBAN    @HINBN
     C                     Z-ADDWHM01     @HM01
     C                     Z-ADDWHM02     @HM02
     C                     Z-ADDWHM03     @HM03
     C                     Z-ADDWHM04     @HM04
     C                     Z-ADDWHM05     @HM05
     C                     Z-ADDWHM06     @HM06
     C                     Z-ADDWHM07     @HM07
     C                     Z-ADDWHM08     @HM08
     C                     Z-ADDWHM09     @HM09
     C                     Z-ADDWHM10     @HM10
     C                     ADD  1         RRN
     C                     ADD  1         X
     C                     WRITESFL01
     C                     Z-ADD0         WHM01
     C                     Z-ADD0         WHM02
     C                     Z-ADD0         WHM03
     C                     Z-ADD0         WHM04
     C                     Z-ADD0         WHM05
     C                     Z-ADD0         WHM06
     C                     Z-ADD0         WHM07
     C                     Z-ADD0         WHM08
     C                     Z-ADD0         WHM09
     C                     Z-ADD0         WHM10
     C                     END
     C*-------------------*
     C* ﾅﾎﾞﾎabﾓ ﾍﾑcﾆﾞ     *
     C*-------------------*
     C           DSPLAY    TAG
     C           *IN81     IFEQ '1'
     C                     SETON                       72
     C                     ELSE
     C                     SETOF                       72
     C                     END
     C                     SETON                       71
     C                     WRITEGAEPW151
     C                     EXFMTSFLREC
     C                     SETOF                       71
     C           *INKA     IFEQ '1'
     C           *INKC     OREQ '1'
     C   KC                MOVE 'M'       PK
     C   KA                MOVE '9'       PK
     C                     MOVE *BLANK    SW
     C                     SETON                       LR
     C                     RETRN
     C                     END
     C*===== ROLL UP =====*
     C           *IN51     IFEQ '1'
     C                     Z-ADD0         X
     C           *IN81     IFEQ '1'
     C                     GOTO DSPLAY
     C                     END
     C           RRN       ADD  1         @SFRCD
     C                     GOTO $100S
     C                     END
     C*
     C                     GOTO DSPLAY
