     H            Y.
     F** GBFR93 ********************************************
     F* UPDATE SALES QTY                                               TING
     F*                                                    *
     F******************************************************
     FGBFPL51 UF  E           K        DISK
     FGBFNP44 UF  E           K        DISK
     FGBFWP90 IF  E           K        DISK
     C******************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C******************************************************
     C                     EXSR #GB51
     C                     EXSR #GB44
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           GWKEY     KLIST
     C                     KFLD           G9TOKU
     C                     KFLD           G9MHN1
     C                     KFLD           G9MHN2
     C                     KFLD           G9MHN3
     C                     KFLD           G9MHN4
     C           GWK2      KLIST
     C                     KFLD           GRTOKU
     C                     KFLD           GRHIN1
     C                     KFLD           GRHIN2
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #GB51     BEGSR
      *
     C           *LOVAL    SETLLGBFPL51
     C           *IN90     DOUEQ*ON
     C                     READ GBFPL51                  90
     C           *IN90     IFEQ *OFF
     C           G9SKJY    ANDEQ*BLANK
     C           G9TOKU    CHAINGBFWP90              96
     C           GWKEY     CHAINGBFWP90              95
     C           *IN96     IFEQ *OFF
     C           *IN95     IFEQ *OFF
     C                     Z-ADDGBNQTY    G9SRYO
     C                     ELSE
     C                     Z-ADD*ZERO     G9SRYO
     C                     ENDIF
      *
     C                     Z-ADD*YEAR     G9KOYY
     C                     Z-ADD*MONTH    G9KOMM
     C                     Z-ADD*DAY      G9KODD
     C                     TIME           @@TIME  60
     C                     MOVEL@@TIME    G9KOTI
     C                     MOVEL#USER     G9KOME
     C                     UPDATGBFPL511
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #GB44     BEGSR
      *
     C           *LOVAL    SETLLGBFNP44
     C           *IN90     DOUEQ*ON
     C                     READ GBFNP44                  90
     C           *IN90     IFEQ *OFF
     C           GWK2      CHAINGBFWP90              95
     C           *IN95     IFEQ *OFF
     C                     Z-ADDGBNQTY    GRSRYO
     C                     UPDATGBFNP441
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
