     H            Y.
     F** GBFR66 ********************************************
     F* SALES UNIT PRICE CONSTITUTION PART WEIGHT .AMOUNT NEWTOTALIZATION DATA C
     F*REATE *
     F*            M-OKUDA          1986.01.20             *
     F******************************************************
     FGBFPL51 IF  E           K        DISK
     FGBFWP66 O   E                    DISK                      A
     E                    HN          5 12               ﾃcﾈbﾍ]ﾌﾞ]
     E                    SY          5  1 0             ﾃcﾈbﾍ] ﾆﾑcﾃﾇc
     E                    SI          5  2 0             ﾃcﾈbﾍ] ﾅbﾇﾞ
     E                    ME          5  2               ﾃcﾈbﾍ] xbﾆｭcﾃ-nﾞ
     E                    TN          5  7 4             ﾃcﾈbﾍ] j]f
     I            DS
     I                                        1  12 KHBAN
     I                                        1   5 KHIN1
     I                                        6  10 KHIN2
     I                                       11  12 KHIN3
     I            DS
     I                                        1  60 HN
     I                                        1  12 G9KHN1
     I                                       13  24 G9KHN2
     I                                       25  36 G9KHN3
     I                                       37  48 G9KHN4
     I                                       49  60 G9KHN5
     I            DS
     I                                        1   50SY
     I                                        1   10G9SYO1
     I                                        2   20G9SYO2
     I                                        3   30G9SYO3
     I                                        4   40G9SYO4
     I                                        5   50G9SYO5
     I            DS
     I                                        1  100SI
     I                                        1   20G9SIZ1
     I                                        3   40G9SIZ2
     I                                        5   60G9SIZ3
     I                                        7   80G9SIZ4
     I                                        9  100G9SIZ5
     I            DS
     I                                        1  10 ME
     I                                        1   2 G9MEI1
     I                                        3   4 G9MEI2
     I                                        5   6 G9MEI3
     I                                        7   8 G9MEI4
     I                                        9  10 G9MEI5
     I            DS
     I                                        1  35 TN
     I                                        1   74G9TNK1
     I                                        8  144G9TNK2
     I                                       15  214G9TNK3
     I                                       22  284G9TNK4
     I                                       29  354G9TNK5
     C******************************************************
     C* M-NO BF.6.4        PARM ﾉ cinﾒ                     *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           PTOKU   4
     C                     PARM           PLKBN   1
     C                     PARM           PTKOJ   1
     C           TNKEY     KLIST
     C                     KFLD           UTOKU
     C                     KFLD           UTKOJ
     C                     KFLD           UHIN1
     C                     KFLD           UHIN2
     C                     KFLD           UHIN3
     C                     KFLD           UHIN4
     C                     MOVE PTOKU     UTOKU   40
     C           PLKBN     IFEQ '1'
     C                     MOVE PTKOJ     UTKOJ   1
     C                     ELSE
     C                     MOVE *BLANK    UTKOJ
     C                     END
     C                     MOVE *BLANK    UHIN1   5
     C                     MOVE *BLANK    UHIN2   5
     C                     MOVE *BLANK    UHIN3   5
     C                     MOVE *BLANK    UHIN4   5
     C           TNKEY     SETLLGBFPL511
     C******************************************************
     C* M-NO BF.6.1.1      ibﾅ]ﾎｦbﾓ ﾉ ﾑvnﾒ                 *
     C******************************************************
     C           STEP01    TAG
     C                     READ GBFPL51                  01
     C           *IN01     CABEQ'1'       END
     C           G9SKJY    CABEQ'D'       STEP01
     C           G9TOKU    CABNEUTOKU     END
     C           PLKBN     IFEQ '1'
     C           G9TKOJ    CABNEPTKOJ     END
     C                     END
     C******************************************************
     C* M-NO BF.6.1.2      ﾆﾏlﾒｭhdﾒa s m]c                *
     C******************************************************
     C                     MOVE 'N'       IADKBN
     C                     Z-ADDG9TOKU    IATOKU
     C                     MOVE G9TKOJ    IATKOJ
     C           PLKBN     IFEQ '3'
     C                     MOVE *BLANK    IAKKEY
     C                     ELSE
     C                     MOVE G9TKOJ    IAKKEY
     C                     END
     C                     MOVE G9MHN1    IAMHN1
     C                     MOVE G9MHN2    IAMHN2
     C                     MOVE G9MHN3    IAMHN3
     C                     MOVE G9MHN4    IAMHN4
     C                     Z-ADDG9KOUH    IAKOUH
     C                     Z-ADDG9MTAN    IAMTAN
     C                     Z-ADDG9SRYO    IASRYO
     C******************************************************
     C* M-NO BF.6.1.3      mﾞ-j ﾆｬｮﾒｭh                     *
     C******************************************************
     C                     Z-ADD1         I       10
     C           1         DO   5         I
     C           HN,I      CABEQ*BLANK    STEP01
     C                     MOVE HN,I      KHBAN
     C                     MOVE KHIN1     IAKHN1
     C                     MOVE KHIN2     IAKHN2
     C                     MOVE KHIN3     IAKHN3
     C                     Z-ADDSY,I      IAKOSU
     C                     Z-ADDSI,I      IASAIZ
     C                     MOVE ME,I      IAMCOD
     C                     Z-ADDTN,I      IAKTAN
     C                     WRITEGBFWP661
     C                     END
     C                     GOTO STEP01
     C******************************************************
     C* M-NO BF.6.2        ENDﾆｭﾒ                          *
     C******************************************************
     C           END       TAG
     C                     SETON                     LR
