     H            Y.
     F** GBFR62 ********************************************
     F* SALES UNIT PRICE MATERIAL PRIMITIVE COST OLDUNIT PRICE TOTALIZATION DATA
     F* CONVERSION *
     F*            M-OKUDA          1986.01.18             *
     F*            T.TODA 2021.08.23 CHANGES(20199)        *
     F******************************************************
     FGBFTP52 IP  E                    DISK
     FGBFWP61 O   E                    DISK                      A
     C******************************************************
     C* M-NO BF.6.1        PARM ﾉ cinﾒ                     *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           PTOKU   4
     C                     PARM           PLKBN   1
     C                     PARM           PTKOJ   1
     C           *IN02     IFEQ '0'
     C                     SETON                     02
     C                     MOVE PTOKU     UTOKU   40
     C           PLKBN     IFEQ '1'
     C                     MOVE PTKOJ     UTKOJ   1
     C                     ELSE
     C                     MOVE *BLANK    UTKOJ
     C                     END
     C                     END
     C******************************************************
     C* M-NO BF.6.1.1      ibﾅ]ﾎｦbﾓ ﾉ ﾑvnﾒ                 *
     C******************************************************
     C           GASKJY    CABEQ'D'       END
     C           GATOKU    CABNEUTOKU     END
     C           PLKBN     IFEQ '1'
     C           GATKOJ    CABNEPTKOJ     END
     C                     END
     C******************************************************
     C* M-NO BF.6.1.2      ﾆﾏlﾒｭhdﾒa s m]c                *
     C******************************************************
     C                     MOVE 'O'       I9DKBN
     C                     Z-ADDGATOKU    I9TOKU
     C                     MOVE GATKOJ    I9TKOJ
     C           PLKBN     IFEQ '3'
     C                     MOVE *BLANK    I9KKEY
     C                     ELSE
     C                     MOVE GATKOJ    I9KKEY
     C                     END
     C                     MOVE GAMHN1    I9MHN1
     C                     MOVE GAMHN2    I9MHN2
     C                     MOVE GAMHN3    I9MHN3
     C                     MOVE GAMHN4    I9MHN4
     C                     Z-ADDGATUSZ    I9TUSZ
     C                     MOVE GAZCOD    I9ZCOD
     C                     Z-ADDGAZKGT    I9ZKGT
     C                     Z-ADDGASZIJ    I9SZIJ
     C                     Z-ADDGASZIH    I9SZIH
     C                     Z-ADDGAZAIH    I9ZAIH
     C                     Z-ADDGAQTAN    I9MTAN
     C                     Z-ADDGASRYO    I9SRYO
     C******************************************************
     C* M-NO BF.6.1.3      mﾞ-j ﾆｬｮﾒｭh                     *
     C******************************************************
     C                     WRITEGBFWP611
     C           END       TAG
