     H            Y.
     F** GBFR77 ********************************************
     F* QUANTITY .AMOUNT TOTALIZATION BY SALES UNIT PRICE PROCESS .SIZE
     F*            M-OKUDA          1986.01.23             *
     F*            T.TODA 2021.08.23 CHANGES(20199)        *
     F******************************************************
     FGBFWL76 IP  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGBFPR77 O   E                    PRINTER
     E                    MD      1   1 26               jbnﾓ
     IGBFWL761
     I                                              ICTOKUL3
     I                                              ICKKEYL3
     I                                              ICKOTEL2
     I                                              ICTUSZL1
     I            DS
     I                                        1  23 HBAN
     I                                        1   5 ICMHN1
     I                                        6   6 F1
     I                                        7  11 ICMHN2
     I                                       12  12 F2
     I                                       13  17 ICMHN3
     I                                       18  18 F3
     I                                       19  23 ICMHN4
     I            DS
     I                                        1   80MDYY
     I                                        1   40DMD
     I                                        5   80DYY
     I            DS
     I                                        1   80YYMD
     I                                        1   40SYY
     I                                        5   80SMD
     C******************************************************
     C* M-NO BF.6.2        PARM ﾉ cinﾒ                     *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           PTOKU   4
     C                     PARM           PLKBN   1
     C                     PARM           PTKOJ   1
     C                     PARM           PKOTE   3
     C           *IN01     IFEQ '0'
     C                     SETON                     01
     C                     Z-ADD*DATE     YYMD
     C                     Z-ADDSYY       DYY
     C                     Z-ADDSMD       DMD
     C           PKOTE     IFEQ '***'
     C                     MOVE 'ALL PROC'KTMEI   8
     C                     ELSE
     C                     MOVE *BLANK    KTMEI
     C                     MOVELPKOTE     KTMEI
     C                     END
     C                     MOVE PTOKU     UTOKU   40
     C                     MOVE MD,1      HD
     C                     MOVE *BLANK    TMEIG
     C                     MOVE '-'       F1
     C                     MOVE '-'       F2
     C                     MOVE '-'       F3
     C                     SETOF                     02
     C           UTOKU     CHAINFGBPL011             02
     C           *IN02     IFEQ '0'
     C                     MOVELB2SMEI    TMEIG
     C                     END
     C                     END
     C******************************************************
     C* M-NO BF.6.3.1      mﾞ-j ﾉ ﾑvﾃv                     *
     C******************************************************
     C           ICTOKU    IFNE UTOKU
     C                     SETON                     LR
     C                     GOTO END
     C                     END
     C           *INL3     IFEQ '1'
     C                     WRITEGBFPR771
     C                     Z-ADD0         L       20
     C                     END
     C******************************************************
     C* M-NO BF.6.3.2      mﾞ-j xbﾅb m]c                  *
     C******************************************************
     C           ICSRYO    MULT ICKGEN    KING   112H
     C           SKING     ADD  KING      SKING  112
     C           SSRYO     ADD  ICSRYO    SSRYO  110
     C           SKENS     ADD  1         SKENS   50
     C                     WRITEGBFPR772
     C           L         ADD  1         L
     C           P         ADD  1         P       30
     C           *INL1     IFEQ '0'
     C           L         IFGE 53
     C                     WRITEGBFPR771
     C                     Z-ADD0         L
     C                     END
     C                     END
     C           END       TAG
     CL1         ZSRYO     ADD  SSRYO     ZSRYO  110
     CL1         ZKING     ADD  SKING     ZKING  112
     CL1         ZKENS     ADD  SKENS     ZKENS   50
     CL1         PLKBN     IFEQ '3'
     CL1         P         IFGT 1
     CL1                   WRITEGBFPR773
     CL1         L         ADD  1         L
     CL1                   END
     CL1                   END
     CL1                   Z-ADD0         P
     CL1                   Z-ADD0         SSRYO
     CL1                   Z-ADD0         SKING
     CL1                   Z-ADD0         SKENS
     CL1         *INL2     IFEQ '0'
     CL1                   WRITEGBFPR776
     CL1         L         ADD  1         L
     CL1         L         IFGE 53
     CL1                   WRITEGBFPR771
     CL1                   Z-ADD0         L
     CL1                   END
     CL1                   END
     CL2         FSRYO     ADD  ZSRYO     FSRYO  110
     CL2         FKING     ADD  ZKING     FKING  112
     CL2         FKENS     ADD  ZKENS     FKENS   50
     CL2                   WRITEGBFPR774
     CL2         L         ADD  1         L
     CL2                   Z-ADD0         ZSRYO
     CL2                   Z-ADD0         ZKING
     CL2                   Z-ADD0         ZKENS
     CL2         *INL3     IFEQ '0'
     CL2                   WRITEGBFPR776
     CL2         L         ADD  1         L
     CL2         L         IFGE 53
     CL2                   WRITEGBFPR771
     CL2                   Z-ADD0         L
     CL2                   END
     CL2                   END
     CL3                   WRITEGBFPR775
     CL3                   Z-ADD0         FSRYO
     CL3                   Z-ADD0         FKING
     CL3                   Z-ADD0         FKENS
**             TITLE
QTY TOTAL LIST BY PROCESS
