     H            Y.                                                      EER050
     F** GBFR42 ********************************************
     F* COMPONENTS PRIMITIVE COST M/F ACCOUNT BOOK < SALES UNIT PRICE ESTIMATE>
     F*            M-OKUDA          1985.11.18             *
     F******************************************************
     FGBFPL41 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGBFPL31 IF  E           K        DISK
     FGBFPR42 O   E                    PRINTER
     E                    MD      1   1 16               vjﾞﾆ
     I            DS
     I                                        1   80UHIZK
     I                                        1   40UYY
     I                                        5   80UMD
     I            DS
     I                                        1   80MDYY
     I                                        1   40AMD
     I                                        5   80AYY
     I            DS
     I                                        1  14 PRHBAN
     I                                        1   5 H2KHN1
     I                                        6   6 F1
     I                                        7  11 H2KHN2
     I                                       12  12 F2
     I                                       13  14 H2KHN3
     C******************************************************
     C* M-NO               ﾌﾟ[x-j- ﾉ cinﾒ                  *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           USER   10
     C                     PARM           PTOKU   4
     C                     PARM           PTKOJ   1
     C                     MOVE PTOKU     UTOKU   40
     C                     MOVE *BLANK    TMEIG  16
     C                     Z-ADD*DATE     UHIZK
     C                     Z-ADDUYY       AYY
     C                     Z-ADDUMD       AMD
     C                     MOVE MD,1      HD     16
     C                     MOVE '-'       F1
     C                     MOVE '-'       F2
     C                     SETOF                     04
     C           UTOKU     CHAINFGBPL011             04
     C           *IN04     IFEQ '0'
     C           B2SKJY    IFNE 'D'
     C                     MOVELB2SMEI    TMEIG
     C                     END
     C                     END
     C                     WRITEGBFPR421
     C                     Z-ADD0         P       20
     C******************************************************
     C* M-NO               mﾞ-jﾈln & ﾑvﾃv                  *
     C******************************************************
     C                     SETOF                     05
     C           MKEY      KLIST
     C                     KFLD           UTOKU
     C                     KFLD           PTKOJ
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
     C                     MOVE *BLANK    HIN1    5
     C                     MOVE *BLANK    HIN2    5
     C                     MOVE *BLANK    HIN3    2
     C           MKEY      SETLLGBFPL411
     C           STEP01    TAG
     C                     READ GBFPL41                  05
     C           *IN05     CABEQ'1'       END
     C           H2SKJY    CABEQ'D'       STEP01
     C           H2TOKU    CABNEUTOKU     END
     C           H2TKOJ    CABNEPTKOJ     END
     C                     SETOF                     06
     C           HKEY      KLIST
     C                     KFLD           BTOKU
     C                     KFLD           BTKOJ
     C                     KFLD           HKBN
     C                     KFLD           HCOD
     C                     Z-ADD0         BTOKU   40
     C                     MOVE *BLANK    BTKOJ   1
     C                     MOVE 'K'       HKBN    1
     C                     MOVE H2MCOD    HCOD    2
     C                     MOVE *BLANK    WMEI   20
     C           HKEY      CHAINGBFPL311             06
     C           *IN06     IFEQ '0'
     C           G8SKJY    IFNE 'D'
     C                     MOVE G8KMEI    WMEI
     C                     END
     C                     END
     C                     WRITEGBFPR422
     C           P         ADD  1         P
     C           P         IFGT 50
     C                     WRITEGBFPR421
     C                     Z-ADD0         P
     C                     END
     C                     GOTO STEP01
     C           END       TAG
     C                     SETON                     LR
**            TITLE
COMPT P-COST
