     H            Y.                                                      EER030
     F** GBFR31 ********************************************
     F* ESTIMATE PART NAME M/F UPDATE FROM DISPLAY               *
     F*             M-OKUDA          1985.11.07            *
     F******************************************************
     FGBFPW31 CF  E                    WORKSTN
     FFGBPL01 IF  E           K        DISK
     FGBFPL31 UF  E           K        DISK                      A
     E                    ER      1   9 60               ERR MSG
     I            DS
     I                                        1   80SHIZK
     I                                        1   40G8SKYY
     I                                        5   60G8SKMM
     I                                        7   80G8SKDD
     I            DS
     I                                        1   80KHIZK
     I                                        1   40G8KOYY
     I                                        5   60G8KOMM
     I                                        7   80G8KODD
     I            DS
     I                                        1   60WTIME
     I                                        1   20G8KOJI
     I                                        3   40G8KOFN
     I                                        5   60BIYO
     C******************************************************
     C* M-NO               ﾌﾟ[x-j- ﾉ cinﾒ                  *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
     C                     PARM           PTOKU   4
     C                     PARM           PTKOJ   1
     C                     MOVE PTOKU     UTOKU   40
     C                     MOVE *BLANK    TMEIG  16
     C                     SETOF                     01
     C           UTOKU     CHAINFGBPL011             04
     C           *IN04     IFEQ '0'
     C           B2SKJY    IFNE 'D'
     C                     MOVELB2SMEI    TMEIG
     C                     END
     C                     END
     C           STEP01    TAG
     C                     EXFMTGBFPW311
     C                     SETOF                     010203
     C                     SETOF                     909199
     C                     SETOF                     89
     C           *INKA     CABEQ'1'       END
     C           MENT      IFEQ '0'
     C                     SETON                     01
     C                     MOVE 'CANCEL'  CMNT    6
     C                     GOTO STEP02
     C                     ELSE
     C           MENT      IFEQ '1'
     C                     SETON                     02
     C                     MOVE 'CHANGE'  CMNT    6
     C                     GOTO STEP02
     C                     ELSE
     C           MENT      IFEQ '2'
     C                     SETON                     03
     C                     MOVE 'ADD'     CMNT    6
     C                     GOTO STEP02
     C                     ELSE
     C                     SETON                     9990
     C                     MOVE ER,1      MSG    60
     C                     GOTO STEP01
     C                     END
     C                     END
     C                     END
     C           STEP02    TAG
     C                     MOVE *BLANK    BMEI    8
     C           G8BUHN    IFEQ 'B'
     C                     MOVE 'PART'    BMEI
     C                     ELSE
     C           G8BUHN    IFEQ 'K'
     C                     MOVE 'COMPT'   BMEI
     C                     ELSE
     C                     SETON                     9989
     C                     MOVE ER,9      MSG
     C                     GOTO STEP01
     C                     END
     C                     END
     C           G8MCOD    IFEQ *BLANK
     C                     SETON                     9991
     C                     MOVE ER,2      MSG
     C                     GOTO STEP01
     C                     END
     C           MKEY      KLIST
     C                     KFLD           BTOKU
     C                     KFLD           BTKOJ
     C                     KFLD           G8BUHN
     C                     KFLD           G8MCOD
     C                     Z-ADD0         BTOKU   40
     C                     MOVE *BLANK    BTKOJ   1
     C                     SETOF                     05
     C           MKEY      CHAINGBFPL311             05
     C******************************************************
     C* M-NO               ﾃcﾆ]hﾎﾞ] n uﾇj- ﾉ f]ib kdlh     *
     C******************************************************
     C           MENT      IFEQ '0'
     C           *IN05     IFEQ '0'
     C           G8SKJY    IFEQ 'D'
     C                     SETON                     9990
     C                     MOVELER,3      MSG
     C                     GOTO STEP01
     C                     END
     C                     ELSE
     C                     SETON                     9990
     C                     MOVELER,4      MSG
     C                     GOTO STEP01
     C                     END
     C                     END
     C           MENT      IFEQ '1'
     C           *IN05     IFEQ '0'
     C           G8SKJY    IFEQ 'D'
     C                     SETON                     9990
     C                     MOVELER,5      MSG
     C                     GOTO STEP01
     C                     END
     C                     ELSE
     C                     SETON                     9990
     C                     MOVELER,6      MSG
     C                     GOTO STEP01
     C                     END
     C                     END
     C           MENT      IFEQ '2'
     C           *IN05     IFEQ '0'
     C           G8SKJY    IFNE 'D'
     C                     SETON                     9990
     C                     MOVELER,7      MSG
     C                     GOTO STEP01
     C                     END
     C                     END
     C                     END
     C           MENT      IFEQ '2'
     C                     MOVE *BLANK    G8KMEI
     C                     MOVE *BLANK    G8GMEI
     C                     END
     C           STEP03    TAG
     C                     EXFMTGBFPW312
     C                     SETOF                     9992
     C           *INKC     IFEQ '1'
     C                     MOVE *BLANK    MENT
     C                     MOVE *BLANK    G8BUHN
     C                     MOVE *BLANK    G8MCOD
     C                     GOTO STEP01
     C                     END
     C           G8KMEI    IFEQ *BLANK
     C                     SETON                     9992
     C                     MOVE ER,8      MSG
     C                     GOTO STEP03
     C                     END
     C           *INKE     CABEQ'0'       STEP03
     C                     MOVE *DATE     KHIZK
     C                     MOVE PUS       G8KONA
     C                     TIME           WTIME
     C           MENT      IFEQ '0'
     C                     MOVE 'D'       G8SKJY
     C                     MOVE *DATE     SHIZK
     C                     ELSE
     C                     MOVE *BLANK    G8SKJY
     C                     Z-ADD0         SHIZK
     C                     END
     C           MENT      IFEQ '2'
     C                     MOVE BTOKU     G8TOKU
     C                     MOVE BTKOJ     G8TKOJ
     C                     END
     C           *IN05     IFEQ '1'
     C                     WRITEGBFPL311
     C                     ELSE
     C                     UPDATGBFPL311
     C                     END
     C                     MOVE *BLANK    MENT
     C                     MOVE *BLANK    G8BUHN
     C                     MOVE *BLANK    G8MCOD
     C                     GOTO STEP01
     C           END       TAG
     C                     SETON                     LR
**
E-01 UPDATE INST IS ERROR <0= CANCEL. 1= CHANGE. 2= ADD>
E-02 PART NAME CODE IS NOT INPUT
E-03 CANCEL WAS APPOINTED, BUT M/F IS CANCELLED ALREADY
E-04 CANCEL WAS APPOINTED, BUT M/F DOES NOT EXIST
E-05 A CHANGE WAS APPOINTED, BUT M/F IS CANCELLED ALREADY
E-06 A CHANGE WAS APPOINTED, BUT M/F DOES NOT EXIST
E-07 ADD WAS APPOINTED, BUT M/F EXISTS
E-08 PART NAME <KANA> IS NOT INPUT
E-09 SELECT PART INSTRUCTION FROM B = PART, K = COMPONENTS
