     H            Y.
     F** GBFR43 ************************************
     F*  UPDATE TRANZACTION OF SALES UNIT PRICE QUOTATION DATA
     F*  .. DATA SELECT
     F*       I-HASADA              91.10.18       *
     F*       GBC                 2000.07.19       *
     F************************************ GBFR43 **
     FGBFPP51 IP  E                    DISK
     FGBFWP43 O   F     100            DISK
   #@E*
   #@E                    ##@        15  1
     I            DS
     I                                        1   80G9SKHZ
     I                                        1   40G9SKYY
     I                                        5   60G9SKMM
     I                                        7   80G9SKDD
   #@I*
   #@I            DS
   #@I                                        1  15 #@YFC
   #@I                                        1  15 ##@
     C           *ENTRY    PLIST
     C                     PARM           PTOKU   4
     C                     PARM           PTKOJ   1
     C                     MOVE PTOKU     WTOKU   40
     C                     MOVE PTKOJ     WTKOJ   1
   #@C*
      *
     C           G9SKJY    IFEQ 'D'
   #@C           G9SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           WTOKU     IFEQ G9TOKU
     C           WTKOJ     ANDEQG9TKOJ
      * TOYOTA IS G9HTAN. OTHER IS G9MTAN
     C           WTOKU     IFEQ 3174
     C                     Z-ADDG9HTAN    TANKA   74
     C                     ELSE
     C                     Z-ADDG9MTAN    TANKA
     C                     END
     C                     EXCPTDT
      *
     C                     END
     C                     END
   #@C*==============================================================*
   #@C*          S#@C01
   #@C*==============================================================*
   #@C*==============================================================*
   #@C*          S#@I01
   #@C*==============================================================*
   #@C*==============================================================*
   #@C*          SB#@YD
   #@C*==============================================================*
   #@C*==============================================================*
   #@C*          SB#@XX
   #@C*==============================================================*
     OGBFWP43 E                DT
     O                         G9TOKU     4
     O                         G9TKOJ     5
     O                         G9MHN1    10
     O                         G9MHN2    15
     O                         G9MHN3    20
     O                         TANKA     27
     O                         G9SRYO    36
