     H            Y.                                                      EER050
     F*** GBFR05 *****************************************
     F* SALES UNIT PRICE ESTIMATE BASIC FILE RESULT CLEAR *
     F*         H.ITO                  90.09.19          *
     F***************************************** GBFR05 ***
     FGBFPP51 UP  E                    DISK
     C           *IN90     IFEQ '0'
     C           *ENTRY    PLIST
     C                     PARM           PARM1   4        nhbﾅg
     C                     PARM           PARM2   1        ﾃcﾆﾞｭc
     C                     MOVE PARM1     @TOKU   40
     C                     MOVE PARM2     @TKOJ   1
     C                     MOVEL'1'       *IN90
     C                     END
     C           G9TOKU    IFEQ @TOKU
     C           G9TKOJ    ANDEQ@TKOJ
     C                     Z-ADD0         G9SRYO
     C                     Z-ADD0         G9JIRY
     C                     UPDATGBFPP511
     C                     END
