     H            Y.                                                      EER050
     F** GBFR22 ********************************************
     F* SUPPLIER PROCESSING COSTS PRIMITIVE COST M/F ACCOUNT BOOK < SALES UNIT P
     F*RICE ESTIMATE> *
     F*            M-OKUDA          1985.11.18             *
     F******************************************************
     FGBFPL21 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGBFPR22 O   E                    PRINTER
     E                    MD      1   1 18               vjﾞﾆ
     E                    CM      1   2 10               ﾃx]n
     I            DS
     I                                        1   80UHIZK
     I                                        1   40UYY
     I                                        5   80UMD
     I            DS
     I                                        1   80MDYY
     I                                        1   40AMD
     I                                        5   80AYY
     C******************************************************
     C* M-NO               ﾌﾟ[x-j- ﾉ cinﾒ                  *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           USER   10
     C                     PARM           PTOKU   4
     C                     PARM           PTKOJ   1
     C                     MOVE PTOKU     UTOKU   40
     C                     MOVE *BLANK    TMEIG  16
     C                     MOVE MD,1      HD     18
     C                     Z-ADD*DATE     UHIZK
     C                     Z-ADDUYY       AYY
     C                     Z-ADDUMD       AMD
     C                     SETOF                     04
     C           UTOKU     CHAINFGBPL011             04
     C           *IN04     IFEQ '0'
     C           B2SKJY    IFNE 'D'
     C                     MOVELB2SMEI    TMEIG
     C                     END
     C                     END
     C                     WRITEGBFPR221
     C                     Z-ADD0         P       20
     C******************************************************
     C* M-NO               mﾞ-jﾈln & ﾑvﾃv                  *
     C******************************************************
     C                     SETOF                     05
     C           MKEY      KLIST
     C                     KFLD           UTOKU
     C                     KFLD           PTKOJ
     C                     KFLD           MEK1
     C                     KFLD           MEK2
     C                     KFLD           MEK3
     C                     KFLD           SAIZ
     C                     MOVE *BLANK    MEK1    4
     C                     MOVE *BLANK    MEK2    2
     C                     MOVE *BLANK    MEK3    1
     C                     Z-ADD0         SAIZ    20
     C           MKEY      SETLLGBFPL211
     C           STEP01    TAG
     C                     READ GBFPL21                  05
     C           *IN05     CABEQ'1'       END
     C           G7SKJY    CABEQ'D'       STEP01
     C           G7TOKU    CABNEUTOKU     END
     C           G7TKOJ    CABNEPTKOJ     END
     C           G7SAIZ    IFEQ 1
     C                     MOVE CM,1      WKMEI  10
     C                     ELSE
     C                     MOVE CM,2      WKMEI
     C                     END
     C                     WRITEGBFPR222
     C           P         ADD  1         P
     C           P         IFGT 50
     C                     WRITEGBFPR221
     C                     Z-ADD0         P
     C                     END
     C                     GOTO STEP01
     C           END       TAG
     C                     SETON                     LR
**            TITLE
SUP PROC P-COST
**        COMMENT
LESS 5MM
MORE 6MM
