     H            Y.
     F** GBFR63 ********************************************
     F* SALES UNIT PRICE MATERIAL PRIMITIVE COST TOTALIZATION LIST PRINTING
     F*            M-OKUDA          1986.01.16             *
     F*            T.TODA 2021.08.23 CHANGES(20199)        *
     F******************************************************
     FGBFWL61 IP  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGBFPR63 O   E                    PRINTER
     E                    MD      1   1 26               jbnﾓ
     IGBFWL611
     I                                              I9TOKUL4
     I                                              I9KKEYL4
     I                                              I9ZCODL3
     I                                              I9TUSZL2
     I                                              I9TKOJL1
     I            DS
     I                                        1   80MDYY
     I                                        1   40DMD
     I                                        5   80DYY
     I            DS
     I                                        1   80YYMD
     I                                        1   40SYY
     I                                        5   80SMD
     C******************************************************
     C* M-NO BF.6.2        PARM ﾉ cinﾒ                     *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           PTOKU   4
     C                     PARM           PLKBN   1
     C                     PARM           PTKOJ   1
     C           *IN01     IFEQ '0'
     C                     SETON                     01
     C                     Z-ADD*DATE     YYMD
     C                     Z-ADDSYY       DYY
     C                     Z-ADDSMD       DMD
     C                     MOVE PTOKU     UTOKU   40
     C                     MOVE MD,1      HD
     C                     MOVE *BLANK    TMEIG
     C                     SETOF                     02
     C           UTOKU     CHAINFGBPL011             02
     C           *IN02     IFEQ '0'
     C                     MOVELB2SMEI    TMEIG
     C                     END
     C                     END
     C           I9TOKU    IFNE UTOKU
     C                     SETON                     LR
     C                     GOTO END
     C                     END
     C           *INL4     IFEQ '1'
     C                     MOVE I9KKEY    KKEY    1
     C                     MOVE I9ZCOD    ZCOD   15
     C           ZCOD      IFEQ *BLANK
     C                     MOVEL'SUPPLIER'ZCOD
     C                     END
     C                     Z-ADDI9TUSZ    TUSZ    31
     C                     MOVE I9TKOJ    TKOJ    1
     C                     WRITEGBFPR631
     C                     Z-ADD0         L       20
     C                     ELSE
     C           *INL3     IFEQ '1'
     C                     MOVE I9ZCOD    ZCOD   15
     C           ZCOD      IFEQ *BLANK
     C                     MOVEL'SUPPLIER'ZCOD
     C                     END
     C                     Z-ADDI9TUSZ    TUSZ    31
     C                     MOVE I9TKOJ    TKOJ    1
     C                     ELSE
     C           *INL2     IFEQ '1'
     C                     Z-ADDI9TUSZ    TUSZ    31
     C                     MOVE I9TKOJ    TKOJ    1
     C                     ELSE
     C           *INL1     IFEQ '1'
     C                     MOVE I9TKOJ    TKOJ    1
     C                     END
     C                     END
     C                     END
     C                     END
     C           I9DKBN    IFEQ 'N'
     C           I9SZIJ    MULT I9SRYO    PJRYO  152
     C           KJRYO     ADD  PJRYO     KJRYO  152
     C           NTAN      IFEQ 0
     C                     Z-ADDI9ZKGT    NTAN    75
     C                     END
     C                     END
     C           I9DKBN    IFEQ 'O'
     C           QTAN      IFEQ 0
     C                     Z-ADDI9ZKGT    QTAN    75
     C                     END
     C                     END
     C           END       TAG
     CL1         KJRYO     DIV  1000      JRYO   100H
     CL1         JRYO      MULT NTAN      NKIN   112H
     CL1         JRYO      MULT QTAN      QKIN   112H
     CL1         QKIN      SUB  NKIN      SKIN   102
     CL1         SJRYN     ADD  JRYO      SJRYN  110
     CL1         SQKIN     ADD  QKIN      SQKIN  112
     CL1         SNKIN     ADD  NKIN      SNKIN  112
     CL1         SSKIN     ADD  SKIN      SSKIN  102
     CL1                   WRITEGBFPR632
     CL1         L         ADD  1         L
     CL1         P         ADD  1         P       30
     CL1                   Z-ADD0         KJRYO
     CL1                   Z-ADD0         JRYO
     CL1                   Z-ADD0         QTAN
     CL1                   Z-ADD0         QKIN
     CL1                   Z-ADD0         NTAN
     CL1                   Z-ADD0         NKIN
     CL1                   Z-ADD0         SKIN
     CL1         *INL2     IFEQ '0'
     CL1         L         IFGE 53
     CL1                   WRITEGBFPR631
     CL1                   Z-ADD0         L
     CL1                   END
     CL1                   END
     CL2         ZJRYN     ADD  SJRYN     ZJRYN  110
     CL2         ZQKIN     ADD  SQKIN     ZQKIN  112
     CL2         ZNKIN     ADD  SNKIN     ZNKIN  112
     CL2         ZSKIN     ADD  SSKIN     ZSKIN  102
     CL2         PLKBN     IFEQ '3'
     CL2         P         IFGT 1
     CL2                   WRITEGBFPR633
     CL2         L         ADD  1         L
     CL2                   END
     CL2                   END
     CL2                   Z-ADD0         P
     CL2                   Z-ADD0         SJRYN
     CL2                   Z-ADD0         SQKIN
     CL2                   Z-ADD0         SNKIN
     CL2                   Z-ADD0         SSKIN
     CL2         *INL3     IFEQ '0'
     CL2                   WRITEGBFPR636
     CL2         L         ADD  1         L
     CL2         L         IFGE 53
     CL2                   WRITEGBFPR631
     CL2                   Z-ADD0         L
     CL2                   END
     CL2                   END
     CL3         FJRYN     ADD  ZJRYN     FJRYN  110
     CL3         FQKIN     ADD  ZQKIN     FQKIN  112
     CL3         FNKIN     ADD  ZNKIN     FNKIN  112
     CL3         FSKIN     ADD  ZSKIN     FSKIN  102
     CL3                   WRITEGBFPR634
     CL3         L         ADD  1         L
     CL3                   Z-ADD0         ZJRYN
     CL3                   Z-ADD0         ZQKIN
     CL3                   Z-ADD0         ZNKIN
     CL3                   Z-ADD0         ZSKIN
     CL3         *INL4     IFEQ '0'
     CL3                   WRITEGBFPR636
     CL3         L         ADD  1         L
     CL3         L         IFGE 53
     CL3                   WRITEGBFPR631
     CL3                   Z-ADD0         L
     CL3                   END
     CL3                   END
     CL4                   WRITEGBFPR635
     CL4                   Z-ADD0         FJRYN
     CL4                   Z-ADD0         FQKIN
     CL4                   Z-ADD0         FNKIN
     CL4                   Z-ADD0         FSKIN
**             TITLE
WG/AMT TOTAL LIST BY MAT
