     H            Y.                                    1
     F*** GBFR15 ***************************
     F* COMPONENTS ESTIMATE UNIT PRICE ACCOUNT BOOK CREATE
     F* M-OKUDA 95.09.23                   *
     F**************************************
     FGBFPL42 IP  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     IGBFPL421
     I                                              H2TOKUL1
     I                                              H2KHN1L2
     I                                              H2KHN2L2
     I                                              H2KHN3L2
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80MDYY
     I                                        1   40DMD
     I                                        5   80DYY
     I            DS
     I                                        1   80YYMD
     I                                        1   40SYY
     I                                        5   80SMD
     C           *IN05     IFEQ '0'
     C                     SETON                     05
     C                     Z-ADD*DATE     YYMD
     C                     Z-ADDSYY       DYY
     C                     Z-ADDSMD       DMD
     C                     EXCPTHD
     C                     END
     C           *INL1     IFEQ '1'
     C                     MOVE *BLANK    TMEI   15
     C           H2TOKU    CHAINFGBPL01              90
     C           *IN90     IFEQ '0'
     C           B2SKJY    IFNE 'D'
     C           B2SKHZ    ORLT *DATE
     C                     MOVELB2SMEI    TMEI
     C                     END
     C                     END
     C                     END
     C           *INL2     IFEQ '1'
     C                     EXCPTSP
     C                     END
     C           H2SKJY    CABEQ'D'       END
     C                     EXCPTMS
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
     C           END       TAG
     OQPRINT  E  103           HD
     O                                   56 'BY COMPT PART'
     O                                   68 'ADDED VALUE'
     O                                   78 'SALES UNP'
     O                                   91 'ACCOUNT BOOK'
     O                                  120 'PAGE'
     O                         PAGE  Z  124
     O        E  2             HD
     O                                  110 'GBFR15'
     O                                  118 'DATE'
     O                         MDYY     129 '  .  .    '
     O        E  2             HD
     O                                   11 'COMPT NO'
     O                                   25 'CUSTOMER'
     O                                   35 'CUST NAME'
     O                                   53 'EST PRIM_C'
     O                                   61 'SIZE'
     O                                   67 'NAME'
     O        E  1             MS
     O                         H2KHN1     7
     O                                    8 '-'
     O                         H2KHN2    13
     O                                   14 '-'
     O                         H2KHN3    16
     O                         H2TOKU    22
     O                                   23 '-'
     O                         H2TKOJ    24
     O                         TMEI      42
     O                         H2TANK1   52
     O                         H2SAIZ1   60
     O                         H2MCOD    68
     O        E  1             SP
     O                                    2 ' '
