     H            Y.
     F** GBFR44 ************************************
     F*UPDATE TRANZACTION OF SALES UNIT PRICE QUOTATION DATA
     F*  ..DATA OUTPUT
     F*       S.YAMAGAMI            91.10.18       *
     F*       GBC                 2000.07.19       *
     F************************************ GBFR44 **
     FGBFWP43 IP  F     100            DISK
     FGBFNP44 UF  E           K        DISK                      A
     E                    HTK         3  7 4             ﾃcyh j]f
     I*
     IGBFWP43 AA  01
     I                                        1   40WTOKU
     I                                        5   5 WKOJO
     I                                        6  10 WHIN1
     I                                       11  15 WHIN2
     I                                       16  20 WHIN3
     I                                       21  27 WMTAN
     I                                       28  36 WSRYO
     I            DS
     I                                        1  21 HTK
     I                                        1   74GRKDTA
     I                                        8  144GRZRTA
     I                                       15  214GRVATA
      *
     C*_____
     C* KEY
     C*~~~~~
     C           KEY1      KLIST
     C                     KFLD           WTOKU
     C                     KFLD           WKOJO
     C                     KFLD           WHIN1
     C                     KFLD           WHIN2
     C                     KFLD           WHIN3
      *
     C*_________
     C* ﾌﾟ[xｰjｰ
     C*~~~~~~~~~
     C           *ENTRY    PLIST
     C                     PARM           PSYOKA  1        ﾆｭfb
     C                     PARM           PKMK1   1        2ﾅfﾞhﾃcyh
     C                     PARM           PKMK2   1        ﾈﾞ]ﾈﾞ]fb
     C                     PARM           PKMK3   1        ﾈﾞ]fb
     C                     PARM           PKMK4   1        3ﾅfﾞhﾃcyh
      *
     C*___________
     C* PRG START
     C*~~~~~~~~~~~
     C                     Z-ADD0         HTK
     C                     MOVE WMTAN     WWMTAN  74
     C*
     C                     SETOF                     10
     C           KEY1      CHAINGBFNP441             10
     C                     Z-ADDWTOKU     GRTOKU
     C                     MOVE WKOJO     GRKOJO
     C                     MOVE WHIN1     GRHIN1
     C                     MOVE WHIN2     GRHIN2
     C                     MOVE WHIN3     GRHIN3
     C                     MOVE WSRYO     GRSRYO
      *
     C*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     C*                    1ﾈ]jh
     C*_____________________________________________________
     C           PSYOKA    IFEQ '0'
     C                     MOVE WWMTAN    GRKOTA
     C                     GOTO STEP1
     C                     END
      *
     C*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     C*                    2ﾈ]jh
     C*_____________________________________________________
     C           PKMK1     IFNE *BLANK
     C                     MOVE WWMTAN    GRRATA
     C                     MOVE PKMK1     A       20
     C           WWMTAN    SUB  GRKOTA    HTK,A
     C                     GOTO STEP1
     C                     END
      *
     C*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     C*                    3ﾈ]jh
     C*_____________________________________________________
     C           PKMK4     IFNE *BLANK
      *
     C                     MOVE WWMTAN    GRRATA
     C           WWMTAN    SUB  GRKOTA    #KMK    74
      *
     C                     Z-ADD0         WTAK1   74
     C                     Z-ADD0         WTAK2   74
     C           PKMK2     IFNE *BLANK
     C                     MOVE PKMK2     A
     C                     Z-ADDHTK,A     WTAK1
     C                     END
     C           PKMK3     IFNE *BLANK
     C                     MOVE PKMK3     A
     C                     Z-ADDHTK,A     WTAK2
     C                     END
      *
     C           #KMK      SUB  WTAK1     WKS1    74
     C           WKS1      SUB  WTAK2     WKS2    74
     C                     MOVE PKMK4     A
     C                     Z-ADDWKS2      HTK,A
     C                     END
      *
     C           STEP1     TAG
      *
     C*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     C*                    ﾃcﾆ]
     C*_____________________________________________________
     C           *IN10     IFEQ '0'
     C                     UPDATGBFNP441
     C                     ELSE
     C                     WRITEGBFNP441
     C                     END
