     H            Y.                                                      EER050
      ** GBFR51 **********************************
      * SALES UNIT PRICE PART NO UNIT ESTIMATE CALCULATION
      * GBFR54 CHANGE, TOO                     *
      *        M-OKUDA          1985.11.27       *
      *        T.TODA 2021.06.16 CHANGES(20199)  *
      ********************************************
     FGBFPW51 CF  E                    WORKSTN
     FGBFPL51 UF  E           K        DISK                      A
     FGBFPL11 IF  E           K        DISK
     FGBFPL21 IF  E           K        DISK
     FGBFPL31 IF  E           K        DISK
     FGBFPL41 IF  E           K        DISK
     FFCETL03 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGBFPP60 IF  E           K        DISK
     FGBFPP61 IF  E           K        DISK
     E                    KO         10  3               ﾃcmbﾃ-nﾞ
     E                    TN         10  6 4             ﾃcmbiﾞ]f
     E                    XKO        10  3               ﾃcmbﾃ-nﾞ ﾃﾍﾟｰ
     E                    XTN        10  6 4             ﾃcmbiﾞ]f ﾃﾍﾟｰ
     E                    ER      1  92 60               ERROR MSG
     E*                   TB1     1 176  4 0             f]ﾌ] ﾒdg aﾒ
     E*                   TB2     1 232  4 0             vlyﾒibﾅ] gｭｮf
     I            DS
     I                                        1   80UHIZK
     I                                        1   40UYY
     I                                        5   60UMM
     I                                        7   80UDD
     I            DS
     I                                        1  20 G9MHIN
     I                                        1   5 G9MHN1
     I                                        6  10 G9MHN2
     I                                       11  15 G9MHN3
     I                                       16  20 G9MHN4
     I            DS
     I                                        1  12 G9SHIN
     I                                        1   5 G9SHN1
     I                                        6  10 G9SHN2
     I                                       11  12 G9SHN3
     I            DS
     I                                        1  23 DSPHN
     I                                        1   5 DSMHN1
     I                                        6   6 F1
     I                                        7  11 DSMHN2
     I                                       12  12 F2
     I                                       13  17 DSMHN3
     I                                       18  18 F3
     I                                       19  23 DSMHN4
     I            DS
     I                                        1   80G9VHZ1
     I                                        1   40G9V1YY
     I                                        5   60G9V1MM
     I                                        7   80G9V1DD
     I*****>>     DS
     I*****>>
     I*****>>                                 5   80DPV1YY
     I*****>>                                 1   20DPV1MM
     I*****>>                                 3   40DPV1DD
     I            DS
     I                                        1   80G9VHZ2
     I                                        1   40G9V2YY
     I                                        5   60G9V2MM
     I                                        7   80G9V2DD
     I*****>>     DS
     I*****>>                                 1   80DPVHZ2
     I*****>>                                 5   80DPV2YY
     I*****>>                                 1   20DPV2MM
     I*****>>                                 3   40DPV2DD
     I            DS
     I                                        1  12 G9KHN1
     I                                        1   5 G9KN11
     I                                        6  10 G9KN12
     I                                       11  12 G9KN13
     I            DS
     I                                        1  12 G9KHN2
     I                                        1   5 G9KN21
     I                                        6  10 G9KN22
     I                                       11  12 G9KN23
     I            DS
     I                                        1  12 G9KHN3
     I                                        1   5 G9KN31
     I                                        6  10 G9KN32
     I                                       11  12 G9KN33
     I            DS
     I                                        1  12 G9KHN4
     I                                        1   5 G9KN41
     I                                        6  10 G9KN42
     I                                       11  12 G9KN43
     I            DS
     I                                        1  12 G9KHN5
     I                                        1   5 G9KN51
     I                                        6  10 G9KN52
     I                                       11  12 G9KN53
     I            DS
     I                                        1  30 KO
     I                                        1   3 G9KKO1
     I                                        4   6 G9KKO2
     I                                        7   9 G9KKO3
     I                                       10  12 G9KKO4
     I                                       13  15 G9KKO5
     I                                       16  18 G9KKO6
     I                                       19  21 G9KKO7
     I                                       22  24 G9KKO8
     I                                       25  27 G9KKO9
     I                                       28  30 G9KO10
     I            DS
     I                                        1  60 TN
     I                                        1   64G9GEN1
     I                                        7  124G9GEN2
     I                                       13  184G9GEN3
     I                                       19  244G9GEN4
     I                                       25  304G9GEN5
     I                                       31  364G9GEN6
     I                                       37  424G9GEN7
     I                                       43  484G9GEN8
     I                                       49  544G9GEN9
     I                                       55  604G9GN10
     I            DS
     I                                        1   80STHIZK
     I                                        1   40STYY
     I                                        5   60STMM
     I                                        7   80STDD
     I            DS
     I                                        1   8 STHIZ1
     I                                        1   2 STMM1
     I                                        3   4 STDD1
     I                                        5   8 STYY1
     I            DS
     I                                        1  10 STHIZ2
     I                                        1   2 STMM2
     I                                        3   3 STP1
     I                                        4   5 STDD2
     I                                        6   6 STP2
     I                                        7  10 STYY2
     I            DS
     I                                        1   80ENHIZK
     I                                        1   40ENYY
     I                                        5   60ENMM
     I                                        7   80ENDD
     I            DS
     I                                        1   8 ENHIZ1
     I                                        1   2 ENMM1
     I                                        3   4 ENDD1
     I                                        5   8 ENYY1
     I            DS
     I                                        1  10 ENHIZ2
     I                                        1   2 ENMM2
     I                                        3   3 ENP1
     I                                        4   5 ENDD2
     I                                        6   6 ENP2
     I                                        7  10 ENYY2
     I            DS
     I                                        1   60KOTIME
     I                                        1   40KTIME
     I                                        1   20KOJI
     I                                        3   40KOFN
     I                                        5   60KOBY
     I            DS
     I                                        1   80G9KAHZ
     I                                        1   40G9KAYY
     I                                        5   60G9KAMM
     I                                        7   80G9KADD
     I            DS
     I                                        1   80G9SUHZ
     I                                        1   40G9SUYY
     I                                        5   60G9SUMM
     I                                        7   80G9SUDD
     I            DS
     I                                        1   80G9KEHZ
     I                                        1   40G9KEYY
     I                                        5   60G9KEMM
     I                                        7   80G9KEDD
     I            DS
     I                                        1   40G9KETI
     I                                        1   20G9KEJI
     I                                        3   40G9KEFN
     I            DS
     I                                        1   80G9KTHZ
     I                                        1   40G9KTYY
     I                                        5   60G9KTMM
     I                                        7   80G9KTDD
      *
     I*****>>     DS
     I*****>>                                 1   80DPKTHZ
     I*****>>                                 5   80DPKTYY
     I*****>>                                 1   20DPKTMM
     I*****>>                                 3   40DPKTDD
      *
     I*           DS
     I*                                       1   80G9QKHZ
     I*                                       1   40G9QKYY
     I*                                       5   60G9QKMM
     I*                                       7   80G9QKDD
     I*           DS
     I*                                       1   80G9QSHZ
     I*                                       1   40G9QSYY
     I*                                       5   60G9QSMM
     I*                                       7   80G9QSDD
     I            DS
     I                                        1   80G9SKHZ
     I                                        1   40G9SKYY
     I                                        5   60G9SKMM
     I                                        7   80G9SKDD
     I            DS
     I                                        1   80G9KOHZ
     I                                        1   40G9KOYY
     I                                        5   60G9KOMM
     I                                        7   80G9KODD
     I            DS
     I                                        1   40G9KOTI
     I                                        1   20G9KOJI
     I                                        3   40G9KOFN
     I            DS
     I                                        1   80GASKHZ
     I                                        1   40GASKYY
     I                                        5   60GASKMM
     I                                        7   80GASKDD
     I            DS
     I                                        1   80GBSKHZ
     I                                        1   40GBSKYY
     I                                        5   60GBSKMM
     I                                        7   80GBSKDD
      *
     C******************************************************
     C* M-NO               ﾌﾟ[x-j- cinﾒ                    *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           USER   10
     C                     PARM           PTOKU   4
     C                     PARM           PTKOJ   1
      *    MMDDYYYY ﾉ ibﾆg
     C                     PARM           PSTR    8
     C                     PARM           PEND    8
      *
     C                     PARM           PTKBN   1
     C                     PARM           PTIME   6
     C                     MOVE '-'       F1
     C                     MOVE '-'       F2
     C                     MOVE '-'       F3
     C                     MOVE PTOKU     UTOKU   40
     C                     MOVE '*'       ATKOJ   1
      *    MMDDYYYY ﾉ ibﾆg
     C                     MOVE PSTR      STHIZ1
     C                     MOVE PEND      ENHIZ1
      *    YYYYMMDD ﾉ ibﾆg p s]f]
     C                     MOVE STYY1     STYY
     C                     MOVE STMM1     STMM
     C                     MOVE STDD1     STDD
     C                     MOVE ENYY1     ENYY
     C                     MOVE ENMM1     ENMM
     C                     MOVE ENDD1     ENDD
      *    fﾞx]ﾍｭcﾆﾞﾑc
     C                     MOVE STMM1     STMM2
     C                     MOVE '.'       STP1
     C                     MOVE STDD1     STDD2
     C                     MOVE '.'       STP2
     C                     MOVE STYY1     STYY2
     C                     MOVE ENMM1     ENMM2
     C                     MOVE '.'       ENP1
     C                     MOVE ENDD1     ENDD2
     C                     MOVE '.'       ENP2
     C                     MOVE ENYY1     ENYY2
      *
     C                     MOVE PTIME     KOTIME
     C                     MOVE *BLANK    TMEIG  16
      *
     C                     SETOF                     04
     C           UTOKU     CHAINFGBPL011             04
     C           *IN04     IFEQ '0'
     C           B2SKJY    IFNE 'D'
     C                     MOVELB2SMEI    TMEIG
     C                     END
     C                     END
      *
     C                     MOVE *BLANK    KESAN
     C           PTKBN     IFEQ 'N'
     C                     MOVEL'NEW UNIT'KESAN
     C                     MOVE 'PRICE'   KESAN
     C                     ELSE
     C           PTKBN     IFEQ 'O'
     C                     MOVEL'OLD UNIT'KESAN
     C                     MOVE 'PRICE'   KESAN
     C                     END
     C                     END
      *
     C           HKEY      KLIST
     C                     KFLD           UTOKU
     C                     KFLD           PTKOJ
     C                     KFLD           G9MHN1
     C                     KFLD           G9MHN2
     C                     KFLD           G9MHN3
     C                     KFLD           G9MHN4
     C                     MOVE *BLANK    G9MHN1
     C                     MOVE *BLANK    G9MHN2
     C                     MOVE *BLANK    G9MHN3
     C                     MOVE *BLANK    G9MHN4
     C                     Z-ADD0         XTN
      *
     C******************************************************
     C* M-NO               KEYfﾞx] ﾉ ﾆﾑﾒ                   *
     C******************************************************
     C           STEP01    TAG
      *
     C                     EXFMTGBFPW511
     C           *INKA     CABEQ'1'       END
     C                     SETOF                     010203
     C                     SETOF                     994041
     C                     SETOF                     101113
      *
     C           MENT      IFNE '0'
     C           MENT      ANDNE'1'
     C           MENT      ANDNE'2'
     C                     SETON                     9940
     C                     MOVE ER,01     MSG
     C                     GOTO STEP01
     C                     END
      *
     C           MENT      IFEQ '0'
     C                     SETON                     01
     C                     MOVE 'CANCEL'  CMNT    6
     C                     GOTO STEP02
     C                     ELSE
     C           MENT      IFEQ '1'
     C                     SETON                     02
     C                     MOVE 'CHANGE'  CMNT    6
     C                     GOTO STEP02
     C                     ELSE
     C           MENT      IFEQ '2'
     C                     SETON                     03
     C                     MOVE ' ADD  '  CMNT    6
     C                     GOTO STEP02
     C                     ELSE
     C                     SETON                     9940
     C                     MOVE ER,91     MSG    60
     C                     GOTO STEP01
     C                     END
     C                     END
     C                     END
     C           STEP02    TAG
      *
     C           G9MHIN    IFEQ *BLANK
     C                     SETON                     9941
     C                     MOVE ER,2      MSG
     C                     GOTO STEP01
     C                     END
      *
     C           MENT      IFEQ '2'
     C           XTOKU     IFEQ *BLANK
     C           XNKOJ     ANDEQ*BLANK
     C                     ELSE
      *
     C           KEY       KLIST
     C                     KFLD           XTOK
     C                     KFLD           XNKOJ
     C                     KFLD           G9MHN1
     C                     KFLD           G9MHN2
     C                     KFLD           G9MHN3
     C                     KFLD           G9MHN4
     C                     MOVE XTOKU     XTOK    40
      *
     C                     SETOF                     12
     C           KEY       CHAINGBFPL511             12
     C           *IN12     IFEQ '0'
     C                     SETON                     13
     C                     Z-ADDG9CHOU    ZCHOU   64
     C                     MOVE G9MSYO    ZMSYO   2
     C                     Z-ADDG9TUSZ    ZTUSZ   31
     C                     Z-ADDG9KUBI    ZKUBI   52
     C                     MOVE G9YAKI    ZYAKI   3
     C                     MOVE G9TKBN    ZTKBN   1
     C                     Z-ADDG9KTNK    ZKTNK   74
     C                     MOVE G9SKYU    ZSKYU   1
     C                     MOVE G9ZCOD    ZZCOD  15
     C                     Z-ADDG9ZKGT    ZZKGT   74
     C                     Z-ADDG9SZIJ    ZSZIJ   72
     C                     Z-ADDG9SZAJ    ZSZAJ   72
     C                     Z-ADDG9KANJ    ZKANJ   72
     C                     Z-ADDG9SZIH    ZSZIH   74
     C                     Z-ADDG9KAIS    ZKAIS   52
     C                     Z-ADDG9SKUR    ZSKUR   74
     C                     Z-ADDG9SKRH    ZSKRH   74
     C                     Z-ADDG9ZAIH    ZZAIH   74
     C                     MOVE G9KHN1    ZKHN1  12
     C                     MOVE G9KHN2    ZKHN2  12
     C                     MOVE G9KHN3    ZKHN3  12
     C                     MOVE G9KHN4    ZKHN4  12
     C                     MOVE G9KHN5    ZKHN5  12
     C                     Z-ADDG9SYO1    ZSYO1   10
     C                     Z-ADDG9SYO2    ZSYO2   10
     C                     Z-ADDG9SYO3    ZSYO3   10
     C                     Z-ADDG9SYO4    ZSYO4   10
     C                     Z-ADDG9SYO5    ZSYO5   10
     C                     Z-ADDG9SIZ1    ZSIZ1   20
     C                     Z-ADDG9SIZ2    ZSIZ2   20
     C                     Z-ADDG9SIZ3    ZSIZ3   20
     C                     Z-ADDG9SIZ4    ZSIZ4   20
     C                     Z-ADDG9SIZ5    ZSIZ5   20
     C                     MOVE G9MEI1    ZMEI1   2
     C                     MOVE G9MEI2    ZMEI2   2
     C                     MOVE G9MEI3    ZMEI3   2
     C                     MOVE G9MEI4    ZMEI4   2
     C                     MOVE G9MEI5    ZMEI5   2
     C                     Z-ADDG9TNK1    ZTNK1   74
     C                     Z-ADDG9TNK2    ZTNK2   74
     C                     Z-ADDG9TNK3    ZTNK3   74
     C                     Z-ADDG9TNK4    ZTNK4   74
     C                     Z-ADDG9TNK5    ZTNK5   74
     C                     Z-ADDG9KOUH    ZKOUH   74
     C                     MOVE G9SME1    ZSME1   4
     C                     MOVE G9SME2    ZSME2   2
     C                     MOVE G9SME3    ZSME3   1
     C                     Z-ADDG9SZKB    ZSZKB   20
     C                     Z-ADDG9GGEN    ZGGEN   74
     C                     MOVE G9GTNI    ZGTNI   1
     C                     Z-ADDG9MMTN    ZMMTN   74
     C                     MOVE G9TCOD    ZTCOD   1
     C                     Z-ADDG9TGEN    ZTGEN   74
     C                     MOVE G9TANI    ZTANI   1
     C                     Z-ADDG9MTTN    ZMTTN   74
     C                     MOVE G9UMEK    ZUMEK   8
     C                     Z-ADDG9GITU    ZGITU   74
     C                     MOVEAKO        XKO
     C                     Z-ADDTN        XTN
     C                     Z-ADDG9KAKH    ZKAKH   74
     C                     Z-ADDG9SGEN    ZSGEN   74
     C                     Z-ADDG9KANR    ZKANR   31
     C                     Z-ADDG9KNRH    ZKNRH   74
     C                     Z-ADDG9REKR    ZREKR   31
     C                     Z-ADDG9RIEK    ZRIEK   74
     C                     Z-ADDG9STAN    ZSTAN   74
     C                     MOVE G9RKB1    ZRKB1   1
     C                     Z-ADDG9RRI1    ZRRI1   31
     C                     Z-ADDG9RKI1    ZRKI1   74
     C                     Z-ADDG9RKN1    ZRKN1   74
     C                     MOVE G9RKB2    ZRKB2   1
     C                     Z-ADDG9RRI2    ZRRI2   31
     C                     Z-ADDG9RKI2    ZRKI2   74
     C                     Z-ADDG9RKN2    ZRKN2   74
     C                     Z-ADDG9TKYO    ZTKYO   74
     C                     Z-ADDG9HTAN    ZHTAN   74
     C                     Z-ADDG9KTHZ    ZKTHZ   80
     C                     Z-ADDG9KATA    ZKATA   74
     C                     MOVE G9V1TA    ZV1TA   1
     C                     MOVE G9V1TB    ZV1TB   1
     C                     MOVE G9V1TC    ZV1TC   1
     C                     Z-ADDG9VHZ1    ZVHZ1   80
     C                     Z-ADDG9V1KN    ZV1KN   74
     C                     MOVE G9V2TA    ZV2TA   1
     C                     MOVE G9V2TB    ZV2TB   1
     C                     MOVE G9V2TC    ZV2TC   1
     C                     Z-ADDG9VHZ2    ZVHZ2   80
     C                     Z-ADDG9V2KN    ZV2KN   74
     C                     Z-ADDG9VAVE    ZVAVE   74
     C                     Z-ADDG9KAHZ    ZKAHZ   80
     C                     Z-ADDG9SUHZ    ZSUHZ   80
     C                     Z-ADDG9MTAN    ZMTAN   74
     C                     Z-ADDG9SRYO    ZSRYO   90
     C*                    Z-ADDG9QKHZ    ZQKHZ   80
     C*                    Z-ADDG9QSHZ    ZQSHZ   80
     C                     Z-ADDG9QTAN    ZQTAN   74
     C                     Z-ADDG9QSRY    ZQSRY   90
     C                     MOVE G9SHN1    ZSHN1   5
     C                     MOVE G9SHN2    ZSHN2   5
     C                     MOVE G9SHN3    ZSHN3   2
     C                     Z-ADDG9JIRY    ZJIRY   90
     C                     MOVE G9AHN1    AHIN1   5
     C                     MOVE G9AHN2    AHIN2   5
     C                     MOVE G9AHN3    AHIN3   2
     C                     END
     C                     END
     C                     ELSE
      *
     C           XTOKU     IFNE *BLANK
     C                     SETON                     1099
     C                     MOVE ER,79     MSG
     C                     GOTO STEP01
     C                     END
     C           XNKOJ     IFNE *BLANK
     C                     SETON                     1199
     C                     MOVE ER,80     MSG
     C                     GOTO STEP01
     C                     END
     C                     END
      *
     C                     SETOF                     04
     C           MKEY      KLIST
     C                     KFLD           UTOKU
     C                     KFLD           PTKOJ
     C                     KFLD           G9MHN1
     C                     KFLD           G9MHN2
     C                     KFLD           G9MHN3
     C                     KFLD           G9MHN4
     C           MKEY      CHAINGBFPL511             04
      *
     C******************************************************
     C* M-NO               ﾃcﾆ]hﾎﾞ] n uﾇj- ﾉ f]ib kdlh     *
     C******************************************************
     C           MENT      IFEQ '0'
     C           *IN04     IFEQ '0'
     C           G9SKJY    IFEQ 'D'
     C                     SETON                     9940
     C                     MOVELER,3      MSG
     C                     GOTO STEP01
     C                     END
     C                     ELSE
     C                     SETON                     9940
     C                     MOVELER,4      MSG
     C                     GOTO STEP01
     C                     END
     C                     END
      *
     C           MENT      IFEQ '1'
     C           *IN04     IFEQ '0'
     C           G9SKJY    IFEQ 'D'
     C                     SETON                     9940
     C                     MOVELER,5      MSG
     C                     GOTO STEP01
     C                     END
     C                     ELSE
     C                     SETON                     9940
     C                     MOVELER,6      MSG
     C                     GOTO STEP01
     C                     END
     C                     END
      *
     C           MENT      IFEQ '2'
     C           *IN04     IFEQ '0'
     C           G9SKJY    IFNE 'D'
     C                     SETON                     9940
     C                     MOVELER,7      MSG
     C                     GOTO STEP01
     C                     END
     C                     END
     C                     END
     C                     MOVE G9MHN1    DSMHN1
     C                     MOVE G9MHN2    DSMHN2
     C                     MOVE G9MHN3    DSMHN3
     C                     MOVE G9MHN4    DSMHN4
      *
     C           MENT      IFEQ '2'
     C                     Z-ADD0         G9CHOU
     C                     MOVE *BLANK    G9AHN1
     C                     MOVE *BLANK    G9AHN2
     C                     MOVE *BLANK    G9AHN3
     C                     MOVE *BLANK    G9SKJY
     C                     Z-ADD0         G9SKHZ
     C                     MOVE *DATE     G9KOHZ
     C                     Z-ADDKOTIME    G9KOTI
     C                     MOVE USER      G9KOME
     C                     Z-ADDUTOKU     G9TOKU
     C                     MOVE PTKOJ     G9TKOJ
     C                     MOVE *BLANK    G9MSYO
     C                     Z-ADD0         G9TUSZ
     C                     Z-ADD0         G9KUBI
     C                     MOVE *BLANK    G9YAKI
     C                     MOVE *BLANK    G9TKBN
     C                     Z-ADD0         G9KTNK
     C                     MOVE *BLANK    G9SKYU
     C                     MOVE *BLANK    G9ZCOD
     C                     Z-ADD0         G9ZKGT
     C                     Z-ADD0         G9SZIJ
     C                     Z-ADD0         G9SZAJ
     C                     Z-ADD0         G9KANJ
     C                     Z-ADD0         G9SZIH
     C                     Z-ADD0         G9KAIS
     C                     Z-ADD0         G9SKUR
     C                     Z-ADD0         G9SKRH
     C                     Z-ADD0         G9ZAIH
     C                     MOVE *BLANK    G9KHN1
     C                     MOVE *BLANK    G9KHN2
     C                     MOVE *BLANK    G9KHN3
     C                     MOVE *BLANK    G9KHN4
     C                     MOVE *BLANK    G9KHN5
     C                     Z-ADD0         G9SYO1
     C                     Z-ADD0         G9SYO2
     C                     Z-ADD0         G9SYO3
     C                     Z-ADD0         G9SYO4
     C                     Z-ADD0         G9SYO5
     C                     Z-ADD0         G9SIZ1
     C                     Z-ADD0         G9SIZ2
     C                     Z-ADD0         G9SIZ3
     C                     Z-ADD0         G9SIZ4
     C                     Z-ADD0         G9SIZ5
     C                     MOVE *BLANK    G9MEI1
     C                     MOVE *BLANK    G9MEI2
     C                     MOVE *BLANK    G9MEI3
     C                     MOVE *BLANK    G9MEI4
     C                     MOVE *BLANK    G9MEI5
     C                     Z-ADD0         G9TNK1
     C                     Z-ADD0         G9TNK2
     C                     Z-ADD0         G9TNK3
     C                     Z-ADD0         G9TNK4
     C                     Z-ADD0         G9TNK5
     C                     Z-ADD0         G9KOUH
     C                     MOVE *BLANK    G9SME1
     C                     MOVE *BLANK    G9SME2
     C                     MOVE *BLANK    G9SME3
     C                     Z-ADD0         G9SZKB
     C                     Z-ADD0         G9GGEN
     C                     MOVE *BLANK    G9GTNI
     C                     Z-ADD0         G9MMTN
     C                     MOVE *BLANK    G9TCOD
     C                     Z-ADD0         G9TGEN
     C                     MOVE *BLANK    G9TANI
     C                     Z-ADD0         G9MTTN
     C                     MOVE *BLANK    G9UMEK
     C                     Z-ADD0         G9GITU
     C                     MOVE *BLANK    KO
     C                     Z-ADD0         TN
     C                     Z-ADD0         G9KAKH
     C                     Z-ADD0         G9SGEN
     C                     Z-ADD0         G9KANR
     C                     Z-ADD0         G9KNRH
     C                     Z-ADD0         G9REKR
     C                     Z-ADD0         G9RIEK
     C                     Z-ADD0         G9STAN
     C                     MOVE *BLANK    G9RKB1
     C                     Z-ADD0         G9RRI1
     C                     Z-ADD0         G9RKI1
     C                     Z-ADD0         G9RKN1
     C                     MOVE *BLANK    G9RKB2
     C                     Z-ADD0         G9RRI2
     C                     Z-ADD0         G9RKI2
     C                     Z-ADD0         G9RKN2
     C                     Z-ADD0         G9TKYO
     C                     Z-ADD0         G9HTAN
     C                     Z-ADD0         G9KTHZ
     C                     Z-ADD0         G9KATA
     C                     MOVE *BLANK    G9V1TA
     C                     MOVE *BLANK    G9V1TB
     C                     MOVE *BLANK    G9V1TC
     C                     Z-ADD0         G9VHZ1
     C                     Z-ADD0         G9V1KN
     C                     MOVE *BLANK    G9V2TA
     C                     MOVE *BLANK    G9V2TB
     C                     MOVE *BLANK    G9V2TC
     C                     Z-ADD0         G9VHZ2
     C                     Z-ADD0         G9V2KN
     C                     Z-ADD0         G9VAVE
     C                     Z-ADD0         G9KAHZ
     C                     Z-ADD0         G9SUHZ
     C                     Z-ADD0         G9MTAN
     C                     Z-ADD0         G9SRYO
     C                     MOVE *DATE     G9KEHZ
     C                     Z-ADDKTIME     G9KETI
     C*                    Z-ADD0         G9QKHZ
     C*                    Z-ADD0         G9QSHZ
     C                     Z-ADD0         G9QTAN
     C                     Z-ADD0         G9QSRY
     C                     Z-ADD0         DSTANK  74
     C                     MOVE *BLANK    G9SHN1
     C                     MOVE *BLANK    G9SHN2
     C                     MOVE *BLANK    G9SHN3
     C                     Z-ADD0         G9JIRY
      *
     C           *IN13     IFEQ '1'
     C                     Z-ADDZCHOU     G9CHOU
     C                     MOVE ZMSYO     G9MSYO
     C                     Z-ADDZTUSZ     G9TUSZ
     C                     Z-ADDZKUBI     G9KUBI
     C                     MOVE ZYAKI     G9YAKI
     C                     MOVE ZTKBN     G9TKBN
     C                     Z-ADDZKTNK     G9KTNK
     C                     MOVE ZSKYU     G9SKYU
     C                     MOVE ZZCOD     G9ZCOD
     C                     Z-ADDZZKGT     G9ZKGT
     C                     Z-ADDZSZIJ     G9SZIJ
     C                     Z-ADDZSZAJ     G9SZAJ
     C                     Z-ADDZKANJ     G9KANJ
     C                     Z-ADDZSZIH     G9SZIH
     C                     Z-ADDZKAIS     G9KAIS
     C                     Z-ADDZSKUR     G9SKUR
     C                     Z-ADDZSKRH     G9SKRH
     C                     Z-ADDZZAIH     G9ZAIH
     C                     MOVE ZKHN1     G9KHN1
     C                     MOVE ZKHN2     G9KHN2
     C                     MOVE ZKHN3     G9KHN3
     C                     MOVE ZKHN4     G9KHN4
     C                     MOVE ZKHN5     G9KHN5
     C                     Z-ADDZSYO1     G9SYO1
     C                     Z-ADDZSYO2     G9SYO2
     C                     Z-ADDZSYO3     G9SYO3
     C                     Z-ADDZSYO4     G9SYO4
     C                     Z-ADDZSYO5     G9SYO5
     C                     Z-ADDZSIZ1     G9SIZ1
     C                     Z-ADDZSIZ2     G9SIZ2
     C                     Z-ADDZSIZ3     G9SIZ3
     C                     Z-ADDZSIZ4     G9SIZ4
     C                     Z-ADDZSIZ5     G9SIZ5
     C                     MOVE ZMEI1     G9MEI1
     C                     MOVE ZMEI2     G9MEI2
     C                     MOVE ZMEI3     G9MEI3
     C                     MOVE ZMEI4     G9MEI4
     C                     MOVE ZMEI5     G9MEI5
     C                     Z-ADDZTNK1     G9TNK1
     C                     Z-ADDZTNK2     G9TNK2
     C                     Z-ADDZTNK3     G9TNK3
     C                     Z-ADDZTNK4     G9TNK4
     C                     Z-ADDZTNK5     G9TNK5
     C                     Z-ADDZKOUH     G9KOUH
     C                     MOVE ZSME1     G9SME1
     C                     MOVE ZSME2     G9SME2
     C                     MOVE ZSME3     G9SME3
     C                     Z-ADDZSZKB     G9SZKB
     C                     Z-ADDZGGEN     G9GGEN
     C                     MOVE ZGTNI     G9GTNI
     C                     Z-ADDZMMTN     G9MMTN
     C                     MOVE ZTCOD     G9TCOD
     C                     Z-ADDZTGEN     G9TGEN
     C                     MOVE ZTANI     G9TANI
     C                     Z-ADDZMTTN     G9MTTN
     C                     MOVE ZUMEK     G9UMEK
     C                     Z-ADDZGITU     G9GITU
     C                     MOVEAXKO       KO
     C                     Z-ADDXTN       TN
     C                     Z-ADDZKAKH     G9KAKH
     C                     Z-ADDZSGEN     G9SGEN
     C                     Z-ADDZKANR     G9KANR
     C                     Z-ADDZKNRH     G9KNRH
     C                     Z-ADDZREKR     G9REKR
     C                     Z-ADDZRIEK     G9RIEK
     C                     Z-ADDZSTAN     G9STAN
     C                     MOVE ZRKB1     G9RKB1
     C                     Z-ADDZRRI1     G9RRI1
     C                     Z-ADDZRKI1     G9RKI1
     C                     Z-ADDZRKN1     G9RKN1
     C                     MOVE ZRKB2     G9RKB2
     C                     Z-ADDZRRI2     G9RRI2
     C                     Z-ADDZRKI2     G9RKI2
     C                     Z-ADDZRKN2     G9RKN2
     C                     Z-ADDZTKYO     G9TKYO
     C                     Z-ADDZHTAN     G9HTAN
     C                     Z-ADDZKTHZ     G9KTHZ
     C                     Z-ADDZKATA     G9KATA
     C                     MOVE ZV1TA     G9V1TA
     C                     MOVE ZV1TB     G9V1TB
     C                     MOVE ZV1TC     G9V1TC
     C                     Z-ADDZVHZ1     G9VHZ1
     C                     Z-ADDZV1KN     G9V1KN
     C                     MOVE ZV2TA     G9V2TA
     C                     MOVE ZV2TB     G9V2TB
     C                     MOVE ZV2TC     G9V2TC
     C                     Z-ADDZVHZ2     G9VHZ2
     C                     Z-ADDZV2KN     G9V2KN
     C                     Z-ADDZVAVE     G9VAVE
     C                     Z-ADDZKAHZ     G9KAHZ
     C                     Z-ADDZSUHZ     G9SUHZ
     C                     Z-ADDZMTAN     G9MTAN
     C                     Z-ADDZSRYO     G9SRYO
     C*                    Z-ADDZQKHZ     G9QKHZ
     C*                    Z-ADDZQSHZ     G9QSHZ
     C                     Z-ADDZQTAN     G9QTAN
     C                     Z-ADDZQSRY     G9QSRY
     C                     MOVE ZSHN1     G9SHN1
     C                     MOVE ZSHN2     G9SHN2
     C                     MOVE ZSHN3     G9SHN3
     C                     Z-ADDZJIRY     G9JIRY
     C                     MOVE AHIN1     G9AHN1
     C                     MOVE AHIN2     G9AHN2
     C                     MOVE AHIN3     G9AHN3
     C           PTKBN     IFEQ 'O'
     C                     Z-ADDG9QTAN    DSTANK
     C                     ELSE
     C                     Z-ADDG9MTAN    DSTANK
     C                     END
     C                     END
     C                     ELSE
      *
     C           PTKBN     IFEQ 'O'
     C                     Z-ADDG9QTAN    DSTANK
     C                     ELSE
     C                     Z-ADDG9MTAN    DSTANK
     C                     END
     C                     END
      *
     C******************************************************
     C* M-NO               mﾞ-j ncﾜh & j]fibﾅ] fﾞx]        *
     C******************************************************
     C           STEP03    TAG
     C                     EXFMTGBFPW512
     C                     Z-ADD42        S       20
     C           42        DO   96        S
     C                     MOVE '0'       *IN,S
     C                     END
     C                     SETOF                     9899
      *
     C           *INKC     IFEQ '1'
     C                     MOVE *BLANK    MENT
     C                     MOVE *BLANK    G9MHIN
     C                     MOVE *BLANK    XTOKU
     C                     MOVE *BLANK    XNKOJ
     C                     GOTO STEP01
     C                     END
      *
     C           G9AHN1    IFEQ *BLANK
     C           G9AHN2    ANDEQ*BLANK
     C           G9AHN3    ANDEQ*BLANK
     C                     SETON                     9998
     C                     MOVE ER,92     MSG
     C                     GOTO STEP03
     C                     END
     C******************************************************
     C* M-NO               ﾅﾞbﾒｭcﾆﾞｭctc ﾉ kdlh             *
     C******************************************************
     C           G9MSYO    IFEQ *BLANK
     C                     SETON                     9942
     C                     MOVE ER,8      MSG
     C                     GOTO STEP03
     C                     END
      *
     C           MSKEY     KLIST
     C                     KFLD           BTOKU
     C                     KFLD           BTKOJ
     C                     KFLD           BBUHN
     C                     KFLD           G9MSYO
     C                     Z-ADD0         BTOKU   40
     C                     MOVE *BLANK    BTKOJ   1
     C                     MOVE 'B'       BBUHN   1
     C                     MOVE *BLANK    BHMEI  20
      *
     C           MSKEY     CHAINGBFPL311             99
     C           *IN99     IFEQ '1'
     C                     MOVE ER,9      MSG
     C                     SETON                     42
     C                     GOTO STEP03
     C                     ELSE
     C           G8SKJY    IFEQ 'D'
     C                     MOVE ER,9      MSG
     C                     SETON                     4299
     C                     GOTO STEP03
     C                     END
     C                     MOVE G8KMEI    BHMEI
     C                     END
      *
     C           G9TUSZ    IFEQ 0
     C                     SETON                     9943
     C                     MOVE ER,10     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9KUBI    IFEQ 0
     C                     SETON                     9944
     C                     MOVE ER,11     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9YAKI    IFEQ *BLANK
     C                     SETON                     9945
     C                     MOVE ER,12     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9YAKI    IFNE '***'
     C           G9YAKI    CHAINFCETL031             99
     C           *IN99     IFEQ '0'
     C           A6GSKD    IFEQ 'D'
     C                     SETON                     99
     C                     END
     C                     END
     C           *IN99     IFEQ '1'
     C                     SETON                     45
     C                     MOVE ER,73     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9TKBN    IFNE 'A'
     C           G9TKBN    IFNE 'B'
     C           G9TKBN    IFNE 'C'
     C                     SETON                     9946
     C                     MOVE ER,13     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C                     END
      *
     C           G9TKBN    IFNE 'A'
     C           G9KTNK    IFEQ 0
     C                     SETON                     9947
     C                     MOVE ER,14     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9TKBN    IFEQ 'A'
     C           G9KTNK    IFNE 0
     C                     SETON                     9947
     C                     MOVE ER,15     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9TKBN    IFEQ 'A'
     C           G9SKYU    IFEQ *BLANK
     C                     SETON                     9995
     C                     MOVE ER,74     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9ZCOD    IFEQ *BLANK
     C                     SETON                     9948
     C                     MOVE ER,16     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           ZKEY      KLIST
     C                     KFLD           UTOKU
     C                     KFLD           ATKOJ
     C                     KFLD           G9ZCOD
     C                     Z-ADD0         G9KAIS
     C                     Z-ADD0         G9SZIH
     C           ZKEY      CHAINGBFPL111             99
     C           *IN99     IFEQ '1'
     C                     MOVE ER,17     MSG
     C                     SETON                     48
     C                     GOTO STEP03
     C                     ELSE
     C           H3SKJY    IFEQ 'D'
     C                     MOVE ER,17     MSG
     C                     SETON                     4899
     C                     GOTO STEP03
     C                     END
     C                     Z-ADDH3KRIT    G9KAIS
     C                     Z-ADDH3STAN    G9SKUR
     C                     Z-ADDH3KTNK    G9ZKGT
     C                     END
      *
     C           G9SZIJ    IFEQ 0
     C                     SETON                     9949
     C                     MOVE ER,18     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9SZAJ    IFEQ 0
     C                     SETON                     9950
     C                     MOVE ER,19     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9SZAJ    IFGT G9SZIJ
     C                     SETON                     9950
     C                     MOVE ER,21     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9KANJ    IFEQ 0
     C                     SETON                     9951
     C                     MOVE ER,20     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C******************************************************
     C* M-NO               ﾃcpｬcﾍ] ﾆﾞｭctc ﾉ kｩｮh           *
     C******************************************************
     C           KOKEY     KLIST
     C                     KFLD           UTOKU
     C                     KFLD           ATKOJ
     C                     KFLD           KKHN1   5
     C                     KFLD           KKHN2   5
     C                     KFLD           KKHN3   2
     C                     Z-ADD0         G9SIZ1
     C                     MOVE *BLANK    G9MEI1
     C                     Z-ADD0         G9TNK1
      *
     C           G9KHN1    IFNE *BLANK
     C                     MOVE G9KN11    KKHN1
     C                     MOVE G9KN12    KKHN2
     C                     MOVE G9KN13    KKHN3
     C           KOKEY     CHAINGBFPL411             99
     C           *IN99     IFEQ '1'
     C                     SETON                     53
     C                     MOVE ER,22     MSG
     C                     GOTO STEP03
     C                     ELSE
     C           H2SKJY    IFEQ 'D'
     C                     SETON                     5399
     C                     MOVE ER,22     MSG
     C                     GOTO STEP03
     C                     END
      *
     C                     Z-ADDH2TANK    G9TNK1
     C                     Z-ADDH2SAIZ    G9SIZ1
     C                     MOVE H2MCOD    G9MEI1
     C           G9TUSZ    SUB  1         WSZ     20
     C           G9SIZ1    IFLT WSZ
     C                     SETON                     9953
     C                     MOVE ER,71     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9SYO1    IFEQ 0
     C                     SETON                     9954
     C                     MOVE ER,23     MSG
     C                     GOTO STEP03
     C                     END
     C                     ELSE
      *
     C           G9SYO1    IFNE 0
     C                     SETON                     9954
     C                     MOVE ER,24     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C                     Z-ADD0         G9SIZ2
     C                     MOVE *BLANK    G9MEI2
     C                     Z-ADD0         G9TNK2
      *
     C           G9KHN2    IFNE *BLANK
     C                     MOVE G9KN21    KKHN1
     C                     MOVE G9KN22    KKHN2
     C                     MOVE G9KN23    KKHN3
     C           KOKEY     CHAINGBFPL411             99
     C           *IN99     IFEQ '1'
     C                     SETON                     55
     C                     MOVE ER,25     MSG
     C                     GOTO STEP03
     C                     ELSE
     C           H2SKJY    IFEQ 'D'
     C                     SETON                     5599
     C                     MOVE ER,25     MSG
     C                     GOTO STEP03
     C                     END
      *
     C                     Z-ADDH2TANK    G9TNK2
     C                     Z-ADDH2SAIZ    G9SIZ2
     C                     MOVE H2MCOD    G9MEI2
     C           G9TUSZ    SUB  1         WSZ     20
     C           G9SIZ2    IFLT WSZ
     C                     SETON                     9955
     C                     MOVE ER,71     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9SYO2    IFEQ 0
     C                     SETON                     9956
     C                     MOVE ER,26     MSG
     C                     GOTO STEP03
     C                     END
     C                     ELSE
      *
     C           G9SYO2    IFNE 0
     C                     SETON                     9956
     C                     MOVE ER,27     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C                     Z-ADD0         G9SIZ3
     C                     MOVE *BLANK    G9MEI3
     C                     Z-ADD0         G9TNK3
      *
     C           G9KHN3    IFNE *BLANK
     C                     MOVE G9KN31    KKHN1
     C                     MOVE G9KN32    KKHN2
     C                     MOVE G9KN33    KKHN3
     C           KOKEY     CHAINGBFPL411             99
     C           *IN99     IFEQ '1'
     C                     SETON                     57
     C                     MOVE ER,28     MSG
     C                     GOTO STEP03
     C                     ELSE
     C           H2SKJY    IFEQ 'D'
     C                     SETON                     5799
     C                     MOVE ER,28     MSG
     C                     GOTO STEP03
     C                     END
      *
     C                     Z-ADDH2TANK    G9TNK3
     C                     Z-ADDH2SAIZ    G9SIZ3
     C                     MOVE H2MCOD    G9MEI3
     C           G9TUSZ    SUB  1         WSZ
     C           G9SIZ3    IFLT WSZ
     C                     SETON                     9957
     C                     MOVE ER,71     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9SYO3    IFEQ 0
     C                     SETON                     9958
     C                     MOVE ER,29     MSG
     C                     GOTO STEP03
     C                     END
     C                     ELSE
      *
     C           G9SYO3    IFNE 0
     C                     SETON                     9958
     C                     MOVE ER,30     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C                     Z-ADD0         G9SIZ4
     C                     MOVE *BLANK    G9MEI4
     C                     Z-ADD0         G9TNK4
      *
     C           G9KHN4    IFNE *BLANK
     C                     MOVE G9KN41    KKHN1
     C                     MOVE G9KN42    KKHN2
     C                     MOVE G9KN43    KKHN3
     C           KOKEY     CHAINGBFPL411             99
     C           *IN99     IFEQ '1'
     C                     SETON                     59
     C                     MOVE ER,31     MSG
     C                     GOTO STEP03
     C                     ELSE
     C           H2SKJY    IFEQ 'D'
     C                     SETON                     5999
     C                     MOVE ER,31     MSG
     C                     GOTO STEP03
     C                     END
      *
     C                     Z-ADDH2TANK    G9TNK4
     C                     Z-ADDH2SAIZ    G9SIZ4
     C                     MOVE H2MCOD    G9MEI4
     C           G9TUSZ    SUB  1         WSZ
     C           G9SIZ4    IFLT WSZ
     C                     SETON                     9959
     C                     MOVE ER,71     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9SYO4    IFEQ 0
     C                     SETON                     9960
     C                     MOVE ER,32     MSG
     C                     GOTO STEP03
     C                     END
     C                     ELSE
      *
     C           G9SYO4    IFNE 0
     C                     SETON                     9960
     C                     MOVE ER,33     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C                     Z-ADD0         G9SIZ5
     C                     MOVE *BLANK    G9MEI5
     C                     Z-ADD0         G9TNK5
      *
     C           G9KHN5    IFNE *BLANK
     C                     MOVE G9KN51    KKHN1
     C                     MOVE G9KN52    KKHN2
     C                     MOVE G9KN53    KKHN3
     C           KOKEY     CHAINGBFPL411             99
     C           *IN99     IFEQ '1'
     C                     SETON                     61
     C                     MOVE ER,34     MSG
     C                     GOTO STEP03
     C                     ELSE
     C           H2SKJY    IFEQ 'D'
     C                     SETON                     6199
     C                     MOVE ER,34     MSG
     C                     GOTO STEP03
     C                     END
      *
     C                     Z-ADDH2TANK    G9TNK5
     C                     Z-ADDH2SAIZ    G9SIZ5
     C                     MOVE H2MCOD    G9MEI5
     C           G9TUSZ    SUB  1         WSZ
     C           G9SIZ5    IFLT WSZ
     C                     SETON                     9961
     C                     MOVE ER,71     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9SYO5    IFEQ 0
     C                     SETON                     9962
     C                     MOVE ER,35     MSG
     C                     GOTO STEP03
     C                     END
     C                     ELSE
      *
     C           G9SYO5    IFNE 0
     C                     SETON                     9962
     C                     MOVE ER,36     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C******************************************************
     C* M-NO               ﾍｭcx]ﾆｭﾒ < fﾞbkｬcfﾃcﾍ > kｩlh    *
     C******************************************************
     C           MEKEY     KLIST
     C                     KFLD           UTOKU
     C                     KFLD           CTKOJ
     C                     KFLD           G9SME1
     C                     KFLD           G9SME2
     C                     KFLD           G9SME3
     C                     KFLD           G9SZKB
     C                     MOVE '*'       CTKOJ   1
      *
     C           G9SME1    IFEQ *BLANK
     C                     SETON                     9963
     C                     MOVE ER,37     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9SME2    IFEQ *BLANK
     C                     SETON                     9964
     C                     MOVE ER,38     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9SME3    IFNE '*'
     C                     SETON                     9965
     C                     MOVE ER,39     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9SME1    IFNE '****'
     C           G9SZKB    IFNE 1
     C           G9SZKB    IFNE 2
     C                     SETON                     9966
     C                     MOVE ER,40     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C                     Z-ADD0         G9GGEN
     C                     MOVE *BLANK    G9GTNI
      *
     C           MEKEY     CHAINGBFPL211             99
     C           *IN99     IFEQ '1'
     C                     SETON                     636465
     C                     SETON                     66
     C                     MOVE ER,41     MSG
     C                     GOTO STEP03
     C                     ELSE
     C           G7SKJY    IFEQ 'D'
     C                     SETON                     636465
     C                     SETON                     9966
     C                     MOVE ER,41     MSG
     C                     GOTO STEP03
     C                     END
     C                     Z-ADDG7HTNK    G9GGEN
     C                     MOVE G7HTNI    G9GTNI
     C                     END
     C                     ELSE
      *
     C                     Z-ADD0         G9SZKB
     C                     Z-ADD0         G9GGEN
     C                     MOVE *BLANK    G9GTNI
     C                     END
      *
     C           G9TKBN    IFEQ 'B'
     C           G9SME1    IFNE '****'
     C                     SETON                     9963
     C                     MOVE ER,78     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9TGEN    IFNE 0
     C           G9TCOD    IFEQ *BLANK
     C                     SETON                     9967
     C                     MOVE ER,42     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9TGEN    IFEQ 0
     C           G9TCOD    IFNE *BLANK
     C                     SETON                     9968
     C                     MOVE ER,43     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9TGEN    IFEQ 0
     C           G9TANI    IFNE *BLANK
     C                     SETON                     9969
     C                     MOVE ER,44     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9TGEN    IFNE 0
     C           G9TANI    IFEQ *BLANK
     C                     SETON                     9969
     C                     MOVE ER,45     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9TGEN    IFNE 0
     C           G9TANI    IFNE 'K'
     C           G9TANI    IFNE 'C'
     C                     SETON                     9969
     C                     MOVE ER,46     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C                     END
      *
     C******************************************************
     C* M-NO               ﾃcmb fﾃciﾞ]f ﾉ kdlh             *
     C******************************************************
     C                     Z-ADD1         A       20
     C                     Z-ADD69        B       20
     C           1         DO   10        A
     C           KO,A      IFEQ *BLANK
     C           TN,A      IFNE 0
     C                     MOVE ER,47     MSG
     C                     MOVE '1'       *IN99
     C           B         ADD  A         C       20
     C                     MOVE '1'       *IN,C
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           KO,A      IFNE *BLANK
     C           TN,A      IFEQ 0
     C                     MOVE ER,48     MSG
     C                     MOVE '1'       *IN99
     C           B         ADD  A         C       20
     C                     MOVE '1'       *IN,C
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           KO,A      IFNE *BLANK
     C           KO,A      CHAINFCETL031             99
     C           *IN99     IFEQ '1'
     C                     MOVE ER,49     MSG
     C                     MOVE '1'       *IN99
     C           B         ADD  A         C       20
     C                     MOVE '1'       *IN,C
     C                     GOTO STEP03
     C                     ELSE
     C           A6GSKD    IFEQ 'D'
     C                     MOVE '1'       *IN99
     C           B         ADD  A         C       20
     C                     MOVE '1'       *IN,C
     C                     MOVE ER,49     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C                     END
     C                     END
     C                     XFOOTTN        G9KAKH
      *
     C******************************************************
     C* M-NO               ﾌ]ﾌﾞbﾍ eﾑﾍﾞ blﾌﾟ]f]ﾒﾍ kdlh      *
     C******************************************************
     C                     SETOF                     05
     C           UTOKU     CHAINGBFPP601             05
     C*          UTOKU     LOKUPTB1                      05
     C           *IN05     IFEQ '0'
     C           GASKJY    IFEQ 'D'
     C           GASKHZ    ANDLE*DATE
     C                     SETON                     05
     C                     ELSE
     C           G9KANR    IFEQ 0
     C                     SETON                     9980
     C                     MOVE ER,50     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           UTOKU     IFEQ 3166
     C           PTKOJ     ANDEQ'8'
     C                     ELSE
      *
     C           G9REKR    IFEQ 0
     C                     SETON                     9981
     C                     MOVE ER,51     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C                     END
     C                     ELSE
      *
     C           UTOKU     IFNE 5512
     C           G9KANR    IFNE 0
     C******               SETON                     9980
     C******               MOVE ER,69     MSG
     C*****                GOTO STEP03
     C                     END
      *
     C           G9REKR    IFNE 0
     C                     SETON                     9981
     C                     MOVE ER,70     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C                     END
      *
     C           G9KATA    IFGT 999
     C                     SETON                     9982
     C                     MOVE ER,60     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9KATA    IFGT 0
     C           G9KTHZ    IFEQ 0
     C                     SETON                     9996
     C                     MOVE ER,76     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9KATA    IFEQ 0
     C           G9KTHZ    IFGT 0
     C                     SETON                     9982
     C                     MOVE ER,77     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9KTHZ    IFGT 0
     C           G9KTYY    IFGT 9999
     C                     SETON                     9996
     C                     MOVE ER,75     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9KTYY    IFLT 1985
     C                     SETON                     9996
     C                     MOVE ER,75     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9KTMM    IFLT 1
     C                     SETON                     9996
     C                     MOVE ER,75     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9KTMM    IFGT 12
     C                     SETON                     9996
     C                     MOVE ER,75     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9KTDD    IFLT 1
     C                     SETON                     9996
     C                     MOVE ER,75     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9KTDD    IFGT 31
     C                     SETON                     9996
     C                     MOVE ER,75     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C******************************************************
     C* M-NO               ﾜbzﾒmｧ- ﾉ kdlh                  *
     C******************************************************
     C           G9RKB1    IFNE *BLANK
     C           G9RRI1    IFEQ 0
     C           G9RKI1    IFEQ 0
     C                     SETON                     9983
     C                     MOVE ER,52     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C                     ELSE
      *
     C           G9RRI1    IFNE 0
     C                     SETON                     9984
     C                     MOVE ER,53     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9RKI1    IFNE 0
     C                     SETON                     9985
     C                     MOVE ER,54     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9RRI1    IFNE 0
     C           G9RKI1    IFNE 0
     C                     SETON                     998485
     C                     MOVE ER,55     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9RKB2    IFNE *BLANK
     C           G9RRI2    IFEQ 0
     C           G9RKI2    IFEQ 0
     C                     SETON                     9986
     C                     MOVE ER,56     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
     C                     ELSE
      *
     C           G9RRI2    IFNE 0
     C                     SETON                     9987
     C                     MOVE ER,57     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9RKI2    IFNE 0
     C                     SETON                     9988
     C                     MOVE ER,58     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9RRI2    IFNE 0
     C           G9RKI2    IFNE 0
     C                     SETON                     998788
     C                     MOVE ER,59     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C******************************************************
     C* M-NO               VA.VE ﾉ kdlh                    *
     C******************************************************
     C           G9KATA    IFGT 999
     C                     SETON                     9982
     C                     MOVE ER,60     MSG
     C                     GOTO STEP03
     C                     END
      *
     C*****>>              Z-ADDDPV1YY    G9V1YY
     C*****>>              Z-ADDDPV1MM    G9V1MM
     C*****>>              Z-ADDDPV1DD    G9V1DD
     C*****>>              Z-ADDDPV2YY    G9V2YY
     C*****>>              Z-ADDDPV2MM    G9V2MM
     C*****>>              Z-ADDDPV2DD    G9V2DD
      *
     C           G9VHZ1    IFEQ 0
     C           G9V1KN    IFNE 0
     C                     SETON                     9989
     C                     MOVE ER,61     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9VHZ1    IFNE 0
     C           G9V1KN    IFEQ 0
     C                     SETON                     9990
     C                     MOVE ER,62     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9VHZ1    IFNE 0
     C           G9V1YY    IFGT 9999
     C                     SETON                     9989
     C                     MOVE ER,63     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9V1YY    IFLT 1980
     C                     SETON                     9989
     C                     MOVE ER,63     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9V1MM    IFGT 12
     C                     SETON                     9989
     C                     MOVE ER,63     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9V1MM    IFLT 1
     C                     SETON                     9989
     C                     MOVE ER,63     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9V1DD    IFGT 31
     C                     SETON                     9989
     C                     MOVE ER,63     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9V1DD    IFLT 1
     C                     SETON                     9989
     C                     MOVE ER,63     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9VHZ2    IFEQ 0
     C           G9V2KN    IFNE 0
     C                     SETON                     9991
     C                     MOVE ER,64     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9VHZ2    IFNE 0
     C           G9V2KN    IFEQ 0
     C                     SETON                     9992
     C                     MOVE ER,65     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9VHZ2    IFNE 0
     C           G9V2YY    IFGT 9999
     C                     SETON                     9991
     C                     MOVE ER,66     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9V2YY    IFLT 1980
     C                     SETON                     9991
     C                     MOVE ER,66     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9V2MM    IFGT 12
     C                     SETON                     9991
     C                     MOVE ER,66     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9V2MM    IFLT 1
     C                     SETON                     9991
     C                     MOVE ER,66     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9V2DD    IFGT 31
     C                     SETON                     9991
     C                     MOVE ER,66     MSG
     C                     GOTO STEP03
     C                     END
      *
     C           G9V2DD    IFLT 1
     C                     SETON                     9991
     C                     MOVE ER,66     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C*          G9SRYO    IFEQ 0
     C*                    SETON                     9993
     C*                    MOVE ER,67     MSG
     C*                    GOTO STEP03
     C*                    END
      *
     C           G9SHN2    IFNE *BLANK
     C           G9SHN1    IFEQ *BLANK
     C                     SETON                     9994
     C                     MOVE ER,72     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9SHN3    IFNE *BLANK
     C           G9SHN2    IFEQ *BLANK
     C                     SETON                     9994
     C                     MOVE ER,72     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9SHN3    IFNE *BLANK
     C           G9SHN1    IFEQ *BLANK
     C                     SETON                     9994
     C                     MOVE ER,72     MSG
     C                     GOTO STEP03
     C                     END
     C                     END
      *
     C           G9SHIN    IFEQ *BLANK
     C                     MOVELG9MHIN    G9SHIN
     C                     END
      *
     C******************************************************
     C* M-NO               nhbﾅgsﾞl j]fibﾅ]tcﾆgs ﾎﾞ]gﾞ     *
     C******************************************************
     C           UTOKU     CABEQ2496      STEP04
     C           UTOKU     CABEQ7935      STEP04
     C                     SETOF                     05
     C           UTOKU     CHAINGBFPP611             05
     C*          UTOKU     LOKUPTB2                      05
     C           *IN05     IFEQ '0'
     C           GBSKJY    IFEQ 'D'
     C           GBSKHZ    ANDLE*DATE
     C                     SETON                     05
     C                     ELSE
     C                     GOTO STEP05
     C                     END
     C                     END
     C                     SETON                     99
     C                     MOVE ER,68     MSG
     C                     GOTO STEP03
      *
     C******************************************************
     C* M-NO               2496.7935           ﾉ vlyﾒ      *
     C******************************************************
     C           STEP04    TAG
      *
     C**************** f]ﾈbﾍ] ﾉ ibﾅ] B=f]ﾈb+xlg C=f]ﾈbﾍ]ﾉv *
     C           G9TKBN    IFNE 'A'
     C                     Z-ADD0         G9ZKGT
     C                     Z-ADD0         G9SZIH
     C                     Z-ADD0         G9KAIS
     C                     Z-ADD0         G9SKRH
     C                     Z-ADD0         G9ZAIH
     C                     Z-ADD0         G9KOUH
      *
     C           G9TKBN    IFEQ 'B'
     C                     Z-ADD0         G9GGEN
     C                     MOVE *BLANK    G9GTNI
     C                     MOVE *BLANK    G9TCOD
     C                     Z-ADD0         G9TGEN
     C                     MOVE *BLANK    G9TANI
     C                     MOVE *BLANK    G9UMEK
     C                     END
      *
     C                     Z-ADD0         G9GITU
     C                     MOVE *BLANK    KO
     C                     Z-ADD0         TN
     C                     Z-ADD0         G9KAKH
     C                     Z-ADD0         G9SGEN
     C                     Z-ADD0         G9KNRH
     C                     Z-ADD0         G9RIEK
     C                     Z-ADD0         G9RKN1
     C                     Z-ADD0         G9RKN2
     C                     Z-ADD0         G9STAN
     C                     Z-ADD0         G9HTAN
     C                     Z-ADD0         G9MTAN
     C                     Z-ADD0         DSTANK
      *
     C           *IN05     IFEQ '1'
     C                     Z-ADD0         G9KANR
     C                     Z-ADD0         G9REKR
     C                     END
     C                     GOTO STEP10
     C                     END
      *
     C**************** ﾅﾞbﾒｭcﾍ *****************************
     C           H3KTNK    DIV  1000      WA      98H
     C           G9SZIJ    MULT WA        G9SZIH    H
     C           G9SZIJ    SUB  G9SZAJ    WB      74
     C           H3KRIT    IFNE 0
     C           H3KRIT    DIV  100       WZ1     54
     C           WB        MULT WZ1       WZ2     83H
     C           H3STAN    DIV  1000      WA
     C           WZ2       MULT WA        G9SKRH    H
     C                     ELSE
     C                     Z-ADD0         G9SKRH
     C                     END
     C           G9SZIH    SUB  G9SKRH    G9ZAIH
      *
     C**************** ﾃcﾈbﾍ] ******************************
     C           G9TNK1    MULT G9SYO1    WC      74
     C           G9TNK2    MULT G9SYO2    WD      74
     C           G9TNK3    MULT G9SYO3    WE      74
     C           G9TNK4    MULT G9SYO4    WF      74
     C           G9TNK5    MULT G9SYO5    WG      74
     C           WC        ADD  WD        G9KOUH
     C           WE        ADD  G9KOUH    G9KOUH
     C           WF        ADD  G9KOUH    G9KOUH
     C           WG        ADD  G9KOUH    G9KOUH
      *
     C**************** xlg  fﾞbkﾏcfﾃcﾍ *********************
     C           STEP10    TAG
     C           G9TKBN    CABEQ'B'       STEP11
     C                     Z-ADD0         G9MMTN
     C                     Z-ADD0         G9MTTN
     C           G9GTNI    IFEQ 'C'
     C                     Z-ADDG9GGEN    G9MMTN
     C                     ELSE
     C           G9GGEN    DIV  1000      WA
     C           WA        MULT G9KANJ    G9MMTN    H
     C                     END
     C           G9TANI    IFEQ 'C'
     C                     Z-ADDG9TGEN    G9MTTN
     C                     ELSE
     C           G9TGEN    DIV  1000      WA
     C           WA        MULT G9KANJ    G9MTTN    H
     C                     END
     C           G9MMTN    ADD  G9MTTN    G9GITU    H
     C           G9TKBN    CABEQ'C'       STEP11
      *
     C**************** fﾃcﾍ ********************************
     C                     XFOOTTN        G9KAKH
      *
     C**************** ﾈbﾞciﾞ]f ***************************
     C           G9ZAIH    ADD  G9KOUH    WG
     C           G9GITU    ADD  WG        WG
     C           G9KAKH    ADD  WG        G9SGEN
      *
     C**************** ﾌ]ﾌﾞbﾍ ******************************
     C           STEP11    TAG
     C           G9TKBN    IFNE 'A'
     C           G9KTNK    ADD  G9GITU    G9SGEN
     C           G9KANR    DIV  100       WH      63
     C           WG        MULT WH        G9KNRH    H
     C           G9SGEN    ADD  G9KNRH    G9STAN
     C           G9REKR    DIV  100       WH
     C           WH        MULT G9KAKH    G9RIEK    H
     C                     ELSE
     C           UTOKU     IFEQ 4812
     C           G9KANR    DIV  100       WH
     C           WH        MULT G9ZAIH    G9KNRH    H
     C                     ELSE
     C           G9KANR    DIV  100       WH      63
     C           WG        MULT WH        G9KNRH    H
     C                     END
     C           G9SGEN    ADD  G9KNRH    G9STAN
      *
      *
     C**************** ﾒdg + fjﾍ ***************************
     C           UTOKU     IFEQ 4812
     C           G9REKR    DIV  100       WH
     C           G9GITU    ADD  G9KAKH    WKKO
     C           WH        MULT WKKO      G9RIEK    H
     C                     ELSE
     C           G9REKR    DIV  100       WH
     C           G9KNRH    ADD  G9KAKH    WKKO    82
     C           WH        MULT WKKO      G9RIEK    H
     C                     END
     C                     END
     C           G9RIEK    ADD  G9STAN    G9HTAN
     C           G9HTAN    ADD  G9KATA    G9HTAN
      *
     C**************** ﾜbzﾒmb ******************************
     C                     Z-ADD0         G9RKN1
     C                     Z-ADD0         G9RKN2
     C           G9RKB1    IFNE *BLANK
     C           G9RRI1    IFNE 0
     C           G9RRI1    DIV  100       WW      43
     C           1         SUB  WW        WI      43
     C           G9STAN    DIV  WI        WR      74H
     C           WR        SUB  G9STAN    G9RKN1
     C                     ELSE
     C                     Z-ADDG9RKI1    G9RKN1
     C                     END
     C                     END
     C           G9RKB2    IFNE *BLANK
     C           G9RRI2    IFNE 0
     C           G9RRI2    DIV  100       WW      43
     C           1         SUB  WW        WI      43
     C           G9STAN    DIV  WI        WR      74H
     C           WR        SUB  G9STAN    G9RKN2  74
     C                     ELSE
     C                     Z-ADDG9RKI2    G9RKN2
     C                     END
     C                     END
     C           G9RKN1    ADD  G9RKN2    G9TKYO
     C           G9HTAN    ADD  G9TKYO    G9HTAN
     C           G9HTAN    ADD  G9CHOU    G9HTAN
      *
     C**************** VA.VE f]iﾞ] *************************
     C                     Z-ADD0         WV1
     C                     Z-ADD0         WV2
      *
     C           G9VHZ1    IFNE 0
      *
     C           G9VHZ1    IFGE 19930101
     C           G9TOKU    IFEQ 3174
     C           G9TOKU    OREQ 0353
     C           G9VHZ1    ADD  20000     WHZ1    80
     C                     ELSE
     C           G9VHZ1    ADD  10000     WHZ1
     C                     END
     C                     ELSE
     C           G9VHZ1    ADD  10000     WHZ1
     C                     END
      *
     C           WHZ1      SUB  1         WHZ1
     C           WHZ1      IFGE STHIZK
     C                     Z-ADDG9V1KN    WV1     74
     C                     END
     C                     END
      *
     C           G9VHZ2    IFNE 0
      *
     C           G9VHZ2    IFGE 19930101
     C           G9TOKU    IFEQ 3174
     C           G9TOKU    OREQ 0353
     C           G9VHZ2    ADD  20000     WHZ2    80
     C                     ELSE
     C           G9VHZ2    ADD  10000     WHZ2
     C                     END
     C                     ELSE
     C           G9VHZ2    ADD  10000     WHZ2
     C                     END
      *
     C           WHZ2      SUB  1         WHZ2
     C           WHZ2      IFGE STHIZK
     C                     Z-ADDG9V2KN    WV2     74
     C                     END
     C                     END
      *
     C           WV1       ADD  WV2       G9VAVE
     C           PTKBN     IFEQ 'O'
     C           G9HTAN    ADD  G9VAVE    G9QTAN
     C                     Z-ADDG9QTAN    DSTANK
     C                     ELSE
     C           G9HTAN    ADD  G9VAVE    G9MTAN
     C                     Z-ADDG9MTAN    DSTANK
     C                     END
      *
     C                     GOTO STEP06
      *
     C******************************************************
     C* M-NO               3174.0353.3158.1724.1287        *
     C*                    0078.3646.8451.1376 4197 ﾉ vlyﾒ *
     C*                    7161.1031                       *
     C******************************************************
     C           STEP05    TAG
      *
     C**************** f]ﾈbﾍ] ﾉ ibﾅ] B=f]ﾈb+xlg C=f]ﾈbﾍ]ﾉv *
     C           G9TKBN    IFNE 'A'
     C                     Z-ADD0         G9ZKGT
     C                     Z-ADD0         G9SZIH
     C                     Z-ADD0         G9KAIS
     C                     Z-ADD0         G9SKRH
     C                     Z-ADD0         G9ZAIH
     C                     Z-ADD0         G9KOUH
     C           G9TKBN    IFEQ 'B'
     C                     Z-ADD0         G9GGEN
     C                     MOVE *BLANK    G9GTNI
     C                     MOVE *BLANK    G9TCOD
     C                     Z-ADD0         G9TGEN
     C                     MOVE *BLANK    G9TANI
     C                     MOVE *BLANK    G9UMEK
     C                     END
     C                     Z-ADD0         G9GITU
     C                     MOVE *BLANK    KO
     C                     Z-ADD0         TN
     C                     Z-ADD0         G9KAKH
     C                     Z-ADD0         G9SGEN
     C                     Z-ADD0         G9KNRH
     C                     Z-ADD0         G9RIEK
     C                     Z-ADD0         G9STAN
     C                     Z-ADD0         G9HTAN
     C                     Z-ADD0         G9RKN1
     C                     Z-ADD0         G9RKN2
     C                     Z-ADD0         G9MTAN
     C                     Z-ADD0         DSTANK
      *
     C           *IN05     IFEQ '1'
     C                     Z-ADD0         G9KANR
     C                     Z-ADD0         G9REKR
     C                     END
     C                     GOTO STEP07
     C                     END
      *
     C**************** ﾅﾞbﾒｭcﾍ *****************************
     C           H3KTNK    DIV  1000      WA      98H
     C           G9SZIJ    MULT WA        G9SZIH    H
     C           G9SZIJ    SUB  G9SZAJ    WB      74
     C           H3KRIT    IFNE 0
     C           H3KRIT    DIV  100       WZ1     54
     C           WB        MULT WZ1       WZ2     83H
     C           H3STAN    DIV  1000      WA
     C           WZ2       MULT WA        G9SKRH    H
     C                     ELSE
     C                     Z-ADD0         G9SKRH
     C                     END
     C           G9SZIH    SUB  G9SKRH    G9ZAIH
      *
     C**************** ﾃcﾈbﾍ] ******************************
     C           G9TNK1    MULT G9SYO1    WC      74
     C           G9TNK2    MULT G9SYO2    WD      74
     C           G9TNK3    MULT G9SYO3    WE      74
     C           G9TNK4    MULT G9SYO4    WF      74
     C           G9TNK5    MULT G9SYO5    WG      74
     C           WC        ADD  WD        G9KOUH
     C           WE        ADD  G9KOUH    G9KOUH
     C           WF        ADD  G9KOUH    G9KOUH
     C           WG        ADD  G9KOUH    G9KOUH
      *
     C**************** xlg  fﾞbkﾏcfﾃcﾍ *********************
     C           STEP07    TAG
     C           G9TKBN    CABEQ'B'       STEP08
     C                     Z-ADD0         G9MMTN
     C                     Z-ADD0         G9MTTN
     C           G9GTNI    IFEQ 'C'
     C                     Z-ADDG9GGEN    G9MMTN
     C                     ELSE
     C           G9GGEN    DIV  1000      WA
     C           WA        MULT G9KANJ    G9MMTN    H
     C                     END
     C           G9TANI    IFEQ 'C'
     C                     Z-ADDG9TGEN    G9MTTN
     C                     ELSE
     C           G9TGEN    DIV  1000      WA
     C           WA        MULT G9KANJ    G9MTTN    H
     C                     END
     C           G9MMTN    ADD  G9MTTN    G9GITU    H
     C           G9TKBN    CABEQ'C'       STEP08
      *
     C**************** fﾃcﾍ ********************************
     C                     XFOOTTN        G9KAKH
      *
     C**************** ﾈbﾞciﾞ]f ***************************
     C           G9ZAIH    ADD  G9KOUH    WG
     C           G9GITU    ADD  WG        WG
     C           G9KAKH    ADD  WG        G9SGEN
      *
     C**************** ﾌ]ﾌﾞbﾍ ******************************
     C           STEP08    TAG
     C           G9TKBN    IFNE 'A'
     C           G9KTNK    ADD  G9GITU    G9SGEN
     C                     END
     C           UTOKU     IFEQ 4812
     C           G9KANR    DIV  100       WH
     C           WH        MULT G9ZAIH    G9KNRH    H
     C                     ELSE
     C           G9KANR    DIV  100       WH      63
     C           G9SGEN    MULT WH        G9KNRH    H
     C                     END
     C           G9SGEN    ADD  G9KNRH    G9STAN
      *
      *
     C**************** ﾒdg + fjﾍ ***************************
     C           UTOKU     IFEQ 4812
     C           G9REKR    DIV  100       WH
     C           G9GITU    ADD  G9KAKH    WKKO
     C           WH        MULT WKKO      G9RIEK    H
     C                     ELSE
     C           G9REKR    DIV  100       WH
     C           WH        MULT G9STAN    G9RIEK    H
     C                     END
     C           G9RIEK    ADD  G9STAN    G9HTAN
     C           G9HTAN    ADD  G9KATA    G9HTAN
      *
     C**************** ﾜbzﾒmb ******************************
     C                     Z-ADD0         G9RKN1
     C                     Z-ADD0         G9RKN2
     C           G9RKB1    IFNE *BLANK
     C           G9RRI1    IFNE 0
     C           G9RRI1    DIV  100       WW      43
     C           1         SUB  WW        WI      43
     C           G9STAN    DIV  WI        WR      74H
     C           WR        SUB  G9STAN    G9RKN1
     C                     ELSE
     C                     Z-ADDG9RKI1    G9RKN1
     C                     END
     C                     END
     C           G9RKB2    IFNE *BLANK
     C           G9RRI2    IFNE 0
     C           G9RRI2    DIV  100       WW      43
     C           1         SUB  WW        WI      43
     C           G9STAN    DIV  WI        WR      74H
     C           WR        SUB  G9STAN    G9RKN2  74
     C                     ELSE
     C                     Z-ADDG9RKI2    G9RKN2
     C                     END
     C                     END
     C           G9RKN1    ADD  G9RKN2    G9TKYO  74
     C           G9HTAN    ADD  G9TKYO    G9HTAN
     C           G9HTAN    ADD  G9CHOU    G9HTAN
      *
     C**************** VA.VE f]iﾞ] *************************
     C                     Z-ADD0         WV1
     C                     Z-ADD0         WV2
      *
     C           G9VHZ1    IFNE 0
      *
     C           G9VHZ1    IFGE 19930101
     C           G9TOKU    IFEQ 3174
     C           G9TOKU    OREQ 0353
     C           G9VHZ1    ADD  20000     WHZ1
     C                     ELSE
     C           G9VHZ1    ADD  10000     WHZ1
     C                     END
     C                     ELSE
     C           G9VHZ1    ADD  10000     WHZ1
     C                     END
      *
     C           WHZ1      SUB  1         WHZ1
     C           WHZ1      IFGE STHIZK
     C                     Z-ADDG9V1KN    WV1     74
     C                     END
     C                     END
      *
     C           G9VHZ2    IFNE 0
      *
     C           G9VHZ2    IFGE 19930101
     C           G9TOKU    IFEQ 3174
     C           G9TOKU    OREQ 0353
     C           G9VHZ2    ADD  20000     WHZ2
     C                     ELSE
     C           G9VHZ2    ADD  10000     WHZ2
     C                     END
     C                     ELSE
     C           G9VHZ2    ADD  10000     WHZ2
     C                     END
      *
     C           WHZ2      SUB  1         WHZ2
     C           WHZ2      IFGE STHIZK
     C                     Z-ADDG9V2KN    WV2     74
     C                     END
     C                     END
     C           WV1       ADD  WV2       G9VAVE
     C           PTKBN     IFEQ 'O'
     C           G9HTAN    ADD  G9VAVE    G9QTAN
     C                     Z-ADDG9QTAN    DSTANK
     C                     ELSE
     C           G9HTAN    ADD  G9VAVE    G9MTAN
     C                     Z-ADDG9MTAN    DSTANK
     C                     END
     C           STEP06    TAG
     C******************************************************
     C* M-NO               mﾞ-j ncﾜh OK  CMD-5 ﾉ ﾆﾑﾒ       *
     C******************************************************
     C           *INKE     CABEQ'0'       STEP03
      *
     C                     MOVE *DATE     UHIZK
     C                     MOVE USER      G9KOME
     C                     MOVE *DATE     G9KOHZ
     C                     MOVE KTIME     G9KOTI
      *
     C                     MOVE *DATE     G9KEHZ
     C                     Z-ADDKTIME     G9KETI
     C           PTKBN     IFEQ 'O'
     C*                    Z-ADDSTHIZK    G9QKHZ
     C*                    Z-ADDENHIZK    G9QSHZ
     C                     ELSE
     C                     Z-ADDSTHIZK    G9KAHZ
     C                     Z-ADDENHIZK    G9SUHZ
     C                     END
     C           MENT      IFEQ '0'
     C                     MOVE 'D'       G9SKJY
     C*                    Z-ADD*DATE     G9SKHZ
     C                     Z-ADD*YEAR     G9SKYY
     C                     Z-ADD*MONTH    G9SKMM
     C                     Z-ADD*DAY      G9SKDD
     C                     ELSE
     C                     MOVE *BLANK    G9SKJY
     C                     Z-ADD0         G9SKHZ
     C                     END
     C           MENT      IFEQ '2'
     C                     MOVE UTOKU     G9TOKU
     C                     MOVE PTKOJ     G9TKOJ
     C                     END
      *
     C           *IN04     IFEQ '0'
     C                     UPDATGBFPL511
     C                     ELSE
     C                     WRITEGBFPL511
     C                     END
      *
     C                     MOVE *BLANK    G9MHIN
     C                     MOVE *BLANK    MENT
     C                     MOVE *BLANK    XTOKU
     C                     MOVE *BLANK    XNKOJ
     C                     GOTO STEP01
      *
     C           END       TAG
     C                     SETON                     LR
**
E-01  UPDATE INST IS WRONG<0= CANCEL . 1= CHANGE. 2= ADD>
E-02 ESTIMATE PART NO IS NOT INPUT
E-03 CANCEL WAS APPOINTED, BUT A FILE IS DELETEDE ALREADY
E-04 CANCEL WAS APPOINTED, BUT A FILE DOES NOT EXIST
E-05 CHANGE WAS APPOINTED, BUT IT IS DELETED A FILE ALREADY
E-06 CHANGE WAS APPOINTED, BUT A FILE DOES NOT EXIST
E-07 ADD WAS APPOINTED, BUT A FILE IS REGISTERED ALREADY
E-08 PART NAME CODE IS NOT INPUT
E-09 PART NAME CODE IS NOT INPUT IN NAME M/F
E-10 PART SIZE IS NOT INPUT
E-11 NOMINAL  LENGTH IS NOT INPUT
E-12 QUENCHING PROCESS CODE IS NOT INPUT < OQ COQ *** >
E-13 CAL INST IS A=GENERAL, B=CPLT PART, C=CPLT PART+PLATING
E-14 THE CPLT PART UNP IS NOT INPUT THAT CAL INST IS NOT A
E-15 THOUGH CALCULATION INST IS A, CPLT PART UNP IS INPUT
E-16 MATERIAL CODE IS NOT INPUT
E-17 NOT REGISTERED IN MAT PRIM_C M/F THAT MAT CD YOU INPUT            STERED
E-18 MATERIAL UNIT WEIGHT IS NOT INPUT
E-19 MATERIAL UNIT WEIGHT IS NOT INPUT
E-20 FINISHED UNIT WEIGHT IS NOT INPUT
E-21 MATERIAL UNIT WEIGHT IS BIGGER THAN MATERIAL UNW
E-22 COMPONENTS P/N 1 ISN'T INPUT IN COMPONENTS PRIM_C M/F
E-23 COMPONENTS P/N 1 WAS INPUT, BUT USING CNT1 ISN'T INPUT
E-24 COMPONENTS P/N 1 ISN'T INPUT, BUT USING CNT1 IS INPUT
E-25 COMPT P/N 2 ISN'T INPUT IN COMPT PRIM_C M/F
E-26 COMPONENTS P/N 2 WAS INPUT, BUT USING CNT2 ISN'T INPUT
E-27 COMPONENTS P/N 2 ISN'T INPUT, BUT USING CNT2 IS INPUT
E-28 COMPONENTS P/N 3 ISN'T INPUT IN COMPONENTS PRIM_C M/F
E-29 COMPONENTS P/N 3 WAS INPUT, BUT USING CNT3 ISN'T INPUT
E-30 COMPONENTS P/N 3 ISN'T INPUT, USING CNT3 IS INPUT
E-31 COMPONENTS P/N 4 ISN'T INPUT IN COMPONENTS PRIM_C M/F
E-32 COMPONENTS P/N 4 WAS INPUT, BUT USING CNT4 ISN'T INPUT
E-33 COMPONENTS P/N 4 ISN'T INPUT, USING CNT4 IS INPUT
E-34 COMPONENTS P/N 5 ISN'T INPUT IN COMPONENTS PRIM_C M/F
E-35 COMPONENTS P/N 5 WAS INPUT, BUT USING CNT5 ISN'T INPUT
E-36 COMPONENTS P/N 5 ISN'T INPUT, USING CNT5 IS INPUT
E-37 PLATING KIND OF SURFACE TREATMENT IS NOT INPUT
E-38 PLATING THICKNESS OF SURFACE TREATMENT IS NOT INPUT
E-39 SPECIAL INSTRUCTION OF SURFACE TREATMENT IS NOT INPUT
E-40 SIZE INSTRUCTION OF SURFACE TREATMENT IS NOT  1 OR 2
E-41 SURFACE TREATMENT PRIM_C M/F FOR S_TREAT ISN'T INPUT
E-42 SP INST ISN'T INPUT THOUGH SP S_TREAT PRIM_C IS INPUT
E-43 SP S_TREAT PRIM_C ISN'T INPUT, BUT SP INST IS INPUT
E-44 SP S_TREAT PRIM_C ISN'T INPUT, AND ONLY UNIT IS INPUT
E-45 SP S_TREAT PRIM_C IS INPUT, BUT UNIT ISN'T INPUT
E-46 INPUT SP S_TREAT PRIM_C UNIT K = , C=COUNT
E-47 PROCESS IS NOT INPUT, AND PROC PRIMITIVE COST IS INPUT
E-48 PROCESS IS INPUT, BUT PROC PRIMITIVE COST IS NOT INPUT
E-49 THE INPUT PROCESS CODE  IS NOT REGISTERED IN PROC M/F
E-50 A RATE OF GENERAL MANAGEMENT COSTS IS NOT INPUT
E-51 PROFIT RATIO IS NOT INPUT
E-52 KIND OF LOYALTY-1 IS INPUT, RATE OR AMT IS NOT INPUT
E-53 KIND OF LOYALTY-1 IS NOT INPUT, AND A RATE IS INPUT
E-54 KIND OF LOYALTY-1 IS NOT INPUT, AND AMOUNT IS INPUT
E-55 INPUT  RATE OR AMOUNT OF LOYALTY-1
E-56 KIND OF LOYALTY-2 IS INPUT, RATE OR AMT IS NOT INPUT
E-57 KIND OF LOYALTY-2 IS NOT INPUT, AND A RATE IS INPUT
E-58 KIND OF LOYALTY-2 IS NOT INPUT, AND AMOUNT IS INPUT
E-59 INPUT  RATE OR AMOUNT OF LOYALTY-2
E-60 AMOUNT OF DIE REPAYMENT COSTS IS TOO MUCH
E-61 VA.VE REDUCTION1 IS INPUT, BUT REDUCTION S_DATE1 IS NOT
E-62 REDUCTION S_DATE1 IS INPUT, BUT VA.VE REDUCTION1 IS NOT
E-63 VA.VE REDUCTION START DATE1 IS LOGICAL ERROR
E-64 VA.VE REDUCTION2 IS INPUT, BUT REDUCTION S_DATE1 IS NOT
E-65 REDUCTION S_DATE1 IS INPUT, BUT VA.VE REDUCTION2 IS NOT
E-66 VA. VE REDUCTION START DATE2 IS LOGICAL ERROR
E-67 6 MONTHS DELIVERY PLAN QUANTITY IS NOT INPUT
E-68 AS FOR CUSTOMER APPOINTED, ESTIMATE CAL IS NOT ADMITTED
E-69 NOT CALCULATE RATE OF GENERAL MGT COSTS, NOT INPUT IT
E-70 NOT CALCULATE PROFIT RATIO, NOT INPUT IT
E-71 SIZE OF COMPONENTS IS SMALL FOR SIZE OF ESTIMATE PART
E-72 THE INPUT CONTENTS OF INT_CO P/N IS WRONG LOGICALLY
E-73 PROC CODE OF QUENCHING PROC ISN'T IN PROC NAME M/F
E-74 MATERIAL PROVISION CODE IS NOT INPUT
E-75 DIE REPAYMENT DATE INCLUDES LOGICAL ERROR
E-76 DIE REPAYMENT COSTS IS INPUT, BUT REPAYMENT DATE IS NOT
E-77 DIE REPAYMENT DATE IS INPUT, BUT REPAYMENT COST IS NOT
E-78 WHEN CALC INST IS B, TURN SURFACE TREATMENT INTO *****
E-79 UPDATE INST-NOT INPUT COPIED CUST EXCEPT ADDTION.
E-80 UPDATE INST-NOT INPUT COPIED FACTORY EXCEPT ADDTION.
E-81 REQUEST UNIT PRICE IS NOT INPUT
E-82 CONTRACT START DATE(MONTH)IS NOT RIGHT.
E-83 CONTRACT START DATE(DAY) IS NOT RIGHT.
E-84 CONTRACT START DATE (YEAR) IS NOT RIGHT
E-85 CONTRACT EXIT DATE(MONTH) IS NOT RIGHT
E-86 CONTRACT EXIT DATE(DAY) IS NOT RIGHT.
E-87 CONTRACT EXIT DATE(YEAR) IS NOT RIGHT
E-88 UNIT PRICE PER PRODUCT IS NOT INPUT
E-89 PRESS VERIFICATION KEY
E-90 PRESS INPUT 1 OR 2 OR 3
E-91  UPDATE INST IS WRONG< 1= CHANGE >
E-92 ASJ INTRAL PARTS NO IS NOT INPUT.
