     H            Y.
     F** GCAR33 **********************************
     F*PUBLICATION OF DIE BUYING ON CREDIT UNIT PRICE UPDATE LIST
     F*          A-IDOTA 1993.05.20              *
     F********************************** GCAR33 **
     FGCAWP30 IP  F     100            DISK
     FFGBPL01 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TAB1    1   4  1   TAB2    6   更新区分
      *
     IGCAWP30 AA
     I                                        1   1 @KSIN
     I                                        2   3 @KAT1
     I                                        4   7 @KAT2
     I                                        8   8 @KAT3
     I                                        9  120@SIRE
     I                                       13  13 @KETI
     I                                       14  14 @RIYU
     I                                       15  15 @SEPN
     I                                       16  220@TANK
     I                                       23  280@KISI
     I                                       29  340@SYUR
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     PARM           KB      1        発行区分
      *初期印刷*
     C           *IN01     IFEQ '0'
      *
     C           KB        IFEQ '1'
     C                     SETON                     15
     C                     END
     C           KB        IFEQ '2'
     C                     SETOF                     15
     C                     END
      *
     C                     TIME           WTIME   60
     C           US        CHAINRGAPL111             30
     C  N30                MOVELJ8NAME    USNM    9
     C                     EXCPTMI
     C                     EXCPTSP
     C                     SETON                     01
     C                     END
      *仕入先名*
     C                     MOVE *BLANK    SINM   16
     C                     SETOF                     30
     C           @SIRE     CHAINFGBPL011             30
     C  N30                MOVELB2SMEI    SINM
      *更新区分名*
     C                     MOVE *BLANK    KSNM    6
     C                     SETOF                     30
     C           @KSIN     LOKUPTAB1      TAB2           30
     C   30                MOVELTAB2      KSNM
      *
     C                     MOVE '-'       HI1     1
     C           @KAT3     IFNE *BLANK
     C                     MOVE '-'       HI2     1
     C                     ELSE
     C                     MOVE *BLANK    HI2
     C                     END
      * OF *
     C           *INOF     IFEQ '1'
     C                     SETON                     40
     C                     SETOF                     OF
     C                     END
     C           @KSIN     IFNE '3'
     C           *IN40     IFEQ '1'
     C                     EXCPTMI
     C                     EXCPTSP
     C                     SETOF                     40
     C                     END
     C                     END
      *明細出力*
     C           @KSIN     IFEQ '0'
     C           @KSIN     OREQ '2'
     C           @KSIN     OREQ '3'
     C                     EXCPTSP
     C                     END
     C                     EXCPTME
      ******************
      *出力レイアウト*
      ******************
     OQPRINT  E   02           MI
     O                                  131 '+-------------------+'
     O        E   03           MI
     O                                  131 '|         |         |'
     O        E   04           MI
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  111 '|'
     O                                  121 '|'
     O                         USNM     130
     O                                  131 '|'
     O        E   05           MI
     O                                   10 'GCAR33-1'
     O                                   22 '***'
     O                                   47 'DIE BUYING ON CREDIT UNI'
     O                                   54 'T PRICE'
     O                 15                66 'UPDATE LIST'
     O                N15                66 'CHANGE LIST'
     O                                   70 '***'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        E   07           MI
     O                                  104 '----'
     O                                  114 'CONTRACT'
     O                                  120 '----'
     O        E  108           MI
     O                                   12 'UPDATE'
     O                                   26 'DIE NO'
     O                                   43 'SUPPLIER'
     O                                   65 'K TYPE'
     O                                   73 'REASON'
     O                                   84 'DESIGN CHG'
     O                                   96 'NEW UNP'
     O                                  109 'START DATE'
     O                                  121 'EXIT DATE'
     O        E  1             ME
     O                         KSNM      12
     O                         @KAT1     21
     O                         HI1       22
     O                         @KAT2     26
     O                         HI2       27
     O                         @KAT3     28
     O                         @SIRE     38
     O                                   40 '-'
     O                         SINM      57
     O                         @KETI     63
     O                         @RIYU     71
     O                         @SEPN     80
     O                         @TANK 1   96
     O                         @KISI    109 '  .  .  '
     O                         @SYUR    121 '  .  .  '
     O        E  1             SP
**  UPDATE INSTRUCTION NAME
0CANCL
1CHG
2ADD
3OLD
