     H            Y.
     F** GCER03 *******************
     F*  PROCESS NAME M/F UPDATE  *
     F*   I-HASADA     97.06.06   *
     F******************* GCER03 **
     FGCEPW03 CF  E                    WORKSTN
     FFCETL03 UF  E           K        DISK                      A
     E                    KOS     1   3  1   KON     6
     E                    ER      1   8 60
     I            DS
     I                                        1   80A6GSHZ
     I                                        1   40A6GSYY
     I                                        5   60A6GSMM
     I                                        7   80A6GSDD
     I            DS
     I                                        1   80A6KSHZ
     I                                        1   40A6KSYY
     I                                        5   60A6KSMM
     I                                        7   80A6KSDD
     I            DS
     I                                        1   60WTIME
     I                                        1   20A6KSJI
     I                                        3   40A6KSHU
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *
     C                     Z-ADD0         A6GSHZ
      *
     C           STP1      TAG
     C                     EXFMTGCEPW031
     C                     SETOF                     010299
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     SETOF                     90
     C                     Z-ADD1         A       10
     C           KTYPE     LOKUPKOS,A                    90
     C           *IN90     IFEQ '0'
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
     C                     MOVE KON,A     WNAME
      *
     C           A6KOTI    IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
      *
      *
     C                     SETOF                     90
     C           A6KOTI    CHAINFCETL031             90
     C           KTYPE     IFEQ '2'
     C           *IN90     IFEQ '0'
     C           A6GSKD    IFEQ 'D'
     C           A6GSHZ    ANDLE*DATE
     C                     GOTO STP2
     C                     END
      *
     C                     SETON                     010299
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C           KTYPE     IFEQ '1'
     C           *IN90     IFEQ '1'
     C                     SETON                     010299
     C                     MOVE ER,4      MSG
     C                     GOTO STP1
     C                     END
      *
     C           A6GSKD    IFEQ 'D'
     C           A6GSHZ    ANDLE*DATE
     C                     SETON                     010299
     C                     MOVE ER,5      MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C           KTYPE     IFEQ '0'
     C           *IN90     IFEQ '1'
     C                     SETON                     010299
     C                     MOVE ER,6      MSG
     C                     GOTO STP1
     C                     END
      *
     C           A6GSKD    IFEQ 'D'
     C           A6GSHZ    ANDLE*DATE
     C                     SETON                     010299
     C                     MOVE ER,7      MSG
     C                     GOTO STP1
     C                     END
     C                     END
     C           STP2      TAG
      *
     C           KTYPE     IFEQ '2'
     C                     MOVE *BLANK    A6GSKD
     C                     Z-ADD0         A6GSHZ
     C                     MOVE *BLANK    A6KTNM
     C                     MOVE *BLANK    A6KMEG
     C                     END
      *
     C           STP3      TAG
     C                     EXFMTGCEPW032
     C                     SETOF                     0399
      *
     C           *INKC     IFEQ '1'
     C                     EXSR SUBRTN
     C                     GOTO STP1
     C                     END
      *
     C           A6KTNM    IFEQ *BLANK
     C                     SETON                     0399
     C                     MOVE ER,8      MSG
     C                     GOTO STP3
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STP3
     C                     END
      *
     C           KTYPE     IFEQ '0'
     C                     MOVE 'D'       A6GSKD
     C                     Z-ADD*DATE     A6GSHZ
     C                     END
      *
     C                     Z-ADD*DATE     A6KSHZ
     C                     TIME           WTIME
     C                     MOVELUS        A6KSNM
     C                     MOVE KTYPE     MTYPE
     C                     MOVE WNAME     MNAME
     C                     MOVE A6KOTI    MKOTI
     C                     MOVE *BLANK    A6KMEG
      *
     C           *IN90     IFEQ '0'
     C                     UPDATFCETL031
     C                     ELSE
     C                     WRITEFCETL031
     C                     END
      *
     C                     EXSR SUBRTN
     C                     GOTO STP1
      *
      *
     C           SUBRTN    BEGSR
      *
     C                     MOVE *BLANK    KTYPE
     C                     MOVE *BLANK    A6KOTI
      *
     C                     ENDSR
      *
**  KOS.KON
0CANCEL
1CHANGE
2ADD
**  ERR
E-01 UPDATE INSTRUCTION IS <0 1 2>
E-02 INPUT PROCESS CODE
E-03 ADD WAS APPOINTED BUT M/F EXIST
E-04 CHANGE WAS APPOINTED BUT M/F DON'T EXIST
E-05 CHANGE WAS APPOINTED BUT M/F IS CANCELLED ALREADY
E-06 CANCEL WAS APPOINTED BUT M/F DON'T EXIST
E-07 CANCEL WAS APPOINTED BUT M/F IS CANCELLED ALREADY
E-08 INPUT PROCESS NAME
