     H            Y.
     F** GCER12 ******************************************
     F* PROCESS M/F LIST INPUT PARM  *
     F* INTRAL COMPANY PART NO ONLY                    *
     F*           I-HASADA               86.10.29        *
     F****************************************** GCER12 **
     FGCEWP11 IP  F     100            DISK
     FAAMPL11 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    OKOT       15  3               旧工程
     E                    OKBM       15  4 0             旧部門
     E                    NKOT       15  3               新工程
     E                    NKBM       15  4 0             新部門
     E                    NUKH       15 10 0             有効日－便
     E                    KOT        15  3               工程
     E                    KBM        15  4 0             部門
     IGCEWP11 AA  01
     I                                        1   5 FBHB1
     I                                        6  10 FBHB2
     I                                       11  12 FBHB3           23
     I                                       13  200FGEK
     I                                       21  280FGIS
     I                                       29  370FGSRO
     I                                       38  421FHHKO
     I                                       43  471FGHKO
     I                                       48  530FTKRO
     I                                       54  550FU
     I                                       56  56 FTEHI
     I                                       57  570FKUBN
     I                                       58  58 FTANZ
     I                                       59  61 KKOTI
     I                                       62  650KBMON
     I                                       66  71 KTKRO
     I                                       72  720FKAIS
     I            DS
     I                                        1  45 OKOT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600OKBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  45 NKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600NKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1 1500NUKH
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                      103 222 FPDAT
     I                                      103 103 FTEHI
     I                                      104 1040FKUBN
     I                                      105 105 FTANZ
     I                                      106 1070FBAN1
     I                                      108 1090FBAN2
     I                                      110 1110FBAN3
     I                                      112 1130FBAN4
     I                                      114 1150FBAN5
     I                                      116 1170FBAN6
     I                                      118 1190FBAN7
     I                                      120 1210FBAN8
     I                                      122 1230FBAN9
     I                                      124 1250FBAN10
     I                                      126 128 FKOT1
     I                                      129 131 FKOT2
     I                                      132 134 FKOT3
     I                                      135 137 FKOT4
     I                                      138 140 FKOT5
     I                                      141 143 FKOT6
     I                                      144 146 FKOT7
     I                                      147 149 FKOT8
     I                                      150 152 FKOT9
     I                                      153 155 FKOT10
     I                                      156 159 FWBM1
     I                                      160 163 FWBM2
     I                                      164 167 FWBM3
     I                                      168 171 FWBM4
     I                                      172 175 FWBM5
     I                                      176 179 FWBM6
     I                                      180 183 FWBM7
     I                                      184 187 FWBM8
     I                                      188 191 FWBM9
     I                                      192 195 FWBM10
     I                                      196 196 FSET
     I                                      197 197 FPARM
     I                                      198 201 FMBM1
     I                                      202 205 FMBM2
     I                                      206 209 FMBM3
     I                                      210 213 FMBM4
     I                                      214 217 FMBM5
     I                                      218 221 FMBM6
     I                                      222 222 FTONL
     I            DS
     I                                        1   9 WTKRO
     I                                        1   1 WTKR1
     I                                        2   2 H1
     I                                        3   4 WTKR2
     I                                        5   5 H2
     I                                        6   7 WTKR3
     I                                        8   8 H3
     I                                        9   9 WTKR4
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     C           KEY       KLIST
     C                     KFLD           FBHB1
     C                     KFLD           FBHB2
     C                     KFLD           FBHB3
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     PARM           PNO     1
     C                     PARM           FMT     1
     C                     PARM           PFDAT 120
      *
     C                     MOVE PFDAT     FPDAT
     C                     SETOF                     21
     C                     ADD  1         RECD    40
     C                     TIME           WTIME   60
      *
     C           *IN22     IFEQ '0'
     C                     SETON                     2122
      *
     C                     SETOF                     02
     C           US        CHAINRGAPL111             02
     C           *IN02     IFEQ '0'
     C           J8SKJY    IFNE 'D'
     C                     MOVELJ8NAME    WUS    15
     C                     MOVELJ8NAME    WNS     9
     C                     END
     C                     END
      *
     C           FMT       COMP 'M'                      32
     C           PNO       COMP '1'                      28
     C           PNO       COMP '2'                      29
     C           PNO       COMP '3'                      30
     C           PNO       COMP '4'                      31
     C           PNO       COMP '5'                      33
     C           FTEHI     COMP 'G'                      15
     C           FTEHI     COMP 'Z'                      16
     C           FTEHI     COMP 'S'                      73
     C           FTEHI     COMP 'A'                      17
     C           FKUBN     COMP 1                        18
     C           FTANZ     COMP 'S'                      19
      *
     C                     END
      *
     C                     SETOF                     41
     C                     MOVE *BLANK    KOT
     C                     Z-ADD0         KBM
     C           KEY       CHAINAAMPL111             41
     C           *IN41     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     41
     C                     END
     C           *IN41     IFEQ '0'
      *
     C                     Z-ADD1         A       20
     C                     Z-ADD0         B       20
     C           1         DO   15        A
     C                     MOVELNUKH,A    WUKH    80
     C           *DATE     IFLT WUKH
     C           OKOT,A    IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE OKOT,A    KOT,B
     C                     Z-ADDOKBM,A    KBM,B
     C                     END
     C                     ELSE
     C           NKOT,A    IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE NKOT,A    KOT,B
     C                     Z-ADDNKBM,A    KBM,B
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     SETOF                     41
     C                     MOVE *BLANK    WSMEI  12
     C           KBM,1     CHAINFGBPL011             41
     C           *IN41     IFEQ '0'
     C                     MOVELB2SMEI    WSMEI
     C                     END
      *
     C                     SETOF                     41
     C                     MOVE *BLANK    WTKRO
     C           KEY       CHAINFCEPL011             41
     C           *IN41     IFEQ '0'
     C           A2TRHZ    IFGT *DATE
     C                     MOVE A2KTRK    WTKR1
     C                     MOVE A2KTRT    WTKR2
     C                     MOVE A2KTRR    WTKR3
     C                     MOVE A2KTRD    WTKR4
     C                     ELSE
     C                     MOVE A2STRK    WTKR1
     C                     MOVE A2STRT    WTKR2
     C                     MOVE A2STRR    WTKR3
     C                     MOVE A2STRD    WTKR4
     C                     END
     C                     END
      *
     C           WTKR2     IFNE *BLANK
     C                     MOVE '-'       H1
     C                     END
     C           WTKR3     IFNE *BLANK
     C                     MOVE '-'       H2
     C                     END
     C           WTKR4     IFNE *BLANK
     C                     MOVE '-'       H3
     C                     END
     OQPRINT  H  102   21
     O                                  131 '+-------------------+'
     O        H  1     21
     O                                  131 '|IN CHARGE|PUBLISHER|'
     O        H  1     21
     O                 28                21 '1.ALL PART NO ORDER'
     O                 29                23 '2.ODR BY NEED BOX / D'
     O                 30                25 '3.ODR BY RESULT BOX / D'
     O                 31                25 '4.CMPLET LOCATION ORDER'
     O                 33                25 '5.INT PROC LOCATION ORD'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '|         |         |'
     O                         WNS      130
     O        H  2     21
     O                                   10 'GCER12-1'
     O                                   60 '*** PROCESS M/F '
     O                                   65 'PARM '
     O                                   83 'APPOINTED LIST ***'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        H  1     21
     O                                   70 '* * * * *'
     O                                   92 'WEIGHT CALC * * * * *'
     O        H  1     21
     O                                   48 'VOL PROD..G TRY MFG..S'
     O        H  1     21
     O                                   38 'LIMIT...Z'
     O                                   67 'MONTHLY QTY..1'
     O                                   91 'MAT U WEIGHT..S'
     O        H  2     21
     O                                   44 'ALL ....A......'
     O                         FTEHI     45
     O                                   71 'RESULT.......2....'
     O                         FKUBN Z   72
     O                                   94 'CMPLET U WT. .K..'
     O                         FTANZ     95
     O        H  1     21
     O                                   47 '8888..SUPPLIER CD'
     O                                   60 '2PROC ABNORMAL '
     O                                   81 '9999..SUPPLIER CD ONLY'
     O        H  2     21
     O                                   39 'PROC-'
     O                         FBAN1 Z   43
     O                                   54 'PROC-'
     O                         FBAN2 Z   58
     O                                   69 'PROC-'
     O                         FBAN3 Z   73
     O                                   84 'PROC-'
     O                         FBAN4 Z   88
     O                                   99 'PROC-'
     O                         FBAN5 Z  103
     O        H  3     21
     O                         FKOT1     36
     O                                   38 '-'
     O                         FWBM1     43
     O                         FKOT2     51
     O                                   53 '-'
     O                         FWBM2     58
     O                         FKOT3     66
     O                                   68 '-'
     O                         FWBM3     73
     O                         FKOT4     81
     O                                   83 '-'
     O                         FWBM4     88
     O                         FKOT5     96
     O                                   98 '-'
     O                         FWBM5    103
     O        H 12     21
     O                                   39 'PROC-'
     O                         FBAN6 Z   43
     O                                   54 'PROC-'
     O                         FBAN7 Z   58
     O                                   69 'PROC-'
     O                         FBAN8 Z   73
     O                                   84 'PROC-'
     O                         FBAN9 Z   88
     O                                   99 'PROC-'
     O                         FBAN10Z  103
     O        H  3     21
     O                         FKOT6     36
     O                                   38 '-'
     O                         FWBM6     43
     O                         FKOT7     51
     O                                   53 '-'
     O                         FWBM7     58
     O                         FKOT8     66
     O                                   68 '-'
     O                         FWBM8     73
     O                         FKOT9     81
     O                                   83 '-'
     O                         FWBM9     88
     O                         FKOT10    96
     O                                   98 '-'
     O                         FWBM10   103
     O        H 13     21
     O                                   58 'DO YOU SET IT ? .Y N.'
     O                                   63 '...'
     O                         FSET      64
     O                                   78 'TUNNEL PROC..'
     O                         FTONL     79
     O                                   97 'Y-NEED N-NOT NEED'
     O        H 13     21
     O                                   68 'LIST THAT PARM WAS INPUT'
     O                                   76 ' ? .Y N.'
     O                                   84 '.....'
     O                         FPARM     85
     O        H 13     21
     O                                   48 'EXCEPT SUPPLIER CD..'
     O                                   50 '1'
     O                         FMBM1     55
     O                                   58 '2'
     O                         FMBM2     63
     O                                   66 '3'
     O                         FMBM3     71
     O                                   74 '4'
     O                         FMBM4     79
     O                                   82 '5'
     O                         FMBM5     87
     O                                   90 '6'
     O                         FMBM6     95
     O        H  103   21
     O       OR        OF
     O                                   15 'CALC OF WEIGHT '
     O                 18                27 'MONTHLY QTY'
     O                N18                27 'RESULT'
     O                                   29 'X'
     O                 19                41 'MATRL UNW'
     O                N19                41 'CMPLET U WT.'
     O                         FTEHI     45
     O                                   46 '-'
     O                 15                54 'VOL PROD'
     O                 16                51 'LIMIT'
     O                 73                53 'TRY MFG'
     O                 17                50 'ALL'
     O        H  1     21
     O       OR        OF
     O                 28                21 '1.ALL PART NO ORDER'
     O                 29                23 '2.ODR BY NEED BOX / D'
     O                 30                25 '3.ODR BY RESULT BOX / D'
     O                 31                24 '4.CMPLET LOCATION ORDER'
     O                 33                25 '5.INT PROC LOCATION ORD'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O        H  2     21
     O       OR        OF
     O                                   10 'GCER12-1'
     O                                   60 '*** PROCESS M/F '
     O                                   65 'PARM '
     O                                   83 'APPOINTED LIST ***'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  119 'PUBLISHER'
     O                         WUS      132
     O        H  2     21
     O       OR        OF
     O                                   14 'INT CO.PART NO'
     O                                   28 'CMPLET LOC'
     O                                   35 'STOCK'
     O                                   49 'MATERIAL'
     O                                   59 'DASH'
     O                                   71 'SHOT'
     O                                   83 'Z COAT'
     O                                   95 'C COAT'
     O                                  107 'F COAT'
     O                                  115 'SORT'
     O                                  125 '1ST PROC'
     O        D  1     01
     O                         FBHB1      6
     O                                    7 '-'
     O                         FBHB2     12
     O                N23                13 '-'
     O                         FBHB3     15
     O                         WTKRO     27
     O                         KOT,1    121
     O                                  122 '-'
     O                         KBM,1    126
     O        D  2     01
     O                         FHHKO 1   25
     O                                   27 '/D'
     O                         WSMEI    130
     O        T  2     LR
     O                                   13 'RECORD COUNT'
     O                         RECD      19 ' , * '
