     H            Y.
     F** GCER11 ******************************************
     F*INPUT PARM OF PROCESS M/F LIST  *
     F*           I-HASADA               86.10.29        *
     F****************************************** GCER11 **
     FGCEWP11 IP  F     100            DISK
     FAAMPL11 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    OKOT       15  3               旧工程
     E                    OKBM       15  4 0             旧部門
     E                    OTKR       15  6               旧所番地
     E                    OKNO       15  3               旧機番
     E                    NKOT       15  3               新工程
     E                    NKBM       15  4 0             新部門
     E                    NTKR       15  6               新所番地
     E                    NKNO       15  3               新機番
     E                    NUKH       15 10 0             有効日－便
     E                    BKOT       15  3               工程ﾎﾞﾍ]uﾇjｰ
     E                    BKBM       15  4 0             部門ﾎﾞﾍ]uﾇjｰ
     E                    KOT        15  3               工程
     E                    KBM        15  4 0             部門
     E                    TKR        15  6               所番地
     E                    KNO        15  3               機№
     E                    HTR        15  9               所番地
     E                    HNO        15  4               機№
     E                    LSM        15 10               細目名
     IGCEWP11 AA  01
     I                                        1   5 FBHB1
     I                                        6  10 FBHB2
     I                                       11  12 FBHB3           17
     I                                       13  200FGEK
     I                                       21  280FGIS
     I                                       29  370FGSRO
     I                                       38  421FHHKO
     I                                       43  471FGHKO
     I                                       48  530FTKRO
     I                                       54  550FU
     I                                       56  56 FTEHI
     I                                       57  570FKUBN
     I                                       58  58 FTANZ
     I                                       59  61 KKOTI
     I                                       62  650KBMON
     I                                       66  71 KTKRO
     I                                       72  720FKAIS
     I                                       73  87 FSMEI
     I            DS
     I                                        1  45 BKOT
     I                                        1   3 A2KOT1
     I                                        4   6 A2KOT2
     I                                        7   9 A2KOT3
     I                                       10  12 A2KOT4
     I                                       13  15 A2KOT5
     I                                       16  18 A2KOT6
     I                                       19  21 A2KOT7
     I                                       22  24 A2KOT8
     I                                       25  27 A2KOT9
     I                                       28  30 A2KO10
     I                                       31  33 A2KO11
     I                                       34  36 A2KO12
     I                                       37  39 A2KO13
     I                                       40  42 A2KO14
     I                                       43  45 A2KO15
     I            DS
     I                                        1  600BKBM
     I                                        1   40A2KBM1
     I                                        5   80A2KBM2
     I                                        9  120A2KBM3
     I                                       13  160A2KBM4
     I                                       17  200A2KBM5
     I                                       21  240A2KBM6
     I                                       25  280A2KBM7
     I                                       29  320A2KBM8
     I                                       33  360A2KBM9
     I                                       37  400A2KB10
     I                                       41  440A2KB11
     I                                       45  480A2KB12
     I                                       49  520A2KB13
     I                                       53  560A2KB14
     I                                       57  600A2KB15
     I            DS
     I                                        1  45 OKOT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600OKBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  90 OTKR
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1  45 OKNO
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN10
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I            DS
     I                                        1  45 NKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600NKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  90 NTKR
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  45 NKNO
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1 1500NUKH
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80A2TAHZ
     I                                        1   40A2TAYY
     I                                        5   60A2TAMM
     I                                        7   80A2TADD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   6 WTKR1
     I                                        1   1 WTKRO1
     I                                        2   3 WTKRO2
     I                                        4   5 WTKRO3
     I                                        6   6 WTKRO4
     I            DS
     I                                        1   9 WTKR2
     I                                        1   1 WATK1
     I                                        2   2 WBTK1
     I                                        3   4 WATK2
     I                                        5   5 WBTK2
     I                                        6   7 WATK3
     I                                        8   8 WBTK3
     I                                        9   9 WATK4
     I            DS
     I                                        1   3 WKNO
     I                                        1   1 WKN1
     I                                        2   3 WKN2
     I            DS
     I                                        1   4 HKNO
     I                                        1   1 HKN1
     I                                        2   2 H1
     I                                        3   4 HKN2
     I            DS
     I                                      103 222 FPDAT
     I                                      103 103 FTEHI
     I                                      104 1040FKUBN
     I                                      105 105 FTANZ
     I                                      106 1070FBAN1
     I                                      108 1090FBAN2
     I                                      110 1110FBAN3
     I                                      112 1130FBAN4
     I                                      114 1150FBAN5
     I                                      116 1170FBAN6
     I                                      118 1190FBAN7
     I                                      120 1210FBAN8
     I                                      122 1230FBAN9
     I                                      124 1250FBAN10
     I                                      126 128 FKOT1
     I                                      129 131 FKOT2
     I                                      132 134 FKOT3
     I                                      135 137 FKOT4
     I                                      138 140 FKOT5
     I                                      141 143 FKOT6
     I                                      144 146 FKOT7
     I                                      147 149 FKOT8
     I                                      150 152 FKOT9
     I                                      153 155 FKOT10
     I                                      156 159 FWBM1
     I                                      160 163 FWBM2
     I                                      164 167 FWBM3
     I                                      168 171 FWBM4
     I                                      172 175 FWBM5
     I                                      176 179 FWBM6
     I                                      180 183 FWBM7
     I                                      184 187 FWBM8
     I                                      188 191 FWBM9
     I                                      192 195 FWBM10
     I                                      196 196 FSET
     I                                      197 197 FPARM
     I                                      198 201 FMBM1
     I                                      202 205 FMBM2
     I                                      206 209 FMBM3
     I                                      210 213 FMBM4
     I                                      214 217 FMBM5
     I                                      218 221 FMBM6
     I                                      222 222 FTONL
     C                     SETOF                     021618
     C                     SETOF                     212223
     C                     SETOF                     242526
     C                     SETOF                     272829
     C                     SETOF                     303132
     C                     SETOF                     333435
     C                     SETOF                     373839
     C                     SETOF                     40
      *
     C                     MOVE '-'       H1
     C                     MOVE *BLANK    LSM
     C                     MOVE *BLANK    KOT
     C                     Z-ADD0         KBM
     C                     MOVE *BLANK    TKR
     C                     MOVE *BLANK    KNO
     C                     MOVE *BLANK    HTR
     C                     MOVE *BLANK    HNO
     C                     TIME           WTIME   60
      *
     C           *IN03     IFEQ '0'
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     PARM           PNO     1
     C                     PARM           FMT     1
     C                     PARM           PFDAT 120
     C                     PARM           PMEIK   1
     C                     MOVE PFDAT     FPDAT
     C                     SETON                     020340
      *
     C                     MOVE FSMEI     WSMEI  15
      *
     C           FMT       COMP 'M'                      04
     C           PNO       COMP '1'                      05
     C           PNO       COMP '2'                      06
     C           PNO       COMP '3'                      07
     C           PNO       COMP '4'                      08
     C           PNO       COMP '5'                      09
     C           FTEHI     COMP 'G'                      10
     C           FTEHI     COMP 'Z'                      11
     C           FTEHI     COMP 'S'                      73
     C           FTEHI     COMP 'A'                      12
     C           FKUBN     COMP 1                        13
     C           FTANZ     COMP 'S'                      14
      *
     C                     SETOF                     15
     C           US        CHAINRGAPL111             15
     C           *IN15     IFEQ '0'
     C           J8SKJY    ANDNE'D'
     C                     MOVELJ8NAME    WUS    15
     C                     MOVELJ8NAME    WNS     9
     C                     END
     C                     END
      *
     C           PMEIK     IFEQ 'Y'
     C           FSMEI     IFNE WSMEI
     C                     SETON                     40
     C                     MOVE FSMEI     WSMEI
     C                     EXCPTTL
      *
     C                     END
     C                     END
      *
     C                     MOVE *BLANK    A2ZETI
     C                     Z-ADD0         WSYS    50
     C                     MOVE *BLANK    WSYT    1
     C                     Z-ADD0         A2GEKN
     C                     Z-ADD0         A2SOZI
     C                     Z-ADD0         A2KASI
     C           FKAIS     IFEQ 0
     C                     ADD  1         XECD    40
     C                     ADD  1         RECD    40
     C                     END
      *
     C                     SETOF                     15
     C           KEY1      CHAINAAMPL111             15
     C           *IN15     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     15
     C                     END
      *
     C           *IN15     IFEQ '0'
     C                     Z-ADD1         A
     C                     Z-ADD0         B
     C           1         DO   15        A
     C                     MOVELNUKH,A    WUKH    80
     C           *DATE     IFLT WUKH
     C           OKOT,A    IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE OKOT,A    KOT,B
     C                     Z-ADDOKBM,A    KBM,B
     C                     MOVE OTKR,A    TKR,B
     C                     MOVE OKNO,A    KNO,B
     C                     END
     C                     ELSE
     C           NKOT,A    IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE NKOT,A    KOT,B
     C                     Z-ADDNKBM,A    KBM,B
     C                     MOVE NTKR,A    TKR,B
     C                     MOVE NKNO,A    KNO,B
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     SETOF                     15
     C           KEY1      KLIST
     C                     KFLD           FBHB1
     C                     KFLD           FBHB2
     C                     KFLD           FBHB3
     C                     SETOF                     15
     C           KEY1      CHAINFCEPL011             15
     C           *IN15     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     15
     C                     END
     C           *IN15     IFEQ '0'
     C           A2TEHI    IFEQ 'Z'
     C           A2TEHI    OREQ 'S'
     C                     MOVEABKOT      KOT
     C                     Z-ADDBKBM      KBM
     C                     END
     C                     ADD  A2GEKN    XGEKN  100
     C                     ADD  A2GEKN    TGEKN  100
     C           A2SYHZ    IFGT *DATE
     C                     Z-ADDA2KSYS    WSYS
     C                     MOVE A2KSYT    WSYT
     C                     ELSE
     C                     Z-ADDA2SSYS    WSYS
     C                     MOVE A2SSYT    WSYT
     C                     END
     C                     END
      *
     C           FGSRO     COMP 0                        16
     C                     Z-ADD0         WHIAT
     C           A2GEKN    IFNE 0
     C           FGSRO     DIV  A2GEKN    WHIA1   52H
     C           WHIA1     MULT 100       WHIAT   40
     C                     END
      *
     C           *IN13     IFEQ '1'
     C                     Z-ADDA2GEKN    WGEK    90
     C                     ELSE
     C                     Z-ADDFGSRO     WGEK
     C                     END
      *
     C           *IN14     IFEQ '1'
     C                     Z-ADDA2SOZI    WTNJO   72
     C                     ELSE
     C                     Z-ADDA2KASI    WTNJO
     C                     END
      *
     C           WSYS      MULT WTNJO     WHAK1   72
     C           WHAK1     DIV  1000      WHAKO   72H
     C           WGEK      MULT WTNJO     WZIU1  100H
     C           WZIU1     DIV  1000      WZIUR  100H
      *
     C           FKAIS     IFEQ 0
     C                     ADD  FGSRO     XGSRO  110
     C                     ADD  FGSRO     TGSRO  110
     C                     ADD  WZIUR     XZIUR   90
     C                     ADD  WZIUR     TZIUR   90
     C                     ADD  FHHKO     XHHKO   61
     C                     ADD  FHHKO     THHKO   61
     C                     ADD  FGHKO     XGHKO   61
     C                     ADD  FGHKO     TGHKO   61
     C                     END
      *
     C           *IN09     IFEQ '1'
     C                     Z-ADD1         A       20
     C           1         DO   15        A
     C           KKOTI     IFEQ KOT,A
     C           KBMON     ANDEQKBM,A
     C                     MOVE TKR,A     WTKRO   6
     C                     EXSR SUBRTN
     C                     MOVE WTKR2     HTR,1
     C           KNO,A     IFNE *BLANK
     C                     SETON                     37
     C                     MOVE KNO,A     WKNO
     C                     MOVE WKN1      HKN1
     C                     MOVE WKN2      HKN2
     C                     MOVE HKNO      HNO,1
     C                     END
     C                     GOTO AP3
     C                     END
     C                     END
     C           AP3       TAG
      *
     C                     SETOF                     15
     C           KBMON     CHAINFGBPL011             15
     C           *IN15     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    IFLE *DATE
     C                     GOTO STP2
     C                     END
     C                     END
     C                     MOVELB2SMEI    LSM,1
     C           STP2      TAG
     C                     END
     C                     ELSE
      *
     C           A2TEHI    IFNE 'Z'
     C           A2TEHI    ANDNE'S'
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           TKR,A     IFNE *BLANK
     C                     MOVE TKR,A     WTKRO
     C                     EXSR SUBRTN
     C                     MOVE WTKR2     HTR,A
     C                     END
     C           KNO,A     IFNE *BLANK
     C           A         IFLE 5
     C                     SETON                     37
     C                     GOTO XX1
     C                     END
     C           A         IFLE 10
     C                     SETON                     38
     C                     GOTO XX1
     C                     END
     C           A         IFGT 10
     C                     SETON                     39
     C                     END
     C           XX1       TAG
     C                     MOVE KNO,A     WKNO
     C                     MOVE WKN1      HKN1
     C                     MOVE WKN2      HKN2
     C                     MOVE HKNO      HNO,A
     C                     END
     C                     END
     C           AP2       TAG
     C                     END
      *
     C                     Z-ADD1         A
     C                     Z-ADD20        B       20
     C           1         DO   15        A
     C                     ADD  1         B
     C           KBM,A     IFNE 0
     C                     MOVE '1'       *IN,B
     C                     SETOF                     15
     C           KBM,A     CHAINFGBPL011             15
     C           *IN15     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    IFLE *DATE
     C                     GOTO STP4
     C                     END
     C                     END
     C                     MOVELB2SMEI    LSM,A
     C           STP4      TAG
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C   09 16             SETON                     18
     C  N09                SETON                     18
      *
     C           SUBRTN    BEGSR
     C                     MOVE WTKRO     WTKR1
     C                     MOVE *BLANK    WTKR2
     C                     MOVE WTKRO1    WATK1
     C                     MOVE WTKRO2    WATK2
     C                     MOVE WTKRO3    WATK3
     C                     MOVE WTKRO4    WATK4
     C           WATK2     IFNE *BLANK
     C                     MOVE '-'       WBTK1
     C                     END
     C           WATK3     IFNE *BLANK
     C                     MOVE '-'       WBTK2
     C                     END
     C           WATK4     IFNE *BLANK
     C                     MOVE '-'       WBTK3
     C                     END
     C                     ENDSR
     OQPRINT  H  102   02
     O                                  131 '+-------------------+'
     O        H  1     02
     O                                  131 '|IN CHARGE|PUBLISHER|'
     O        H  1     02
     O                 05                21 '1.ALL PART NO ORDER'
     O                 06                23 '2.ODR BY NEED BOX / D'
     O                 07                22 '3.ODR BY ACT BOX / D'
     O                 08                24 '4.COMPLETION LOC ORDER'
     O                 09                25 '5.INT PROC LOCATION ORD'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '|         |         |'
     O                         WNS      130
     O        H  2     02
     O                                   10 'GCER11-1'
     O                                   55 '*** PROCESS M/F '
     O                                   60 'PARM '
     O                                   77 'APPOINTED LIST ***'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        H  1     02
     O                                   70 '* * * * *'
     O                                   92 'WEIGHT CALC * * * * *'
     O        H  1     02
     O                                   48 'VOL PROD..G TRY MFG..S'
     O        H  1     02
     O                                   38 'LIMIT...Z'
     O                                   67 'MONTHLY QTY..1'
     O                                   91 'MAT U WEIGHT..S'
     O        H  2     02
     O                                   44 'ALL ....A......'
     O                         FTEHI     45
     O                                   71 'RESULT.......2....'
     O                         FKUBN Z   72
     O                                   94 'CMPLET U WT. .K..'
     O                         FTANZ     95
     O        H  1     02
     O                                   47 '8888..SUPPLIER CD'
     O                                   60 '2PROC ABNORMAL '
     O                                   81 '9999..SUPPLIER CD ONLY'
     O        H  2     02
     O                                   39 'PROC-'
     O                         FBAN1 Z   43
     O                                   54 'PROC-'
     O                         FBAN2 Z   58
     O                                   69 'PROC-'
     O                         FBAN3 Z   73
     O                                   84 'PROC-'
     O                         FBAN4 Z   88
     O                                   99 'PROC-'
     O                         FBAN5 Z  103
     O        H  3     02
     O                         FKOT1     36
     O                                   38 '-'
     O                         FWBM1     43
     O                         FKOT2     51
     O                                   53 '-'
     O                         FWBM2     58
     O                         FKOT3     66
     O                                   68 '-'
     O                         FWBM3     73
     O                         FKOT4     81
     O                                   83 '-'
     O                         FWBM4     88
     O                         FKOT5     96
     O                                   98 '-'
     O                         FWBM5    103
     O        H 12     02
     O                                   39 'PROC-'
     O                         FBAN6 Z   43
     O                                   54 'PROC-'
     O                         FBAN7 Z   58
     O                                   69 'PROC-'
     O                         FBAN8 Z   73
     O                                   84 'PROC-'
     O                         FBAN9 Z   88
     O                                   99 'PROC-'
     O                         FBAN10Z  103
     O        H  3     02
     O                         FKOT6     36
     O                                   38 '-'
     O                         FWBM6     43
     O                         FKOT7     51
     O                                   53 '-'
     O                         FWBM7     58
     O                         FKOT8     66
     O                                   68 '-'
     O                         FWBM8     73
     O                         FKOT9     81
     O                                   83 '-'
     O                         FWBM9     88
     O                         FKOT10    96
     O                                   98 '-'
     O                         FWBM10   103
     O        H 13     02
     O                                   58 'DO YOU SET IT ?.Y N.'
     O                                   63 '...'
     O                         FSET      64
     O                                   78 'TUNNEL PROC..'
     O                         FTONL     79
     O                                   97 'Y-NEED N-NOT NEED'
     O        H 13     02
     O                                   68 'LIST THAT PARM WAS INPUT'
     O                                   76 ' ? .Y N.'
     O                                   84 '.....'
     O                         FPARM     85
     O        H 13     02
     O                                   48 'EXCPT SUPPLIER CD..'
     O                                   50 '1'
     O                         FMBM1     55
     O                                   58 '2'
     O                         FMBM2     63
     O                                   66 '3'
     O                         FMBM3     71
     O                                   74 '4'
     O                         FMBM4     79
     O                                   82 '5'
     O                         FMBM5     87
     O                                   90 '6'
     O                         FMBM6     95
     O        H  103   40
     O       OR        OF
     O                                   15 'CALC OF WEIGHT '
     O                 13                27 'MONTHLY QTY'
     O                N13                27 'RESULT'
     O                                   29 'X'
     O                 14                41 'MATRL UNW'
     O                N14                41 'CMPLET U WT.'
     O                         FTEHI     45
     O                                   46 '-'
     O                 10                54 'VOL PROD'
     O                 11                51 'LIMIT'
     O                 73                53 'TRY MFG'
     O                 12                50 'ALL'
     O        H  1     40
     O       OR        OF
     O                 05                21 '1.ALL PART NO ORDER'
     O                 06                23 '2.ODR BY NEED BOX / D'
     O                 07                22 '3.ODR BY ACT BOX / D'
     O                 08                25 '4.CMPLET LOCATION ORDER'
     O                 09                25 '5.INT PROC LOCATION ORD'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O        H  2     40
     O       OR        OF
     O                                   10 'GCER11-1'
     O                                   60 '*** PROCESS M/F '
     O                                   65 'PARM '
     O                                   83 'APPOINTED LIST ***'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  119 'PUBLISHER'
     O                         WUS      132
     O        H  1     40
     O       OR        OF
     O                         FSMEI     15
     O                                   92 '..PROC-1..  ..PROC-2..'
     O                                  116 '..PROC-3..  ..PROC-4..'
     O                                  128 '..PROC-5..'
     O        H  1     40
     O       OR        OF
     O                                   92 '..PROC-6..  ..PROC-7..'
     O                                  116 '..PROC-8..  ..PROC-9..'
     O                                  128 '..PROC-10.'
     O        H  2     40
     O       OR        OF
     O                                    5 'ID'
     O                                   17 'INT CO. P/N'
     O                                   29 'MONTYLY QTY'
     O                         FU    Z   36
     O                                   46 'MONTH RESULT'
     O                                   52 'RATIO'
     O                                   63 'ACCOM QTY'
     O                                   92 '..PROC-11.  ..PROC-12.'
     O                                  116 '..PROC-13.  ..PROC-14.'
     O                                  128 '..PROC-15.'
     O        D  1     01 04
     O                         A2ZETI     4
     O                         FBHB1     12
     O                                   13 '-'
     O                         FBHB2     18
     O                N17                19 '-'
     O                         FBHB3     21
     O                         A2GEKN1   33
     O                         FGSRO 1   45
     O                         WHIAT 1   51
     O                                   52 '%'
     O                         WSYS  1   61
     O                                   62 '-'
     O                         WSYT      63
     O                 09      KKOTI     73
     O                 09                74 '-'
     O                 09      KBMON     78
     O                N09      KOT,1     73
     O                N09                74 '-'
     O                N09      KBM,1     78
     O                N09      KOT,2     85
     O                 22                86 '-'
     O                 22      KBM,2     90
     O                 09      HTR,1     92
     O                N09      KOT,3     97
     O                 23                98 '-'
     O                 23      KBM,3    102
     O                N09      KOT,4    109
     O                 24               110 '-'
     O                 24      KBM,4    114
     O                N09      KOT,5    121
     O                 25               122 '-'
     O                 25      KBM,5    126
     O        D  1     01 04 18
     O       OR        01 04N18
     O       AND       37
     O       OR  2     01 04N18
     O       AND      N37
     O                         WZIUR 1   14
     O                                   18 'KG/M'
     O                         FHHKO 1   33
     O                                   35 '/D'
     O                         FGHKO 1   45
     O                                   47 '/D'
     O                 14                59 'MATRL UNW'
     O                N14                59 'CMPLET U WT.'
     O                         WTNJO 2   69
     O                         LSM,1     80
     O                N09      LSM,2     92
     O                N09      LSM,3    104
     O                N09      LSM,4    116
     O                N09      LSM,5    128
     O        D  1     01 04 18
     O       AND       37
     O       OR  2     01 04 18
     O       AND      N37
     O                 16      A2TAHZY   42
     O                 16                50 'VOL PROD'
     O                                   59 '1BOX WT.'
     O                         WHAKO 2   67
     O                                   69 'KG'
     O                N09      HTR,1     79
     O                N09      HTR,2     91
     O                N09      HTR,3    103
     O                N09      HTR,4    115
     O                N09      HTR,5    127
     O        D  2     01 04 37
     O                         HNO,1     77
     O                N09      HNO,2     89
     O                N09      HNO,3    101
     O                N09      HNO,4    113
     O                N09      HNO,5    125
     O        D  1     01 04 26
     O                         KOT,6     73
     O                 26                74 '-'
     O                 26      KBM,6     78
     O                         KOT,7     85
     O                 27                86 '-'
     O                 27      KBM,7     90
     O                         KOT,8     97
     O                 28                98 '-'
     O                 28      KBM,8    102
     O                         KOT,9    109
     O                 29               110 '-'
     O                 29      KBM,9    114
     O                         KOT,10   121
     O                 30               122 '-'
     O                 30      KBM,10   126
     O        D  1     01 04 26
     O                         LSM,6     80
     O                         LSM,7     92
     O                         LSM,8    104
     O                         LSM,9    116
     O                         LSM,10   128
     O        D  1     01 04 26
     O       AND       38
     O       OR  2     01 04 26
     O       AND      N38
     O                         HTR,6     79
     O                         HTR,7     91
     O                         HTR,8    103
     O                         HTR,9    115
     O                         HTR,10   127
     O        D  2     01 04 26
     O       AND       38
     O                         HNO,6     77
     O                         HNO,7     89
     O                         HNO,8    101
     O                         HNO,9    113
     O                         HNO,10   125
     O        D  1     01 04 31
     O                         KOT,11    73
     O                 31                74 '-'
     O                 31      KBM,11    78
     O                         KOT,12    85
     O                 32                86 '-'
     O                 32      KBM,12    90
     O                         KOT,13    97
     O                 33                98 '-'
     O                 33      KBM,13   102
     O                         KOT,14   109
     O                 34               110 '-'
     O                 34      KBM,14   114
     O                         KOT,15   121
     O                 35               122 '-'
     O                 35      KBM,15   126
     O        D  1     01 04 31
     O                         LSM,11    80
     O                         LSM,12    92
     O                         LSM,13   104
     O                         LSM,14   116
     O                         LSM,15   128
     O        D  1     01 04 31
     O       AND       39
     O       OR  2     01 04 31
     O       AND      N39
     O                         HTR,11    79
     O                         HTR,12    91
     O                         HTR,13   103
     O                         HTR,14   115
     O                         HTR,15   127
     O        D  2     01 04 31
     O       AND       39
     O                         HNO,11    77
     O                         HNO,12    89
     O                         HNO,13   101
     O                         HNO,14   113
     O                         HNO,15   125
     O        E  2             TL
     O                                   38 'MONTHLY SET NBR TOTAL'
     O                         XGEKN  B  60 ' ,   ,   , * '
     O                                   90 'SET BOX / DAY TOTAL'
     O                         XHHKO  B 104 '  , * . '
     O***                               109 'BOX/D'
     O        E  2             TL
     O                         FU    Z   22
     O                                   39 'MONTHLY RESULT TOTAL '
     O                         XGSRO  B  60 '  ,   ,   , * '
     O                                   93 'RESULT BOX / DAY TOTAL'
     O                         XGHKO  B 104 '  , * . '
     O***                               109 'BOX/D'
     O        E  2             TL
     O                                   31 'WEIGHT TOTAL '
     O                         XZIUR  B  60 '   ,   , * '
     O                                   62 'KG'
     O                                   81 'RECORD COUNT'
     O                         XECD   B 104 ' , * '
     O        T  2     LR
     O                                   38 'MONTHLY SETTING TOTAL'
     O                         TGEKN     60 ' ,   ,   , * '
     O                                   90 'SET BOX / DAY TOTAL'
     O                         THHKO    104 '  , * . '
     O***                               109 'BOX/D'
     O        T  2     LR
     O                         FU    Z   22
     O                                   39 'MONTHLY RESULT TOTAL'
     O                         TGSRO     60 '  ,   ,   , * '
     O                                   93 'RESULT BOX / DAY TOTAL'
     O                         TGHKO    104 '  , * . '
     O***                               109 'BOX/D'
     O        T  2     LR
     O                                   31 'WEIGHT TOTAL'
     O                         TZIUR     60 '   ,   , * '
     O                                   62 'KG'
     O                                   81 'RECORD COUNT'
     O                         RECD     104 ' , * '
