     H            Y.
     F** GCER33 **************************************
     F*.....// LOCATION SHIPMENT NUMBER OF BOXES DISPLAY TAG PUBLICATION ///*
     F* A-IDOTA                 1987.09.14           *
     F************************************** GCER33 **
     FMBDPL01 IP  E           K        DISK
     FGCENP30 O   E                    DISK
     IMBDPL011    01
     I                                              F3SHN1L2
     I                                              F3SHN2L2
     I                                              F3SHN3L2
     I                                              F3NONYL1
     I                                              F3NKOJL1
     C           *INL2     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     02
     C                     ELSE
     C                     MOVE 'N'       FASENY
     C           *IN04     IFEQ '0'
     C                     MOVE 'S'       FASENY
     C                     END
     C                     WRITEGCENP301
     C                     SETOF                     0304
     C                     END
     C                     END
     C           *INL1     IFEQ '1'
     C           *IN03     IFEQ '1'
     C                     SETON                     04
     C                     MOVE 'N'       FASENY
     C                     WRITEGCENP301
     C                     END
     C                     SETON                     03
     C                     MOVE F3SHN1    FASHN1
     C                     MOVE F3SHN2    FASHN2
     C                     MOVE F3SHN3    FASHN3
     C                     Z-ADDF3NONY    FANONY
     C                     MOVE F3NKOJ    FANKOJ
     C                     MOVE F3NUKE    FANUKR
     C                     MOVE F3TOKU    FATOKU
     C                     MOVE F3TKOJ    FATKOJ
     C                     MOVE F3TUKE    FATUKR
     C                     END
     C           END       TAG
     CLR                   EXSR OWARI
     C*-----------------------------------------------*
     C*        終り　の　処理　サブ・ルーチン       *
     C*-----------------------------------------------*
     C           OWARI     BEGSR
     C                     MOVE 'N'       FASENY
     C           *IN04     IFEQ '0'
     C                     MOVE 'S'       FASENY
     C                     END
     C                     WRITEGCENP301
     C                     ENDSR
