     H            Y.
     F** GCER34 **************************************
     F*   ISSUE TAG DISPLAYING DAILY SHIPMENT OF AN ADDRESS *
     F*       A-IDOTA           1987.09.16           *
     F************************************** GCER34 **
     FMB#NP01 IP  E           K        DISK
     FMB#PL01 UF  E           K        DISK
     IMB#NP011    01
     I                                              FASHN1L1
     I                                              FASHN2L1
     I                                              FASHN3L1
     C           *INL1     IFEQ '1'
     C           HNBAN     CHAINMB#PL011             02
     C           *IN02     IFEQ '1'
     C                     GOTO END
     C                     END
     C           FASENY    IFEQ 'N'
     C                     MOVE 'N'       F3SENY
     C                     UPDATMB#PL011
     C                     END
     C           FASENY    IFEQ 'S'
     C                     MOVE 'S'       F3SENY
     C                     UPDATMB#PL011
     C                     END
     C                     END
     C           END       TAG
     C*-------------合成ＫＥＹ--------------*
     C           HNBAN     KLIST
     C                     KFLD           FASHN1
     C                     KFLD           FASHN2
     C                     KFLD           FASHN3
