     H            Y.                                                      EER030
     F** GCER04 ********************************************
     F* PROCESS NAME M/F ACCOUNT BOOK CREATE                             *
     F*             M-OKUDA          1985.11.14            *
     F******************************************************
     FFCETL03 IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     C           *IN01     IFEQ '0'
     C                     SETON                     01
     C                     TIME           WTIME   60
     C                     EXCPTHD
     C                     END
     C           A6GSKD    CABEQ'D'       END
     C                     EXCPTMS
     C   OF                EXCPTHD
     C                     SETOF                     OF
     C           END       TAG
     OQPRINT  E  102           HD
     O                                  131 '+-------------------+'
     O        E  1             HD
     O                                  131 '|         |         |'
     O        E  1             HD
     O                                   88 'TIME'
     O                         WTIME Y   98
     O                                  131 '|         |         |'
     O        E  2             HD
     O                                   12 'GCER04-1 '
     O                                   25 'BY PROCESS'
     O                                   57 'PROCESS NAME '
     O                                   73 'M/F ACCOUNT BOOK'
     O                                   88 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        E  2             HD
     O                                   52 'PROCESS'
     O                                   66 'PROCESS NAME'
     O        E  1             MS
     O                         A6KOTI    50
     O                         A6KTNM    84
