     H            Y.
     F** GCER3B **************************************
     F*   ISSUE TAG DISPLAYING DAILY SHIPMENT OF AN ADDRESS *
     F*             CHECK OF DIFFERENCE              *
     F*       A-IDOTA           1987.10.15           *
     F*       H-AMANO           2003.04.09           *
     F************************************** GCER36 **
     FGCEWP3A UP  E           K        DISK
     FGCEWP31 O   F     100            DISK
     C*-----------------------------------------------*
     C*              新旧　の　チェック             *
     C*-----------------------------------------------*
     C                     SETOF                     70
     C           FBNHIN    CABEQ*BLANK    END
     C           FBCHEK    IFNE 'T'
     C                     SETON                     70
     C                     EXSR NEWW
     C                     ELSE
     C           FBOHIN    IFEQ *BLANK
     C                     EXSR NEWW
     C                     ELSE
     C           FBOTOK    IFNE FBNTOK
     C                     EXSR NEWW
     C                     GOTO END
     C                     END
     C           FBOBAR    IFNE FBNBAR
     C                     EXSR NEWW
     C                     GOTO END
     C                     END
     C           FBOHAK    IFNE FBNHAK
     C                     EXSR NEWW
     C                     GOTO END
     C                     END
     C           FBOMAI    IFNE FBNMAI
     C                     EXSR NEWW
     C                     GOTO END
     C                     END
     C           FBOSEN    IFNE FBNSEN
     C                     EXSR NEWW
     C                     GOTO END
     C                     END
     C           FBOMAX    IFNE FBNMAX
     C                     EXSR NEWW
     C                     GOTO END
     C                     END
     C                     EXSR SEFT
     C                     END
     C                     END
     C           END       TAG
     C*-----------------------------------------------*
     C*          新の出力　＆　新を旧にシフト       *
     C*-----------------------------------------------*
     C           NEWW      BEGSR
     C                     MOVE *BLANK    HBAN   14
     C                     MOVE *BLANK    TKOB    9
     C                     Z-ADD0         BARA    20
     C                     Z-ADD0         HAKO    41
     C                     MOVE *BLANK    MISU    4
     C                     Z-ADD0         TOKI    80
     C                     MOVE *BLANK    SENY    1
     C                     Z-ADD0         MAXH    40
     C                     MOVE FBNHIN    HBAN
     C                     MOVE FBNTOK    TKOB
     C                     Z-ADDFBNBAR    BARA
     C                     Z-ADDFBNHAK    HAKO
     C                     MOVE FBNMAI    MISU
     C                     Z-ADDFBNTIM    TOKI
     C                     MOVE FBNSEN    SENY
     C                     MOVE FBNMAX    MAXH
     C                     EXCPTDT
     C                     EXSR KIYC
     C                     MOVE FBNHIN    FBOHIN
     C                     MOVE FBNTOK    FBOTOK
     C                     Z-ADDFBNBAR    FBOBAR
     C                     Z-ADDFBNHAK    FBOHAK
     C                     MOVE FBNMAI    FBOMAI
     C                     Z-ADDFBNTIM    FBOTIM
     C                     MOVE FBNSEN    FBOSEN
     C                     Z-ADDFBNMAX    FBOMAX
     C                     EXSR SINC
     C           *IN70     IFEQ '1'
     C                     MOVE *BLANK    FBCHEK
     C                     END
     C                     UPDATGCEWP3A1
     C                     ENDSR
     C*-----------------------------------------------*
     C*       新を旧にシフト　サフ゛ルーチン        *
     C*-----------------------------------------------*
     C           SEFT      BEGSR
     C                     EXSR KIYC
     C                     MOVE FBNHIN    FBOHIN
     C                     MOVE FBNTOK    FBOTOK
     C                     Z-ADDFBNBAR    FBOBAR
     C                     Z-ADDFBNHAK    FBOHAK
     C                     MOVE FBNMAI    FBOMAI
     C                     Z-ADDFBNTIM    FBOTIM
     C                     MOVE FBNSEN    FBOSEN
     C                     Z-ADDFBNMAX    FBOMAX
     C                     EXSR SINC
     C                     UPDATGCEWP3A1
     C                     ENDSR
     C*-----------------------------------------------*
     C*       新のクリアー　サフ゛ルーチン          *
     C*-----------------------------------------------*
     C           SINC      BEGSR
     C                     MOVE *BLANK    FBNHIN
     C                     MOVE *BLANK    FBNTOK
     C                     Z-ADD0         FBNBAR
     C                     Z-ADD0         FBNHAK
     C                     MOVE *BLANK    FBNMAI
     C                     Z-ADD0         FBNTIM
     C                     MOVE *BLANK    FBNSEN
     C                     Z-ADD0         FBNMAX
     C                     ENDSR
     C*-----------------------------------------------*
     C*       新のクリアー　サフ゛ルーチン          *
     C*-----------------------------------------------*
     C           KIYC      BEGSR
     C                     MOVE *BLANK    FBOHIN
     C                     MOVE *BLANK    FBOTOK
     C                     Z-ADD0         FBOBAR
     C                     Z-ADD0         FBOHAK
     C                     MOVE *BLANK    FBOMAI
     C                     Z-ADD0         FBOTIM
     C                     MOVE *BLANK    FBOSEN
     C                     Z-ADD0         FBOMAX
     C                     ENDSR
     C*-----------------------------------------------*
     C*                   出力仕様                  *
     C*-----------------------------------------------*
     OGCEWP31 E                DT
     O                         HBAN      14
     O                         TKOB      23
     O                         HAKO      27
     O                         MISU      31
     O                         TOKI      39
     O                         SENY      40
     O                         BARA      42
     O                         MAXH      46
