     H            Y.
     F** GCGR41 **************************
     F* LOCATION SHIPMENT NUMBER OF BOXES DISPLAY TAG PUBLICATION *
     F*        <SETTING NUMBER AUTOMATIC HANDLING> *
     F* A-IDOTA             1996.10.07   *
     F************************** GCGR41 **
     FGCGWP13 IP  F     100            DISK
     FGCGPL40 IF  E           K        DISK
     FGCGPR40 O   E             77     PRINTER
     E                    FR1     1  10  2 0 FR2    10   フロアーコード
     IGCGWP13 AA
     I                                        1  14 SHNBAN
      *所番地*
     I                                       15  23 STOKOR
     I                                       15  15 KTKR1
     I                                       17  18 KTKR2
      *
     I                                       24  250SBAR
     I                                       26  291SHAKO
     I                                       30  32 SMISU
     I                                       33  400STOKI
     I                                       41  41 SSENY
     I                                       42  440SMAXH
     I                                       45  45 SZGN
     I                                       46  490SPAS
     I                                       50  530SBMN
      * KEY *
     C           KEY1      KLIST
     C                     KFLD           KTKR1
     C                     KFLD           KTKR2
      *---------------------------------------------------------------*
      * 初期設定                                                    *
      *---------------------------------------------------------------*
     C                     TIME           WTIME
     C                     MOVE *BLANK    @FROA
     C                     MOVE *BLANK    @TKRB
     C                     MOVE *BLANK    @HINB
     C                     MOVE *BLANK    @KUBN
     C                     Z-ADD0         @HAKOS
     C                     MOVE *BLANK    @KANSU
     C                     Z-ADD0         @ZOGEP
     C                     MOVE *BLANK    @ZOGEN
      *---------------------------------------------------------------*
      * ＭＯＶＥ                                                    *
      *---------------------------------------------------------------*
      *フロアコード*
     C                     SETOF                     30
     C           KEY1      CHAINGCGPL401             30
     C           *IN30     IFEQ '0'
     C           G4SKJY    ANDEQ'D'
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '1'
     C                     GOTO @END
     C                     END
      *
     C                     Z-ADD0         A       20
     C                     Z-ADD1         B       20
     C                     MOVELG4FRCD    A
     C                     SETOF                     30
     C           A         LOKUPFR1,B                    30
     C           *IN30     IFEQ '1'
     C                     MOVELFR2,B     @FROA
     C                     END
      *ページ替え制御*
     C           *IN01     IFEQ '0'
     C                     WRITEGCGPR401
     C                     MOVE G4FRCD    KFRCD   2
     C                     SETON                     01
     C                     END
     C           G4FRCD    IFNE KFRCD
     C                     WRITEGCGPR401
     C                     MOVE G4FRCD    KFRCD   2
     C                     END
      *
     C                     MOVELSTOKOR    @TKRB
     C                     MOVELSHNBAN    @HINB
     C           SSENY     IFEQ 'S'
     C                     MOVEL'    '    @KUBN
     C                     END
     C                     Z-ADDSHAKO     @HAKOS
     C                     MOVELSMISU     @KANSU
      *
     C                     Z-ADD0         XPAS    40
     C           SPAS      SUB  100       XPAS
     C                     Z-ADDXPAS      @ZOGEP
     C*          XPAS      IFLT 0
     C*                    MOVEL' -  '    @ZOGEN
     C*                    ELSE
     C*                    MOVEL' +  '    @ZOGEN
     C*                    END
      *
     C           SZGN      IFEQ '+'
     C                     MOVEL'    '    @ZOGEN
     C                     ELSE
     C                     MOVEL'    '    @ZOGEN
     C                     END
      *---------------------------------------------------------------*
      * 印刷処理                                                    *
      *---------------------------------------------------------------*
     C           *IN77     IFEQ '1'
     C                     WRITEGCGPR401
     C                     SETOF                     77
     C                     END
     C                     WRITEGCGPR402
      *
     C           @END      TAG
** FLOOR CODE
01 1F
02 2F
03 3F
04 5F
05 6F
06 ARRS
07 THE 7TH F
08 GOJYOGAWA
09 HOTEI
10APICS-2
