     H            Y.
     F** GCGR03 **************************************
     F*EACH FACTORY COMPLETION LOC NBR OF BOXES DISPLAY LABEL PUBLISH
     F* A-IDOTA                 1992.03.02           *
     F************************************** GCGR03 **
     FGCGWP02 IP  E           K        DISK
     FGCGPR01 O   E             77     PRINTER
     E                    KTO     1   1  8
     E                    KHK     1   1 12
     E                    KHA     1   1  8
     E**********          KKN     1   1 18
     E**********          KMI     1   1  4
     E                    TKOB        5  9
     E                    CTOK        5  8
     E                    BARA        5  2 0
     E                    CHIA        5 12
     E                    HAKO        5  5
     E                    CHAK        5  8
     E                    CKAN        5 18
     E                    MISU        5  3
     E                    CMAI        5  4
     E                    TOKI        5  8 0
     E                    MAXH        5  3 0
     E                    ZTOK        9  1
     I            DS
     I                                        1  40 CTOK
     I                                        1   8 CTOK1
     I                                        9  16 CTOK2
     I                                       17  24 CTOK3
     I                                       25  32 CTOK4
     I                                       33  40 CTOK5
     I            DS
     I                                        1  45 TKOB
     I                                        1   9 TOKOB1
     I                                       10  18 TOKOB2
     I                                       19  27 TOKOB3
     I                                       28  36 TOKOB4
     I                                       37  45 TOKOB5
     I            DS
     I                                        1  100BARA
     I                                        1   20BARA1
     I                                        3   40BARA2
     I                                        5   60BARA3
     I                                        7   80BARA4
     I                                        9  100BARA5
     I            DS
     I                                        1  60 CHIA
     I                                        1  12 CHIA1
     I                                       13  24 CHIA2
     I                                       25  36 CHIA3
     I                                       37  48 CHIA4
     I                                       49  60 CHIA5
     I            DS
     I                                        1  25 HAKO
     I                                        1   5 HAKO1
     I                                        6  10 HAKO2
     I                                       11  15 HAKO3
     I                                       16  20 HAKO4
     I                                       21  25 HAKO5
     I            DS
     I                                        1  40 CHAK
     I                                        1   8 CHAK1
     I                                        9  16 CHAK2
     I                                       17  24 CHAK3
     I                                       25  32 CHAK4
     I                                       33  40 CHAK5
     I            DS
     I                                        1  90 CKAN
     I                                        1  18 CKAN1
     I                                       19  36 CKAN2
     I                                       37  54 CKAN3
     I                                       55  72 CKAN4
     I                                       73  90 CKAN5
     I            DS
     I                                        1  15 MISU
     I                                        1   3 MISU1
     I                                        4   6 MISU2
     I                                        7   9 MISU3
     I                                       10  12 MISU4
     I                                       13  15 MISU5
     I            DS
     I                                        1  20 CMAI
     I                                        1   4 CMAI1
     I                                        5   8 CMAI2
     I                                        9  12 CMAI3
     I                                       13  16 CMAI4
     I                                       17  20 CMAI5
     I            DS
     I                                        1  400TOKI
     I                                        1   80TOKI1
     I                                        9  160TOKI2
     I                                       17  240TOKI3
     I                                       25  320TOKI4
     I                                       33  400TOKI5
     I            DS
     I                                        1  150MAXH
     I                                        1   30MAXH1
     I                                        4   60MAXH2
     I                                        7   90MAXH3
     I                                       10  120MAXH4
     I                                       13  150MAXH5
     I            DS
     I                                        1   5 HK
     I                                        1   3 HK1
     I                                        1   1 HK11
     I                                        2   2 HK12
     I                                        4   4 CNM
     I                                        5   5 HK2
     I            DS
     I                                        1   9 ZTOK
     I                                        1   9 ZZTOK
     I                                        1   1 TOK1
     I                                        2   2 TOK2
     I                                        3   3 TOK3
     I                                        4   4 TOK4
     I                                        5   5 TOK5
     I                                        6   6 TOK6
     I                                        7   7 TOK7
     I                                        8   8 TOK8
     I                                        9   9 TOK9
      *--------------------------------*
      *所番地出荷箱数表示ラベル　発行*
      *--------------------------------*
     C           *IN55     IFEQ '0'
     C                     MOVE '.'       CNM
     C                     Z-ADD1         J       10
     C                     EXSR SUB2
     C                     SETON                     5560
     C                     END
     C           *IN60     IFEQ '1'
     C                     SETOF                     60
     C                     Z-ADD1         H       20
     C           1         DO   20        H
     C                     MOVE '0'       *IN,H
     C                     END
     C                     SETOF                     505152
     C                     SETOF                     5354
     C                     END
     C                     EXSR SUB1
     C                     MOVE FBNTOK    TKOB,J
     C                     Z-ADDFBNTIM    TOKI,J
     C                     Z-ADDFBNBAR    BARA,J
     C                     Z-ADDFBNMAX    MAXH,J
      *
     C           FBNBAR    IFNE 0
     C                     Z-ADD0         BA      20
     C           10        ADD  J         BA
     C                     MOVE '1'       *IN,BA
     C                     END
      *
     C           FBNHAK    IFEQ 0
     C                     MOVE '1'       *IN,J
     C                     ADD  1         J
     C                     GOTO END
     C                     END
      *
     C           FBNSEN    IFEQ 'S'
     C                     Z-ADD0         H
     C           J         ADD  5         H
     C                     MOVE '1'       *IN,H
     C                     END
      *
     C           FBKYTU    IFEQ *BLANK
     C                     Z-ADD0         X       20
     C           J         ADD  49        X
     C                     MOVE '1'       *IN,X
     C                     END
      *
     C           FBNMAX    IFNE 0
     C           J         ADD  15        MA      20
     C                     MOVE '1'       *IN,MA
     C                     END
      *
     C                     MOVELFBNHAK    HK1
     C                     MOVE FBNHAK    HK2
     C           HK11      IFEQ '0'
     C                     MOVE *BLANK    HK11
     C           HK12      IFEQ '0'
     C                     MOVE *BLANK    HK12
     C                     END
     C                     END
     C                     MOVE HK        HAKO,J
     C*
     C*********            MOVE FBNMAI    MISU,J
     C                     ADD  1         J
     C           END       TAG
     C           J         IFEQ 6
     C                     SETON                     60
     C                     Z-ADD1         J       10
     C                     WRITEGCGPR011
     C                     EXSR SUB2
     C                     END
     C           LR        TAG
     CLR                   EXSR SUB3
      *------------------------*
      *漢字入力　サブルーチン*
      *------------------------*
     C           SUB1      BEGSR
     C                     MOVE KTO,1     CTOK,J
     C                     MOVE KHK,1     CHIA,J
     C                     MOVE KHA,1     CHAK,J
     C**********           MOVE KKN,1     CKAN,J
     C**********           MOVE KMI,1     CMAI,J
     C                     ENDSR
      *------------*
      *初期値設定*
      *------------*
     C           SUB2      BEGSR
     C                     MOVE *BLANK    TKOB
     C                     MOVE *BLANK    CTOK
     C                     Z-ADD0         BARA
     C                     MOVE *BLANK    CHIA
     C                     MOVE *BLANK    CHAK
     C                     MOVE *BLANK    CKAN
     C                     MOVE *BLANK    CMAI
     C                     MOVE *BLANK    HAKO
     C                     MOVE *BLANK    MISU
     C                     Z-ADD0         TOKI
     C                     Z-ADD0         MAXH
     C                     ENDSR
      *----------------------*
      *終了　サブ・ルーチン*
      *----------------------*
     C           SUB3      BEGSR
     C           TKOB,1    IFNE *BLANK
     C                     Z-ADD0         K       20
     C                     Z-ADD1         H
     C                     SETOF                     77
     C           1         DO   5         H
     C           TKOB,H    IFEQ *BLANK
     C                     SETON                     77
     C                     END
     C  N77                END
     C                     ADD  5         H
     C           H         DO   10        K
     C                     MOVE '0'       *IN,K
     C                     END
     C                     WRITEGCGPR011
     C                     END
     C                     ENDSR
     C**
     C*かんばん発行枚数
     C**
     C*枚
**
LOCATION
**
PER DAY BOX
**
BOX/SFT
