     H            Y.                                                      EER030
     F** GCKR21 ********************************
     F* ...  LT M/F BY DEPARTMENT UPDATE ... *
     F* I-HASADA                  85.12.14     *
     F******************************** GCKR21 **
     FGCKPL21 UF  E           K        DISK                      A
     FFGBPL01 IF  E           K        DISK
     FGCKPW21 CF  E                    WORKSTN
     E                    HBM         4  1               ﾎﾞy]
     E                    HNO         5  1               ﾉcpｬcﾑcﾍﾞ
     E                    HSK         3  2 0             ﾅbhﾓ
     E                    HNH         8  2 0             ﾉcpｬcﾆﾞf] (ﾆﾞ)
     E                    HNM         8  2 0             ﾉcpｬcﾆﾞf] (ﾎ])
     E                    WNM         8  2               ﾉcpｬcﾆﾞf] (fﾞx])
     E                    TEB     1   3  8               ﾃcﾆ]hﾎﾞ] xb
     E                    ER      1  16 60               d[ｰ xlﾈｰﾆﾞ
     I            DS
     I                                        1   80T2SKHZ
     I                                        1   40T2SKYY
     I                                        5   60T2SKMM
     I                                        7   80T2SKDD
     I*
     I            DS
     I                                        1   80T2KOHZ
     I                                        1   40T2KOYY
     I                                        5   60T2KOMM
     I                                        7   80T2KODD
     I*
     I            DS
     I                                        1   60WTIME
     I                                        1   20T2KOHH
     I                                        3   40T2KOSS
     I*
     I            DS
     I                                        1  20 T2NAMK
     I                                        2  19 WNAMK
     I*
     I            DS
     I                                        1   4 HBM
     I                                        1   4 WBMON
     I*
     I            DS
     I                                        1   5 HNO
     I                                        1   1 T2MOND
     I                                        2   2 T2TUED
     I                                        3   3 T2WEND
     I                                        4   4 T2THUD
     I                                        5   5 T2FRID
     I*
     I            DS
     I                                        1   60HSK
     I                                        1   60T2SKRU
     I                                        1   20T2SKR1
     I                                        3   40T2SKR2
     I                                        5   60T2SKR3
     I*
     I            DS
     I                                        1  160HNH
     I                                        1   20T2NHH1
     I                                        3   40T2NHH2
     I                                        5   60T2NHH3
     I                                        7   80T2NHH4
     I                                        9  100T2NHH5
     I                                       11  120T2NHH6
     I                                       13  140T2NHH7
     I                                       15  160T2NHH8
     I*
     I            DS
     I                                        1  160HNM
     I                                        1   20T2NMM1
     I                                        3   40T2NMM2
     I                                        5   60T2NMM3
     I                                        7   80T2NMM4
     I                                        9  100T2NMM5
     I                                       11  120T2NMM6
     I                                       13  140T2NMM7
     I                                       15  160T2NMM8
     I*
     I            DS
     I                                        1  16 WNM
     I                                        1   2 WNMM1
     I                                        3   4 WNMM2
     I                                        5   6 WNMM3
     I                                        7   8 WNMM4
     I                                        9  10 WNMM5
     I                                       11  12 WNMM6
     I                                       13  14 WNMM7
     I                                       15  16 WNMM8
     I*
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I*
     I            DS
     I                                        1   6 WTAIP
     I                                        1   40T2BMON
     I                                        5   5 H1
     I                                        6   6 T2TAIP
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     MOVE '-'       H1
     C*
     C*--------------------------*
     C*     ...fﾞ x ]  1 ...     *
     C*--------------------------*
     C           STP1      TAG
     C                     EXFMTGCKPW211
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     252627
     C                     SETOF                     99
     C*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C*---------------------------------*
     C*     ...ﾃcﾆ]hﾎﾞ]  ﾉ  kｩｮh...     *
     C*---------------------------------*
     C           WKOSN     IFEQ *BLANK
     C                     SETON                     0499
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
     C           WKOSN     IFNE '0'
     C           WKOSN     IFNE '1'
     C           WKOSN     IFNE '2'
     C                     SETON                     0499
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
     C                     SETON                     03
     C                     MOVE TEB,3     WNAME
     C                     GOTO STP2
     C                     END
     C                     SETON                     02
     C                     MOVE TEB,2     WNAME
     C                     GOTO STP2
     C                     END
     C                     SETON                     01
     C                     MOVE TEB,1     WNAME
     C           STP2      TAG
     C*
     C*---------------------------------*
     C*     ...ﾎﾞy]ﾃｰnﾞ  ﾉ  kｩｮh...     *
     C*---------------------------------*
     C           WBMON     IFEQ *BLANK
     C                     SETON                     0599
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     END
     C*
     C                     Z-ADD1         A       10
     C           1         DO   4         A
     C           HBM,A     IFGE '0'
     C           HBM,A     IFLE '9'
     C                     GOTO ATP1
     C                     END
     C                     END
     C                     SETON                     0599
     C                     MOVE ER,4      MSG
     C                     GOTO STP1
     C           ATP1      TAG
     C                     END
     C*
     C*---------------------------------*
     C*     ...ﾅbyhuﾇjｰ  n  kｩｮh...     *
     C*---------------------------------*
     C                     MOVE WBMON     T2BMON
     C                     SETOF                     28
     C           T2BMON    CHAINFGBPL011             28
     C   28                GOTO ATP2
     C           B2SKJY    CABNE'D'       ATP3
     C           B2SKHZ    CABGT*DATE     ATP3
     C           ATP2      TAG
     C                     SETON                     0599
     C                     MOVE ER,5      MSG
     C                     GOTO STP1
     C           ATP3      TAG
     C*
     C*--------------------------------------*
     C*     ...ﾎﾞy]ﾃｰnﾞ jbﾎﾟ  ﾉ  kｩｮh...     *
     C*--------------------------------------*
     C           T2TAIP    IFEQ *BLANK
     C                     SETON                     0699
     C                     MOVE ER,6      MSG
     C                     GOTO STP1
     C                     END
     C*
     C           KEY       KLIST
     C                     KFLD           T2BMON
     C                     KFLD           T2TAIP
     C           KEY       CHAINGCKPL211             25
     C           *IN25     IFEQ '1'
     C                     GOTO STP3
     C                     END
     C           T2SKJY    COMP 'D'                  2626
     C           *IN26     IFEQ '1'
     C                     GOTO STP3
     C                     END
     C           T2SKHZ    COMP *DATE                262727
     C           STP3      TAG
     C   01 25             GOTO STP4
     C   01N25 27          GOTO STP5
     C   02 25             GOTO STP6
     C   02N25 27          GOTO STP7
     C   03N25 26          GOTO STP8
     C                     GOTO STP9
     C           STP4      TAG
     C                     SETON                     040506
     C                     SETON                     99
     C                     MOVE ER,7      MSG
     C                     GOTO STP1
     C           STP5      TAG
     C                     SETON                     040506
     C                     SETON                     99
     C                     MOVE ER,8      MSG
     C                     GOTO STP1
     C           STP6      TAG
     C                     SETON                     040506
     C                     SETON                     99
     C                     MOVE ER,9      MSG
     C                     GOTO STP1
     C           STP7      TAG
     C                     SETON                     040506
     C                     SETON                     99
     C                     MOVE ER,10     MSG
     C                     GOTO STP1
     C           STP8      TAG
     C                     SETON                     040506
     C                     SETON                     99
     C                     MOVE ER,11     MSG
     C                     GOTO STP1
     C           STP9      TAG
     C*
     C           *IN03     IFEQ '1'
     C                     MOVE *BLANK    T2SKJY
     C                     Z-ADD0         T2SKHZ
     C                     MOVE *BLANK    T2NAMN
     C                     MOVE *BLANK    T2NAMK
     C                     MOVE *BLANK    T2MOND
     C                     MOVE *BLANK    T2TUED
     C                     MOVE *BLANK    T2WEND
     C                     MOVE *BLANK    T2THUD
     C                     MOVE *BLANK    T2FRID
     C                     Z-ADD0         T2SKRU
     C                     Z-ADD0         T2NHH1
     C                     Z-ADD0         T2NHH2
     C                     Z-ADD0         T2NHH3
     C                     Z-ADD0         T2NHH4
     C                     Z-ADD0         T2NHH5
     C                     Z-ADD0         T2NHH6
     C                     Z-ADD0         T2NHH7
     C                     Z-ADD0         T2NHH8
     C                     Z-ADD0         T2NMM1
     C                     Z-ADD0         T2NMM2
     C                     Z-ADD0         T2NMM3
     C                     Z-ADD0         T2NMM4
     C                     Z-ADD0         T2NMM5
     C                     Z-ADD0         T2NMM6
     C                     Z-ADD0         T2NMM7
     C                     Z-ADD0         T2NMM8
     C                     Z-ADD0         T2LTM1
     C                     Z-ADD0         T2LTM2
     C                     END
     C*
     C                     MOVE *BLANK    WNM
     C                     Z-ADD1         A
     C           1         DO   8         A
     C           HNH,A     IFEQ 0
     C           HNM,A     IFEQ 0
     C                     MOVE *BLANK    WNM,A
     C                     GOTO STP11
     C                     END
     C                     END
     C                     MOVE HNM,A     WNM,A
     C           STP11     TAG
     C                     END
     C*
     C*--------------------------*
     C*     ...fﾞ x ]  2 ...     *
     C*--------------------------*
     C           STP10     TAG
     C                     EXFMTGCKPW212
     C                     SETOF                     070809
     C                     SETOF                     101112
     C                     SETOF                     131417
     C                     SETOF                     181920
     C                     SETOF                     212223
     C                     SETOF                     2499
     C*
     C           *INKC     IFEQ '1'
     C                     EXSR SUBRTN
     C                     GOTO STP1
     C                     END
     C*
     C*------------------------------------*
     C*     ...f]ﾌﾞ]ﾆｬﾓbxb  ﾉ  kｩｮh...     *
     C*------------------------------------*
     C*          WNAMK     IFEQ *BLANK
     C*                    SETON                     0799
     C*                    MOVE ER,12     MSG
     C*                    GOTO STP10
     C*                    END
     C           T2NAMN    IFEQ *BLANK
     C                     SETON                     0899
     C                     MOVE ER,13     MSG
     C                     GOTO STP10
     C                     END
     C*
     C*----------------------------------*
     C*     ...ﾉcpｬcﾑcﾍﾞ  ﾉ  kｩｮh...     *
     C*----------------------------------*
     C                     Z-ADD1         A
     C                     Z-ADD8         B       20
     C           1         DO   5         A
     C                     ADD  1         B
     C           HNO,A     IFNE *BLANK
     C           HNO,A     IFNE '1'
     C                     MOVE '1'       *IN,B
     C                     SETON                     99
     C                     MOVE ER,14     MSG
     C                     GOTO STP10
     C                     END
     C                     END
     C                     END
     C*
     C*-----------------------------*
     C*     ...ﾅbhﾓ  ﾉ  kｩｮh...     *
     C*-----------------------------*
     C                     SETOF                     1528
     C                     Z-ADD1         A
     C           1         DO   3         A
     C           HSK,A     IFNE 0
     C                     SETON                     28
     C           *IN15     IFEQ '1'
     C                     SETON                     1499
     C                     MOVE ER,15     MSG
     C                     GOTO STP10
     C                     END
     C                     ELSE
     C                     SETON                     15
     C           *IN28     IFEQ '1'
     C                     SETON                     1499
     C                     MOVE ER,15     MSG
     C                     GOTO STP10
     C                     END
     C                     END
     C                     END
     C*
     C*----------------------------------*
     C*     ...ﾉcpｬcﾆﾞf]  ﾉ  kｩｮh...     *
     C*----------------------------------*
     C                     Z-ADD1         A
     C           1         DO   8         A
     C                     MOVE WNM,A     HNM,A
     C           HNH,A     IFEQ 0
     C           HNM,A     IFEQ 0
     C                     MOVE *BLANK    WNM,A
     C                     END
     C                     END
     C                     END
     C*
     C                     Z-ADD1         A
     C                     Z-ADD16        B
     C           1         DO   8         A
     C                     ADD  1         B
     C           HNH,A     IFLE 23
     C           HNM,A     IFLE 59
     C                     GOTO ATP5
     C                     END
     C                     END
     C                     MOVE '1'       *IN,B
     C                     SETON                     99
     C                     MOVE ER,16     MSG
     C                     GOTO STP10
     C           ATP5      TAG
     C                     END
     C*
     C           *INKE     IFEQ '0'
     C                     GOTO STP10
     C                     END
     C*
     C                     MOVE WNAME     ZNAME
     C                     MOVE WBMON     ZBMON
     C                     MOVE T2TAIP    ZTAIP
     C                     Z-ADD*DATE     T2KOHZ
     C                     TIME           WTIME
     C                     MOVELUS        T2KOME
     C           *IN01     IFEQ '1'
     C                     MOVE 'D'       T2SKJY
     C                     Z-ADD*DATE     T2SKHZ
     C                     END
     C           *IN25     IFEQ '1'
     C                     WRITEGCKPL211
     C                     ELSE
     C                     UPDATGCKPL211
     C                     END
     C                     EXSR SUBRTN
     C                     GOTO STP1
     C*
     C*---------------------------------*
     C*       ...ﾅ ﾎﾞ ﾓ ｰ k ]...        *
     C*     ...fﾞ x ] 1  ﾉ  hﾒaｰ...     *
     C*---------------------------------*
     C           SUBRTN    BEGSR
     C                     MOVE *BLANK    WKOSN
     C                     MOVE *BLANK    WBMON
     C                     MOVE *BLANK    T2TAIP
     C                     ENDSR
**  TEB
0-CANCEL
1-CHANGE
2-ADD
**  ER
E-01 UPDATE INSTRUCTION ISN'T INPUT
E-02 UPDATE INSTRUCTION IS ERROR < 0=CANCEL.1=CHANGE.2=ADD >
E-03 DEPARTMENT CODE ISN'T INPUT
E-04 DEPARTMENT CODE INTO NUMBER
E-05 THERE IS NOT DEPARTMENT CODE IN DETAILS M/F
E-06 DEPARTMENT CODE TYPE ISN'T INPUT
E-07 CANCEL WAS APPOINTED, BUT THERE IS NOT IT IN M/F
E-08 CANCEL WAS APPOINTED, BUT M/F IS CANCELLED ALREADY
E-09 CHANGE WAS APPOINTED, BUT THERE IS NOT IT IN M/F
E-10 CHANGE WAS APPOINTED, BUT M/F IS CANCELLED ALREADY
E-11 ADD WAS APPOINTED, BUT THERE IS NOT IT IN M/F
E-12 KANBAN KIND(KANJI) ISN'T INPUT
E-13 KANBAN KIND(KANA) ISN'T INPUT
E-14 DELIVERY DAY IN A WEEK IS ERROR < BLANK.1 >
E-15 INPUT CYCLE ALL
E-16 THE DELIVERY THAT REVERSING(TIME MINUTES) IS NOT RIGHT
