     H            Y.
     F** GCQR91 *********************
     F* USA DIE NO LIST
     F*                             *
     F* S.YAMAGAMI 1996.01.15 *
     F********************* GCQR91 **
     FGCQWP90 IP  F      50            DISK
     FGCQPL13 IF  E           K        DISK
     FGCAPL01 IF  E           K        DISK
     FGCQWP91 O   F     100            DISK
     I*
     IGCQWP90 AA  01
     I                                        1  15 IFKATAL1
     I                                        1   2 IKAT1
     I                                        4   7 IKAT2
     I                                        9   9 IKAT3
     I                                       16  20 IFSHN1
     I                                       21  25 IFSHN2
     I                                       26  27 IFSHN3
     I                                       28  350ISRYO
     I            DS
     I                                        1   7 T6TKRO
     I                                        1   1 T6TKR1
     I                                        2   3 T6TKR2
     I                                        4   5 T6TKR3
     I                                        6   6 T6TKR4
     I                                        7   7 T6TKR5
     C*
     C           *INL1     IFEQ '1'
     C                     SETON                     88
     C                     Z-ADD0         OSRYO   90
     C                     END
     C*
     C                     ADD  ISRYO     OSRYO
     C*
     CL1 88                EXSR SUB1
     C*****************************************************************
     C* SUB1 (型xｰfｰ・型所番地・収容数)
     C*****************************************************************
     C           SUB1      BEGSR
     C*
     C                     SETOF                     50
     C                     Z-ADD0         OKOCD   40
     C                     MOVE *BLANK    OTKRO   7
     C                     Z-ADD0         OSYOS   30
     C*
     C           KEY1      KLIST
     C                     KFLD           IKAT1
     C                     KFLD           IKAT2
     C                     KFLD           IKAT3
     C*
     C           KEY1      SETLLGCQPL131
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEGCQPL131                 10
     C           *IN10     IFEQ '0'
     C           T6SKJY    IFEQ *BLANK
     C           T6KOCD    IFNE 0000
     C*
     C           T6KOCD    IFNE OKOCD
     C           T6TKRO    ORNE OTKRO
     C                     Z-ADDT6KOCD    OKOCD
     C                     MOVE T6TKRO    OTKRO
     C                     Z-ADDT6SYOS    OSYOS
     C                     EXSR SUB2
     C                     SETON                     50
     C                     EXCPTDT
     C                     END
     C*
     C                     END
     C                     END
     C                     END
     C  N10                ENDDO
     C*
     C           *IN50     IFEQ '0'
     C                     Z-ADD0         OKOCD
     C                     MOVE *BLANK    OTKRO
     C                     Z-ADD0         OSYOS
     C                     Z-ADD0         OTANK
     C                     EXCPTDT
     C                     END
     C*
     C                     ENDSR
     C*****************************************************************
     C* SUB2 (単価)
     C*****************************************************************
     C           SUB2      BEGSR
     C*
     C                     Z-ADD0         OTANK   70
     C*
     C           KEY2      KLIST
     C                     KFLD           IKAT1
     C                     KFLD           IKAT2
     C                     KFLD           IKAT3
     C                     KFLD           OKOCD
     C*
     C           KEY2      SETLLGCAPL011
     C                     DO   *HIVAL
     C                     SETOF                     20
     C           KEY2      READEGCAPL011                 20
     C           *IN20     IFEQ '0'
     C           XASKJY    IFNE 'D'
     C                     Z-ADDXATANK    OTANK
     C                     SETON                     20
     C                     END
     C                     END
     C  N20                ENDDO
     C*
     C                     ENDSR
      *
     OGCQWP91 E                DT
     O                         IFKATA    15
     O                         OTANK     22
     O                         OKOCD     26
     O                         OTKRO     33
     O                         OSYOS     36
     O                         OSRYO     45
