     H            Y.                                                      EER050
     F** GCQR80 ***********************************
     F*３桁数値→２桁文字変換          　　   *
     F*        MSK          2004.12.01            *
     F********************************** GCQR80  **
     E                    CD1    36  36  1
     E                    CD2    26  26  1
      *------------------------------------------------------*
      * PARAMETER                                            *
      *------------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PINUM   3
     C                     PARM           POCHR   2
      *
      *---------*
      * MAIN    *
      *---------*
      *
     C                     MOVELPINUM     WKNUM   30
     C           WKNUM     SUB  100       WKNUM
     C           WKNUM     DIV  26        X       30
     C                     MVR            Y       30
     C                     ADD  1         X
     C                     MOVELCD1,X     POCHR
     C                     ADD  1         Y
     C                     MOVE CD2,Y     POCHR
      *
     C                     SETON                     LR
     C                     RETRN
      *
** CD1
0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ
** CD2
ABCDEFGHIJKLMNOPQRSTUVWXYZ
