     H            Y.
     F** GCQR3Y *******************************************************
     F* DIE ALLOTMENT M/F SELECTIVE UPDATE
     F*       Y.MAEDA              2020.05.20               *
     F*  型構成マスター対応         2020.10.27                      *
     F******************************************************* GCQR3Y **
     FGCQWP3Y IP  E           K        DISK
     FCCQWP4Y IF  E           K        DISK
     FCCQWP4Z IF  E           K        DISK
     FGCQWL3Z IF  E           K        DISK                      A
     FWK400L1 UF  E           K        DISK                      A
     FWK420L1 UF  E           K        DISK                      A
      *----------------------------------------------------------------
      *<<システム情報>>
     I           SDS
     I                                     *PROGRAM @@PGM
     I                                      244 253 @@WSID
     I                                      254 263 @@USER
     I                                      264 269 @@JBNO
      *<<日付／時刻>>
     I            DS
     I                                        1  140W@TIME
     I                                        1   60W@HMS
     I                                        7  140W@YMD
      *
     I            DS
     I                                        1  20 CYBKEY
     I                                        1   5 CYSHN1
     I                                        6  10 CYSHN2
     I                                       11  12 CYSHN3
     I                                       13  20 CYHKNO
      *
     I            DS
     I                                        1  20 W@BKEY
     I                                        1   5 W@SHN1
     I                                        6  10 W@SHN2
     I                                       11  12 W@SHN3
     I                                       13  20 W@HKNO
      *----------------------------------------------------------------
      *KEY
     C           KEY1      KLIST
     C                     KFLD           CYSHN1
     C                     KFLD           CYSHN2
     C                     KFLD           CYSHN3
     C                     KFLD           CYHKNO
     C                     KFLD           CYKOTI
     C                     KFLD           CYKSEI
     C                     KFLD           CYKAT1
     C                     KFLD           CYKAT2
      *
     C           YZKEY1    KLIST
     C                     KFLD           K#SHN1  5
     C                     KFLD           K#SHN2  5
     C                     KFLD           K#SHN3  2
     C                     KFLD           K#HKNO  8
      *
     C           KXKEY1    KLIST
     C                     KFLD           K#OKT1  2
     C                     KFLD           K#OKT2  4
      *----------------------------------------------------------------
     C           *IN82     IFEQ '0'
     C                     TIME           W@TIME
     C                     MOVEL*BLANK    W@BKEY
     C                     SETON                     82
     C                     ENDIF
      *MAIN
     C                     SETOF                     81
     C           KEY1      CHAINGCQWL3Z              81
     C           *IN81     IFEQ '1'
     C                     CLEARGCQWL3Z1
     C                     MOVELCYSKJY    C1SKJY
     C                     Z-ADDCYSKYY    C1SKYY
     C                     Z-ADDCYSKMM    C1SKMM
     C                     Z-ADDCYSKDD    C1SKDD
     C                     Z-ADDCYKOYY    C1KOYY
     C                     Z-ADDCYKOMM    C1KOMM
     C                     Z-ADDCYKODD    C1KODD
     C                     Z-ADDCYKOHH    C1KOHH
     C                     Z-ADDCYKOSS    C1KOSS
     C                     MOVELCYKOME    C1KOME
     C                     MOVELCYSHN1    C1SHN1
     C                     MOVELCYSHN2    C1SHN2
     C                     MOVELCYSHN3    C1SHN3
     C                     MOVELCYKOTI    C1KOTI
     C                     Z-ADDCYKSEI    C1KSEI
     C                     MOVELCYKAT1    C1KAT1
     C                     MOVELCYKAT2    C1KAT2
     C                     MOVELCYSPKB    C1SPKB
     C                     Z-ADDCYKOSU    C1KOSU
     C                     MOVELCYKUBN    C1KUBN
     C                     MOVELCYKSKB    C1KSKB
     C                     MOVELCYYKIR    C1YKIR
     C                     MOVELCYYKIR    C1YKIR
     C                     MOVELCYCD01    C1CD01
     C                     MOVELCYHKNO    C1HKNO
     C                     Z-ADDCYHKYY    C1HKYY
     C                     Z-ADDCYHKMM    C1HKMM
     C                     Z-ADDCYHKDD    C1HKDD
     C                     Z-ADDCYHKJI    C1HKJI
     C                     Z-ADDCYHKFN    C1HKFN
     C                     Z-ADDCYHKBY    C1HKBY
     C                     MOVELCYBIKO    C1BIKO
     C                     MOVELCYFLG1    C1FLG1
     C                     MOVELCYFLG2    C1FLG2
     C                     MOVELCYFLG3    C1FLG3
     C                     MOVELCYFLG4    C1FLG4
     C                     MOVELCYKTBN    C1KTBN
     C                     WRITEGCQWL3Z1
     C                     END
      *<<転送用ワークから工場型構成マスター差替え用ファイルへ>>
     C           CYBKEY    IFNE W@BKEY
     C                     EXSR #DBO10
      *<<転送用ワークから工場型部品使用ファイル差替え用へ>>
     C                     EXSR #DBO20
     C                     MOVELCYBKEY    W@BKEY
     C                     ENDIF
      *----------------------------------------------------------------
      *差替え転送用ワークから型構成マスター工場用の更新
      *----------------------------------------------------------------
     C           #DBO10    BEGSR
      *<<型構成マスター工場用の更新>>
     C                     MOVELCYSHN1    K#SHN1
     C                     MOVELCYSHN2    K#SHN2
     C                     MOVELCYSHN3    K#SHN3
     C                     MOVELCYHKNO    K#HKNO
     C           YZKEY1    SETLLCCQWP4Y1
     C           YZKEY1    READECCQWP4Y1                 90
     C           *IN90     IFEQ '0'
      *  <<型構成マスター工場用削除>>
     C                     MOVELY1OKT1    K#OKT1
     C                     MOVELY1OKT2    K#OKT2
     C           KXKEY1    SETLLWK400L11
     C           KXKEY1    READEWK400L11                 91
     C           *IN91     DOWEQ'0'
     C                     DELETWK400L11
     C           KXKEY1    READEWK400L11                 91
     C                     ENDDO
      *  <<工場型構成マスター差替え用ファイル>>
     C                     MOVELCYSHN1    K#SHN1
     C                     MOVELCYSHN2    K#SHN2
     C                     MOVELCYSHN3    K#SHN3
     C                     MOVELCYHKNO    K#HKNO
     C           YZKEY1    SETLLCCQWP4Y1
     C           YZKEY1    READECCQWP4Y1                 92
     C           *IN92     DOWEQ'0'
      *    <<型構成マスター工場用作成>>
     C                     CLEARWK400L11
     C                     Z-ADDW@YMD     K4CRHZ
     C                     Z-ADDW@HMS     K4CRTI
     C                     MOVEL@@USER    K4CRNA
     C                     MOVEL@@PGM     K4CRPG
     C                     MOVELY1OKT1    K4OKT1
     C                     MOVELY1OKT2    K4OKT2
     C                     MOVELY1SPKB    K4SPKB
     C                     Z-ADDY1SEQN    K4SEQN
     C                     MOVELY1KKT1    K4KKT1
     C                     MOVELY1KKT2    K4KKT2
     C                     MOVELY1KSPK    K4KSPK
     C                     MOVELY1OYAK    K4OYAK
     C                     Z-ADDY1KOSU    K4KOSU
     C                     WRITEWK400L11
      *
     C           YZKEY1    READECCQWP4Y1                 92
     C                     ENDDO
      *
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------------------
      *差替え転送用ワークから型部品使用工場ファイル工場用の更新
      *----------------------------------------------------------------
     C           #DBO20    BEGSR
      *<<型部品使用工場ファイル工場用の更新>>
     C                     MOVELCYSHN1    K#SHN1
     C                     MOVELCYSHN2    K#SHN2
     C                     MOVELCYSHN3    K#SHN3
     C                     MOVELCYHKNO    K#HKNO
     C           YZKEY1    SETLLCCQWP4Z1
     C           YZKEY1    READECCQWP4Z1                 90
     C           *IN90     IFEQ '0'
      *  <<型構成マスター工場用削除>>
     C                     MOVELZ1OKT1    K#OKT1
     C                     MOVELZ1OKT2    K#OKT2
     C           KXKEY1    SETLLWK420L11
     C           KXKEY1    READEWK420L11                 91
     C           *IN91     DOWEQ'0'
     C                     DELETWK420L11
     C           KXKEY1    READEWK420L11                 91
     C                     ENDDO
      *  <<工場型構成マスター差替え用ファイル>>
     C                     MOVELCYSHN1    K#SHN1
     C                     MOVELCYSHN2    K#SHN2
     C                     MOVELCYSHN3    K#SHN3
     C                     MOVELCYHKNO    K#HKNO
     C           YZKEY1    SETLLCCQWP4Z1
     C           YZKEY1    READECCQWP4Z1                 92
     C           *IN92     DOWEQ'0'
      *    <<型構成マスター工場用作成>>
     C                     CLEARWK420L11
     C                     Z-ADDW@YMD     K2CRHZ
     C                     Z-ADDW@HMS     K2CRTI
     C                     MOVEL@@USER    K2CRNA
     C                     MOVEL@@PGM     K2CRPG
     C                     MOVELZ1OKT1    K2OKT1
     C                     MOVELZ1OKT2    K2OKT2
     C                     MOVELZ1SPKB    K2SPKB
     C                     MOVELZ1KKT1    K2KAT1
     C                     MOVELZ1KKT2    K2KAT2
     C                     MOVELZ1KSPK    K2KSPK
     C                     MOVELZ1KOJY    K2KOJY
     C                     MOVELZ1BIK2    K2BIKO
     C                     MOVELZ1KTBN    K2KTBN
     C                     WRITEWK420L11
      *
     C           YZKEY1    READECCQWP4Z1                 92
     C                     ENDDO
      *
     C                     ENDIF
      *
     C                     ENDSR
