     H            Y.
     F** GCQR85 *******************************************************
     F*  DIE SETTING# INQUIRY ( SPECIFY CONDITIONS )                  *
     F*----------+-----+---------+------------------------------------*
     F*2022.05.12|TEC. |T.MITSUI | 22047  INITIAL VERSION.            *
     F******************************************************* GCQR85 **
     F*          FILE DEFINE                              *
     F*****************************************************
     F*==< SPECIFY CONDITIONS SCREEN >==*
     FGCQPW85 CF  E                    WORKSTN
     F*
     F*==< SALES TOTALIZATION FILE >==*
     FMBEPL05 IF  E           K        DISK
     F*
     E*****************************************************
     E*          ARRAY DEFINE                             *
     E*****************************************************
     E                    @MSG    1   5 60
     E                    @SR        12  9 0
     E                    @SM        12 11 0
     E*
     I*****************************************************
     I*          DATA STRACTURE DEFINE                    *
     I*****************************************************
     I*==< SYSTEM INF. >==*
     I           SDS
     I                                     *PROGRAM @@PGM
     I                                      244 253 @@WSID
     I                                      254 263 @@USER
     I                                      264 269 @@JBNO
     I            DS
     I                                    P   1  600@SR
     I                                    P   1   50I6SRO1
     I                                    P   6  100I6SRO2
     I                                    P  11  150I6SRO3
     I                                    P  16  200I6SRO4
     I                                    P  21  250I6SRO5
     I                                    P  26  300I6SRO6
     I                                    P  31  350I6SRO7
     I                                    P  36  400I6SRO8
     I                                    P  41  450I6SRO9
     I                                    P  46  500I6SROA
     I                                    P  51  550I6SROB
     I                                    P  56  600I6SROC
     I*==< WORK >==*
     I            DS
     I                                        1  140S@TIME
     I                                        1   60S@HMS
     I                                        7  140S@YMD
     I                                        7  120S@DTYM
     I            DS
     I                                        1   8 W@DARA
     I                                        1   60W@BASE
     I                                        1   40W@BDYY
     I                                        5   60W@BDMM
     I*
     C*****************************************************
     C*          PARM LIST                                *
     C*****************************************************
     C           *ENTRY    PLIST
     C                     PARM           P@DARA  8
     C                     PARM           P@BASE  60
     C                     PARM           P@EXTR  1
     C                     PARM           P@DISP  1
     C                     PARM           P@COND  2
     C*
     C*****************************************************
     C*          WORKING ITEM                             *
     C*****************************************************
     C                     MOVEL'EDT1'    S@PROC  4         PROCESS CONTROL
     C                     MOVEL*BLANK    F@MB02  1
     C                     Z-ADD*ZERO     M       30
     C*
     C*****************************************************
     C*          MAIN ROUTINE                             *
     C*****************************************************
     C*
D----C           S@PROC    DOWNE'EXIT'
|    C*
|S---C                     SELEC
|+---C           S@PROC    WHEQ 'EDT1'
||   C                     EXSR #EDT1
||   C*
|+---C           S@PROC    WHEQ 'DSP1'
||   C                     EXSR #DSP1
||   C*
|+---C           S@PROC    WHEQ 'CHK1'
||   C                     EXSR #CHK1
|E---C                     ENDSL
|    C*
E----C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C*****************************************************
     C*  #EDT1   SCREEN INITIALIZE                        *
     C*****************************************************
     C           #EDT1     BEGSR
     C*
     C                     TIME           S@TIME
     C                     MOVELP@DARA    W@DARA
     C                     MOVEL'0'       F@MB02
     C                     Z-ADD*ZERO     @SM
     C*                    ____________
     C           W@BDYY    SETLLMBEPL05
     C           W@BDYY    READEMBEPL05                  91
     C*                    ~~~~~~~~~~~~
D----C           *IN91     DOWEQ'0'
|    C                     ADD  @SR       @SM
|    C*                    ____________
|    C           W@BDYY    READEMBEPL05                  91
|    C*                    ~~~~~~~~~~~~
E----C                     ENDDO
     C*
     C                     Z-ADDW@BDMM    M
     C*
I----C           @SM,M     DOWEQ*ZERO
|    C           F@MB02    ANDEQ'0'
|    C                     SUB  1         W@BDMM
|    C*
|I---C           W@BDMM    IFLT 1
||   C                     ADD  12        W@BDMM
||   C                     SUB  1         W@BDYY
||   C                     Z-ADD*ZERO     @SM
||   C*                    ____________
||   C           W@BDYY    SETLLMBEPL05
||   C           W@BDYY    READEMBEPL05                  91
||   C*                    ~~~~~~~~~~~~
||I--C           *IN91     IFEQ '0'
|||D-C           *IN91     DOWEQ'0'
|||| C                     ADD  @SR       @SM
|||| C*                    ____________
|||| C           W@BDYY    READEMBEPL05                  91
|||| C*                    ~~~~~~~~~~~~
|||E-C                     ENDDO
|||  C*
||+--C                     ELSE
|||  C                     MOVEL'1'       F@MB02
||E--C                     ENDIF
|E---C                     ENDIF
|    C*
|    C                     Z-ADDW@BDMM    M
E----C                     ENDDO
     C*
     C                     Z-ADDW@BASE    #1BASE
     C                     MOVEL*BLANK    #1EXTR            EXTRACTION
     C                     MOVEL*BLANK    #1DISP            DISPLAY ORDER
     C                     MOVEL*BLANK    #1EMSG
     C                     SETOF                     313299
     C*
     C*==< NEXT >==*
     C                     MOVEL'DSP1'    S@PROC
     C*
     C           #EDT1E    ENDSR
     C*****************************************************
     C*  #DEP1   SCREEN DISPLAY                           *
     C*****************************************************
     C           #DSP1     BEGSR
     C*                    _____________
     C                     EXFMTGCQPW851
     C*                    ~~~~~~~~~~~~~
     C*==< NEXT >==*
S----C                     SELEC
+----C           *IN01     WHEQ '1'                        < F1 >
|    C                     Z-ADD*ZERO     P@BASE
|    C                     MOVEL*BLANK    P@EXTR
|    C                     MOVEL*BLANK    P@DISP
|    C                     MOVEL'01'      P@COND
|    C                     MOVEL'EXIT'    S@PROC
|    C*
+----C                     OTHER                           < CTRL >
|    C                     MOVEL'CHK1'    S@PROC
E----C                     ENDSL
     C*
     C           #DSP1E    ENDSR
     C*****************************************************
     C*  #CHK1   SCREEN INPUT CHECK                       *
     C*****************************************************
     C           #CHK1     BEGSR
     C*
     C                     MOVEL*BLANK    #1EMSG
     C                     SETOF                     313299
     C*
     C*==< EXTRACTION >==*
S----C                     SELEC
+----C           #1EXTR    WHEQ *BLANK
|    C  N99                MOVEL@MSG,1    #1EMSG
|    C                     SETON                     3199
|    C*
+----C           #1EXTR    WHEQ '1'
+----C           #1EXTR    WHEQ '2'
+----C           #1EXTR    WHEQ '3'
|    C*
+----C                     OTHER
|    C  N99                MOVEL@MSG,2    #1EMSG
|    C                     SETON                     3199
E----C                     ENDSL
     C*
     C*==< DISPLAY ORDER >==*
S----C                     SELEC
+----C           #1DISP    WHEQ *BLANK
|    C  N99                MOVEL@MSG,1    #1EMSG
|    C                     SETON                     3299
|    C*
+----C           #1DISP    WHEQ '1'
+----C           #1DISP    WHEQ '2'
+----C           #1DISP    WHEQ '3'
|    C*
+----C                     OTHER
|    C  N99                MOVEL@MSG,2    #1EMSG
|    C                     SETON                     3299
E----C                     ENDSL
     C*
     C*==< NEXT >==*
I----C           *IN99     IFEQ '0'
|    C                     Z-ADD#1BASE    P@BASE
|    C                     MOVEL#1EXTR    P@EXTR
|    C                     MOVEL#1DISP    P@DISP
|    C                     MOVEL'00'      P@COND
|    C                     MOVEL'EXIT'    S@PROC
|    C*
+----C                     ELSE
|    C                     MOVEL'DSP1'    S@PROC
E----C                     ENDIF
     C*
     C           $CHK1E    ENDSR
     C*
----+-*--1----+----2----+----3----+----4----+----5----+----6----+----7
** @MSG
E-01 REQUIRED FIELD.
E-02 THE VALUE ENTERED IS INCORRECT.



