     H            Y.
     F** GCQR86 *******************************************************
     F*  DIE SETTING# INQUIRY ( DIE INFORMATION DATA CREATE - 1 )     *
     F*----------+-----+---------+------------------------------------*
     F*2022.05.12|TEC. |T.MITSUI | 22047  INITIAL VERSION.            *
     F******************************************************* GCQR86 **
     F*          FILE DEFINE                              *
     F*****************************************************
     F*==< DIE KANBAN M/F >==*
     FGCQPL14 IF  E           K        DISK
     F*
     F*==< DIE OUTGOING DATA >==*
     FECSPL07 IF  E           K        DISK
     F*
     F*==< DIE INVENTORY FILE >==*
     FECSPL10 IF  E           K        DISK
     F*
     F*==< DIE ALLOTMENT M/F >==*
     FGCQTL31 IF  E           K        DISK
     F*
     F*
     F*==< DIE INFORMATION DATA (1) >==*
     FGCQWP86 O   E                    DISK
     F*
     E*****************************************************
     E*          ARRAY DEFINE                             *
     E*****************************************************
     E                    #YYM        6  6 0
     E                    @YYM        6  6 0             GCQWP86
     E                    @KOS        6  5 0             GCQWP86
     E*
     I*****************************************************
     I*          DATA STRACTURE DEFINE                    *
     I*****************************************************
     I*==< SYSTEM INF. >==*
     I           SDS
     I                                     *PROGRAM @@PGM
     I                                      244 253 @@WSID
     I                                      254 263 @@USER
     I                                      264 269 @@JBNO
     I*==< GCQTL31 >==*
     I            DS
     I                                        1  12 DFSHN@
     I                                        1   5 DFSHN1
     I                                        6  10 DFSHN2
     I                                       11  12 DFSHN3
     I*==< GCQWP86 >==*
     I            DS
     I                                        1  360@YYM
     I                                        1   60W1YYM5
     I                                        7  120W1YYM4
     I                                       13  180W1YYM3
     I                                       19  240W1YYM2
     I                                       25  300W1YYM1
     I                                       31  360W1YYM0
     I            DS
     I                                    P   1  180@KOS
     I                                    P   1   30W1KOS5
     I                                    P   4   60W1KOS4
     I                                    P   7   90W1KOS3
     I                                    P  10  120W1KOS2
     I                                    P  13  150W1KOS1
     I                                    P  16  180W1KOS0
     I*==< WORK >==*
     I            DS
     I                                        1  140S@TIME
     I                                        1   60S@HMS
     I                                        7  140S@YMD
     I            DS
     I                                        1   60W@DTYM
     I                                        1   40W@DTYY
     I                                        5   60W@DTMM
     I            DS
     I                                        1  15 K@KATA
     I                                        1   2 K@KAT1
     I                                        3   3 K@KATH
     I                                        4   7 K@KAT2
     I            DS
     I                                        1  12 W@SHN@
     I                                        1   5 W@SHN1
     I                                        6  10 W@SHN2
     I                                       11  12 W@SHN3
     I*
     C*****************************************************
     C*          PARM LIST                                *
     C*****************************************************
     C           *ENTRY    PLIST
     C                     PARM           P@BASE  60
     C                     PARM           P@EXTR  1
     C                     PARM           P@DISP  1
     C*
     C*****************************************************
     C*          KEY LIST                                 *
     C*****************************************************
     C*==< GCQPL14 : DIE KANBAN M/F >==*
     C           K@CQ14    KLIST
     C                     KFLD           K@KAT1  2         DIE NO.1
     C                     KFLD           K@KAT2  4         DIE NO.2
     C                     KFLD           K@KAT3  1         ADD NUMBER
     C*
     C*==< ECSPL07 : DIE OUTGOING DATA >==*
     C           K@EC07    KLIST
     C                     KFLD           K@KAT1            DIE NO.1
     C                     KFLD           K@KAT2            DIE NO.2
     C                     KFLD           K@YOYY  40
     C                     KFLD           K@YOMM  20
     C*
     C*==< ECSPL10 : DIE INVENTORY FILE >==*
     C           K@EC10    KLIST
     C                     KFLD           K@KAT1            DIE NO.1
     C                     KFLD           K@KAT2            DIE NO.2
     C*
     C*==< GCQTL31 : DIE ALLOTMENT M/F >==*
     C           K@CQ31    KLIST
     C                     KFLD           K@KATA            DIE NO
     C*
     C*****************************************************
     C*          MAIN ROUTINE                             *
     C*****************************************************
     C                     EXSR #INIT
     C*
     C                     MOVEL*LOVAL    K@KAT1            DIE NO.1
     C                     MOVEL*LOVAL    K@KAT2            DIE NO.2
     C                     MOVEL*LOVAL    K@KAT3            DIE NO.3
     C*                    ____________
     C           K@CQ14    SETLLGCQPL14
     C                     READ GCQPL14                  91
     C*                    ~~~~~~~~~~~~
D----C           *IN91     DOWEQ'0'
|    C                     MOVELT6KAT1    K@KAT1            DIE NO.1
|    C                     MOVELT6KAT2    K@KAT2            DIE NO.2
|    C                     MOVEL*BLANK    K@KAT3            ADD NUMBER
|    C*                    ____________
|    C           K@CQ14    SETLLGCQPL14
|    C                     EXSR #CQ14
|    C*                    ~~~~~~~~~~~~
|I---C           *IN91     IFEQ '0'
||   C                     EXSR #DINF
|E---C                     ENDIF
|    C*
|    C*        ( NEXT DIE )
|    C                     MOVELT6KAT1    K@KAT1            DIE NO.1
|    C                     MOVELT6KAT2    K@KAT2            DIE NO.2
|    C                     MOVEL*HIVAL    K@KAT3            ADD NUMBER
|    C*                    ____________
|    C           K@CQ14    SETGTGCQPL14
|    C                     READ GCQPL14                  91
|    C*                    ~~~~~~~~~~~~
E----C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C*===================================================*
     C*  #CQ14   GCQPL14 READ                             *
     C*===================================================*
     C           #CQ14     BEGSR
     C*
     C           #CQ141    TAG
     C*                    ____________
     C           K@CQ14    READEGCQPL14                  91
     C*                    ~~~~~~~~~~~~
     C           *IN91     CABEQ'1'       #CQ14E
     C*
     C*==< SKIP >==*
I----C           T6SKJY    IFEQ 'D'
|    C           T6SKHZ    ANDLES@YMD
|    C                     GOTO #CQ141
E----C                     ENDIF
     C*
     C           #CQ14E    ENDSR
     C*****************************************************
     C*  #INIT   INITIAL PROCESS                          *
     C*****************************************************
     C           #INIT     BEGSR
     C*
     C                     TIME           S@TIME
     C*
     C*==< MONTHS AND YEARS BEFORE 6 MONTHS >==*
     C                     Z-ADD*ZERO     #YYM
     C                     Z-ADDP@BASE    W@DTYM
     C                     Z-ADD6         J       30
     C*
D----C           J         DOWGE1
|    C                     Z-ADDW@DTYM    #YYM,J
|    C*
|    C                     SUB  1         W@DTMM
|I---C           W@DTMM    IFLT 1
||   C                     ADD  12        W@DTMM
||   C                     SUB  1         W@DTYY
|E---C                     ENDIF
|    C*
|    C                     SUB  1         J
E----C                     ENDDO
     C*
     C           #INITE    ENDSR
     C*****************************************************
     C*  #DINF   DIE INFORMATION                          *
     C*****************************************************
     C           #DINF     BEGSR
     C*
     C*==< DIE NUMBER >==*
     C                     CLEARGCQWP861
     C                     MOVELT6KAT1    W1KAT1
     C                     MOVELT6KAT2    W1KAT2
     C                     Z-ADDT6LTIM    W1LTIM
     C                     Z-ADDT6SYOS    W1SYOS
     C                     Z-ADDT6SRYO    W1SRYO
     C                     Z-ADDT6MAIS    W1MAIS
     C*
     C*==< DIE OUTGOING >==*
     C                     Z-ADD1         J
D----C           J         DOWLE6
|    C                     Z-ADD#YYM,J    @YYM,J
|    C*
|    C           @YYM,J    DIV  100       K@YOYY
|    C                     Z-ADD@YYM,J    K@YOMM
|    C*                    ____________
|    C           K@EC07    SETLLECSPL07
|    C           K@EC07    READEECSPL07                  92
|    C*                    ~~~~~~~~~~~~
|D---C           *IN92     DOWEQ'0'
||   C                     ADD  EQKOSU    @KOS,J
||   C*                    ____________
||   C           K@EC07    READEECSPL07                  92
||   C*                    ~~~~~~~~~~~~
|E---C                     ENDDO
|    C*
|    C                     ADD  1         J
E----C                     ENDDO
     C*
     C*==< DIE CURRENT INVENTORY >==*
     C*                    ____________
     C           K@EC10    SETLLECSPL10
     C           K@EC10    READEECSPL10                  93
     C*                    ~~~~~~~~~~~~
D----C           *IN93     DOWEQ'0'
|I---C           E1SKJY    IFEQ 'D'
||   C           E1SDAT    ANDLES@YMD
||   C*
|+---C                     ELSE
||   C                     ADD  E1SQTY    W1SQTY
|E---C                     ENDIF
|    C*                    ____________
|    C           K@EC10    READEECSPL10                  93
|    C*                    ~~~~~~~~~~~~
E----C                     ENDDO
     C*
     C*==< DIE ALLOTMENT >==*
     C                     MOVEL*BLANK    K@KATA
     C                     MOVELT6KAT1    K@KAT1
     C                     MOVEL'-'       K@KATH
     C                     MOVELT6KAT2    K@KAT2
     C*                    ____________
     C           K@CQ31    SETLLGCQTL31
     C           K@CQ31    READEGCQTL31                  94
     C*                    ~~~~~~~~~~~~
D----C           *IN94     DOWEQ'0'
|    C                     MOVELDFSHN@    W@SHN@
|    C                     MOVEL'0'       F@WRIT  1
|    C*
|D---C           *IN94     DOWEQ'0'
||   C           DFSHN@    ANDEQW@SHN@
||I--C           DFSKJY    IFEQ 'D'
|||  C           DFSKHZ    ANDLES@YMD                                  )
|||  C*
||+--C                     ELSE
|||  C                     MOVEL'1'       F@WRIT
||E--C                     ENDIF
||   C*                    ____________
||   C           K@CQ31    READEGCQTL31                  94
||   C*                    ~~~~~~~~~~~~
|E---C                     ENDDO
|    C*
|I---C           F@WRIT    IFEQ '1'
||   C                     MOVELW@SHN1    W1SHN1
||   C                     MOVELW@SHN2    W1SHN2
||   C                     MOVELW@SHN3    W1SHN3
||   C*                    _____________
||   C                     WRITEGCQWP861
||   C*                    ~~~~~~~~~~~~~
|E---C                     ENDIF
E----C                     ENDDO
     C*
     C           #DINFE    ENDSR
     C*
