     H            Y.
     F** GADR13 ********************************
     F* .. DIE ALOT M/F MAKER UPDATE LOG
     F*   TCH 1/11/05                          *
     F*                                        *
     F******************************** GADR13 **
     FGCQWP11 UP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TAB1    1   3  1   TAB2   10
      *-------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *-------------------------------------------------
     C           WWPRNT    CABNE*BLANK    @END
      *
     C                     MOVE '1'       WWPRNT
     C                     UPDATGCQWP111
     C                     SETON                     U1
      *
     C           WWTRAN    LOKUPTAB1      TAB2           10
      *
     C  N98
     COR OF                EXCPT@HED
     C  N98                MOVE *ON       *IN98
      *
     C                     EXCPT@DTL
      *
     C           @END      TAG
      *
      *-------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O        E   02           @HED
     O                                   25 'TO ACCOUNTING DEPARTMENT'
     O        E   03           @HED
     O                                   50 'DIE ALOT M/F UPDATE LOG'
     O        E   05           @HED
     O                                   11 'DATE'
     O                                   16 'PROC'
     O                                   36 'COMPT  '
     O                                   51 'DIE #   '
     O                                   57 'NAME'
     O                                   67 'COUNT'
     O        E 1              @DTL
     O                         WWDATE    10 '    /  /  '
     O                         WWPROC    16
     O                         WWCOMP    36
     O                         WWDIE#    48
     O                         WWNAME    59
     O                         WWCONT    67
     O                       10TAB2      85
      *
** TAB1/TAB2
0DELETED
1UPDATED
2ADDED
