     H            Y.
     F** GCQR3Z *********************************************
     F* DIE ALLOTMENT M/F SELECTIVE UPDATE                  *
     F*       Y.MAEDA              2020.05.19               *
     F********************************************* GCQR3Z **
     FGCQPW3Z CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
      * DIE ALLOTMENT M/F SELECTIVE UPDATE FILE
     FGCQWP3Z UF  E           K        DISK
      *
      * .. PART INFORMATION M/F   *.
     FFCEPL01 IF  E           K        DISK
      *
      * DIE ALLOTMENT M/F
     FGCQPL31 UF  E           K        DISK                      A
      *================================================================
     E                    ER      1   6 60
      *================================================================
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1   80C1SKHZ
     I                                        1   40C1SKYY
     I                                        5   60C1SKMM
     I                                        7   80C1SKDD
      *
     I            DS
     I                                        1   80C1HKHZ
     I                                        1   40C1HKYY
     I                                        5   60C1HKMM
     I                                        7   80C1HKDD
      *
     I            DS
     I                                        1   40C1HKTM
     I                                        1   20C1HKJI
     I                                        3   40C1HKFN
      *
     I            DS
     I                                        1   80DFSKHZ
     I                                        1   40DFSKYY
     I                                        5   60DFSKMM
     I                                        7   80DFSKDD
      *
     I            DS
     I                                        1   80HYMD8
     I                                        1   40HYY
     I                                        5   60HMM
     I                                        7   80HDD
      *
     I            DS
     I                                        1   60TIME
     I                                        1   20TIMEH
     I                                        3   40TIMEF
      *
     I            DS
     I                                        1   60WKDATE
     I                                        1   20WKYY
     I                                        3   40WKMM
     I                                        5   60WKDD
      *
     I            DS
     I                                        1   80W@DATE
     I                                        1   40W@KYY
     I                                        5   60W@KMM
     I                                        7   80W@KDD
      *
     I            DS
     I                                        1  14 @SHN
     I                                        1   5 @SHN1
     I                                        6   6 WKF1
     I                                        7  11 @SHN2
     I                                       12  12 WKF2
     I                                       13  14 @SHN3
      *
      *
     I           SDS
     I                                      254 263 @@USER
      *
     I            DS
     I                                        1  15 #KKATA
     I                                        1   2 K$KAT1
     I                                        3   3 K$HF1
     I                                        4   7 K$KAT2
     I                                        8   8 K$HF2
     I                                        9   9 K$KAT3
      *================================================================
     C           *ENTRY    PLIST
     C                     PARM           P@SHN1  5
     C                     PARM           P@SHN2  5
     C                     PARM           P@SHN3  2
      *================================================================
      *  KEY LIST                                          *
      *================================================================
     C           KEYC11    KLIST
     C                     KFLD           #KSHN1  5
     C                     KFLD           #KSHN2  5
     C                     KFLD           #KSHN3  2
      *
     C           KEYC12    KLIST
     C                     KFLD           #KDHN1  5
     C                     KFLD           #KDHN2  5
     C                     KFLD           #KDHN3  2
     C                     KFLD           #KDKNO  8
     C                     KFLD           #KDKYY  40
     C                     KFLD           #KDKMM  20
     C                     KFLD           #KDKDD  20
     C                     KFLD           #KDKJI  20
     C                     KFLD           #KDKFN  20
      *
      *
     C           KEYC22    KLIST
     C                     KFLD           #KSHN1  5
     C                     KFLD           #KSHN2  5
     C                     KFLD           #KSHN3  2
     C                     KFLD           #KKOTI  3
     C                     KFLD           #KKSEI  20
     C                     KFLD           #KKATA 15
      *
     C           KEYEA1    KLIST
     C                     KFLD           #KSHN1  5
     C                     KFLD           #KSHN2  5
     C                     KFLD           #KSHN3  2
     C                     KFLD           #KSEHI  1
      *
      * FOR SAVF
     C           KEYSV1    KLIST
     C                     KFLD           #SSHN1  5
     C                     KFLD           #SSHN2  5
     C                     KFLD           #SSHN3  2
     C                     KFLD           #SHKNO  8
      *================================================================
      *  MAIN                                              *
      *================================================================
     C                     EXSR $SB100
     C           *IN01     DOWEQ'0'
     C                     EXSR $SB200
     C                     END
     C                     EXSR $SB300
      *================================================================
      *  INITIALIZE                                        *
      *================================================================
     CSR         $SB100    BEGSR
     C                     MOVE *BLANK    DSPSW1  1
     C                     MOVE *BLANK    DSPSW2  1
     C                     MOVE *BLANK    DSPSW3  1
      *
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR $SB410                     SFLCLR
      *
     C                     Z-ADD*DATE     HYMD8
     C                     TIME           TIME
      *
     C                     MOVE '1'       DSPSW1
     C                     MOVE '0'       DSPSW2
     C                     MOVE '0'       DSPSW3
      *
     C           P@SHN1    IFEQ *BLANK
     C           P@SHN2    ANDEQ*BLANK
     C           P@SHN3    ANDEQ*BLANK
     C                     ELSE
     C                     MOVELP@SHN1    @SHN1
     C                     MOVELP@SHN2    @SHN2
     C                     MOVELP@SHN3    @SHN3
     C                     ENDIF
      *
     CSR         $S100E    ENDSR
      *================================================================
      *  MAIN PROCESS                                      *
      *================================================================
     CSR         $SB200    BEGSR
      *
     C           *IN01     DOWEQ'0'
     C           DSPSW1    ANDEQ'1'
     C                     EXSR $SB210
     C                     END
      * DETAIL
     C           *IN03     DOWEQ'0'
     C           *IN05     ANDEQ'0'
     C           DSPSW2    ANDEQ'1'
     C                     EXSR $SB220
     C                     END
     CSR         $S200E    ENDSR
      *================================================================
      *  DSP01     (GCQPW3Z1)                              *
      *================================================================
     CSR         $SB210    BEGSR
      *********************
     C           P@SHN1    IFEQ *BLANK
     C           P@SHN2    ANDEQ*BLANK
     C           P@SHN3    ANDEQ*BLANK
     C                     ELSE
     C                     GOTO $SKIP
     C                     ENDIF
      *********************
      *
     C                     EXFMTGCQPW3Z1
     C                     SETOF                     313299
     C                     SETOF                     33
     C                     MOVE *BLANK    @ERR
      * F3
     C           *IN03     IFEQ '1'
     C                     SETON                     01
     C                     GOTO $S210E
     C                     END
      *
      * INPUT CHECK
      *
     C           @SHN1     IFEQ *BLANK
     C           @SHN2     ANDEQ*BLANK
     C           @SHN3     ANDEQ*BLANK
     C                     SETON                     993133
     C                     MOVELER,6      @ERR
     C                     GOTO $S210E
     C                     END
      *-------------------------*
     C           $SKIP     TAG
      *-------------------------*
     C                     MOVE @SHN1     #KSHN1
     C                     MOVE @SHN2     #KSHN2
     C                     MOVE @SHN3     #KSHN3
     C                     MOVE 'S'       #KSEHI
     C                     MOVEL*BLANK    @HNMI
      *
     C                     SETOF                       21
     C           KEYC11    CHAINFCEPL01              21
     C           *IN21     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                       21
     C                     ENDIF
      *
     C  N21                MOVELA2SMEI    @HNMI
      *
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR $SB410                     SFLCLR
      *
     C           KEYC11    SETLLGCQWP3Z
     C                     SETOF                     8166
      *
      *--------------------
     C                     DO   *HIVAL
     C                     EXSR $SB400
     C  N81N66             END
      *--------------------
      *
S1   C           CTRX      IFEQ 0
     C                     SETON                     31
     C                     SETON                     99
 S2  C           @1HKNO    IFNE *BLANK
     C                     SETON                     32
 E2  C                     ENDIF
     C**
  S3 C           P@SHN1    IFEQ *BLANK
     C           P@SHN2    ANDEQ*BLANK
     C           P@SHN3    ANDEQ*BLANK
     C                     MOVEL*BLANK    P@SHN2
     C                     MOVEL*BLANK    P@SHN3
     C                     MOVELER,3      @ERR
     C                     EXSR $SB410                     SFLCLR
     C                     GOTO $S210E
  X3 C                     ELSE
     C                     SETON                     01
     C                     GOTO $S210E
  E3 C                     ENDIF
     C**
E1   C                     ENDIF
      * NEXTポイントセット
     C                     EXSR $SB900
      *
     C                     MOVE '0'       DSPSW1
     C                     MOVE '1'       DSPSW2
      *
     C                     MOVE '-'       WKF1
     C                     MOVE '-'       WKF2
     C           @SHN3     IFEQ *BLANK
     C                     MOVE ' '       WKF2
     C                     END
     C                     SETOF                       05
      *
     CSR         $S210E    ENDSR
      *================================================================
      *   DSP02         (SFL.GCQPW3Z9)                    *
      *================================================================
     CSR         $SB220    BEGSR
      *
     C                     SETON                     70
     C                     WRITEGCQPW3Z9
     C                     EXFMTSFLCTL
     C                     SETOF                     70
     C                     SETOF                     3399
     C                     MOVEL*BLANK    @ERR
      * CMD-3
     C           *IN03     IFEQ '1'
     C                     EXSR $SB410                     SFLCLR
     C                     SETOF                       03
     C                     MOVE '0'       DSPSW2
     C                     MOVE '1'       DSPSW1
     C                     CLEARGCQPW3Z1
     C*********************
     C           P@SHN1    IFEQ *BLANK
     C           P@SHN2    ANDEQ*BLANK
     C           P@SHN3    ANDEQ*BLANK
     C                     ELSE
     C                     SETON                     0103
     C                     ENDIF
     C*********************
     C                     GOTO $S220E
     C                     END
      *--------------------*
      *  SFL CHECHK        *
      *--------------------*
     C                     Z-ADD1         X       20
     C                     MOVE *BLANK    $@SEL   1
      *-------------------------
S1   C                     DO   *HIVAL    X
     C                     SETOF                     25
     C           X         CHAINSFL                  25
     C   25                LEAVE
     C*
 S2  C           @SEL      IFNE *BLANK
     C           @SEL      ANDNE'1'
     C           @SEL      ANDNE'A'
     C           @SEL      ANDNE'B'
     C           @SEL      ANDNE'C'
     C           @SEL      ANDNE'D'
     C                     SETON                     3399
     C                     SETOF                     05
     C                     MOVELER,4      @ERR
 E2  C                     ENDIF
     C*
 S2  C           @SEL      IFEQ '1'
     C           $@SEL     ANDNE*BLANK
     C                     SETON                     3399
     C                     SETOF                     05
     C                     MOVELER,4      @ERR
 E2  C                     ENDIF
     C*
 S2  C           @SEL      IFEQ '1'
     C                     EXSR $SB800
     C   99                SETON                     33
     C   99                SETOF                     05
 E2  C                     ENDIF
     C*
     C           @SEL      IFNE *BLANK
     C                     MOVE @SEL      $@SEL
     C                     ENDIF
     C*
     C           @FLG2     COMP '2'                      39
     C                     UPDATSFL
     C                     SETOF                     33
E1   C  N99                ENDDO
      *-------------------------
     C      99             GOTO $S220E
      *-------------------*
      * ROLLDOWN          *
      *-------------------*
S1   C           *IN52     IFEQ '1'
     C                     ADD  1         CTRX
     C* 1ST. PAGE
 S2  C           WKPAGE    IFEQ 1
     C                     GOTO $S220E
 E2  C                     END
     C*
 S2  C           *IN81     IFEQ '1'
     C                     SETOF                     81
     C           KEYC11    SETGTGCQWP3Z
 E2  C                     END
     C*
     C                     ADD  13        CTRX
     C                     SETOF                     6627
     C*
 S2  C                     DO   *HIVAL
     C                     EXSR $SB401                     <REDPE>
 E2  C  N81N27             ENDDO
     C*
     C                     Z-ADD0         CTRX    40
     C*
 S2  C           *IN81     IFEQ '1'
     C           KEYC11    SETLLGCQWP3Z
 E2  C                     END
     C*
     C                     EXSR $SB410                     SFLCLR
     C*
     C                     SETOF                     6681
 S2  C                     DO   *HIVAL
     C                     EXSR $SB400
 E2  C  N81N66             ENDDO
     C*
     C                     EXSR $SB900
     C                     SUB  1         WKPAGE
     C                     GOTO $S220E
E1   C                     END
      *--------------------*
      * ROLL-UP            *
      *--------------------*
S1   C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
     C*
     C                     EXSR $SB410                     SFLCLR
     C                     SETOF                     6681
     C*
 S2  C                     DO   *HIVAL
     C                     EXSR $SB400
 E2  C  N81N66             ENDDO
     C*
     C                     EXSR $SB900
     C                     ADD  1         WKPAGE
     C                     GOTO $S220E
E1   C                     END
      *
      *
      *
      * < F5 >
      *
S1   C           *IN05     IFEQ '1'
     C*  保留
 S2  C           $@SEL     IFEQ 'A'
     C           $@SEL     OREQ 'B'
     C           $@SEL     OREQ 'C'
     C           $@SEL     OREQ 'D'
     C                     EXSR #HOLD
     C                     MOVE '0'       DSPSW2
     C                     MOVE '1'       DSPSW1
     C                     GOTO $S220E
 E2  C                     ENDIF
     C*
     C                     EXSR $SB500
     C*
     C                     EXSR $SB520
     C*
     C                     EXSR $SB510
     C*
     C                     SETOF                       05
     C                     MOVE '0'       DSPSW2
     C                     MOVE '1'       DSPSW1
     C                     CLEARGCQPW3Z1
     C*
E1   C                     ENDIF
      *
     CSR         $S220E    ENDSR
      *================================================================
      *   END PROCESS                                      *
      *================================================================
     CSR         $SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         $S300E    ENDSR
      *================================================================
      *   FIND INQ DATA                                    *
      *================================================================
     CSR         $SB400    BEGSR
     C*
     C           KEYC11    READEGCQWP3Z                  81
     C*
     C                     SETOF                     67
     C                     MOVE '0'       GETFLG  1
S1   C           *IN81     IFEQ '0'
     C           C1SKJY    ANDEQ'D'
     C           C1SKHZ    ANDLE*DATE
     C                     SETON                     67
E1   C                     END
      *
S1   C           *IN81     IFEQ '0'
     C           *IN67     ANDEQ'0'
     C                     MOVE '1'       GETFLG
 S2  C           @1HKNO    IFNE *BLANK
     C           @1HKNO    ANDNEC1HKNO
     C                     MOVE '0'       GETFLG
 E2  C                     ENDIF
     C*
 S2  C           C1FLG1    IFEQ *BLANK
     C           GETFLG    ANDEQ'1'
     C                     EXSR $SB499
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     ADD  1         CTRX
     C                     WRITESFL
 E2  C                     ENDIF
     C*
E1   C                     ENDIF
      *
     C           CTRX      IFEQ 13
     C                     SETON                       66
     C                     ENDIF
      *
     CSR         $S400E    ENDSR
      *================================================================
      *   READ FILE                                        *
      *================================================================
     CSR         $SB401    BEGSR
     C                     SETOF                       27
     C                     DO   *HIVAL
     C           KEYC11    REDPEGCQWP3Z                  81
     C                     SETOF                     67
     C                     MOVE '0'       GETFLG
     C           *IN81     IFEQ '0'
     C           C1SKJY    ANDEQ'D'
     C           C1SKHZ    ANDLE*DATE
     C                     SETON                     67
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN67     ANDEQ'0'
      *
     C                     MOVE '1'       GETFLG
     C           @1HKNO    IFNE *BLANK
     C           @1HKNO    ANDNEC1HKNO
     C                     MOVE '0'       GETFLG
     C                     END
      *
     C           C1FLG1    IFEQ *BLANK
     C           GETFLG    ANDEQ'1'
     C                     SUB  1         CTRX           27
     C                     END
      *
     C                     END
      *
     C  N27N81             ENDDO
     CSR         $S401E    ENDSR
      *================================================================
      *   DSP CLEAR
      *================================================================
     CSR         $SB410    BEGSR
      *
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     SETOF                     7166
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN    40
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
      *
     CSR         $S410E    ENDSR
      *================================================================
      *  EDIT                                              *
      *================================================================
     CSR         $SB499    BEGSR
      *
     C                     MOVE C1HKNO    @HKNO
     C                     MOVE C1HKHZ    @HKHZ
     C                     MOVE C1HKTM    @HKTM
     C                     MOVELC1BIKO    @BIKO
     C                     MOVE C1KAT1    @KAT1
     C                     MOVE C1KAT2    @KAT2
     C*----                MOVE C1SPKB    @SPKB
     C                     MOVEL*BLANK    @SPKB
     C                     MOVE *BLANK    @SEL
      *
     C                     MOVE C1FLG2    @FLG2
     C                     MOVE *BLANK    @TEXT
     C                     SELEC
     C           C1FLG2    WHEQ '2'
     C                     MOVEL'*CHANGED'@TEXT
     C           C1FLG2    WHEQ 'A'
     C                     MOVEL'*HOLD(A)'@TEXT
     C           C1FLG2    WHEQ 'B'
     C                     MOVEL'*HOLD(B)'@TEXT
     C           C1FLG2    WHEQ 'C'
     C                     MOVEL'*HOLD(C)'@TEXT
     C           C1FLG2    WHEQ 'D'
     C                     MOVEL'*HOLD(D)'@TEXT
     C                     ENDSL
      *
     C           @FLG2     COMP '2'                      39
      *
     CSR         $S499E    ENDSR
      *================================================================
      *  DIE ALLOTMENT M/F DELETE                          *
      *================================================================
     CSR         $SB500    BEGSR
     C*
     C                     MOVE @SHN1     #KSHN1  5
     C                     MOVE @SHN2     #KSHN2  5
     C                     MOVE @SHN3     #KSHN3  2
     C           KEYC11    SETLLGCQPL31
     C                     SETOF                       29
      *-------------------------
S1   C                     DO   *HIVAL
     C           KEYC11    READEGCQPL31                  29
     C   29                LEAVE
 S2  C           DFSKJY    IFEQ 'D'
     C           DFSKHZ    ANDLE*DATE
     C                     ITER
 E2  C                     ENDIF
     C*
     C                     MOVE 'D'       DFSKJY
     C                     Z-ADDHYY       DFSKYY
     C                     Z-ADDHMM       DFSKMM
     C                     Z-ADDHDD       DFSKDD
     C                     MOVEL@@USER    DFKOME
     C                     UPDATGCQPL311
     C*
E1   C                     ENDDO
      *-------------------------
     CSR         $S500E    ENDSR
      *================================================================
      *   DELETE GCQWP3Z
      *================================================================
     CSR         $SB510    BEGSR
      *
     C                     SETOF                     29
     C                     Z-ADD1         X       20
      *-------------------------
S1   C                     DO   *HIVAL    X
     C                     SETOF                     25
     C           X         CHAINSFL                  25
     C   25                LEAVE
     C*
 S2  C           @SEL      IFEQ '1'
     C                     SETON                     29
     C                     MOVE @SHN1     #KSHN1  5
     C                     MOVE @SHN2     #KSHN2  5
     C                     MOVE @SHN3     #KSHN3  2
     C                     SETOF                       23
     C           KEYC11    SETLLGCQWP3Z
     C*--------------------
  S3 C                     DO   *HIVAL
     C           KEYC11    READEGCQWP3Z                  23
     C   23                LEAVE
  S4 C           C1HKNO    IFLE @HKNO
     C**        *          MOVE 'D'       C1SKJY
     C                     Z-ADDHYY       C1KOYY
     C                     Z-ADDHMM       C1KOMM
     C                     Z-ADDHDD       C1KODD
     C                     MOVEL@@USER    C1KOME
     C                     MOVE '2'       C1FLG2           処理済
     C                     UPDATGCQWP3Z1
  E4 C                     ENDIF
  E3 C                     ENDDO
     C*--------------------
      *
 E2  C                     END
E1   C  N29                ENDDO
      *-------------------------
      *
     CSR         $S510E    ENDSR
      *================================================================
      *  DIE ALLOTMENT M/F UPDATE                          *
      *================================================================
     CSR         $SB520    BEGSR
      *
     C                     SETOF                     29
     C                     Z-ADD1         X       20
      *-------------------------
S1   C                     DO   *HIVAL    X
     C                     SETOF                     25
     C           X         CHAINSFL                  25
     C   25                LEAVE
     C*
 S2  C           @SEL      IFEQ '1'
     C                     MOVE @SHN1     #KDHN1  5
     C                     MOVE @SHN2     #KDHN2  5
     C                     MOVE @SHN3     #KDHN3  2
     C                     MOVE @HKNO     #KDKNO  8
     C                     Z-ADD@HKHZ     W@DATE
     C                     MOVE W@KYY     #KDKYY  40
     C                     MOVE W@KMM     #KDKMM  20
     C                     MOVE W@KDD     #KDKDD  20
     C                     MOVEL@HKTM     #KDKJI  20
     C                     MOVE @HKTM     #KDKFN  20
     C                     SETOF                       24
     C           KEYC12    SETLLGCQWP3Z
     C*--------------------
  S3 C                     DO   *HIVAL
     C           KEYC12    READEGCQWP3Z                  24
     C   24                LEAVE
  S4 C**       * C1FLG1    IFNE '2'
  S4 C           C1FLG2    IFNE '2'                        2=処理済
     C           C1FLG4    ANDNE'1'
     C*
     C                     MOVE @SHN1     #KSHN1  5
     C                     MOVE @SHN2     #KSHN2  5
     C                     MOVE @SHN3     #KSHN3  2
     C*
     C                     MOVE *BLANK    #KKATA
     C                     MOVE C1KAT1    K$KAT1
     C                     MOVE C1KAT2    K$KAT2
     C*--                  MOVE C1SPKB    K$KAT3
     C                     MOVEL*BLANK    K$KAT3
     C                     MOVE '-'       K$HF1
     C                     MOVE '-'       K$HF2
     C           K$KAT3    IFEQ *BLANK
     C                     MOVE ' '       K$HF2
     C                     ENDIF
     C*
     C                     MOVELC1KOTI    #KKOTI
     C                     Z-ADDC1KSEI    #KKSEI  20
     C                     SETON                       29
     C                     SETOF                       23
     C**
     C           KEYC22    CHAINGCQPL31              23
     C*
  S5 C           *IN23     IFEQ '0'
     C                     CLEARGCQPL311
     C                     EXSR $SB599
     C                     UPDATGCQPL311
  X5 C                     ELSE
     C                     CLEARGCQPL311
     C                     EXSR $SB599
     C                     WRITEGCQPL311
  E5 C                     ENDIF
     C**
     C*                **  MOVE '2'       C1FLG1
     C                     MOVE '2'       C1FLG2           処理済
     C                     UPDATGCQWP3Z1
  E4 C                     ENDIF
  E3 C                     ENDDO
     C*--------------------
 E2  C                     END
E1   C  N29                ENDDO
      *-------------------------
     CSR         $S520E    ENDSR
      *================================================================
      *  DIE ALLOTMENT M/F EDIT
      *================================================================
     CSR         $SB599    BEGSR
     C                     Z-ADDHYY       DFKOYY
     C                     Z-ADDHMM       DFKOMM
     C                     Z-ADDHDD       DFKODD
     C                     Z-ADDTIMEH     DFKOHH
     C                     Z-ADDTIMEF     DFKOSS
     C                     MOVEL@@USER    DFKOME
     C*                 ** MOVEL'GCQR3Z'  DFPGMN
     C                     MOVE C1SHN1    DFSHN1
     C                     MOVE C1SHN2    DFSHN2
     C                     MOVE C1SHN3    DFSHN3
     C                     MOVE C1KOTI    DFKOTI
     C                     MOVE C1KSEI    DFKSEI
     C*
     C                     MOVE #KKATA    DFKATA
     C*
     C                     Z-ADDC1KOSU    DFKOSU
     C                     MOVE C1KUBN    DFKUBN
     C                     MOVE C1KSKB    DFKSKB
     CSR         $S599E    ENDSR
      *================================================================
      *  DUPLICATE CHECK                                   *
      *================================================================
     CSR         $SB800    BEGSR
      *
     C           X         ADD  1         Y       20
      *-------------------------
     C                     DO   *HIVAL
     C                     SETOF                     26
     C           Y         CHAINSFL                  26
     C   26                LEAVE
      *
     C*        * @SEL      IFEQ '1'
     C           @SEL      IFNE ' '
     C                     MOVELER,5      @ERR
     C                     SETON                     99
     C                     END
     C*
     C  N99                ADD  1         Y
     C*
     C  N99                ENDDO
      *-------------------------
     CSR         $S800E    ENDSR
      *================================================================
      *  NEXT POINTER SET                                  *
      *================================================================
     CSR         $SB900    BEGSR
      *
     C                     SETOF                       6864
     C                     SETOF                       2526
      *-------------------------
S1   C                     DO   *HIVAL
     C           KEYC11    READEGCQWP3Z                  81
     C*
     C                     MOVE '0'       GETFLG
     C                     SETOF                       67
 S2  C           *IN81     IFEQ '0'
     C           C1SKJY    ANDEQ'D'
     C           C1SKHZ    ANDLE*DATE
     C                     SETON                       67
 E2  C                     ENDIF
     C*
 S2  C           *IN81     IFEQ '0'
     C           *IN67     ANDEQ'0'
     C                     MOVE '1'       GETFLG
  S3 C           @1HKNO    IFNE *BLANK
     C           @1HKNO    ANDNEC1HKNO
     C                     MOVE '0'       GETFLG
  E3 C                     ENDIF
     C*
  S3 C           C1FLG1    IFEQ *BLANK
     C           GETFLG    ANDEQ'1'
     C                     MOVE C1SHN1    #SSHN1  5
     C                     MOVE C1SHN2    #SSHN2  5
     C                     MOVE C1SHN3    #SSHN3  2
     C                     MOVE C1HKNO    #SHKNO  8
     C                     SETON                       68
  E3 C                     ENDIF
 E2  C                     ENDIF
     C*
E1   C  N81N68             ENDDO
      *-------------------------
      *
     C           *IN68     IFEQ '1'
     C           KEYSV1    SETLLGCQWP3Z
     C                     END
      *
     CSR         $S900E    ENDSR
      *================================================================
      *         保留
      *================================================================
     C           #HOLD     BEGSR
      *
     C                     SETOF                     29
     C                     Z-ADD1         X       20
      *-------------------------
S1   C                     DO   *HIVAL    X
     C                     SETOF                     25
     C           X         CHAINSFL                  25
     C   25                LEAVE
     C*
 S2  C           @SEL      IFEQ 'A'
     C           @SEL      OREQ 'B'
     C           @SEL      OREQ 'C'
     C           @SEL      OREQ 'D'
     C                     MOVE @SHN1     #KDHN1  5
     C                     MOVE @SHN2     #KDHN2  5
     C                     MOVE @SHN3     #KDHN3  2
     C                     MOVE @HKNO     #KDKNO  8
     C                     Z-ADD@HKHZ     W@DATE
     C                     MOVE W@KYY     #KDKYY  40
     C                     MOVE W@KMM     #KDKMM  20
     C                     MOVE W@KDD     #KDKDD  20
     C                     MOVEL@HKTM     #KDKJI  20
     C                     MOVE @HKTM     #KDKFN  20
     C                     SETOF                       24
     C           KEYC12    SETLLGCQWP3Z
     C*--------------------
  S3 C                     DO   *HIVAL
     C           KEYC12    READEGCQWP3Z                  24
     C   24                LEAVE
  S4 C           C1FLG1    IFEQ ' '
     C           C1FLG2    ANDNE'2'                        2=処理済
     C*
     C                     MOVE @SEL      C1FLG2           保留
     C                     UPDATGCQWP3Z1
  E4 C                     ENDIF
  E3 C                     ENDDO
     C*--------------------
 E2  C                     END
E1   C                     ENDDO
      *-------------------------
     C                     ENDSR
      *================================================================
      *================================================================
**
ER-1 INPUT PART NO
ER-2 PART NO IS INCORRECT
ER-3 THERE ARE NO DATA
ER-4 SELECT NO IS INCORRECT
ER-5 SELECT NO IS INCORRECT
ER-6 PLEASE ENTER EITHER
