     H            Y.
     F** GCQR46 ************************************
     F*   DIE KANBAN M/F UPDATE                    *
     F*       MSK.KUNIEDA           98.06.18       *
     F*
     F*       TCH.AMANO             03.03.20
     F*       TCH.AMANO             03.11.19
     F*
     F* TCHK1 02/26/08 BUGFIX
     F* 14-610 2015/04/17 ITS. T.MITSUI L/T 25->50
     F* 14-480 2015/04/21 ITS. T.MITSUI超鋼・最低2->1
     F*        2015/07/07 ITS. T.MITSUI L/T 50->42
     F* 15-315 2015/12/08 ITS. T.MITSUI型かんばん設定式の変更
     F*        2017/09/01 ITS. T.MITSUI端数切上げ計算+0.9999化
     F************************************ GCQR46 **
     FGCQPW46 CF  E                    WORKSTN
     FGCQPL11 UF  E           K        DISK                      A
     FGCQPL12 IF  E           K        DISK
     FFCQPL31 IF  E           K        DISK
     FGCQPL36 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAABPL01 IF  E           K        DISK
     FGCKPL21 IF  E           K        DISK
     FAACPL01 IF  E           K        DISK
     E                    $MSG    1  25 60               ERR MSG
     E                    $CMT    1   3 10
     E                    $TYU    1  21  2
      *
     I            DS
     I                                        1   9 @KATA
     I                                        1   2 @KAT1
     I                                        3   3 @K1
     I                                        4   7 @KAT2
     I                                        8   8 @K2
     I                                        9   9 @KAT3
     I            DS
     I                                        1   80@TUHZ
     I                                        1   40@TUHY
     I                                        5   60@TUHM
     I                                        7   80@TUHD
     I            DS
     I                                        1   80@HAHZ
     I                                        1   40@HAHY
     I                                        5   60@HAHM
     I                                        7   80@HAHD
     I            DS
     I                                        1   80@KIHZ
     I                                        1   40@KIHY
     I                                        5   60@KIHM
     I                                        7   80@KIHD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80WKHYMD
     I                                        1   40WKHY
     I                                        5   60WKHM
     I                                        7   80WKHD
     I            DS
     I                                        1   60TIME
     I                                        1   20TIMHH
     I                                        3   40TIMSS
     I                                        5   60TIMSE
     I            DS
     I                                        1  11 @TKRO
     I                                        1   1 @TKR1
     I                                        2   2 @TK1
     I                                        3   4 @TKR2
     I                                        5   5 @TK2
     I                                        6   7 @TKR3
     I                                        8   8 @TK3
     I                                        9   9 @TKR4
     I                                       10  10 @TK4
     I                                       11  11 @TKR5
     I            DS
     I                                        1   9 LOC
     I                                        1   1 T6TKR1
     I I            '-'                       2   2 T1
     I                                        3   4 T6TKR2
     I I            '-'                       5   5 T2
     I                                        6   7 T6TKR3
     I I            '-'                       8   8 T3
     I                                        9   9 T6TKR4
     I            DS
     I                                        1  15 ##KATA
     I                                        1   2 ##KAT1
     I                                        3   3 ##HN
     I                                        4   7 ##KAT2
      *------ INDICATOR OR SWITCH USAGED ------------------*
      * DSPSW1     '1'  GCQPW461    ACTIVE                 *
      * DSPSW2     '1'  GCQPW462    ACTIVE                 *
      * *IN81      '1'  GCQPL11     NOT FOUND OR AT END    *
      *                                                    *
      *----------------------------------------------------*
      *  PARAMETER  TRANSFER                               *
      *----------------------------------------------------*
      *
     C           *ENTRY    PLIST
     C                     PARM           USER   10
      *-------------------*
      *  KEY LIST         *
      *-------------------*
     C           KEYT61    KLIST
     C                     KFLD           #KTKR1  1
     C                     KFLD           #KTKR2  2
     C                     KFLD           #KTKR3  2
     C                     KFLD           #KTKR4  1
     C                     KFLD           #KTKR5  1
     C                     KFLD           #KKAT1  2
     C                     KFLD           #KKAT2  4
     C                     KFLD           #KKAT3  1
     C                     KFLD           #KKOCD  40
      *
     C           KEYQ41    KLIST
     C                     KFLD           #KKAT1
     C                     KFLD           #KKAT2
      *
     C           KEYA41    KLIST
     C                     KFLD           #KSETI  20
      *
     C           KEYT21    KLIST
     C                     KFLD           #KBMON  40
     C                     KFLD           #KTAIP  1
      *
     C           K#12      KLIST
     C                     KFLD           @KAT1
     C                     KFLD           @KAT2
     C                     KFLD           @KAT3
     C           K#11      KLIST
     C                     KFLD           @TKR1
     C                     KFLD           @TKR2
     C                     KFLD           @TKR3
     C                     KFLD           @TKR4
      *
     C                     MOVE '-'       @TK1
     C                     MOVE '-'       @TK2
     C                     MOVE '-'       @TK3
     C                     MOVE '-'       @TK4
      *
      *----------------------------------------------------*
      *   MAIN ROUTINE                                     *
      *----------------------------------------------------*
     C                     EXSR $SB100
     C           *IN01     DOWEQ'0'
     C                     EXSR $SB200
     C                     END
     C                     EXSR $SB300
      *
      *----------------------------------------------------*
      *   INITIAL  PROCESS                                 *
      *----------------------------------------------------*
     CSR         $SB100    BEGSR
     C                     TIME           TIME
     C                     Z-ADD*DATE     HYMD8   80
     C                     MOVE HYMD8     WKHYMD
     C                     MOVEA'00000000'*IN,11
     C                     SETOF                     1999
     C                     Z-ADD0         WKALL   20
     C                     Z-ADD0         WKMAX   30
     C                     Z-ADD0         WKKALL  30
     C                     Z-ADD0         WKYY    40
     C                     Z-ADD0         WKMM    20
     C                     Z-ADD0         WKDD    20
     C                     Z-ADD0         WKKSKB  10
     C                     Z-ADD0         WKSRYO 102
     C                     Z-ADD0         WKKOSU 102
     C                     Z-ADD0         WKMAIS  20
     C                     MOVE *BLANK    DSPSW1  1
     C                     MOVE *BLANK    DSPSW2  1
     C                     MOVE *BLANK    WKKSHK  1
     C                     MOVE *BLANK    WKKOUT  1
     C                     MOVE *BLANK    WKDOUT  1
     C                     Z-ADD0         WKALHK  30
     C                     Z-ADD0         WKMXHK  30
     C                     Z-ADD0         W6KSKB  10
     C                     Z-ADD8990      @KOCD
     CSR         $S100S    ENDSR
      *
      *----------------------------------------------------*
      *   MAIN  PROCESS                                    *
      *----------------------------------------------------*
     CSR         $SB200    BEGSR
     C                     MOVE '1'       DSPSW1
     C                     MOVE '0'       DSPSW2
     C           *IN01     DOWEQ'0'
     C           DSPSW1    ANDEQ'1'
     C                     EXSR $SB210
     C                     END
      *
     C           *IN01     DOWEQ'0'
     C           *IN03     ANDEQ'0'
     C           *IN05     ANDEQ'0'
     C           DSPSW2    ANDEQ'1'
     C                     EXSR $SB220
     C                     END
     CSR         $S200E    ENDSR
      *----------------------------------------------------*
      *   FIRST DISPLAY  PROCESS (GCQPW461)                *
      *----------------------------------------------------*
     CSR         $SB210    BEGSR
     C                     EXFMTGCQPW461
      * PUT CMD-1
     C           *IN01     IFEQ '1'
     C                     GOTO $S210E
     C                     END
     C                     SETOF                     111213
     C                     SETOF                     149915
     C                     MOVE *BLANK    @MSG
      * ITEM CHECK
     C           @KBN      IFEQ *BLANK
     C                     SETON                     1199
     C                     MOVEL$MSG,1    @MSG
     C                     GOTO $S210E
     C                     END
     C           @KBN      IFNE '0'
     C           @KBN      ANDNE'1'
     C           @KBN      ANDNE'2'
     C                     SETON                     1199
     C                     MOVEL$MSG,2    @MSG
     C                     GOTO $S210E
     C                     END
      *
     C           @TKR1     IFEQ *BLANK
     C           @TKR2     ANDEQ*BLANK
     C           @TKR3     ANDEQ*BLANK
     C           @TKR4     ANDEQ*BLANK
     C           @TKR5     ANDEQ*BLANK
     C                     SETON                     1299
     C                     MOVEL$MSG,3    @MSG
     C                     GOTO $S210E
     C                     END
     C           @TKR1     IFNE '6'
     C                     SETON                     1599
     C                     MOVEL$MSG,4    @MSG
     C                     GOTO $S210E
     C                     END
      *
     C           @KAT1     IFEQ *BLANK
     C           @KAT2     ANDEQ*BLANK
     C                     SETON                     1399
     C                     MOVEL$MSG,5    @MSG
     C                     GOTO $S210E
     C                     END
      *
     C                     MOVE @KAT1     #KKAT1
     C                     MOVE @KAT2     #KKAT2
     C                     MOVE @KAT1     ##KAT1
     C                     MOVE '-'       ##HN
     C                     MOVE @KAT2     ##KAT2
      *
     C           @KBN      IFNE '0'
     C           ##KATA    SETLLGCQPL361
     C           *IN21     DOUEQ*ON
     C           ##KATA    READEGCQPL361                 21
     C           *IN21     IFEQ *OFF
     C           DFSKJY    ANDEQ*BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           *IN21     IFEQ '1'
     C                     SETON                     1399
     C                     MOVEL$MSG,25   @MSG
     C                     GOTO $S210E
     C                     END
      *
     C                     SETOF                     21
     C           KEYQ41    CHAINFCQPL311             21
     C           *IN21     IFEQ '0'
     C           Q4SKJY    IFEQ 'D'
     C           Q4SKHZ    ANDLEHYMD8
     C                     SETON                       21
     C                     END
     C                     END
     C           *IN21     IFEQ '1'
     C                     SETON                     1399
     C                     MOVEL$MSG,6    @MSG
     C                     GOTO $S210E
     C                     END
     C                     END
      *
     C*          @KOCD     IFNE 8990
     C*                    SETON                     1499
     C*                    MOVEL$MSG,7    @MSG
     C*                    GOTO $S210E
     C*                    END
      * KEY FILD SET
     C                     MOVE @TKR1     #KTKR1
     C                     MOVE @TKR2     #KTKR2
     C                     MOVE @TKR3     #KTKR3
     C                     MOVE @TKR4     #KTKR4
     C                     MOVE @TKR5     #KTKR5
     C                     MOVE @KAT1     #KKAT1
     C                     MOVE @KAT2     #KKAT2
     C                     MOVE @KAT3     #KKAT3
     C                     MOVE @KOCD     #KKOCD
      *
     C                     SETOF                       81
     C                     EXSR $SB900
      * CANSEL
     C           @KBN      IFEQ '0'
     C           *IN81     IFEQ '1'
     C                     SETON                     111213
     C                     SETON                     1499
     C                     MOVEL$MSG,8    @MSG
     C                     GOTO $S210E
     C                     END
     C                     MOVE T6DOUT    WKDOUT
     C                     END
      * CHANGE
     C           @KBN      IFEQ '1'
     C           *IN81     IFEQ '1'
     C                     SETON                     111213
     C                     SETON                     1499
     C                     MOVEL$MSG,9    @MSG
     C                     GOTO $S210E
     C                     END
     C                     MOVE T6DOUT    WKDOUT
     C                     END
      * ADD
     C           @KBN      IFEQ '2'
     C           *IN81     IFEQ '0'
     C                     SETON                     111213
     C                     SETON                     1499
     C                     MOVEL$MSG,10   @MSG
     C                     GOTO $S210E
     C                     END
     C                     MOVE *BLANK    WKDOUT
     C                     END
      *
     C           @KBN      IFEQ '2'
     C           K#12      SETLLGCQPL12
     C           *IN90     DOUEQ*ON
     C           K#12      READEGCQPL12                  90
     C           *IN90     IFEQ *OFF
     C           T6SKJY    ANDEQ*BLANK
     C                     SETON                     111213
     C                     SETON                     1499
     C           $MSG,23   CAT  LOC:1     @MSG
     C                     GOTO $S210E
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           @KBN      IFEQ '2'
     C           K#11      SETLLGCQPL11
     C           *IN90     DOUEQ*ON
     C           K#11      READEGCQPL11                  90
     C           *IN90     IFEQ *OFF
     C           T6SKJY    ANDEQ*BLANK
     C           T6KAT1    IFNE @KAT1
     C           T6KAT2    ORNE @KAT2
     C           T6KAT3    ORNE @KAT3
     C                     SETON                     111213
     C                     SETON                     1499
     C           $MSG,24   CAT  T6KAT1:0  @MSG      P
     C           @MSG      CAT  T6KAT2:1  @MSG      P
     C                     GOTO $S210E
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     MOVE '-'       @K1
     C                     MOVE '-'       @K2
      *
     C                     SETOF                     21
     C                     MOVE *BLANK    @KONM
     C           #KKOCD    CHAINFGBPL011             21
     C           *IN21     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLEHYMD8
     C                     SETON                       21
     C                     END
     C                     END
      * PROCESS BRANCH
     C           @KBN      CASEQ'0'       $SB400
     C           @KBN      CASEQ'1'       $SB400
     C           @KBN      CASEQ'2'       $SB410
     C                     ENDCS
     C                     MOVE '0'       DSPSW1
     C                     MOVE '1'       DSPSW2
      *
     C                     Z-ADD@KALL     WKKALL
     C                     Z-ADD@KMAX     WKMAX
     C           @KALL     IFLT @KMAX
     C                     Z-ADD@KMAX     WKALL
     C                     ELSE
     C                     Z-ADD@KALL     WKALL
     C                     END
      *
     CSR         $S210E    ENDSR
      *----------------------------------------------------*
      *   SECOND DISPLAY PROCESS (GCQPW462)                *
      *----------------------------------------------------*
     CSR         $SB220    BEGSR
     C                     EXFMTGCQPW462
      * PUT CMD-3
     C           *IN03     IFEQ '1'
     C                     EXSR $SB430
     C                     GOTO $S220E
     C                     END
      *
     C                     SETOF                     111213
     C                     SETOF                     141516
     C                     SETOF                     171819
     C                     SETOF                     99
     C                     MOVE *BLANK    @MSG
      * INPUT ITEM CHECHK
     C           @SRYO     IFEQ 0
     C                     SETON                     1199
     C                     MOVEL$MSG,11   @MSG
     C                     GOTO $S220E
     C                     END
      *
     C           @SETI     IFEQ *BLANK
     C                     SETON                     1299
     C                     MOVEL$MSG,12   @MSG
     C                     GOTO $S220E
     C                     END
     C           @SETI     IFNE '01'
     C                     SETON                     1299
     C                     MOVEL$MSG,13   @MSG
     C                     GOTO $S220E
     C                     END
      *
     C                     SETOF                     21
     C                     MOVE @SETI     #KSETI
     C                     EXSR $SB910
     C           *IN21     IFEQ '1'
     C                     SETON                     1299
     C                     MOVEL$MSG,14   @MSG
     C                     GOTO $S220E
     C                     END
     C                     MOVELA4SETN    @SETNM
      *
     C           @KOTP     IFEQ *BLANK
     C                     SETON                     1499
     C                     MOVEL$MSG,15   @MSG
     C                     GOTO $S220E
     C                     END
      * LT M/F BY DEPARTMENT READ
     C                     MOVE @KOCD1    #KBMON
     C                     MOVE @KOTP     #KTAIP
     C           KEYT21    CHAINGCKPL211             21
     C           *IN21     IFEQ '0'
     C           T2SKJY    IFEQ 'D'
     C           T2SKHZ    ANDLEHYMD8
     C                     SETON                     21
     C                     END
     C                     END
     C           *IN21     IFEQ '1'
     C                     SETON                     149913
     C                     MOVEL$MSG,16   @MSG
     C                     GOTO $S220E
     C                     END
      * BAR CODE M/F READ
     C           #KBMON    CHAINAACPL011             21
     C           *IN21     IFEQ '0'
     C           T8SKJY    IFEQ 'D'
     C           T8SKHZ    ANDLEHYMD8
     C                     SETON                       21
     C                     END
     C                     END
     C           *IN21     IFEQ '1'
     C                     SETON                     1399
     C                     MOVEL$MSG,17   @MSG
     C                     GOTO $S220E
     C                     END
      *
     C                     MOVELT8BKO2    @KOBD
      *
     C*          @LTIM     IFNE 30
     C*                    SETON                     1699
     C*                    MOVEL$MSG,19   @MSG
     C*                    GOTO $S220E
     C*                    END
      *
     C           @SYOS     IFEQ 0
     C                     SETON                     1799
     C                     MOVEL$MSG,20   @MSG
     C                     GOTO $S220E
     C                     END
      *
     C           @KBN      IFEQ '1'
     C           @KIHZ     IFLE @@KIHZ
     C                     SETON                     1999
     C                     MOVEL$MSG,18   @MSG
     C                     GOTO $S220E
     C                     END
     C                     END
      *
     C           @KBN      IFEQ '2'
     C           @KIHZ     IFEQ 0
     C                     Z-ADDHYMD8     @KIHZ
     C                     END
     C                     END
      *
     C                     MOVE @KIHZ     WKHYMD
     C                     SETON                     21
     C           WKHY      IFGE 1986
     C           WKHM      IFGE 01
     C           WKHM      ANDLE12
     C           WKHD      IFGE 01
     C           WKHD      ANDLE31
     C                     SETOF                     21
     C                     END
     C                     END
     C                     END
     C           *IN21     IFEQ '1'
     C                     SETON                     1999
     C                     MOVEL$MSG,21   @MSG
     C                     GOTO $S220E
     C                     END
      *
     C                     EXSR $SB920
      *
      * PUT CMD-5
      *
     C           *IN05     IFEQ '1'
     C           @KBN      CASEQ'0'       $SB500
     C           @KBN      CASEQ'1'       $SB520
     C           @KBN      CASEQ'2'       $SB520
     C                     ENDCS
     C                     EXSR $SB430
     C                     END
      *
     CSR         $S220E    ENDSR
      *----------------------------------------------------*
      *   FAINAL PROCESS                                   *
      *----------------------------------------------------*
     CSR         $SB300    BEGSR
     C                     SETON                       LR
     C                     RETRN
     CSR         $S300E    ENDSR
      *----------------------------------------------------*
      *   DISPLAY ITEM SET  ( CANSEL OR CHANGE)            *
      *----------------------------------------------------*
     CSR         $SB400    BEGSR
     C           @KBN      IFEQ '0'
     C                     SETON                       89
     C                     MOVEL$CMT,1    @KBNNM
     C                     END
     C           @KBN      IFEQ '1'
     C                     MOVEL$CMT,2    @KBNNM
     C                     END
     C           *IN21     IFEQ '0'
     C                     MOVELB2SMEI    @KONM
     C                     END
      *
     C                     MOVE *BLANK    @SETI
     C                     MOVE *BLANK    @SETIM
     C                     Z-ADDT6HAHZ    @HAHZ
     C                     Z-ADDT6TUHZ    @TUHZ
     C                     Z-ADDT6KALL    @KALL
     C                     Z-ADDT6KMIN    @KMIN
     C                     Z-ADDT6KMAX    @KMAX
     C                     Z-ADDT6SRMS    @SRMS
     C                     Z-ADDT6MAIS    @MAIS
     C                     Z-ADDT6MAIS    WKMAIS
     C                     MOVELT6KSKB    @KSKB
     C                     MOVE *BLANK    @KSKBN  1
     C                     MOVELT6KSKB    W6KSKB
     C                     Z-ADDT6SRYO    @SRYO
     C                     MOVE T6SETI    @SETI
     C                     Z-ADDT6KOCD    @KOCD1
     C                     MOVELT6KOTP    @KOTP
     C                     MOVE T6KOBD    @KOBD
     C                     Z-ADDT6LTIM    @LTIM
     C                     Z-ADDT6SYOS    @SYOS
     C                     Z-ADDT6KIJN    @KIJN
     C                     Z-ADDT6KELT    @KELT
     C                     Z-ADDT6KIHZ    @KIHZ
     C                     Z-ADDT6KIHZ    @@KIHZ
      *
     C                     SETOF                     21
     C                     MOVE *BLANK    @SETNM
     C                     MOVE T6SETI    #KSETI
     C                     MOVE T6DOUT    WKDOUT
     C                     MOVE T6KOUT    WKKOUT
     C                     EXSR $SB910
     C           *IN21     IFEQ '0'
     C                     MOVELA4SETN    @SETNM
     C                     END
     C           T6SETI    IFNE 0
     C                     MOVE T6SETI    @SETIM
     C                     END
     CSR         $S400E    ENDSR
      *----------------------------------------------------*
      *   DISPLAY ITEM SET  ( ADD )                        *
      *----------------------------------------------------*
     CSR         $SB410    BEGSR
     C                     MOVEL$CMT,3    @KBNNM
     C           *IN21     IFEQ '0'
     C                     MOVELB2SMEI    @KONM
     C                     END
     C                     MOVE @KOCD     @KOCD1
      *
     C                     Z-ADD0         @HAHZ
     C                     Z-ADD0         @TUHZ
     C                     Z-ADD0         @KALL
     C                     Z-ADD0         @KMIN
     C                     Z-ADD0         @KMAX
     C                     Z-ADD0         @SRMS
     C                     Z-ADD0         @MAIS
     C                     Z-ADD99        WKMAIS
     C                     MOVELT6KSKB    @KSKB
     C                     MOVE *BLANK    @KSKBN
     C                     Z-ADD0         @SRYO
     C                     MOVE '01'      @SETI
     C                     MOVEL*BLANK    @SETIM
     C                     MOVEL'A'       @KOTP
     C                     MOVE *BLANK    @KOBD
     C**********           Z-ADD30        @LTIM
     C********** 50        MULT 1.2       @LTIM
     C*******    42        MULT 1.2       @LTIM
     C           34        MULT 1.1       @LTIM
     C                     Z-ADD0         @SYOS
     C                     Z-ADD1         @KIJN
     C                     Z-ADD0         @KELT
     C                     Z-ADD0         @KIHZ
     C                     Z-ADD0         @@KIHZ
     C                     MOVE *BLANK    WKDOUT
     C                     MOVE *BLANK    WKKOUT
     CSR         $S410E    ENDSR
      *----------------------------------------------------*
      *   ITEM CLEAR                                       *
      *----------------------------------------------------*
     CSR         $SB430    BEGSR
     C                     MOVE *BLANK    @KBNNM
     C                     MOVEL*BLANK    @KONM
     C                     Z-ADD8990      @KOCD
     C                     MOVE *ZERO     @KOCD1
      *
     C                     Z-ADD0         @HAHZ
     C                     Z-ADD0         @TUHZ
     C                     Z-ADD0         @KALL
     C                     Z-ADD0         @KMIN
     C                     Z-ADD0         @KMAX
     C                     Z-ADD0         @SRMS
     C                     Z-ADD0         @MAIS
     C                     Z-ADD0         WKMAIS
     C                     MOVEL*BLANK    @KSKB
     C                     MOVE *BLANK    @KSKBN
     C                     Z-ADD0         @SRYO
     C                     MOVE *BLANK    @SETI
     C                     MOVE *BLANK    @SETIM
     C                     Z-ADD0         @KOCD1
     C                     MOVEL*BLANK    @KOTP
     C                     MOVE *BLANK    @KOBD
     C                     Z-ADD0         @LTIM
     C                     Z-ADD0         @SYOS
     C                     Z-ADD0         @KIJN
     C                     Z-ADD0         @KELT
     C                     Z-ADD0         @KIHZ
     C                     Z-ADD0         @@KIHZ
     C                     MOVE *BLANK    WKDOUT
     C                     MOVE *BLANK    WKKOUT
     C                     MOVE *BLANK    @KBN
     C                     MOVE *BLANK    @TKR1
     C                     MOVE *BLANK    @TKR2
     C                     MOVE *BLANK    @TKR3
     C                     MOVE *BLANK    @TKR4
     C                     MOVE *BLANK    @TKR5
     C                     MOVE *BLANK    @KAT1
     C                     MOVE *BLANK    @KAT2
     C                     MOVE *BLANK    @KAT3
     C                     MOVE '1'       DSPSW1
     C                     MOVE '0'       DSPSW2
     C                     SETOF                     0305
     CSR         $S430E    ENDSR
      *----------------------------------------------------*
      *   DIE KANBAN M/F CANSEL                            *
      *----------------------------------------------------*
     CSR         $SB500    BEGSR
     C           KEYT61    SETLLGCQPL111
     C                     DO   *HIVAL
     C                     SETOF                     81
     C           KEYT61    READEGCQPL111                 81
     C           *IN81     IFEQ '0'
     C                     Z-ADDHYMD8     WKHYMD
     C                     MOVE 'D'       T6SKJY
     C                     MOVE WKHY      T6SKYY
     C                     MOVE WKHM      T6SKMM
     C                     MOVE WKHD      T6SKDD
     C                     MOVE WKHY      T6KOYY
     C                     MOVE WKHM      T6KOMM
     C                     MOVE WKHD      T6KODD
     C                     MOVE TIMHH     T6KOHH
     C                     MOVE TIMSS     T6KOSS
     C                     MOVELUSER      T6KOME
     C                     UPDATGCQPL111
     C                     END
     C  N81                END
     CSR         $S500E    ENDSR
      *----------------------------------------------------*
      *   DIE KANBAN M/F ADD                               *
      *----------------------------------------------------*
     CSR         $SB520    BEGSR
     C                     Z-ADDHYMD8     WKHYMD
     C                     MOVE *BLANK    T6SKJY
     C                     Z-ADD0         T6SKYY
     C                     Z-ADD0         T6SKMM
     C                     Z-ADD0         T6SKDD
     C                     MOVE WKHY      T6KOYY
     C                     MOVE WKHM      T6KOMM
     C                     MOVE WKHD      T6KODD
     C                     MOVE TIMHH     T6KOHH
     C                     MOVE TIMSS     T6KOSS
     C                     MOVELUSER      T6KOME
      *
     C                     MOVE @KAT1     T6KAT1
     C                     MOVE @KAT2     T6KAT2
     C                     MOVE @KAT3     T6KAT3
     C                     MOVE @TKR1     T6TKR1
     C                     MOVE @TKR2     T6TKR2
     C                     MOVE @TKR3     T6TKR3
     C                     MOVE @TKR4     T6TKR4
     C                     MOVE @TKR5     T6TKR5
     C                     Z-ADD@HAHY     T6HAYY
     C                     Z-ADD@HAHM     T6HAMM
     C                     Z-ADD@HAHD     T6HADD
     C                     Z-ADD@TUHY     T6TUYY
     C                     Z-ADD@TUHM     T6TUMM
     C                     Z-ADD@TUHD     T6TUDD
     C                     Z-ADD@KALL     T6KALL
     C                     Z-ADD@KMIN     T6KMIN
     C                     Z-ADD@KMAX     T6KMAX
     C                     Z-ADD@SRMS     T6SRMS
     C                     Z-ADD@MAIS     T6MAIS
     C                     MOVEL@KSKB     T6KSKB
     C                     Z-ADD@SRYO     T6SRYO
     C                     MOVE @SETI     T6SETI
     C                     Z-ADD@KOCD1    T6KOCD
     C                     MOVEL@KOTP     T6KOTP
     C                     MOVE @KOBD     T6KOBD
     C                     Z-ADD@LTIM     T6LTIM
     C                     Z-ADD@SYOS     T6SYOS
     C                     Z-ADD@KIJN     T6KIJN
     C                     Z-ADD@KELT     T6KELT
     C                     Z-ADD@KIHY     T6KIYY
     C                     Z-ADD@KIHM     T6KIMM
     C                     Z-ADD@KIHD     T6KIDD
      *
     C                     MOVE WKDOUT    T6DOUT
     C                     MOVE WKKOUT    T6KOUT
     C                     MOVE WKKSHK    T6KSHK
     C                     MOVE WKALHK    T6ALHK
     C                     MOVE WKMXHK    T6MXHK
      *
     C                     WRITEGCQPL111
      *
     CSR         $S520E    ENDSR
      *----------------------------------------------------*
      *   DIE KANBAN M/F READ                              *
      *----------------------------------------------------*
     CSR         $SB900    BEGSR
      *
     C                     Z-ADD9         T6KSKB
     C           KEYT61    SETLLGCQPL111
     C           KEYT61    READEGCQPL111                 81
     C           *IN81     IFEQ '0'
     C           T6SKJY    IFEQ 'D'
     C           T6SKHZ    ANDLEHYMD8
     C                     SETON                       81
     C                     END
     C                     END
     CSR         $S900E    ENDSR
      *----------------------------------------------------*
      *   SETTING M/F    READ                              *
      *----------------------------------------------------*
     CSR         $SB910    BEGSR
      *
     C           KEYA41    CHAINAABPL01              21
     C           *IN21     IFEQ '0'
     C           A4SKJY    IFEQ 'D'
     C           A4SKHZ    ANDLEHYMD8
     C                     SETON                       21
     C                     END
     C                     END
     CSR         $S910E    ENDSR
      *----------------------------------------------------*
      *   CALUCULATION                                     *
      *----------------------------------------------------*
     CSR         $SB920    BEGSR
      * REASON CODE SET
     C           @KSKBN    IFEQ *BLANK
     C           WKMAIS    IFNE 0
     C           @SETI     IFGE '01'
     C           @SETI     ANDLE'49'
      *
     C                     MOVE '*'       @KSKBN
     C           @KSKB     IFEQ 9
     C                     Z-ADD0         WKKSKB
     C                     ELSE
     C           @KSKB     ADD  1         WKKSKB
     C                     END
      *
     C                     ELSE
     C                     Z-ADDW6KSKB    WKKSKB
     C                     END
     C                     END
     C                     Z-ADDWKKSKB    @KSKB
     C                     END
      * KANBAN SHEETS SET
     C                     Z-ADD0         WKSRYO
     C                     Z-ADD0         WKKOSU
     C**         @SRYO     MULT 4         WKSRYO
     C**         @SYOS     IFNE 0
     C**         WKSRYO    DIV  @SYOS     WKKOSU
     C**                   ADD  0.9       WKKOSU
     C**                   END
      * 2005.09.29
     C                     Z-ADD0         WKSU1  114
     C                     Z-ADD0         WKSU2  114
     C                     Z-ADD0         WKSU3  114
     C                     Z-ADD0         WKSU4  114
     C                     Z-ADD0         WKSU5  114
     C                     Z-ADD0         WKSU6  114
     C                     Z-ADD0         WKSU7  114
     C                     Z-ADD0         WKSU8  114
     C*******    @SRYO     MULT 1.25      WKSU1
     C*******    @SYOS     MULT 20        WKSU2
     C**********           Z-ADD30        WKSU3
     C********** 50        MULT 1.2       WKSU3
     C*******    42        MULT 1.2       WKSU3
     C*******    WKSU1     DIV  WKSU2     WKSU4
     C*******    WKSU3     MULT WKSU4     WKSU5
     C*******    @SRYO     DIV  @SYOS     WKSU6
     C*******    WKSU5     ADD  WKSU6     WKSU7
     C*******    WKSU7     ADD  0.9       WKKOSU
     C*===============================================================*
     C*    月間必要数×安全係数                                     *
     C*  (( -------------------- )×( L/T×補正係数))             *
     C*     収容数×平均稼働日                                      *
     C*                                                               *
     C*                       月間必要数                            *
     C*                  ＋( ----------×在庫係数)＝かんばん枚数*
     C*                         収容数                              *
     C*                                                               *
     C*   ※かんばん枚数は小数点以下切り上げ                        *
     C*===============================================================*
     C           @SRYO     MULT 1.25      WKSU1
     C           @SYOS     MULT 20        WKSU2
     C           WKSU1     DIV  WKSU2     WKSU3
     C           34        MULT 1.1       WKSU4
     C           WKSU3     MULT WKSU4     WKSU5
     C           @SRYO     DIV  @SYOS     WKSU6
     C           WKSU6     MULT 0.5       WKSU7
     C           WKSU5     ADD  WKSU7     WKSU8
     C*****      WKSU8     ADD  0.9       WKKOSU
     C           WKSU8     ADD  0.9999    WKKOSU
      *
     C                     Z-ADDWKKOSU    @MAIS
      *
     C                     SETOF                     35
TCHK1C*          T6KAT1    LOKUP$TYU                     35
TCHK1C           @KAT1     LOKUP$TYU                     35
     C           *IN35     IFEQ '1'
     C           @MAIS     IFLT 2
     C**********           Z-ADD2         @MAIS
     C                     Z-ADD1         @MAIS
     C                     END
     C                     ELSE
     C           @MAIS     IFLT 1
     C                     Z-ADD1         @MAIS
     C                     END
     C                     END
      *
     C           WKMAIS    IFEQ *ZERO
     C                     Z-ADD@MAIS     @KMAX
     C                     GOTO #RTN1
     C                     END
      *
TCHK1C*          T6DOUT    IFNE *BLANK
TCHK1C           WKDOUT    IFNE *BLANK
     C                     Z-ADDWKALL     @KALL
     C                     Z-ADDWKMAX     @KMIN
     C                     END
     C                     MOVE @MAIS     @KMAX
      *
     C           WKHY      IFNE @TUHY
     C           WKHY      SUB  @TUHY     WKYY
     C           WKYY      IFLE 01
     C                     Z-ADDWKHM      WKMM
     C                     Z-ADDWKHD      WKDD
     C           WKDD      CABLE@TUHD     #PAS1
     C                     END
     C           @KALL     CABLT@KMIN     #PAS1
     C           @KMIN     CABGE30        #PAS1
     C           @SETI     IFGE '01'
     C           @SETI     ANDLE'49'
     C                     GOTO #PAS1
     C                     END
     C                     SETON                       99
     C                     MOVE $MSG,22   @MSG
     C                     GOTO $S920E
     C                     END
     C           #PAS1     TAG
     C                     Z-ADD0         @SRMS
     C           WKDOUT    IFNE *BLANK
     C                     MOVE *BLANK    WKKSHK
     C                     Z-ADD0         WKALHK
     C                     Z-ADD0         WKMXHK
     C                     END
      *
     C           W6KSKB    IFEQ @KSKB
     C           WKDOUT    CABEQ'Y'       #RTN1
     C           WKKSHK    CABEQ*BLANK    #RTN1
     C                     Z-ADDWKALHK    WKKALL
     C                     Z-ADDWKMXHK    WKMAX
     C                     ELSE
     C           WKKSHK    IFNE *BLANK
     C                     Z-ADDWKALHK    WKKALL
     C                     Z-ADDWKMXHK    WKMAX
     C                     END
     C                     END
     C                     Z-ADD0         @KALL
     C                     Z-ADD0         @KMIN
     C           WKKALL    IFGT WKMAX
     C           WKKALL    SUB  WKMAX     @SRMS
     C                     END
     C           #RTN1     TAG
      *
     C           @SETI     IFGE '01'
     C           @SETI     ANDLE'49'
     C           @KBN      IFEQ '1'
     C                     Z-ADD*DATE     @TUHZ
     C                     END
     C                     END
      *
      * PUT CMD-5
     C           *IN05     IFEQ '1'
      *
     C           W6KSKB    IFEQ @KSKB
     C           WKDOUT    CABEQ'Y'       #RTN2
     C           WKKSHK    CABEQ*BLANK    #RTN2
     C                     END
     C           WKDOUT    IFNE *BLANK
     C                     MOVEL'H'       WKKSHK
     C                     Z-ADDWKKALL    WKALHK
     C                     Z-ADDWKMAX     WKMXHK
     C                     END
      *
     C           #RTN2     TAG
     C           WKMAIS    IFNE *ZERO
     C           W6KSKB    IFEQ @KSKB
     C           @KMIN     IFEQ @KMAX
     C                     GOTO $S920E
     C                     END
     C                     END
     C                     END
     C                     Z-ADD*DATE     @TUHZ
     C                     MOVE *BLANK    WKDOUT
     C                     MOVEL'Y'       WKKOUT
      *
     C                     END
      *
     CSR         $S920E    ENDSR
**
ER-1 NOT INPUT UPDATE
ER-2 MUST INPUT < 0.1.2. > FOR UPDATE INSTRUCTION
ER-3 NOT INPUT LOCATION CODE
ER-4 FACTORY CODE FOR ADDRESS IS 6 ONLY
ER-5 NOT INPUT DIE NO.
ER-6 THIS DIE NO. IS NOT IN DIE SPEC M/F
ER-7 MUST INPUT < 8990 > FOR PURCHASE POINT
ER-08 IT'S NOT APPLICABLE KEY IN DIE KANBAN M/F TO CANCEL
ER-09 IT'S NOT APPLICABLE KEY IN DIE KANBAN M/F TO CHANGE
ER-10 IT'S ALREADY ADDED TO DIE KANBAN M/F
ER-11 NOT INPUT MONTHLY NECESSARY
ER-12 NOT INPUT SETTING CODE
ER-13 SETTING CODE IS 01
ER-14 THIS SETTING CODE IS NOT IN SETTING M/F
ER-15 NOT INPUT TYPE
ER-16 REVERSED ONE IS NOT IN LT M/F BY DEPARTMENT
ER-17 PURCHASE POINT NOT IN BAR CODE M/F
ER-18 THE DATE IS TO BE LATER THAN CHANGE DATE
ER-19 WAY LT IS 30
ER-20 NOT INPUT ACCOMMODATED QUANTITY
ER-21 SWITCHING DATE IS NOT CORRECT
ER-22 RECREATE ALL KANBANS SINCE THEY HAVE BEEN ISSUED ONCE
ER-23 THIS DIE HAS A DIFFERNT LOCATION CODE:
ER-24 THIS LOCATION HAS A DIFFERENT DIE CODE:
ER-25 THIS DIE NO. IS NOT IN DIE ALLOTMENT M/F
**
0 : CANSEL
1 : CHANGE
2 : ADD
**
07
08
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
40
41
42
38
