     H            Y.
     F** GCQR58 **********************************
     F*   REFERENCE TO DIE ADDRESS AND MAKER     *
     F*  PROGRAM ID.    :  GCQR58.      <RPG>    *
     F*  CREATE DATE.   :  02.19.1999            *
     F*  AUTHOR.        :  MSK.KUNIEDA           *
     F*                                          *
     F* TCHK1 08/01/06 CHG ADD GENERIC SEARCH    *
     F********************************** GCQR58 **
     FGCQPW58 CF  E                    WORKSTN
     F                                        RRN   KSFILE DSP2R
     FGCQPL13 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     E                    MSG     1   2 60               ERR MSG
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   9 @KAT
     I                                        1   2 @KAT1
     I                                        3   3 @KATA
     I                                        4   7 @KAT2
     I                                        8   8 @KATB
     I                                        9   9 @KAT3
     I            DS
     I                                        1  11 TKR
     I                                        1   1 TKR1
     I                                        2   2 TKRA
     I                                        3   4 TKR2
     I                                        5   5 TKRB
     I                                        6   7 TKR3
     I                                        8   8 TKRC
     I                                        9   9 TKR4
     I                                       10  10 TKRD
     I                                       11  11 TKR5
     C           KEY1      KLIST
     C                     KFLD           KAT1
     C                     KFLD           KAT2
     C                     KFLD           KAT3
TCHK1C           KEY11     KLIST
TCHK1C                     KFLD           KAT1
TCHK1C                     KFLD           KAT2
      *
     C           STP0      TAG
     C                     MOVE *BLANK    KAT1
     C                     MOVE *BLANK    KAT2
     C                     MOVE *BLANK    KAT3
      *
     C           STP1      TAG
     C                     EXFMTGCQPW581
     C                     MOVEA'0'       *IN,01
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
      *
     C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
      *
     C******************************************************
     C*  <SCREEN 1 CHECK>                                  *
     C******************************************************
     C*
     C*  CHECK OF KANBAN
     C*
     C           KAT1      IFEQ *BLANK
     C           KAT2      ANDEQ*BLANK
     C           KAT3      ANDEQ*BLANK
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,1     ERR
     C                     GOTO STP1
     C                     END
      *
     C                     MOVELKAT1      @KAT1
     C                     MOVELKAT2      @KAT2
     C                     MOVELKAT3      @KAT3
     C           @KAT2     IFNE *BLANK
     C                     MOVEL'-'       @KATA
     C                     END
      *
     C           @KAT3     IFNE *BLANK
     C                     MOVEL'-'       @KATB
     C                     END
      *
     C           LOOP      TAG
     C                     EXSR #SET
      *
     C           ERR       IFNE *BLANK
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
      *
     C******************************************************
     C*  EXFMT  (SCREEN 2)                                 *
     C******************************************************
     C           STP2      TAG
     C                     WRITEDSP2X
     C                     MOVEA'1'       *IN,91
     C                     EXFMTDSP2C
     C                     MOVEA'0'       *IN,91
      *
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
      *
     C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
      *
     C           *INKC     IFEQ '1'
     C                     GOTO STP0
     C                     END
      *
     C*                    GOTO STP2
     C                     GOTO STP0
     C******************************************************
     C           #SET      BEGSR                           *
     C******************************************************
      *
     C                     Z-ADD0         RRN     50
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
      *
     C           KEY1      SETLLGCQPL131
     C                     MOVE *BLANK    TKR
     C                     Z-ADD0         MKCD
     C                     MOVE *BLANK    MKNM
     C                     Z-ADD0         GHSU
     C                     Z-ADD0         KBN
     C                     Z-ADD0         MAIS
     C                     Z-ADD0         SYOS
     C                     Z-ADD0         KIRI
     C                     Z-ADD0         SKHZ
     C                     DO   *HIVAL
TCHK1C           KAT3      IFNE *BLANK
     C           KEY1      READEGCQPL131                 10
TCHK1C                     ELSE
TCHK1C           KEY11     READEGCQPL131                 10
TCHK1C                     END
     C           *IN,10    IFEQ '0'
      *
     C                     MOVE *BLANK    TKR
     C                     MOVELT6TKR1    TKR1
     C                     MOVELT6TKR2    TKR2
     C                     MOVELT6TKR3    TKR3
     C                     MOVELT6TKR4    TKR4
     C                     MOVELT6TKR5    TKR5
     C           TKR2      IFNE *BLANK
     C                     MOVEL'-'       TKRA
     C                     END
      *
     C           TKR3      IFNE *BLANK
     C                     MOVEL'-'       TKRB
     C                     END
      *
     C           TKR4      IFNE *BLANK
     C                     MOVEL'-'       TKRC
     C                     END
      *
     C           TKR5      IFNE *BLANK
     C                     MOVEL'-'       TKRD
     C                     END
      *
TCHK1C                     MOVELT6KAT3    D@KAT3
TCHK1C*
     C                     Z-ADDT6KOCD    MKCD
     C                     MOVE *BLANK    MKNM
     C           MKCD      CHAINFGBPL011             20
     C           *IN,20    IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLEUDATE
     C                     MOVEA'1'       *IN,20
     C                     END
      *
     C  N20                MOVELB2SMEI    MKNM
      *
     C                     Z-ADDT6SRYO    GHSU
     C                     Z-ADDT6KSKB    KBN
     C                     Z-ADDT6KMAX    MAIS
      *
     C           T6SRYO    DIV  T6SYOS    @@M     70
     C           @@M       MULT 4         MAIS
      *
     C                     Z-ADDT6SYOS    SYOS
     C                     Z-ADDT6KIHZ    KIRI
     C                     Z-ADDT6SKHZ    SKHZ
      *
     C                     ADD  1         RRN
     C                     WRITEDSP2R
     C                     END
      *
     C           @END      TAG
     C  N10                END
      *
     C           RRN       IFEQ 0
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,2     ERR
     C                     END
      *
     C                     ENDSR
      *
**  MSG (d[ｰ xｮﾈｰﾆﾞ)
E-01  INPUT DIE NO.
E-02  THERE ISN'T APPLICABLE DATA
