     H            Y.
     F** GCQR90 *********************
     F* USA DIE NO LIST
     F*                             *
     F* S.YAMAGAMI 1996.01.15 *
     F********************* GCQR90 **
     FGCQTL31 IP  E           K        DISK
     FNNBPL05 IF  E           K        DISK
     FGCQWP90 O   F      50            DISK
      *
     C           KEY       KLIST
     C                     KFLD           WYEAR
     C                     KFLD           WMONT
     C                     KFLD           DFSHN1
     C                     KFLD           DFSHN2
     C                     KFLD           DFSHN3
     C                     Z-ADD1995      WYEAR   40
     C                     Z-ADD10        WMONT   20
     C                     Z-ADD0         WSRYO   80
     C*
     C           DFSKJY    IFNE 'D'
     C*
     C                     SETOF                     10
     C           KEY       CHAINNNBPL051             10
     C           *IN10     IFEQ '0'
     C           T9SKJY    IFNE 'D'
     C                     Z-ADDT9SRYO    WSRYO
     C                     END
     C                     END
     C*
     C                     EXCPTDT
     C                     END
     OGCQWP90 E                DT
     O                         DFKATA    15
     O                         DFSHN1    20
     O                         DFSHN2    25
     O                         DFSHN3    27
     O                         WSRYO     35
