     H            Y.
     F** GCRR03 ********************************************
     F*                                                    *
     F*  T.SAKASHITA                        2013/APL/29    *
     F******************************************** BTMRC1 **
     FGCRWP02 IP  E                    DISK
     FGCRWP03 O   F    2048            DISK
     C  N77                EXCPTOHED
     C                     SETON                     77
     C                     MOVE '0'       O@FLG   1
     C           W#SETI    IFLT 0
     C                     MOVE '-'       O@FLG
     C                     MULT -1        W#SETI
     C                     END
     C                     EXCPTODAT
     OGCRWP03 E                OHED
     O                                      'DIE NO.'
     O                                      ','
     O                                      'QTY.'
     O                                      ','
     O                                      'PART NO.'
     O                                      ','
     O                                      'MONTHLY VOL.'
     OGCRWP03 E                ODAT
     O                         W#KATA
     O                                      ','
     O                         W#KOSU
     O                                      ','
     O                                      '="'
     O                         W#HIN1
     O                         W#HIN2
     O                         W#HIN3
     O                                      '"'
     O                                      ','
     O                         O@FLG
     O                         W#SETI
     O                                      ','
