     H            Y.
     FGCRWP00 IP  E                    DISK
     FGCRWP01 O   E                    DISK
      *
     I            DS
     I                                        1  30 P@OUT
     I                                        1   5 W@HIN1
     I                                        6  10 W@HIN2
     I                                       11  12 W@HIN3
      *
     C                     MOVEL*BLANK    P@IN   30
     C                     MOVELW@HINA    P@IN   30
     C                     MOVEL*BLANK    P@OUT  30
     C                     CALL 'APLR36'
     C                     PARM           P@IN   30
     C                     PARM           P@OUT  30
      *
     C                     ADD  1         W@RENO
      *
     C                     WRITEGCRWP011
