     H            Y.
     F** GCRR01 ********************************************
     F*                                                    *
     F*  T.SAKASHITA                        2013/APL/29    *
     F******************************************** BTMRC1 **
     FGCRPW01 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN   KSFILE SFREC1
     FGCRWP01 UF  E           K        DISK
      *
     IINFDS       DS
     I                                    B 378 3790$$RRN
     I****************************
     I*プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      254 255 W$USR2
     I                                      264 269 W$JBNO
     I            DS
     I                                        1   80V3SKHZ
     I                                        1   40V3SKYY
     I                                        5   60V3SKMM
     I                                        7   80V3SKDD
     I            DS
     I                                        1   80V3KOHZ
     I                                        1   40V3KOYY
     I                                        5   60V3KOMM
     I                                        7   80V3KODD
     I            DS
     I                                        1   80V3KIHZ
     I                                        1   40V3KIYY
     I                                        5   60V3KIMM
     I                                        7   80V3KIDD
     C*
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT            初期処理
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C           @STEP     CASEQ'#RUN    '#RUN
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C* 初期ﾈｮmb
     C*===============================================================
     C           #INIT     BEGSR
     C                     MOVEA*ALL'0'   *IN
     C*  USER ID
     C           W$USR2    IFEQ 'I4'
     C                     SETON                     55
     C                     ENDIF
     C*
     C*  SFLCLR
     C                     SETON                     72
     C                     WRITESFCTL1
     C                     SETOF                     72
     C                     Z-ADD0         RRN     40
     C                     Z-ADD0         ENDRRN  40
     C                     MOVE *BLANK    @@UMU   1        データ有無
     C*
     C           *LOVAL    SETLLGCRWP01
     C*-------------------------
S1   C                     DO   *HIVAL
     C                     READ GCRWP01                  90
     C   90                LEAVE
 S2  C* * *      V3SKJY    IFEQ 'D'
     C* * *      V3SKHZ    ANDLE*DATE
     C* * *                ITER
 E2  C* * *                ENDIF
     C*
     C* * *                MOVE V3NONY    S1NONY
     C* * *                MOVE V3NKOJ    S1NKOJ
     C* * *                MOVE V3NUKE    S1NUKE
     C                     MOVE W@RENO    S1RENO
     C                     MOVE W@HIN1    S1UHN1
     C                     MOVE W@HIN2    S1UHN2
     C                     MOVELW@HIN3    S1UHN3
     C                     Z-ADDW@SETI    S1SETI
      *
     C                     ADD  1         RRN
     C                     WRITESFREC1
E1   C                     ENDDO
     C*-------------------------
     C           RRN       IFEQ 0
     C                     MOVE '#END    '@STEP
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     Z-ADD1         DSPRRN
     C                     ENDIF
     C                     ENDSR
     C*===============================================================
      *画面１*
     C*===============================================================
     C           #DSP1     BEGSR
     C                     SETON                     71
     C                     WRITEDSP01
     C                     EXFMTSFCTL1
     C                     SETOF                     71
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD$$RRN     DSPRRN
      *-----*
      * F24 *
      *-----*
     C   KY                EXSR #F24
      *----*
      * F3 *
      *----*
     C   KC                MOVE '#END    '@STEP
     C   KE                MOVE '#RUN    '@STEP
     C                     ENDSR
      *===============================================================
     C           #RUN      BEGSR
      *
     C                     Z-ADD0         @X      40
      *
     C                     DO   *HIVAL
     C                     ADD  1         @X
     C           @X        CHAINSFREC1               88
     C   88                LEAVE
      *
     C           S1RENO    CHAINGCRWP01              89
     C           *IN89     IFEQ '0'
     C                     MOVE S1UHN1    W@HIN1
     C                     MOVE S1UHN2    W@HIN2
     C                     MOVE S1UHN3    W@HIN3
     C                     Z-ADDS1SETI    W@SETI
     C                     UPDATGCRWP011
     C                     END
      *
     C                     ENDDO
      *
     C                     MOVE '#END    '@STEP
      *
     C           ERUN      ENDSR
      *-----------------------------------------------------
     C           #F24      BEGSR
      *
     C                     Z-ADD0         @X      40
      *
     C                     DO   *HIVAL
     C                     ADD  1         @X
     C           @X        CHAINSFREC1               88
     C   88                LEAVE
      *
     C           S1RENO    CHAINGCRWP01              89
     C           *IN89     IFEQ '0'
     C                     MOVE *BLANK    W@HIN1
     C                     MOVE *BLANK    W@HIN2
     C                     MOVE *BLANK    W@HIN3
     C                     Z-ADD0         W@SETI
     C                     UPDATGCRWP011
     C                     END
      *
     C                     MOVE W@HIN1    S1UHN1
     C                     MOVE W@HIN2    S1UHN2
     C                     MOVELW@HIN3    S1UHN3
     C                     Z-ADDW@SETI    S1SETI
     C                     UPDATSFREC1
      *
     C                     ENDDO
      *
     C                     ENDSR
