     H            Y.
     F** GCRR25 **********************************
     F* TOOL KANBAN MAINTENANCE DATA CREATION    *
     F*    ITS.               2013.10.23         *
     F********************************************
     FGCQTL31 IF  E           K        DISK
     FECSPL07 IF  E           K        DISK
     FGCQPL12 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     FABBPL02 IF  E           K        DISK
     FGCRWP21 IF  E           K        DISK                      A
     E                    YM          6  6 0
     E                    KS          6  3 0
     E                    I6S        12  9 0
     E                    SR          6  9 0
      *
     I            DS
     I                                        1  15 DFKATA
     I                                        1   2 DFKAT1
     I                                        3   3 DFKF1
     I                                        4   7 DFKAT2
     I                                        8   8 DFKF2
     I                                        9   9 DFKAT3
      *
     I            DS
     I                                        1   60EQYOYM
     I                                        1   40EQYOYY
     I                                        5   60EQYOMM
      *
     I            DS
     I                                        1 1080I6S
     I                                        1   90I6SRO1
     I                                       10  180I6SRO2
     I                                       19  270I6SRO3
     I                                       28  360I6SRO4
     I                                       37  450I6SRO5
     I                                       46  540I6SRO6
     I                                       55  630I6SRO7
     I                                       64  720I6SRO8
     I                                       73  810I6SRO9
     I                                       82  900I6SROA
     I                                       91  990I6SROB
     I                                      100 1080I6SROC
      *
     I            DS
     I                                        1   60WKYM
     I                                        1   40WKY
     I                                        5   60WKM
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60WTIME
     I                                        7  140WDATE
      *
     I            DS
     I                                        1   80WKDL
     I                                        1   40WKDLY
     I                                        5   60WKDLM
     I                                        7   80WKDLD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C                     TIME           SDATE
     C           *YEAR     SUB  1         WKDLY
     C                     Z-ADDUMONTH    WKDLM
     C                     Z-ADDUDAY      WKDLD
      * SELECT = DELETE DATA
     C                     READ GCQTL311                 80
     C           *IN80     DOWEQ'0'
     C           DFSKJY    IFEQ 'D'
     C           DFSKHZ    ANDGEWKDL
     C           DFKSEI    IFNE 99
     C                     EXSR #SB500
     C                     ENDIF
     C                     ENDIF
     C                     READ GCQTL311                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-------------------------------------------*
      * GCRWP21                                   *
      *-------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C           KEYW1     KLIST
     C                     KFLD           DFKAT1
     C                     KFLD           DFKAT2
     C                     KFLD           DFKAT3
     C           KEYW1     CHAINGCRWP211             67
     C           *IN67     IFEQ '0'
      *
     C                     CLEARGCRWP211
     C                     MOVELDFSHN1    W1SHN1
     C                     MOVELDFSHN2    W1SHN2
     C                     MOVELDFSHN3    W1SHN3
     C                     MOVELDFKOTI    W1KOTI
     C                     Z-ADDDFKSEI    W1KSEI
     C                     MOVELDFKATA    W1KATA
     C                     MOVELDFKAT1    W1KAT1
     C                     MOVELDFKAT2    W1KAT2
     C                     MOVELDFKAT3    W1KAT3
     C                     Z-ADDDFKOSU    W1KOSU
     C                     MOVELDFKUBN    W1KUBN
     C                     MOVELDFKSKB    W1KSKB
     C                     MOVELDFKTBN    W1KTBN
      * ECSPP01
     C                     EXSR #SB510
     C                     Z-ADDKS,1      W1KOS1
     C                     Z-ADDYM,1      W1YM1
     C                     Z-ADDKS,2      W1KOS2
     C                     Z-ADDYM,2      W1YM2
     C                     Z-ADDKS,3      W1KOS3
     C                     Z-ADDYM,3      W1YM3
     C                     Z-ADDKS,4      W1KOS4
     C                     Z-ADDYM,4      W1YM4
     C                     Z-ADDKS,5      W1KOS5
     C                     Z-ADDYM,5      W1YM5
     C                     Z-ADDKS,6      W1KOS6
     C                     Z-ADDYM,6      W1YM6
      * MBEPP02
     C                     EXSR #SB520
     C                     Z-ADDSR,6      W1SRY6
     C                     Z-ADDSR,5      W1SRY5
     C                     Z-ADDSR,4      W1SRY4
     C                     Z-ADDSR,3      W1SRY3
     C                     Z-ADDSR,2      W1SRY2
     C                     Z-ADDSR,1      W1SRY1
      * GCQPP11
     C                     EXSR #SB530
     C                     Z-ADDWKSYOS    W1SYOS
     C                     Z-ADDWKLTIM    W1LTIM
     C                     Z-ADDWKMAIS    W1MAIS
     C                     Z-ADDWKKMAX    W1KMAX
     C                     Z-ADDWKSRYO    W1SRYO
      * ABBPP01
     C                     EXSR #SB540
     C                     Z-ADDWKN0YM    W1N0YM
     C                     Z-ADDWKN0YM    WKYM
     C                     ADD  1         WKM
     C           WKM       IFEQ 13
     C                     Z-ADD1         WKM
     C                     ADD  1         WKY
     C                     ENDIF
     C                     Z-ADDWKYM      W1N1YM
     C                     Z-ADDW1N1YM    WKYM
     C                     ADD  1         WKM
     C           WKM       IFEQ 13
     C                     Z-ADD1         WKM
     C                     ADD  1         WKY
     C                     ENDIF
     C                     Z-ADDWKYM      W1N2YM
     C                     Z-ADDWKN0SR    W1N0SR
     C                     Z-ADDWKN1SR    W1N1SR
     C                     Z-ADDWKN2SR    W1N2SR
     C                     WRITEGCRWP211
      *
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
      *-------------------------------------------*
      * ECSPP01                                   *
      *-------------------------------------------*
     CSR         #SB510    BEGSR
      *
     C           KEYEQ1    KLIST
     C                     KFLD           DFKAT1
     C                     KFLD           DFKAT2
     C                     KFLD           KKYOYY  40
     C                     KFLD           KKYOMM  20
      *
     C           KEYEQ2    KLIST
     C                     KFLD           DFKAT1
     C                     KFLD           DFKAT2
      *
     C                     CLEARYM
     C                     CLEARKS
      *
     C                     Z-ADD*YEAR     WKY
     C                     Z-ADDUMONTH    WKM
     C                     SUB  1         WKM
     C           WKM       IFEQ 0
     C                     Z-ADD12        WKM
     C                     SUB  1         WKY
     C                     ENDIF
      *
     C                     Z-ADDWKY       KKYOYY
     C                     Z-ADDWKM       KKYOMM
     C                     Z-ADD0         WKKOSU  30
     C                     Z-ADD1         X       20
     C           X         DOWLE6
     C                     EXSR #SB511
     C                     SUB  1         WKM
     C           WKM       IFEQ 0
     C                     Z-ADD12        WKM
     C                     SUB  1         WKY
     C                     ENDIF
     C                     Z-ADDWKY       KKYOYY
     C                     Z-ADDWKM       KKYOMM
     C                     Z-ADD0         WKKOSU  30
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB510    ENDSR
      *-------------------------------------------*
      * ECSPP01                                   *
      *-------------------------------------------*
     CSR         #SB511    BEGSR
      *
     C           KEYEQ1    SETLLECSPL071
     C           KEYEQ1    READEECSPL071                 83
     C           *IN83     DOWEQ'0'
     C           EQSKJY    IFEQ 'D'
     C           EQSKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  EQKOSU    WKKOSU
     C                     ENDIF
     C           KEYEQ1    READEECSPL071                 83
     C                     ENDDO
      *
     C                     Z-ADDWKYM      YM,X
     C                     Z-ADDWKKOSU    KS,X
      *
     CSR         ESB511    ENDSR
      *-------------------------------------------*
      * MBEPP02                                   *
      *-------------------------------------------*
     CSR         #SB520    BEGSR
      *
     C           KEYI6     KLIST
     C                     KFLD           KKDNEN  40
     C                     KFLD           DFSHN1
     C                     KFLD           DFSHN2
     C                     KFLD           DFSHN3
      *
     C                     CLEARSR
      *
     C                     Z-ADD1         X       20
     C           X         DOWLE6
     C                     Z-ADDYM,X      WKYM
     C                     Z-ADDWKY       KKDNEN
     C                     EXSR #SB521
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB520    ENDSR
      *-------------------------------------------*
      * MBEPP02                                   *
      *-------------------------------------------*
     CSR         #SB521    BEGSR
      *
     C           KEYI6     CHAINMBEPL051             83
     C           *IN83     IFEQ '0'
     C                     Z-ADDWKM       M       20
     C                     Z-ADDI6S,M     SR,X
     C                     ENDIF
      *
     CSR         ESB521    ENDSR
      *-------------------------------------------*
      * GCQPP11                                   *
      *-------------------------------------------*
     CSR         #SB530    BEGSR
      *
     C           KEYT6     KLIST
     C                     KFLD           DFKAT1
     C                     KFLD           DFKAT2
      *
     C                     Z-ADD0         WKSYOS  30
     C                     Z-ADD0         WKLTIM  31
     C                     Z-ADD0         WKMAIS  20
     C                     Z-ADD0         WKKMAX  20
     C                     Z-ADD0         WKSRYO  72
     C                     MOVEL'0'       GET     1
     C           KEYT6     SETGTGCQPL121
     C           KEYT6     REDPEGCQPL121                 83
     C           *IN83     DOWEQ'0'
     C           GET       ANDEQ'0'
     C           T6SKJY    IFEQ 'D'
     C           T6SKHZ    ANDLE*DATE
     C                     ELSE
     C           T6KIHZ    IFLE *DATE
     C                     MOVEL'1'       GET     1
     C                     Z-ADDT6SYOS    WKSYOS
     C                     Z-ADDT6LTIM    WKLTIM
     C                     Z-ADDT6MAIS    WKMAIS
     C                     Z-ADDT6KMAX    WKKMAX
     C                     Z-ADDT6SRYO    WKSRYO
     C                     ENDIF
     C                     ENDIF
     C           KEYT6     REDPEGCQPL121                 83
     C                     ENDDO
      *
     CSR         ESB530    ENDSR
      *-------------------------------------------*
      * ABBPP01                                   *
      *-------------------------------------------*
     CSR         #SB540    BEGSR
      *
     C           KEYQ5     KLIST
     C                     KFLD           DFSHN1
     C                     KFLD           DFSHN2
     C                     KFLD           DFSHN3
      *
     C                     Z-ADD0         WKN0YM  60
     C                     Z-ADD0         WKN0SR  90
     C                     Z-ADD0         WKN1SR  90
     C                     Z-ADD0         WKN2SR  90
     C           KEYQ5     CHAINABBPL021             83
     C           *IN83     IFEQ '0'
     C                     Z-ADDQ5NTYM    WKN0YM
     C                     Z-ADDQ5NNNM    WKN0SR
     C                     Z-ADDQ51NNM    WKN1SR
     C                     Z-ADDQ52NNM    WKN2SR
     C                     ENDIF
      *
     CSR         ESB540    ENDSR
