      *** GDAR10 **********************************************
      *    MATERIAL ORDER DATA SUMMARY                        *
      *                    TCH          2003/02/06            *
      ******************************************* GDAR10 ******
     H            Y/                                    1
     FGDAPW10 CF  E                    WORKSTN
     FBTBPL05 UF  E           K        DISK
     FBTBPP41 UF  E           K        DISK                      A
     FBTBPL51 UF  E           K        DISK
     FGDAPL01 UF  E           K        DISK
     FGDAPL03 IF  E           K        DISK
     F            GDAPP011                          KRENAMEGDAP03R
     FGDAPL10 UF  E           K        DISK                      A
     FIZAPL01 IF  E           K        DISK
     FIZBPL01 IF  E           K        DISK
     FAB#PPCT UF  E           K        DISK                      A
     I****************************************************************
     E                    MSG     1   2 78
     E                    HTP        31  3 0
     E                    HTM        31  3 0
     E                    HTZ        31  1
     I****************************************************************
     I            DS
     I                                        1  93 HTP
     I                                        1   30BTPH01
     I                                        4   60BTPH02
     I                                        7   90BTPH03
     I                                       10  120BTPH04
     I                                       13  150BTPH05
     I                                       16  180BTPH06
     I                                       19  210BTPH07
     I                                       22  240BTPH08
     I                                       25  270BTPH09
     I                                       28  300BTPH10
     I                                       31  330BTPH11
     I                                       34  360BTPH12
     I                                       37  390BTPH13
     I                                       40  420BTPH14
     I                                       43  450BTPH15
     I                                       46  480BTPH16
     I                                       49  510BTPH17
     I                                       52  540BTPH18
     I                                       55  570BTPH19
     I                                       58  600BTPH20
     I                                       61  630BTPH21
     I                                       64  660BTPH22
     I                                       67  690BTPH23
     I                                       70  720BTPH24
     I                                       73  750BTPH25
     I                                       76  780BTPH26
     I                                       79  810BTPH27
     I                                       82  840BTPH28
     I                                       85  870BTPH29
     I                                       88  900BTPH30
     I                                       91  930BTPH31
     I            DS
     I                                        1  93 HTM
     I                                        1   30BTMH01
     I                                        4   60BTMH02
     I                                        7   90BTMH03
     I                                       10  120BTMH04
     I                                       13  150BTMH05
     I                                       16  180BTMH06
     I                                       19  210BTMH07
     I                                       22  240BTMH08
     I                                       25  270BTMH09
     I                                       28  300BTMH10
     I                                       31  330BTMH11
     I                                       34  360BTMH12
     I                                       37  390BTMH13
     I                                       40  420BTMH14
     I                                       43  450BTMH15
     I                                       46  480BTMH16
     I                                       49  510BTMH17
     I                                       52  540BTMH18
     I                                       55  570BTMH19
     I                                       58  600BTMH20
     I                                       61  630BTMH21
     I                                       64  660BTMH22
     I                                       67  690BTMH23
     I                                       70  720BTMH24
     I                                       73  750BTMH25
     I                                       76  780BTMH26
     I                                       79  810BTMH27
     I                                       82  840BTMH28
     I                                       85  870BTMH29
     I                                       88  900BTMH30
     I                                       91  930BTMH31
     I            DS
     I                                        1  31 HTZ
     I                                        1   1 BTZM01
     I                                        2   2 BTZM02
     I                                        3   3 BTZM03
     I                                        4   4 BTZM04
     I                                        5   5 BTZM05
     I                                        6   6 BTZM06
     I                                        7   7 BTZM07
     I                                        8   8 BTZM08
     I                                        9   9 BTZM09
     I                                       10  10 BTZM10
     I                                       11  11 BTZM11
     I                                       12  12 BTZM12
     I                                       13  13 BTZM13
     I                                       14  14 BTZM14
     I                                       15  15 BTZM15
     I                                       16  16 BTZM16
     I                                       17  17 BTZM17
     I                                       18  18 BTZM18
     I                                       19  19 BTZM19
     I                                       20  20 BTZM20
     I                                       21  21 BTZM21
     I                                       22  22 BTZM22
     I                                       23  23 BTZM23
     I                                       24  24 BTZM24
     I                                       25  25 BTZM25
     I                                       26  26 BTZM26
     I                                       27  27 BTZM27
     I                                       28  28 BTZM28
     I                                       29  29 BTZM29
     I                                       30  30 BTZM30
     I                                       31  31 BTZM31
     I            DS
     I                                        1   80LASKHZ
     I                                        1   40LASKYY
     I                                        5   60LASKMM
     I                                        7   80LASKDD
     I            DS
     I                                        1   80LAKOHZ
     I                                        1   40LAKOYY
     I                                        5   60LAKOMM
     I                                        7   80LAKODD
     I            DS
     I                                        1   60LAKOTM
     I                                        1   20LAKOHH
     I                                        3   40LAKOSS
     I            DS
     I                                        1   80BTSKHZ
     I                                        1   40BTSKYY
     I                                        5   60BTSKMM
     I                                        7   80BTSKDD
     I            DS
     I                                        1   80BTKOHZ
     I                                        1   40BTKOYY
     I                                        5   60BTKOMM
     I                                        7   80BTKODD
     I            DS
     I                                        1   60BTKOTM
     I                                        1   20BTKOHH
     I                                        3   40BTKOSS
     I            DS
     I                                        1   80B4SKHZ
     I                                        1   40B4SKYY
     I                                        5   60B4SKMM
     I                                        7   80B4SKDD
     I            DS
     I                                        1   80B4KOHZ
     I                                        1   40B4KOYY
     I                                        5   60B4KOMM
     I                                        7   80B4KODD
     I            DS
     I                                        1   60B4KOTM
     I                                        1   20B4KOHH
     I                                        3   40B4KOSS
     I            DS
     I                                        1   80B5SKHZ
     I                                        1   40B5SKYY
     I                                        5   60B5SKMM
     I                                        7   80B5SKDD
     I            DS
     I                                        1   80B5KOHZ
     I                                        1   40B5KOYY
     I                                        5   60B5KOMM
     I                                        7   80B5KODD
     I            DS
     I                                        1   60B5KOTM
     I                                        1   20B5KOHH
     I                                        3   40B5KOSS
     I            DS
     I                                        1   80B5NUHZ
     I                                        1   40B5NUYY
     I                                        5   60B5NUMM
     I                                        7   80B5NUDD
     I            DS
     I                                        1   80B5SYHZ
     I                                        1   40B5SYYY
     I                                        5   60B5SYMM
     I                                        7   80B5SYDD
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
     I            DS
     I                                        1   80ZDSKHZ
     I                                        1   40ZDSKYY
     I                                        5   60ZDSKMM
     I                                        7   80ZDSKDD
     I            DS
     I                                        1   80ZCUKHZ
     I                                        1   40ZCUKYY
     I                                        5   60ZCUKMM
     I                                        7   80ZCUKDD
     I            DS
     I                                        1   80ZCSTHZ
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
     I            DS
     I                                        1   80ZDUKHZ
     I                                        1   40ZDUKYY
     I                                        5   60ZDUKMM
     I                                        7   80ZDUKDD
     I            DS
     I                                        1   80ZDSTHZ
     I                                        1   40ZDSTYY
     I                                        5   60ZDSTMM
     I                                        7   80ZDSTDD
     I            DS
     I                                        1   80$WYMD
     I                                        1   60$WYM
     I                                        1   40$WYY
     I                                        5   60$WMM
     I                                        7   80$WDD
     I            DS
     I                                        1   80@WYMD
     I                                        1   60@WYM
     I                                        1   40@WYY
     I                                        5   60@WMM
     I                                        7   80@WDD
     I            DS
     I                                        1  29 WHR1
     I                                        1  15 WZAIS
     I                                       16  202WZAIK
     I                                       21  21 WPTCD
     I                                       22  250WSIRE
     I                                       26  290WUKEI
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *----------------------------------------------------------
      *    MAIN ROUTINE
      *----------------------------------------------------------
     C                     EXSR #MAIN
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *----------------------------------------------------------
     C           #MAIN     BEGSR
      *----------------------------------------------------------
     C           *INKA     DOUEQ*ON
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '1'       P@END
     C                     LEAVE
      *
     C                     OTHER
     C                     EXSR #CHK
     C           *INKE     IFEQ *ON
     C           *IN99     ANDEQ*OFF
     C                     EXSR #UPD
     C                     EXSR #PPC
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------------
     C           #CHK      BEGSR
      *----------------------------------------------------------
     C                     MOVE *OFF      *IN61
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    D@MSG
     C           D@SUPL    IFEQ *BLANK
     C                     SETON                     6199
     C                     MOVE MSG,2     D@MSG
     C                     ELSE
     C                     MOVE D@SUPL    K@SUPL  40
     C           K@SUPL    CHAINGDAPL03              90
     C           *IN90     IFEQ *ON
     C                     SETON                     6199
     C                     MOVE MSG,1     D@MSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------------
     C           #UPD      BEGSR
      *----------------------------------------------------------
     C****************
     C* READ GDAPP01 *
     C****************
     C           *LOVAL    SETLLGDAPL01
     C           *IN10     DOUEQ*ON
     C                     READ GDAPL01                  10
     C           *IN10     IFEQ *OFF
     C           IVSKJY    ANDEQ*BLANK
     C           IVSIRE    ANDEQK@SUPL
     C           IVHADT    ANDLE*DATE
     C                     MOVE IVZAIS    K@ZAIS
     C                     Z-ADDIVZAIK    K@ZAIK
     C                     MOVE IVPTCD    K@PTCD
     C                     Z-ADDIVSIRE    K@SIRE
     C                     Z-ADDIVUKEI    K@UKEI
     C                     Z-ADDIVMAIS    @MAIS
     C                     EXSR #SUM
      *
     C                     Z-ADD*DATE     IVSYHZ
     C                     UPDATGDAPP011
     C                     ENDIF
     C                     ENDDO
     C****************
     C* READ BTBPL51 *
     C****************
     C           *LOVAL    SETLLBTBPL511
     C           *IN10     DOUEQ*ON
     C                     READ BTBPL511                 10
     C           *IN10     IFEQ '0'
     C           B5SKJY    ANDEQ*BLANK
     C           B5NUHZ    ANDLE*DATE
     C           B5SIRE    ANDEQK@SUPL
      *
     C                     MOVE B5ZAIS    K@ZAIS
     C                     Z-ADDB5ZAIK    K@ZAIK
     C                     MOVE B5PTCD    K@PTCD
     C                     Z-ADDB5SIRE    K@SIRE
     C                     Z-ADDB5UKEI    K@UKEI
     C                     Z-ADDB5MAIS    @MAIS
     C                     EXSR #SUM
      *
     C                     Z-ADD*DATE     B5KOHZ
     C                     TIME           B5KOTM
     C                     MOVEL#USER     B5KOME
     C                     MOVEL*BLANK    B5KOPG
     C                     MOVEL#PGM      B5KOPG
     C                     Z-ADD*DATE     B5SYHZ
     C                     UPDATBTBPL511
     C                     ENDIF
     C                     ENDDO
      ****************
      * READ BTBPL41 *
      ****************
     C           *LOVAL    SETLLBTBPP411
     C           *IN10     DOUEQ*ON
     C                     READ BTBPP411                 10
     C           *IN10     IFEQ '0'
     C           B4SKJY    ANDEQ*BLANK
     C           B4SIRE    ANDEQK@SUPL
      *
     C                     MOVE B4ZAIS    K@ZAIS
     C                     Z-ADDB4ZAIK    K@ZAIK
     C                     MOVE B4PTCD    K@PTCD
     C                     Z-ADDB4SIRE    K@SIRE
     C                     Z-ADDB4UKEI    K@UKEI
     C                     Z-SUBB4MAIS    @MAIS
     C                     EXSR #SUM
      *
     C                     DELETBTBPP411
     C                     ENDIF
     C  N10                ENDDO
      ****************
      * READ BTBPP05 *
      ****************
     C                     Z-ADD*DATE     $WYMD
     C                     Z-ADD*DATE     @WYMD
     C           @WMM      IFEQ 01
     C                     SUB  1         @WYY
     C                     Z-ADD12        @WMM
     C                     ELSE
     C                     SUB  1         @WMM
     C                     END
      *
      *
     C           *LOVAL    SETLLBTBPL05
     C           *IN20     DOUEQ*ON
     C                     READ BTBPL05             N    20
      *
     C           *IN20     IFEQ *OFF
     C           BTSKJY    ANDEQ*BLANK
     C           BTSIRE    ANDEQK@SUPL
      *
     C                     MOVE BTZAIS    K@ZAIS
     C                     Z-ADDBTZAIK    K@ZAIK
     C                     MOVE BTPTCD    K@PTCD
     C                     Z-ADDBTSIRE    K@SIRE
     C                     Z-ADDBTUKEI    K@UKEI
     C           @LOP1     TAG
     C           K#BTB1    CHAINBTBPL05              2199
     C           *IN99     IFEQ *ON
     C                     EXFMTDSPWN
     C                     GOTO @LOP1
     C                     ENDIF
      *
     C  N21                EXSR #NXT
      *
     C           @LOP2     TAG
     C           K#BTB2    CHAINBTBPL05              2199
     C           *IN99     IFEQ *ON
     C                     EXFMTDSPWN
     C                     GOTO @LOP2
     C                     ENDIF
     C  N21                EXSR #NXT
      *
     C           K#BTB3    SETGTBTBPL05
     C                     ENDIF
     C                     ENDDO
      * GDAPP10
     C           *LOVAL    SETLLGDAPL10
     C           *IN10     DOUEQ*ON
     C                     READ GDAPL10                  10
     C           *IN10     IFEQ '0'
      *
     C           IBMAIS    IFLE 0
     C                     MOVEL'D'       IBSKJY
     C                     Z-ADD*DATE     IBSKDT
     C                     Z-ADD*DATE     IBKODT
     C                     TIME           IBKOTM
     C                     MOVEL#USER     IBKOME
     C                     UPDATGDAPP101
     C           IBMAIS    IFLT 0
     C                     MOVEL*BLANK    B4SKJY
     C                     Z-ADD0         B4SKHZ
     C                     Z-ADD*DATE     B4KOHZ
     C                     TIME           B4KOTM
     C                     MOVEL#USER     B4KOME
     C                     Z-ADDIBSIRE    B4SIRE
     C                     Z-ADDIBUKEI    B4UKEI
     C                     MOVELIBPTCD    B4PTCD
     C                     MOVELIBZAIS    B4ZAIS
     C                     Z-ADDIBZAIK    B4ZAIK
     C                     Z-SUBIBMAIS    B4MAIS
     C                     WRITEBTBPP411
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
     C***************************************************************
     C           #NXT      BEGSR
     C***************************************************************
     C                     Z-ADD0         WMAIS   30
     C                     MOVEL*BLANK    WKOSN   1
     C           @WYM      IFEQ BTKEYM
     C                     Z-ADD31        @DX     30
     C                     ELSE
     C                     Z-ADD$WDD      @DX
     C                     ENDIF
      *
     C           1         DO   @DX       U       30
      *
     C           HTZ,U     IFEQ *BLANK
     C           HTP,U     IFNE 0
     C           HTM,U     ORNE 0
     C                     ADD  HTP,U     WMAIS
     C                     SUB  HTM,U     WMAIS
     C                     MOVEL'*'       HTZ,U
     C                     MOVEL'*'       WKOSN
     C                     END
     C                     END
     C                     ENDDO
      *
     C           WKOSN     IFEQ '*'
     C                     Z-ADD*DATE     BTKOHZ
     C                     TIME           BTKOTM
     C                     MOVEL#USER     BTKOME
     C                     UPDATBTBPL051
     C                     END
      *
     C           WMAIS     IFNE 0
     C                     Z-ADDWMAIS     @MAIS   50
     C                     EXSR #SUM
     C                     END
      *
     C                     ENDSR
     C***************************************************************
     C           #SUM      BEGSR
     C***************************************************************
     C           K#BTB0    CHAINGDAPL10              90
     C           *IN90     IFEQ *OFF
     C                     ADD  @MAIS     IBMAIS
     C                     UPDATGDAPP101
     C                     ELSE
     C                     CLEARGDAPP101
     C                     MOVE K@ZAIS    IBZAIS
     C                     Z-ADDK@ZAIK    IBZAIK
     C                     Z-ADD*DATE     IBKODT
     C                     TIME           IBKOTM
     C                     MOVEL#USER     IBKOME
     C                     Z-ADDK@SIRE    IBSIRE
     C                     Z-ADDK@UKEI    IBUKEI
     C                     ADD  @MAIS     IBMAIS
     C                     MOVE K@PTCD    IBPTCD
     C                     EXSR #ZETI
     C                     MOVE PZETI     IBZETI
     C                     WRITEGDAPP101
     C                     ENDIF
      *
     C                     ENDSR
     C***************************************************************
     C           #ZETI     BEGSR
     C***************************************************************
      *
     C                     MOVE *BLANK    PZETI   4
     C                     SELEC
     C           K@PTCD    WHEQ 'W'
     C           KEY2      SETGTIZAPL01
     C           *IN10     DOUEQ*ON
     C                     SETOF                     10
     C           KEY2      REDPEIZAPL011                 10
      *
     C           *IN10     IFEQ '0'
     C           ZCSKJY    ANDEQ*BLANK
     C           ZCUKHZ    ANDLE*DATE
     C           ZCSTHZ    ANDGT*DATE
     C                     MOVELZCKNO3    PZETI
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *------------*
      * ROD KANBAN *
      *------------*
     C           K@PTCD    WHEQ 'R'
     C           KEY2      SETGTIZBPL01
     C           *IN10     DOUEQ*ON
     C           KEY2      REDPEIZBPL011                 10
      *
     C           *IN10     IFEQ '0'
     C           ZDSKJY    ANDEQ*BLANK
     C           ZDUKHZ    ANDLE*DATE
     C           ZDSTHZ    ANDGT*DATE
     C                     MOVELZDKNO3    PZETI
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSL
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #PPC      BEGSR
      *---------------------------------------------------
     C                     TIME           @@TIM6  60
     C           K#PPCT    CHAINAB#PPCT              90
     C           *IN90     IFEQ *ON
     C                     CLEARAB#PPCT1
     C                     ENDIF
     C                     MOVELK@KWD1    CTKEY1
     C                     MOVELK@KWD2    CTKEY2
     C                     Z-ADD*DATE     CTNBR1
     C                     Z-ADD@@TIM6    CTNBR2
     C  N90                UPDATAB#PPCT1
     C   90                WRITEAB#PPCT1
      *
     C                     ENDSR
      *---------------------------------------------------
     C           *INZSR    BEGSR
      *---------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           P@END   1
      *
     C           KEY2      KLIST
     C                     KFLD           K@ZAIS
     C                     KFLD           K@ZAIK
     C                     KFLD           K@UKEI
     C                     KFLD           K@SIRE
     C           K#BTB0    KLIST
     C                     KFLD           K@SIRE  40
     C                     KFLD           K@ZAIS 15
     C                     KFLD           K@ZAIK  52
     C                     KFLD           K@PTCD  1
     C                     KFLD           K@UKEI  40
     C           K#BTB1    KLIST
     C                     KFLD           K@SIRE  40
     C                     KFLD           K@UKEI  40
     C                     KFLD           K@PTCD  1
     C                     KFLD           K@ZAIS 15
     C                     KFLD           K@ZAIK  52
     C                     KFLD           @WYM
     C           K#BTB2    KLIST
     C                     KFLD           K@SIRE  40
     C                     KFLD           K@UKEI  40
     C                     KFLD           K@PTCD  1
     C                     KFLD           K@ZAIS 15
     C                     KFLD           K@ZAIK  52
     C                     KFLD           $WYM
     C           K#BTB3    KLIST
     C                     KFLD           K@SIRE  40
     C                     KFLD           K@UKEI  40
     C                     KFLD           K@PTCD  1
     C                     KFLD           K@ZAIS 15
     C                     KFLD           K@ZAIK  52
     C           KEY1      KLIST
     C                     KFLD           WSIRE
     C                     KFLD           WUKEI
     C                     KFLD           WPTCD
     C                     KFLD           WZAIS
     C                     KFLD           WZAIK
     C           K#PPCT    KLIST
     C                     KFLD           K@KWD1  8
     C                     KFLD           K@KWD2  8
      *
     C                     MOVE *BLANK    P@END
     C                     MOVEL'MATERIAL'K@KWD1
     C                     MOVEL'SUMMARY 'K@KWD2
     C           K#PPCT    CHAINAB#PPCT             N90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDCTNBR1    D@DATE
     C                     Z-ADDCTNBR2    D@TIME
     C                     ENDIF
      *
     C                     ENDSR
** MSG
NO DATA!!
SUPPLIER CODE ERROR.
