     H            Y/
     F***************************************************
     F*   PT PARTS LIST                                   *
     F*                                                 *
     F*                                                 *
     F*                                                 *
     F***************************************************
     FAAPTL01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FMBDPL01 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FFAAPL04 IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
      *------------------------------------------------------------
     E                    TTL     1   3 25
     E                    DLV        24  4 0
     E                    NAM        24 15
     E                    DLVX        6  4
     E                    NAMX        6 15
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1  140W@TIME
     I                                        1   60W@HMS
     I                                        7  140W@YMD
     I                                        7  100W@YY
     I                                       11  120W@MM
     I                                       13  140W@DD
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   60@@MDY
     I                                        1   20@@MM
     I                                        3   40@@DD
     I                                        5   60@@YY
     I            DS
     I                                        1   80A2TYMD
     I                                        1   40A2TAYY
     I                                        5   60A2TAMM
     I                                        7   80A2TADD
     I            DS
     I                                        1   80L7STHZ
     I                                        1   40L7STYY
     I                                        5   60L7STMM
     I                                        7   80L7STDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C                     EXSR #PRT1
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#FCEP    KLIST
     C                     KFLD           L5SHN1
     C                     KFLD           L5SHN2
     C                     KFLD           L5SHN3
     C           K#ADGX    KLIST
     C                     KFLD           W@YY
     C                     KFLD           W@MM
     C           K#GAD     KLIST
     C                     KFLD           F3TOKU
     C                     KFLD           F3NONY
     C           K#GADX    KLIST
     C                     KFLD           B7TOKU
     C                     KFLD           B7NONY
      *
     C                     TIME           W@TIME
     C                     Z-ADDW@YY      @@YY
     C                     Z-ADDW@MM      @@MM
     C                     Z-ADDW@DD      @@DD
     C                     MOVE *ALL'-'   @@LINE198
      *
     C                     ENDSR
      *------------------------------------------------------
      *   FINISHED GOODS
      *------------------------------------------------------
     C           #PRT1     BEGSR
      *
     C                     MOVE TTL,1     W@TTL  25 P
     C                     MOVE *OFF      *IN98
     C           *IN80     DOUEQ*ON
     C                     READ AAPTL01                  80
     C           *IN80     IFEQ *OFF
     C           L5SKJY    ANDEQ*BLANK
     C           L5STHZ    ANDEQ99999999
     C           L5TKR1    ANDEQ'0'
      *
     C           K#FCEP    CHAINFCEPL01              90
     C           *IN90     IFEQ *OFF
     C           A2TYMD    IFLT 20021101
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
      *
     C  N98                MOVE *ON       *IN98
      *
      * ACTUAL SHIPMENT
     C                     EXSR #ACT
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   ACTUAL SHIPMENT
      *------------------------------------------------------
     C           #ACT      BEGSR
      *
     C                     Z-ADD*ZERO     DLV
     C                     MOVE *BLANK    NAM
     C                     Z-ADD*ZERO     X       20
     C                     Z-ADD*ZERO     @@QTY   92
     C                     Z-ADD*ZERO     @@NONY  40
     C           K#FCEP    SETLLMBDPL01
     C           *IN90     DOUEQ*ON
     C           K#FCEP    READEMBDPL01                  90
     C           *IN90     IFEQ *OFF
     C           F3SKJY    ANDEQ*BLANK
      *
     C           F3NONY    IFNE @@NONY
     C           K#GAD     SETLLGADPL11
     C           *IN91     DOUEQ*ON
     C           K#GAD     READEGADPL11                  91
     C           *IN91     IFEQ *OFF
     C           B5SKJY    ANDEQ*BLANK
     C                     ADD  1         X
     C                     MOVELB5KMEI    NAM,X
     C                     Z-ADDF3NONY    DLV,X
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     Z-ADDF3NONY    @@NONY
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           K#FCEP    SETLLFAAPL04
     C           *IN90     DOUEQ*ON
     C           K#FCEP    READEFAAPL04                  90
     C           *IN90     IFEQ *OFF
     C           B7SKBN    ANDEQ*BLANK
      *
     C           B7NONY    LOKUPDLV                      10
     C           *IN10     IFEQ *OFF
     C           K#GADX    SETLLGADPL11
     C           *IN91     DOUEQ*ON
     C           K#GADX    READEGADPL11                  91
     C           *IN91     IFEQ *OFF
     C           B5SKJY    ANDEQ*BLANK
     C                     ADD  1         X
     C                     MOVELB5KMEI    NAM,X
     C                     Z-ADDB7NONY    DLV,X
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *BLANK    DLVX
     C                     MOVE *BLANK    NAMX
     C                     Z-ADD*ZERO     Y       20
      *
     C           L5SHN2    COMP *BLANK                   01
     C           L5SHN3    COMP *BLANK                   02
     C                     EXCPT@DT1
      *
     C           DLV,1     IFEQ *ZERO
     C                     EXCPT@SKP
     C                     ELSE
     C           1         DO   24        X
     C           DLV,X     IFEQ *ZERO
     C                     LEAVE
     C                     ENDIF
     C                     ADD  1         Y
     C                     MOVE DLV,X     DLVX,Y
     C                     MOVE NAM,X     NAMX,Y
     C           Y         IFEQ 6
     C                     EXCPT@DT2
     C                     MOVE *BLANK    DLVX
     C                     MOVE *BLANK    NAMX
     C                     Z-ADD*ZERO     Y       20
     C                     ENDIF
     C                     ENDDO
      *
     C           Y         IFNE *ZERO
     C                     EXCPT@DT2
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         @@MDY Y  175
     O                                  178 'P.'
     O                         PAGE  Z  182
     O        E   02           @HED
     O                                   83 'ASJ PARTS LIST'
     O                         W@TTL    104
     O                         W@HMS    175 '  :  :  '
     O        E   04           @HED
     O                                    5 'PART#'
     O                                   45 'START DATE'
     O                                   55 'LOCATION'
     O                                   66 'SHIP TO'
     O        E  106           @HED
     O                         @@LINE   198
     O        E 00             @DT1
     O                         A2BHB1     5
     O                      N01           6 '-'
     O                         A2BHB2    11
     O                      N02          12 '-'
     O                         A2BHB3    14
     O                         A2TYMD    45 '    /  /  '
     O                         A2STRK    48
     O                         A2STRT    51
     O                         A2STRR    54
     O                         A2STRD    56
      *
     O        E  1             @DT2
     O                         DLVX,1    62
     O                         NAMX,1    78
     O                         DLVX,2    83
     O                         NAMX,2    99
     O                         DLVX,3   104
     O                         NAMX,3   120
     O                         DLVX,4   125
     O                         NAMX,4   141
     O                         DLVX,5   146
     O                         NAMX,5   172
     O                         DLVX,6   177
     O                         NAMX,6   193
     O        E  1             @SKP
     O                                    1 ' '
      *
**  TTL
<< FINISHED PARTS >>
<< HALF FINISHED PARTS >>
<< WASHER >>
