     H            Y/
     F***************************************************
     F*   WASHER LIST TO  PC
     F*                                                 *
     F***************************************************
     FGDGPW53 CF  E                    WORKSTN
     F                                              KINFDS @INFDS
     FFCEPL01 IF  E           K        DISK
     FMCENP13 IF  E           K        DISK
     FAKBPL08 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FGDGWP53 O   E                    DISK
      *------------------------------------------------------------
     E                    KB         15  3               MACHINE
     E                    KO         15  3               PROCESS
     E                    MC         50  3
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1  45 KB
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  45 KO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  12 MCPRT
     I                                        1   5 MCSHN1
     I                                        6  10 MCSHN2
     I                                       11  12 MCSHN3
     I            DS
     I                                        1  12 S@PRT
     I                                        1   5 S@PRT1
     I                                        6  10 S@PRT2
     I                                       11  12 S@PRT3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#FCEP    KLIST
     C                     KFLD           L1SHN1
     C                     KFLD           L1SHN2
     C                     KFLD           L1SHN3
     C           K#MC      KLIST
     C                     KFLD           K@SHN1
     C                     KFLD           K@SHN2
     C                     KFLD           K@SHN3
     C           K#AK1     KLIST
     C                     KFLD           D@LOC1
     C           K#AK2     KLIST
     C                     KFLD           D@LOC1
     C                     KFLD           D@LOC2
      *
     C           *LIKE     DEFN MCSHN1    K@SHN1
     C           *LIKE     DEFN MCSHN2    K@SHN2
     C           *LIKE     DEFN MCSHN3    K@SHN3
      *
     C                     MOVEL'01'      W@ID    2
     C                     MOVE '1'       D@LOC1
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA FOR SUB FILE
      *------------------------------------------------------
     C           #SET      BEGSR
      *
     C           D@LOC2    IFNE *BLANK
     C           K#AK2     SETLLAKBPL08
     C                     ELSE
     C           K#AK1     SETLLAKBPL08
     C                     ENDIF
      *--> LOCATION
     C           *IN80     DOUEQ*ON
     C           D@LOC2    IFNE *BLANK
     C           K#AK2     READEAKBPL08                  80
     C                     ELSE
     C                     READ AKBPL08                  80
     C                     ENDIF
      *
     C           *IN80     IFEQ *OFF
     C           L1SKJY    ANDNE'D'
     C           L1STYY    ANDEQ9999
     C           K#FCEP    CHAINFCEPL01              90
     C           *IN90     IFEQ *OFF
     C                     ITER
     C                     ENDIF
      *
     C                     CLEARGDGWP531
      *
     C                     MOVELL1TKR1    WLOC1
     C                     MOVELL1TKR2    WLOC2
     C                     MOVELL1TKR3    WLOC3
     C                     MOVELL1TKR4    WLOC4
     C                     MOVE L1SHN1    WPART1
     C                     MOVE L1SHN2    WPART2
     C                     MOVE L1SHN3    WPART3
     C                     MOVE *BLANK    MC
     C                     Z-ADD*ZERO     Z       30
     C           K#FCEP    SETLLMCENP13
     C           *IN97     DOUEQ*ON
     C           K#FCEP    READEMCENP13                  97
B01  C           *IN97     IFEQ *OFF
      *
     C                     MOVE MCSHN1    K@SHN1
     C                     MOVE MCSHN2    K@SHN2
     C                     MOVE MCSHN3    K@SHN3
      *
     C                     EXSR #MCN
     C                     ENDIF
     C                     ENDDO
      *
     C           Z         IFEQ *ZERO
     C                     WRITEGDGWP531
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   MACHINE NUMBER
      *------------------------------------------------------
     C           #MCN      BEGSR
      *
     C           K#MC      SETLLAAMPL11
     C           *IN91     DOUEQ*ON
     C           K#MC      READEAAMPL11                  91
     C           *IN91     IFEQ *OFF
     C           CKSKJY    ANDEQ*BLANK
      *
     C                     Z-ADD1         Y       30
     C           'RL '     LOKUPKO,Y                     10
     C           *IN10     IFEQ *ON
     C           KB,Y      LOKUPMC                       10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         Z
     C                     MOVE KB,Y      MC,Z
     C                     MOVE KB,Y      WMCHN
     C                     WRITEGDGWP531
     C                     ENDIF
     C                     ENDIF
     C                     LEAVE
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     EXFMTDSP01
     C                     SELEC
      * F1
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
      * F5
     C           *INKE     WHEQ *ON
     C                     EXSR #SET
     C                     MOVEL'99'      W@ID
     C                     ENDSL
      *
     C                     ENDSR
