     H            Y.                                    1
      ** GDGR39 *******************
      *  PRINT NON-DELIVERY LIST  *
      *  A.MAMIYA    2000.11.11   *
      *  COPY FROM GDGR36         *
      *                           *
      *  ADD PGM ID ON THE LIST   *
      *  K.KASHIWAGI 2001.03.15   *
      ******************* GDGR39 **
     FGDGWP36 IP  F     128            DISK
     FGDGPL25 IF  E           K        DISK
     FQPRINT  O   F     158     OF     PRINTER
      *
     IGDGWP36 AA  01
     I                                        1   5 IHIN1
     I                                        6  10 IHIN2
     I                                       11  12 IHIN3
     I                                       13  180IODER L1
     I                                       13  14 IODR1
     I                                       15  16 IODR2
     I                                       17  18 IODR3
     I                                       19  230IITEM
     I                                       24  310IODHZ
     I                                       32  380ISYOS
     I                                       39  430IMAIS
     I                                       44  500ISURY
      *
     I                                       51  51 IHANY
     I                                       52  590IDLHZ
      *
      *
     I            DS
     I                                        1   80IESKHZ
     I                                        1   40IESKYY
     I                                        5   60IESKMM
     I                                        7   80IESKDD
     I            DS
     I                                        1   80IESOHZ
     I                                        1   40IESKOY
     I                                        5   60IESKOM
     I                                        7   80IESKOD
     I            DS
     I                                        1   80IENYHZ
     I                                        1   40IENYUY
     I                                        5   60IENYUM
     I                                        7   80IENYUD
     I            DS
     I                                        1   6 IEINVO
     I                                        1   2 IIVO1
     I                                        3   6 IIVO2
     I           SDS
     I                                        1   8 @PGMID
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *
     C                     MOVE *BLANK    WUSER   9
     C                     MOVE *BLANK    WUSME  15
     C                     CALL 'APLR00'
     C                     PARM           US
     C                     PARM           WUSME
     C                     MOVELWUSME     WUSER
      *-----*
      * KEY *
      *-----*
     C           KEY       KLIST
     C                     KFLD           IODER
     C                     KFLD           IITEM
      *-----*
      * INZ *
      *-----*
     C           *IN05     IFEQ '0'
     C                     SETON                     05
     C                     Z-ADD0         GSKSU   70
     C                     Z-ADD0         GSKHK   30
     C                     Z-ADD0         GRESU   70
     C                     Z-ADD0         GREHK   30
     C                     Z-ADD0         GMISU   70
     C                     Z-ADD0         GMIHK   30
     C                     TIME           WTIME   60
     C                     MOVE *BLANK    MINO    1
     C                     MOVE *BLANK    GHANY   1
     C                     EXCPTHD
     C                     END
      *
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
      *
     C           *INL1     IFEQ '1'
     C           *IN50     ANDEQ'1'
     C                     EXCPTDT1
     C                     END
     C                     SETON                     50
      *----------------------*
      * SHIPPING INFORMATION *
      *----------------------*
     C                     SETOF                     20
     C           KEY       SETLLGDGPL25
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY       READEGDGPL251                 10
     C           *IN10     IFEQ '0'
     C           IESKJY    IFEQ 'D'
     C           IESKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           IENYUK    IFEQ *BLANK
     C                     ADD  IESURY    GSKSU
     C                     ELSE
     C                     ADD  IESURY    GSKSU
     C                     ADD  IESURY    GRESU
     C                     END
     C                     MOVE IEHANY    GHANY
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C           ISURY     SUB  GSKSU     GMISU
     C           GMISU     IFGT 0
     C                     MOVEL'*'       MINO
     C                     END
     C           IESYOS    IFNE 0
     C           GSKSU     DIV  IESYOS    GSKHK
     C           GRESU     DIV  IESYOS    GREHK
     C           GMISU     DIV  IESYOS    GMIHK
     C                     END
     C                     EXCPTDT2
     C                     MOVE *BLANK    MINO
     C                     Z-ADD0         GSKSU
     C                     Z-ADD0         GSKHK
     C                     Z-ADD0         GRESU
     C                     Z-ADD0         GREHK
     C                     Z-ADD0         GMISU
     C                     Z-ADD0         GMIHK
     OQPRINT  E  103           HD
     O                                  151 '.....................'
      *
     O        E  1             HD
     O                                  151 '.         .         .'
      *
     O        E  1             HD
     O                         @PGMID    11
     O                                  109 'TIME'
     O                         WTIME    118
     O                                  131 '.'
     O                                  141 '.'
     O                         WUSER    150
     O                                  151 '.'
      *
     O        E  1             HD
     O                                   64 '** ORDER HISTORY LIST **'
     O                                  109 'DATE'
     O                         UDATE    118 '  .  .  '
     O                                  124 'PAGE'
     O                         PAGE  Z  128
     O                                  151 '.....................'
      *
     O        E  1             HD
     O                                   20 'ORDER INFORMATION'
     O                                   40 '--------------------'
     O                                   60 '--------------------'
     O                                   75 '---------------'
     O                                   88 '-------------'
     O                                  107 'SIHP INFO-------'
     O                                  126 'RECEIVE INFO----'
     O                                  148 'NON-DELI INFO------'
      *
     O        E  1             HD
     O                                   15 'ORDER NUMBER'
     O                                   22 'ITEM #'
     O                                   33 'ORDER DATE'
     O                                   42 'PART NO.'
     O                                   53 'QTY.'
     O                                   67 'QTY./BOX'
     O                                   72 'BOX'
     O                                   78 'CRY'
     O                                   87 'DELIVERY'
     O                                   95 'QTY.'
     O                                  104 'BOX'
     O                                  114 'QTY.'
     O                                  123 'BOX'
     O                                  133 'QTY.'
     O                                  142 'BOX'
     O                                  148 'CRY'
      *
     A*         1         2         3         4         5         6         7
     A*1234567890123456789012345678901234567890123456789012345678901234567890123
      *   ORDER INFORMATION-----------------------------------------------------
     O*   ORDER NUMBER ITEM # ORDER DATE PART NO.       QTY.      QTY./BOX  BOX
     O*   ------------ ------ ---------- -------------- --------- --------- ----
     A*         7         8         9        10        11        12        13
     A*12345678901234567890123456789012345678901234567890123456789012345678901
     O*----------------------------   SIHPING INFO----   RECEIVE INFO----
     O*TY./BOX  BOX   CRY DELIVERY    QTY.     BOX       QTY.      BOX
     O*-------- ------ - ----------   --------- ------   --------- ------
     A*11      12        13        14        15        16
     A*12345678901234567890123456789012345678901234567890
     O*RECEIVE INFO----   NON-DELI INFO------
     O*QTY.      BOX      QTY.      BOX   CRY
     O*--------- ------   --------- ------ -
     O*
      *
     O        E  1             HD
     O                                   15 '------------'
     O                                   22 '------'
     O                                   33 '----------'
     O                                   48 '--------------'
     O                                   58 '---------'
     O                                   68 '---------'
     O                                   75 '------'
     O                                   77 '-'
     O                                   88 '----------'
     O                                  100 '---------'
     O                                  107 '------'
     O                                  119 '---------'
     O                                  126 '------'
     O                                  138 '---------'
     O                                  145 '------'
     O                                  147 '-'
      *
     O        E  1             DT1
      *
     O        E  1             DT2
     O                         MINO       2
     O                                    7 'IAF-'
     O                         IODR1      9
     O                                   10 '-'
     O                         IODR2     12
     O                                   13 '-'
     O                         IODR3     15
     O                         IITEM     21
     O                         IODHZ     33 '    /  /  '
     O                         IHIN1     39
     O                                   40 '-'
     O                         IHIN2     45
     O                                   46 '-'
     O                         IHIN3     48
     O                         ISURY     58 ' ,   ,   '
     O                         ISYOS     68 ' ,   ,   '
     O                         IMAIS     75 ' ,    '
     O                         IHANY     77
     O                         IDLHZ     88 '    /  /  '
     O                         GSKSU    100 ' ,   ,   '
     O                         GSKHK    107 ' ,    '
     O                         GRESU    119 ' ,   ,   '
     O                         GREHK    126 ' ,    '
     O                         GMISU    138 ' ,   ,   '
     O                         GMIHK    145 ' ,    '
     O                         GHANY    147
