     H            Y.
     F** GDGRA1 *********************************/
     F*       ..LIST OF INPORT ORDER DATE ..    */
     F* CODING:K.OKACHI           2000.11.08    */
     F*----------+-----+----------+-----------------------------------*
     F*2021.02.04|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F****************************************************************/
     FGDGWPA01IP  F     256            DISK
     FFCEPL11 IF  E           K        DISK
     FAAPPL05 IF  E           K        DISK
     FAANPL05 IF  E           K        DISK
     FAKBPL06 IF  E           K        DISK
     FQPRINT  O   F      80     OF     PRINTER
     E                    TITLE   1   1 60
      *
     IGDGWPA01AA
     I                                        1   6 IODER
     I                                        7  10 IZETI
     I                                       11  11 ISEIH
     I                                       12  15 IRENB
     I                                       16  16 ICD
     I                                       17  21 IHIN1 L1
     I                                       22  26 IHIN2 L1
     I                                       27  28 IHIN3 L1
     I                                       29  350ISYOS
     I                                       36  380IMAIS
     I                                       39  46 ISYHZ
     I                                       47  500IHAYY
     I                                       51  520IHAMM
     I                                       53  540IHADD
      *
     I            DS
     I                                        1   80FCSKHZ
     I                                        1   40FCSKYY
     I                                        5   60FCSKMM
     I                                        7   80FCSKDD
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *
     C           *IN05     IFEQ '0'
     C                     SETON                     05
     C                     MOVE *BLANK    WUS     9
     C                     MOVE *BLANK    WUSME  15
     C                     CALL 'APLR00'
     C                     PARM           US
     C                     PARM           WUSME
     C                     MOVELWUSME     WUS
     C                     TIME           WTIME   60
     C                     EXCPTHD
     C                     END
      *
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
      *
     C                     Z-ADD0         WNOSU  100
     C           ISYOS     MULT IMAIS     WNOSU
      *
     C           *INL1     IFEQ '1'
     C                     EXSR #SB100
     C                     EXSR #SB200
     C                     EXCPTDH
     C                     END
      *
     C                     EXCPTDT
      *
      *-----------------------------------------------------*
      *                  新旧設定数収得                   *
      *-----------------------------------------------------*
     C           #SB100    BEGSR
     C                     Z-ADD0         WSTSU1  90
     C                     Z-ADD0         WSTSU2  90
     C           KEY01     KLIST
     C                     KFLD           IHIN1
     C                     KFLD           IHIN2
     C                     KFLD           IHIN3
     C                     SETOF                     10
     C           KEY01     CHAINFCEPL111             10
     C           *IN10     IFEQ '0'
     C           FCSKJY    IFEQ 'D'
     C           FCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDFCGK01    WSTSU1
     C                     Z-ADDFCGK02    WSTSU2
     C                     END
     C                     END
     C           ESB100    ENDSR
      *-----------------------------------------------------*
      *                新旧かんばん枚数収得               *
      *-----------------------------------------------------*
     C           #SB200    BEGSR
     C                     Z-ADD0         WMIN    50
     C                     Z-ADD0         WMAX    50
     C           KEY02     KLIST
     C                     KFLD           KZETI
     C                     MOVE *BLANK    KZETI
     C                     MOVE IZETI     KZETI   4
     C           ISEIH     CASEQ'0'       #SB210
     C           ISEIH     CASEQ'3'       #SB220
     C           ISEIH     CASEQ'6'       #SB230
     C                     ENDCS
     C           ESB200    ENDSR
      *-----------------------------------------------------*
      *                完成品かんばんＭ                   *
      *-----------------------------------------------------*
     C           #SB210    BEGSR
     C           KEY02     SETGTAAPPL051
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY02     REDPEAAPPL051                 10
     C           *IN10     IFEQ '0'
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDL5KMIN    WMIN
     C                     Z-ADDL5KMAX    WMAX
     C                     SETON                     10
     C                     END
     C                     END
     C  N10                ENDDO
     C           ESB210    ENDSR
      *-----------------------------------------------------*
      *                構成品かんばんＭ                   *
      *-----------------------------------------------------*
     C           #SB220    BEGSR
     C           KEY02     SETGTAKBPL061
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY02     REDPEAKBPL061                 10
     C           *IN10     IFEQ '0'
     C           L1SKJY    IFEQ 'D'
     C           L1SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDL1KMIN    WMIN
     C                     Z-ADDL1KMAX    WMAX
     C                     SETON                     10
     C                     END
     C                     END
     C  N10                ENDDO
     C           ESB220    ENDSR
      *-----------------------------------------------------*
      *                半製品かんばんＭ                   *
      *-----------------------------------------------------*
     C           #SB230    BEGSR
     C           KEY02     SETGTAANPL051
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY02     REDPEAANPL051                 10
     C           *IN10     IFEQ '0'
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDL7KMIN    WMIN
     C                     Z-ADDL7KMAX    WMAX
     C                     SETON                     10
     C                     END
     C                     END
     C  N10                ENDDO
     C           ESB230    ENDSR
     OQPRINT  E  102           HD
     O                                   80 '...........'
     O        E  1             HD
     O                                   10 'AAPRA0-1'
     O                                   58 'TIME'
     O                         WTIME Y   67
     O                                   80 '.         .'
     O        E  1             HD
     O                                    6 'PAGE'
     O                         PAGE  Z   10
     O                                   58 'DATE'
     O                         UDATE Y   67
     O                                   70 '.'
     O                         WUS       79
     O                                   80 '.'
     O        E  2             HD
     O                         TITLE     63
     O                                   80 '...........'
      *
     O        E  2             HD
     O                                   12 'PART NO.'
     O                                   27 'ORDER DATE'
     O                                   36 'VOLUME'
     O                                   46 'QTY/BOX'
     O                                   59 'ORDER QTY'
     O                                   72 'NOTE'
     O        E  1             DH
     O                                    8 'OLD QTY:'
     O                         WSTSU22 +  1
     O                                 +  5 'OLD KANBAN:'
     O                         WMIN  2 +  1
     O        E  1             DH
     O                                    8 'NEW QTY:'
     O                         WSTSU12 +  1
     O                                 +  5 'NEW KANBAN:'
     O                         WMAX  2 +  1
     O        E  2             DT
     O                         IHIN1      6
     O                                    7 '-'
     O                         IHIN2     12
     O                                   13 '-'
     O                         IHIN3     15
     O                         IHAYY     21
     O                                   22 '.'
     O                         IHAMM     24
     O                                   25 '.'
     O                         IHADD     27
     O                         IMAIS K   35
     O                         ISYOS 2   46
     O                         WNOSU 2   59
     O                                   61 '('
     O                                   80 ')'
**  TITLE
  ** ASJ PASS-THROUGH PART SETTING NO. INC-DECREASE LIST **
