     H            Y.
      ** GDGR27  *****************************************************
      *  SET (IECNNO, IECNRD) OF GDGPP25                             *
      *  SEEK                       2023.02.17                       *
      ****************************************************************
     FGDGWP27 IF  E                    DISK
     FGDGPL26 UF  E           K        DISK
     I            DS
     I                                        1  30 GDFL01
     I                                        1   2 GDF01A
     I                                        4   7 GDF01B
     I            DS
     I                                        1  30 GDFL02
     I                                        1   4 GDF02A
     I            DS
     I                                        1  30 GDFL04
     I                                        5   6 GDF04A
     I                                        8   9 GDF04B
     I                                       11  12 GDF04C
     I            DS
     I                                        1  30 GDFL05
     I                                        3   7 GDF05A
     I            DS
     I                                        1   6 W0INVO
     I                                        1   2 W0INV1
     I                                        3   6 W0INV2
     I            DS
     I                                        1   6 W0ODER
     I                                        1   2 W0ODE1
     I                                        3   4 W0ODE2
     I                                        5   6 W0ODE3
     I            DS
     I                                        1   80IESKDT
     I                                        1   40IESKYY
     I                                        5   60IESKMM
     I                                        7   80IESKDD
     I            DS
     I                                        1   80IEKODT
     I                                        1   40IEKOYY
     I                                        5   60IEKOMM
     I                                        7   80IEKODD
     I            DS
     I                                        1   40IEKOTM
     I                                        1   20IEKOHH
     I                                        3   40IEKOSS
     I            DS
     I                                        1  140W0TIME
     I                                        1   60W0TITM
     I                                        1   40W0TIT4
     I                                        7  140W0TIDT
     I           SDS
     I                                     *PROGRAM DSPGM
     I                                      254 263 DSUSER
      ****************************************************************
      * PARAMETER                                                    *
      ****************************************************************
     C*
      ****************************************************************
      * KEY LIST                                                     *
      ****************************************************************
     C*  GDGPL26
     C           KEYIE     KLIST
     C                     KFLD           IEINVO            INVOICE NO.
     C                     KFLD           IEODER            ORDER NO
     C                     KFLD           IEITEM            ITEM NO
      ****************************************************************
      * MAIN                                                         *
      ****************************************************************
     C* INITIALIZE
     C                     EXSR #INIT
     C*
     C           1         SETLLGDGWP271
B01  C                     DO   *HIVAL
     C                     READ GDGWP271                 90
     C   90                LEAVE
     C*
B02  C           GDFL06    IFEQ *BLANK
     C                     ITER
E02  C                     ENDIF
     C*
     C                     MOVE *BLANK    W0INVO            INVOICE NO
     C                     MOVELGDF01A    W0INV1
     C                     MOVELGDF01B    W0INV2
     C                     MOVE *BLANK    W0ODER            ORDER NO
     C                     MOVELGDF04A    W0ODE1
     C                     MOVELGDF04B    W0ODE2
     C                     MOVELGDF04C    W0ODE3
     C                     MOVELW0INVO    IEINVO            INVOICE NO.
     C                     MOVELW0ODER    IEODER            ORDER NO
     C                     MOVELGDF05A    IEITEM            ITEM NO
     C           KEYIE     SETLLGDGPL26
B02  C                     DO   *HIVAL
     C           KEYIE     READEGDGPL26                  90
     C   90                LEAVE
     C*
B03  C           IESKJY    IFEQ 'D'
     C           IESKDT    ANDLEW0TIDT
     C                     ITER
E03  C                     ENDIF
B03  C           IEPARE    IFNE GDF02A
     C                     ITER
E03  C                     ENDIF
     C*
     C                     MOVELGDFL15    IECAHK            CASE# ISSUE DATE
     C                     MOVELGDFL03    IECNNO            CONTAINER NO.
     C                     Z-ADDW0TIDT    IEKODT            UPDATE WORK DATE
     C                     Z-ADDW0TIT4    IEKOTM            UPDATE WORK TIME
     C                     MOVELDSUSER    IEKOME            NAME OF TEAM MEMBER
     C                     UPDATGDGPL261
     C*
E02  C                     ENDDO
     C*
E01  C                     ENDDO
     C* 終了
     C                     MOVE *ON       *INLR
     C                     RETRN
      ****************************************************************
      * INITIALIZE                                                   *
      ****************************************************************
     C           #INIT     BEGSR
     C*
     C                     TIME           W0TIME
     C*
     C                     ENDSR
