      ** GDGR1Y ******************************************************
      *    GET DEPARTMENT CODE ( PART NO )
      *    KIRI 2014.11.26
      *---------------------------------------------------------------
      * PARM( '94130' '60600' '  ' '    ')
      * PARM( '90119' 'T0464' '  ' '    ')
      ****************************************************************
     H            Y/                                    1
      *
      * COMPONENTS KANBAN M/F
      *構成品かんばんマスター
     FAKBPL04 IF  E           K        DISK
      *
      * HALF-FINISHED GOODS KANBAN M/F
      *半製品かんばんマスター
     FAANPL06 IF  E           K        DISK
      *
      * COMPLETION HALF-FINISHED GOODS KANBAN M/F
      *完成半製品かんばんマスター
     FAAPTL01 IF  E           K        DISK
      *================================================================
      *================================================================
     I            DS
     I                                        1   60@@TIME
     I                                        1   40@TIME
      *
     I            DS
     I                                        1   80L7SKHZ
     I                                        1   40L7SKYY
     I                                        5   60L7SKMM
     I                                        7   80L7SKDD
     I            DS
     I                                        1   80L7UKHZ
     I                                        1   40L7UKYY
     I                                        5   60L7UKMM
     I                                        7   80L7UKDD
     I            DS
     I                                        1   80L7STHZ
     I                                        1   40L7STYY
     I                                        5   60L7STMM
     I                                        7   80L7STDD
      *     <<
     I           SDS
     I                                        1  10 @@PGM
     I                                      254 263 @@USID
     C*===============================================================
     C           *ENTRY    PLIST
     C                     PARM           P@HIN1  5        PART NO1
     C                     PARM           P@HIN2  5        PART NO2
     C                     PARM           P@HIN3  2        PART NO3
     C*                                                 DEPARTMENT CODE
     C                     PARM           P@BMON  4
     C*--------------------
     C                     MOVE *BLANK    P@BMON
      *
     C                     EXSR #BMON
     C*--------------------
     C                     SETON                     LR
     C                     RETRN
     C*================================================================
     C*================================================================
     C           #BMON     BEGSR                                     *
      *
     C           KEY01     KLIST
     C                     KFLD           P@HIN1  5        PART NO1
     C                     KFLD           P@HIN2  5        PART NO2
     C                     KFLD           P@HIN3  2        PART NO3
      *
      * COMPLETION HALF-FINISHED GOODS KANBAN M/F *
      *完成半製品かんばんマスター
     C                     SETOF                     54
     C           KEY01     SETGTAAPTL011
      *-------------------------
     C                     DO   *HIVAL
     C           ##1       TAG
     C           KEY01     REDPEAAPTL011                 54
     C           *IN54     IFEQ '0'
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    IFLE *DATE
     C                     GOTO ##1
     C                     END
     C                     END
     C*
     C           L5UKHZ    IFGT *DATE
     C                     GOTO ##1
     C                     END
     C*
     C           L5STHZ    IFLE *DATE
     C                     GOTO ##1
     C                     END
     C*
     C                     MOVE L5BMON    P@BMON
     C                     GOTO E#BMON
     C                     END
     C  N54                ENDDO
      *-------------------------
      * .. COMPONENTS KANBAN M/F   *.
      *構成品かんばんマスター
      *
     C                     SETOF                     54
     C           KEY01     SETLLAKBPL041                 54
      *-------------------------
     C                     DO   *HIVAL
     C           ##2       TAG
     C           KEY01     READEAKBPL041                 54
     C           *IN54     IFEQ '0'
     C           L1SKJY    IFEQ 'D'
     C           L1SKHZ    IFLE *DATE
     C                     GOTO ##2
     C                     END
     C                     END
     C           L1UKHZ    IFGT *DATE
     C                     GOTO ##2
     C                     END
     C           L1STHZ    IFLE *DATE
     C                     GOTO ##2
     C                     END
     C                     MOVELL1BMON    P@BMON
     C                     GOTO E#BMON
     C                     END
     C  N54                ENDDO
      *-------------------------
      * HALF-FINISHED GOODS KANBAN M/F   *
      *半製品かんばんマスター
      *
     C                     SETOF                     54
     C           KEY01     SETLLAANPL061                 54
      *-------------------------
     C                     DO   *HIVAL
     C           ##3       TAG
     C           KEY01     READEAANPL061                 54
     C           *IN54     IFEQ '0'
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    IFLE *DATE
     C                     GOTO ##3
     C                     END
     C                     END
     C           L7UKHZ    IFGT *DATE
     C                     GOTO ##3
     C                     END
     C           L7STHZ    IFLE *DATE
     C                     GOTO ##3
     C                     END
     C                     MOVELL7BMON    P@BMON
     C                     GOTO E#BMON
     C                     END
     C  N54                ENDDO
      *-------------------------
     C*
     C           E#BMON    ENDSR
     C*================================================================
