     H            Y.
     F** GDGR24 ***************************
     F*  MATERIAL ORDER FILE UPDATE LSIT  *
     F*         K.YASUDA     2000.12.14   *
     F*************************** GDGR24 **
     FGDGWP24 IP  F     128            DISK
     FQPRINT  O   F      80     OF     PRINTER
     E                    UP1     1   3  1   UP2    60
      *
     IGDGWP24 AA  01
     I                                        1   1 IUPDT L1
     I                                        2   7 IODER
     I                                        2   3 IODR1
     I                                        4   5 IODR2
     I                                        6   7 IODR3
     I                                        8   8 IPTCD
     I                                        9  130IITEM
     I                                       14  18 IHIN1
     I                                       19  23 IHIN2
     I                                       24  25 IHIN3
     I                                       26  320ISYOS
     I                                       33  370IHAKO
     I                                       38  440IOQTY
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           USER   10
      *
     C           *INL1     IFEQ '1'
     C                     Z-ADD1         Z       30
     C                     SETOF                     20
     C           IUPDT     LOKUPUP1,Z                    20
     C           *IN20     IFEQ '1'
     C                     MOVELUP2,Z     WCMT   60
     C                     END
     C                     SETOF                     10
     C           IUPDT     IFEQ '1'
     C                     SETON                     10
     C                     END
      *
     C                     END
      *
     C           *INL1     IFEQ '1'
     C           *INOF     OREQ '1'
     C                     SETOF                     OF
     C                     EXCPTHD
     C                     END
      *
     C                     SETOF                     45
     C           IHIN3     IFNE *BLANK
     C                     SETON                     45
     C                     END
     C                     EXCPTDT
     OQPRINT  E  102           HD
     O                         WCMT      74
      *
     O        E  1             HD
     O                                    7 'GDGR24'
     O                                   71 'PAGE :'
     O                         PAGE  Z   75
     O        E  1             HD
     O                                   66 'DATE :'
     O                         UMONTH    69
     O                                   70 '/'
     O                         UDAY      72
     O                                   73 '/'
     O                         *YEAR     77
      *
     O        E  1             HD
     O                                   10 'ORDER NO.'
     O                                   23 'ITEM NO.'
     O                                   33 'PARTS NO.'
     O                                   48 'QTY./BOX'
     O                                   54 'BOX'
     O                                   67 'ORDER QTY'
     O                                   78 'REMARKS'
      *
     O        E  1             DT
     O                                    5 'IAF-'
     O                         IODR1      7
     O                                    8 '-'
     O                         IODR2     10
     O                                   11 '-'
     O                         IODR3     13
     O                         IPTCD     16
     O                                   17 '-'
     O                         IITEM     22
     O                         IHIN1     29
     O                                   30 '-'
     O                         IHIN2     35
     O                 45                36 '-'
     O                         IHIN3     38
     O                         ISYOS     49 ' ,   ,   '
     O                         IHAKO     56 '     '
     O                         IOQTY     68 '  ,   ,   '
     O                                   79 '(      )'
** UP1/UP2
0ORDER SHEET(0:DELETE) : IAF -> AOYAMA SEISAKUSYO
1ORDER SHEET(1:CHANGE) : IAF -> AOYAMA SEISAKUSYO
2ORDER SHEET(2:ADD) : IAF ->AOYAMA SEISAKUSYO
