     H            Y.
     F** GDGR1D ************************
     F* DELETE GDGPP10                 *
     F*  KIRI      2014.10.08          *
     F**********************************
     FGDGWP13 IF  F     160            DISK
     FGDGPL10 UF  E           K        DISK
     IGDGWP13 AA
     I                                        1   1 IIKBN
     I                                       16  20 IIHIN1
     I                                       21  25 IIHIN2
     I                                       26  27 IIHIN3
     I                                       57  57 IISEIH
      *
     I           SDS
     I                                     *PROGRAM ##PGM
     I                                      244 253 ##WSID
     I                                      254 263 ##USER
     I                                      264 269 ##JBNO
      *
     C                     READ GDGWP13                  80
     C           *IN80     DOWEQ'0'
     C           IIKBN     IFEQ 'D'
     C                     EXSR #SB400
     C                     ENDIF
     C                     READ GDGWP13                  80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------*
      * DELETE GDGPP10           *
      *--------------------------*
     CSR         #SB400    BEGSR
      *
     C           KEY       KLIST
     C                     KFLD           IIHIN1
     C                     KFLD           IIHIN2
     C                     KFLD           IIHIN3
     C                     KFLD           IISEIH
      *
     C           KEY       SETLLGDGPL101
     C           KEY       READEGDGPL101                 81
     C           *IN81     DOWEQ'0'
     C                     DELETGDGPL101
     C           KEY       READEGDGPL101                 81
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
