     H            Y/
     F***************************************************
     F*   ASJ WASHER - SPECIAL ORDER RECEIVING            *
     F*                                                 *
     F*                                                 *
     F*                                                 *
     F***************************************************
     FGDGPW72 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FFCEPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAKBPL04 IF  E           K        DISK
     FGDGPL40 UF  E           K        DISK                      A
      *------------------------------------------------------------
     E                    CMD     1   2 78
     E                    ARY        32 12
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1  12 S@PART
     I                                        1   5 S@PRT1
     I                                        6  10 S@PRT2
     I                                       11  12 S@PRT3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #DSP01
     C           W@ID      CASEQ'02'      #DSP02
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#FCEP    KLIST
     C                     KFLD           S@PRT1
     C                     KFLD           S@PRT2
     C                     KFLD           S@PRT3
     C           K#ADGP    KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#G40     KLIST
     C                     KFLD           D@RCVD
     C                     KFLD           D@IVNO
     C           K#G41     KLIST
     C                     KFLD           D@RCVD
     C                     KFLD           D@IVNO
     C                     KFLD           H@PRT1
     C                     KFLD           H@PRT2
     C                     KFLD           H@PRT3
      *
     C                     Z-ADD*ZERO     RRN1    40
     C                     Z-ADD*ZERO     @RRN1   40
     C                     MOVEL'01'      W@ID    2
     C                     Z-ADD*DATE     D@RCVD
      *
     C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #DSP01    BEGSR
      *
     C                     MOVELCMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVEL'99'      W@ID
      *
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     MOVEL'02'      W@ID
     C                     EXSR #SET1
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
      *
     C           D@RCVD    IFEQ *ZERO
     C                     MOVE *ON       *IN61
     C                     MOVE *ON       *IN99
     C                     ELSE
     C                     Z-ADDD@RCVD    K@YMD
     C           K#ADGP    CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C                     MOVE *ON       *IN61
     C                     MOVE *ON       *IN99
     C                     ENDIF
     C                     ENDIF
      *
     C           D@IVNO    IFEQ *BLANK
     C                     MOVE *ON       *IN62
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CLEAR
      *------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00000000'*IN,60
     C                     MOVE *BLANK    D@MSG
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA FOR 2ND SCREEN
      *------------------------------------------------------
     C           #SET1     BEGSR
      *
     C                     MOVE *ON       *IN51
     C                     WRITECTL01
     C                     MOVE *OFF      *IN51
     C                     Z-ADD*ZERO     RRN1
      *
     C           K#G40     SETLLGDGPL40
     C           *IN80     DOUEQ*ON
     C           K#G40     READEGDGPL40                  80
     C           *IN80     IFEQ *OFF
     C           G4SKJY    ANDEQ*BLANK
     C                     MOVE G4HIN1    S@PRT1
     C                     MOVE G4HIN2    S@PRT2
     C                     MOVE G4HIN3    S@PRT3
     C                     Z-ADDG4NOHK    S@RBOX
     C                     Z-ADDG4NOSU    S@RQTY
     C                     MOVE G4HIN1    H@PRT1
     C                     MOVE G4HIN2    H@PRT2
     C                     MOVE G4HIN3    H@PRT3
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDIF
     C                     ENDDO
      *
     C                     CLEARSFL01
     C                     DO   32
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDDO
      *
     C                     Z-ADD1         #RCNO1
      *
     C                     ENDSR
      *------------------------------------------------------
      *   2ND SCREEN
      *------------------------------------------------------
     C           #DSP02    BEGSR
      *
     C                     MOVELCMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN52
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN52
      *
     C                     Z-ADD@@REC     #RCNO1
     C                     SELEC
      * F3
     C           *INKC     WHEQ *ON
     C                     MOVEL'99'      W@ID
      * F12
     C           *INKL     WHEQ *ON
     C                     MOVEL'01'      W@ID
      * F05
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #WRT
     C                     MOVEL'01'      W@ID
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CHECK
      *------------------------------------------------------
     C           #CHK2     BEGSR
      *
     C                     EXSR #CLR
      *
     C                     Z-ADD*ZERO     @RRN1
     C                     MOVE *BLANK    ARY
     C                     Z-ADD*ZERO     Z       30
     C           *IN80     DOUEQ*ON
     C                     ADD  1         @RRN1
     C           @RRN1     CHAINSFL01                80
     C           *IN80     IFEQ *OFF
     C                     MOVEA'000'     *IN,61
     C           S@PART    IFNE *BLANK
      * DOUPLICATE CHECK
     C           S@PART    LOKUPARY                      10
     C           *IN10     IFEQ *ON
     C  N99                Z-ADD@RRN1     #RCNO1
     C                     MOVE *ON       *IN61
     C                     MOVE *ON       *IN99
     C                     ELSE
     C                     ADD  1         Z
     C                     MOVE S@PART    ARY,Z
     C                     ENDIF
      *PART# CHECK
     C           K#FCEP    CHAINFCEPL01              90
     C           *IN90     IFEQ *OFF
     C  N99                Z-ADD@RRN1     #RCNO1
     C                     MOVE *ON       *IN61
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           S@RBOX    IFEQ *ZERO
     C  N99                Z-ADD@RRN1     #RCNO1
     C                     MOVE *ON       *IN63
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *QTY/BOX
     C                     Z-ADD*ZERO     W@BOXQ  90
     C           K#FCEP    SETGTAKBPL041
     C           *IN98     DOUEQ*ON
     C           K#FCEP    REDPEAKBPL041                 98
B01  C           *IN98     IFEQ *OFF
B02  C           L1SKJY    ANDNE'D'
B02  C           L1STYY    ANDEQ9999
      * PCS/BOX
     C                     Z-ADDL1SYOS    W@BOXQ  90
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           W@BOXQ    MULT S@RBOX    S@RQTY
      *
     C                     ENDIF
     C                     UPDATSFL01
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   UPDATE
      *------------------------------------------------------
     C           #WRT      BEGSR
      *
     C                     Z-ADD*ZERO     @RRN1
     C           *IN80     DOUEQ*ON
     C                     ADD  1         @RRN1
     C           @RRN1     CHAINSFL01                80
     C           *IN80     IFEQ *OFF
     C                     SELEC
      * DELETE
     C           H@PRT1    WHNE *BLANK
     C           S@PART    ANDEQ*BLANK
     C           K#G41     CHAINGDGPL40              90
     C           *IN90     IFEQ *OFF
     C                     MOVE 'D'       G4SKJY
     C                     Z-ADD*DATE     G4SKDT
     C                     Z-ADD*DATE     G4KYMD
     C                     TIME           G4KTIM
     C                     MOVEL#USER     G4KOME
     C                     UPDATGDGPP401
     C                     ENDIF
      * UPDATE
     C           H@PRT1    WHNE *BLANK
     C           S@PART    ANDNE*BLANK
     C           K#G41     CHAINGDGPL40              90
     C           *IN90     IFEQ *OFF
     C                     MOVE S@PRT1    G4HIN1
     C                     MOVE S@PRT2    G4HIN2
     C                     MOVE S@PRT3    G4HIN3
     C                     Z-ADDS@RBOX    G4NOHK
     C                     Z-ADDS@RQTY    G4NOSU
     C                     Z-ADD*DATE     G4KYMD
     C                     TIME           G4KTIM
     C                     MOVEL#USER     G4KOME
     C                     UPDATGDGPP401
     C                     ENDIF
      * WRITE
     C           H@PRT1    WHEQ *BLANK
     C           S@PART    ANDNE*BLANK
     C                     MOVE S@PRT1    G4HIN1
     C                     MOVE S@PRT2    G4HIN2
     C                     MOVE S@PRT3    G4HIN3
     C                     Z-ADDS@RBOX    G4NOHK
     C                     Z-ADDS@RQTY    G4NOSU
     C                     Z-ADD*DATE     G4KYMD
     C                     TIME           G4KTIM
     C                     MOVEL#USER     G4KOME
     C                     Z-ADDD@RCVD    G4RCDT
     C                     MOVELD@IVNO    G4IVNO
     C                     WRITEGDGPP401
      *
     C                     ENDSL
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
**  CMD
F3:END
F3:END   F5:UPDATE   F12: PREV
