     H            Y.                                    1
      ** GDGR38 *******************
      *  PRINT NON-DELIVERY LIST  *
      *  A.MAMIYA    2000.11.11   *
      *  COPY FROM GDGR36         *
      *  ADD PGM ID ON THE LIST   *
      *  K.KASHIWAGI 2000.03.15   *
      *  CHANGE %001 N.HAYAKAWA  2004.01.15
      ******************* GDGR38 **
     FGDGWP36 IP  F     128            DISK
     FGDGPL25 IF  E           K        DISK
     FQPRINT  O   F     158     OF     PRINTER
      *
     IGDGWP36 AA  01
     I                                        1   5 IHIN1
     I                                        6  10 IHIN2
     I                                       11  12 IHIN3
     I                                       13  180IODER L1
     I                                       13  14 IODR1
     I                                       15  16 IODR2
     I                                       17  18 IODR3
     I                                       19  230IITEM
     I                                       24  310IODHZ
     I                                       32  380ISYOS
     I                                       39  430IMAIS
     I                                       44  500ISURY
      *
     I                                       51  51 IHANY
     I                                       52  590IDLHZ
      *
      *
     I            DS
     I                                        1   80IESKHZ
     I                                        1   40IESKYY
     I                                        5   60IESKMM
     I                                        7   80IESKDD
     I            DS
     I                                        1   80IESOHZ
     I                                        1   40IESKOY
     I                                        5   60IESKOM
     I                                        7   80IESKOD
     I            DS
     I                                        1   80IENYHZ
     I                                        1   40IENYUY
     I                                        5   60IENYUM
     I                                        7   80IENYUD
     I            DS
     I                                        1   6 IINVO
     I                                        1   2 IIVO1
     I                                        3   6 IIVO2
     I           SDS
     I                                        1   8 @PGMID
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *
     C                     MOVE *BLANK    WUSER   9
     C                     MOVE *BLANK    WUSME  15
     C                     CALL 'APLR00'
     C                     PARM           US
     C                     PARM           WUSME
     C                     MOVELWUSME     WUSER
      *-----*
      * KEY *
      *-----*
     C           KEY       KLIST
     C                     KFLD           IODER
     C                     KFLD           IITEM
      *-----*
      * INZ *
      *-----*
     C           *IN05     IFEQ '0'
     C                     SETON                     05
     C                     Z-ADD0         GSKSU   70
     C                     Z-ADD0         GSKHK   30
     C                     Z-ADD0         GRESU   70
     C                     Z-ADD0         GREHK   30
     C                     Z-ADD0         GMISU   70
     C                     Z-ADD0         GMIHK   30
     C                     MOVE *BLANK    IINVO   6
     C                     Z-ADD0         ISYSU   70
     C                     Z-ADD0         ISKHK   50
     C                     Z-ADD0         ISOHZ   80
     C                     Z-ADD0         INYHZ   80
     C                     MOVE *BLANK    IPALE   4
     C                     TIME           WTIME   60
     C                     MOVE *BLANK    $HANY   1
     C                     EXCPTHD
     C                     END
      *
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
      *
     C           *INL1     IFEQ '1'
     C           *IN50     ANDEQ'1'
     C                     EXCPTDT1
     C                     END
     C                     SETON                     50
      *----------------------*
      * SHIPPING INFORMATION *
      *----------------------*
     C                     SETOF                     20
     C           KEY       SETLLGDGPL25
     C                     DO   *HIVAL
     C                     SETOF                     1077
     C           KEY       READEGDGPL251                 10
     C           *IN20     IFEQ '0'
     C           *IN10     IFEQ '1'
     C                     SETON                     2077
     C                     EXCPTDT2
     C                     END
     C                     END
     C           *IN10     IFEQ '0'
     C           IESKJY    IFEQ 'D'
     C           IESKHZ    ANDLE*DATE
     C                     ELSE
     C           *IN20     IFEQ '0'
     C                     SETON                     2077
     C                     END
      *
     C                     MOVELIEINVO    IINVO
     C                     Z-ADDIESURY    ISYSU
     C           ISYSU     DIV  ISYOS     ISKHK
     C*                    Z-ADDIESBOX    ISKHK
     C                     Z-ADDIESOHZ    ISOHZ
     C                     Z-ADDIENYHZ    INYHZ
 %001C                     MOVE IEPARE    IPALE
     C                     MOVE IEHANY    $HANY
     C           IENYUK    IFEQ *BLANK
     C                     ADD  IESURY    GSKSU
     C                     ELSE
     C                     ADD  IESURY    GSKSU
     C                     ADD  IESURY    GRESU
     C                     END
     C                     EXCPTDT2
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C           ISURY     SUB  GSKSU     GMISU
     C           GMISU     DIV  ISYOS     GMIHK
     C           GSKSU     DIV  ISYOS     GSKHK
     C           GRESU     DIV  ISYOS     GREHK
     C                     EXCPTDT3
     C                     MOVE *BLANK    IINVO
     C                     Z-ADD0         ISYSU
     C                     Z-ADD0         ISKHK
     C                     Z-ADD0         ISOHZ
     C                     Z-ADD0         INYHZ
 %001C                     MOVE *BLANK    IPALE
     C                     MOVE *BLANK    $HANY
     C                     Z-ADD0         GSKSU
     C                     Z-ADD0         GSKHK
     C                     Z-ADD0         GRESU
     C                     Z-ADD0         GREHK
     C                     Z-ADD0         GMISU
     C                     Z-ADD0         GMIHK
     OQPRINT  E  103           HD
     O                                  151 '.....................'
      *
     O        E  1             HD
     O                                  151 '.         .         .'
      *
      *
     O        E  1             HD
     O                         @PGMID     9
     O                                  109 'TIME'
     O                         WTIME    118 '  :  :  '
     O                                  131 '.'
     O                                  141 '.'
     O                         WUSER    150
     O                                  151 '.'
      *
     O        E  1             HD
     O                                   68 '** NON-DELIVERY LIST **'
     O                                  109 'DATE'
     O                         UDATE    118 '  .  .  '
     O                                  124 'PAGE'
     O                         PAGE  Z  128
     O                                  151 '.....................'
      *
     O        E  1             HD
     O                                   18 'ORDER INFORMATION'
     O                                   38 '--------------------'
     O                                   58 '--------------------'
     O                                   74 '----------------'
     O                                   87 '-------------'
     O                                  109 'SIHPING INFORMATION'
     O                                  131 '----------------------'
     O                                  150 'RECEIVE INFO----'
      *
     O        E  1             HD
     O                                   11 'ORDER NO.'
     O                                   21 'ITEM #'
     O                                   32 'ORDER DATE'
     O                                   41 'PART NO.'
     O                                   52 'QTY.'
     O                                   66 'QTY./BOX'
     O                                   71 'BOX'
     O                                   77 'CRY'
     O                                   86 'DELIVERY'
     O                                   97 'INVOICE'
     O                                  103 'PALL.'
     O                                  108 'QTY.'
     O                                  117 'BOX'
     O                                  130 'SHIP DATE'
     O                                  146 'RECEIVE DATE'
     O                                  150 'CRY'
      *
     A*         1         2         3         4         5         6         7
     A*1234567890123456789012345678901234567890123456789012345678901234567890123
     O* ORDER INFORMATION-------------------------------------------------------
     O*  ORDER NO.    ITEM # ORDER DATE PART NO.       QTY.      QTY./BOX  BOX
     O*  ------------ ------ ---------- -------------- --------- --------- -----
     A*         7         8         9        10        11        12        13
     A*12345678901234567890123456789012345678901234567890123456789012345678901
     O*--------------                SIHPING INFORMATION ---------------------
     O*        BOX   CRY DELIVERY    INVOICE PALL. QTY.      BOX    SHIP DATE
     O*------- ------ - ----------   ------- ----- --------- ------ ----------
     A*11      12        13        14        15        16
     A*12345678901234567890123456789012345678901234567890
     O*---------------------   RECEIVE INFO----
     O*    BOX    SHIP DATE    RECEIVE DATE CRY
     O*--- ------ ----------   ------------  -
     O*-------  RECEIVE INFO    9999-99-99
     O*
      *
     O        E  1             HD
     O                                   14 '------------'
     O                                   21 '------'
     O                                   32 '----------'
     O                                   47 '--------------'
     O                                   57 '---------'
     O                                   67 '---------'
     O                                   74 '------'
     O                                   76 '-'
     O                                   87 '----------'
     O                                   97 '-------'
     O                                  103 '-----'
     O                                  113 '---------'
     O                                  120 '------'
     O                                  131 '----------'
     O                                  146 '------------'
     O                                  149 '-'
     O        E  1             DT1
      *
     O        E  1             DT2
     O                 77                 1 '*'
     O                 77                 6 'IAF-'
     O                 77      IODR1      8
     O                 77                 9 '-'
     O                 77      IODR2     11
     O                 77                12 '-'
     O                 77      IODR3     14
     O                 77      IITEM     20
     O                 77      IODHZ     32 '    /  /  '
     O                 77      IHIN1     38
     O                 77                39 '-'
     O                 77      IHIN2     44
     O                 77                45 '-'
     O                 77      IHIN3     47
     O                 77      ISURY     57 ' ,   ,   '
     O                 77      ISYOS     67 ' ,   ,   '
     O                 77      IMAIS     74 '  ,   '
     O                 77      IHANY     76
     O                 77      IDLHZ     87 '    /  /  '
      *
     O                         IIVO1     92
     O                N10                93 '-'
     O                         IIVO2     97
     O                         IPALE    103
     O                         ISYSU    113 ' ,   ,   '
     O                         ISKHK    120 '  ,   '
     O                         ISOHZ    131 '    /  /  '
     O                         INYHZ    145 '    /  /  '
     O                         $HANY    145
      *
     O        E  3             DT3
     O                                   11 'TOTAL...'
     O                                   23 '(SHIPPING-->'
     O                                   28 'QTY.'
     O                         GSKSU 1   37
     O                                   41 'BOX'
     O                         GSKHK 1   48
     O                                   49 ')'
     O                                   63 '(RECIVEING-->'
     O                                   68 'QTY.'
     O                         GRESU 1   77
     O                                   81 'BOX'
     O                         GREHK 1   88
     O                                   89 ')'
     O                                  106 '(NON-DELIVERY-->'
     O                                  111 'QTY.'
     O                         GMISU 1  120
     O                                  124 'BOX'
     O                         GMIHK 1  131
     O                                  132 ')'
