      ** GDGR16 ******************************************************
      *    ORDER FIXED HANDING / PRINT OF ORDER SHEET TABLE
      *     G.B.C                        97/02/21
      ****************************************************************
     H            Y/                                    1
     FGDGPL18 IF  E           K        DISK
     FGDGPR13 O   E             95     PRINTER
     FGDGWPE1 O   F     128            DISK
     I            DS
     I                                        1   80ICSKHZ
     I                                        1   40ICSKYY
     I                                        5   60ICSKMM
     I                                        7   80ICSKDD
     I            DS
     I                                        1   60IODER
     I                                        1   20IODR1
     I                                        3   40IODR2
     I                                        5   60IODR3
     I            DS
     I                                        1   80ICDLVR
     I                                        1   40ICDLVY
     I                                        5   60ICDLVM
     I                                        7   80ICDLVD
     C* MAIN
     C           *ENTRY    PLIST
     C                     PARM           PODR1   2
     C                     PARM           PODR2   2
     C                     PARM           PODR3   2
     C                     PARM           P@SYS   8
     C*
     C                     MOVELP@SYS     D1ODRX
     C                     MOVELP@SYS     D1ODR0
     C                     MOVELPODR1     IODR1
     C                     MOVELPODR2     IODR2
     C                     MOVELPODR3     IODR3
     C           IODER     SETLLGDGPL181
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           IODER     READEGDGPL18                  10
     C           *IN10     IFEQ '0'
     C           ICSKJY    IFEQ 'D'
     C           ICSKHZ    ANDLE*DATE
     C                     ELSE
     C           ICIFMK    IFNE 'C'
     C                     MOVELIODR1     D1ODR1
     C                     MOVELIODR2     D1ODR2
     C                     MOVELIODR3     D1ODR3
     C                     MOVELICODRY    W1YEAR
     C                     MOVELICODRM    W1MONT
     C                     MOVELICODRD    W1DAY
     C*                    MOVELICSEIH    IBSEIH
     C                     MOVELICITEM    W1NO
     C                     MOVEL*BLANK    W1CRY
     C           ICHANY    IFEQ 'A'
     C                     MOVEL'AIR'     W1CRY
     C                     ADD  ICMAIS    IHAIRT
     C                     END
     C           ICHANY    IFEQ 'S'
     C                     MOVEL'SHIP'    W1CRY
     C                     ADD  ICMAIS    IHSHPT
     C                     END
     C*                    MOVELICHIN1    IBHIN1
     C*                    MOVELICHIN2    IBHIN2
     C*                    MOVELICHIN3    IBHIN3
     C*                    MOVELICSURY    IBSURY
     C*                    MOVELICMAIS    IBMAIS
     C*                    MOVELICSYOS    IBSYOS
     C                     ADD  ICMAIS    IHTOTL
     C*
     C           *IN95     IFEQ '1'
     C           *IN90     OREQ '0'
     C                     SETOF                     95
     C                     SETON                     90
     C                     WRITEGDGPR131
     C                     END
     C                     SETOF                     15
     C           ICHIN3    IFEQ *BLANK
     C                     SETON                     15
     C                     END
     C                     WRITEGDGPR132
      *
     C                     EXCPTDTE
      *
     C                     END
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C           IHTOTL    IFNE 0
     C                     WRITEGDGPR133
     C                     WRITEGDGPR134
     C                     END
     C                     SETON                     LR
     C                     RETRN
     OGDGWPE1 E                DTE
     O                         ICSEIH
     O                                      '-'
     O                         W1NO
     O                                      ';'
     O                         ICHIN1
     O                                      '-'
     O                         ICHIN2
     O                      N15             '-'
     O                         ICHIN3
     O                                      ';'
     O                         ICSURY1
     O                                      ';'
     O                         ICMAIS3
     O                                      ';'
     O                         ICSYOS1
