     H            Y/
     F***************************************************
     F*  LOT ID TAG FOR ASJ HALF FINISHED GOODS         *
     F*                                                 *
     F* TCHK  01/19/11 CREATE                           *
     F* TCHK1 03/08/11 CHG W7ODER to W7INVN             *
     F* TCHK2 03/14/12 ADD W1109-A4148 SPECIAL          *
     F***************************************************
     FGDGPW46 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FAANPL03 IF  E           K        DISK
     FAB#PPCT UF  E           K        DISK                      A
     FGDGPL45 UF  E           K        DISK
     FGDGPL46 IF  E           K        DISK
     F            GDGPP451                          KRENAMEGDGPL461
     FGDGPL47 IF  E           K        DISK
     F            GDGPP451                          KRENAMEGDGPL471
     FGDGWP46 IF  E           K        DISK                      A
     FGDGWL46 IF  E           K        DISK
     F            GDGWP461                          KRENAMEGDGWL461
     FGDGWP47 O   E           K        DISK                      A
     FQPRINT  O   F     132     OF     PRINTER
      *------------------------------------------------------------
     E                    ERR     1  10 78
     E                    CMD     1   2 78
      *------------------------------------------------------------
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I            DS
     I                                        1   5 W@LOC
     I                                        1   2 W@LOC1
     I                                        3   3 W@LOCA
     I                                        4   5 W@LOC2
     I            DS
     I                                        1  14 W@PRT
     I                                        1   5 W@PRT1
     I                                        6   6 W@PRTA
     I                                        7  11 W@PRT2
     I                                       12  12 W@PRTB
     I                                       13  14 W@PRT3
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C*
     C                     DO   *HIVAL
     C*
     C                     MOVEL*ON       *IN42
     C                     WRITEDSP99
     C                     EXFMTDSP01
     C   KA                LEAVE
     C                     MOVEL*OFF      *IN41
     C                     MOVEL*BLANK    D@MSG
     C*
     C           D@INV#    IFEQ *BLANK
     C           D@INV#    ORLE D@INVP
     C                     MOVEL*ON       *IN41
     C                     MOVELERR,3     D@MSG
     C                     ITER
     C                     END
     C*
     C                     EXSR #SET@
     C                     MOVEL*OFF      *IN42
     C                     EXSR #SCRN
     C*
     C   KA                LEAVE
     C*
     C                     ENDDO
     C*
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
     C*
     C                     Z-ADD*ZERO     RRN1    40
     C                     Z-ADD*ZERO     @@RRN   40
     C*
     C                     TIME           WSDT
     C*
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C*
     C                     MOVEL#PGM      K#PGM   8 P
     C           K#PGM     CHAINAB#PPCT              99
     C           *IN99     IFEQ *ON
     C                     MOVEL*BLANK    D@INVP
     C                     ELSE
     C                     MOVELCTCHR1    D@INVP
     C                     END
     C*
     C           D@INVP    SETGTGDGPL47
     C                     READ GDGPL47                  99
     C           *IN99     IFEQ *OFF
     C                     MOVELIEINVO    D@INV#
     C                     END
     C*
     C                     ENDSR
      *------------------------------------------------------
      *  SET DATA FOR WORK FILE
      *------------------------------------------------------
     C           #SET@     BEGSR
     C*
     C                     CLOSEGDGWL46
     C                     CLOSEGDGWP46
     C                     MOVELCMD,2     P@CMD     P
     C                     Z-ADD75        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN GDGWP46
     C                     OPEN GDGWL46
     C*
     C           *LOVAL    SETLLAANPL03
     C*
     C                     DO   *HIVAL
     C*
     C                     READ AANPL03                  98
     C   98                LEAVE
     C           L7SKJY    IFNE *BLANK
     C           L7STYY    ORNE 9999
     C                     ITER
     C                     END
     C*
     C                     Z-ADD*ZERO     W@TBOX  50
     C                     Z-ADD*ZERO     W@TTAG  50
     C                     CLEARGDGWP461
     C                     MOVELL7TKR1    WELOC1
     C                     MOVELL7TKR2    WELOC2
     C                     MOVELL7TKR3    WELOC3
     C                     MOVELL7TKR4    WELOC4
     C                     MOVELL7SHN1    WEPRT1
     C                     MOVELL7SHN2    WEPRT2
     C                     MOVELL7SHN3    WEPRT3
     C                     Z-ADDL7HKSU    WELOT
     C*
     C                     MOVEL*BLANK    WWINVO  6
     C                     Z-ADD999999    WWODER  60
     C*
     C           K#L46     KLIST
     C                     KFLD           L7SHN1
     C                     KFLD           L7SHN2
     C                     KFLD           L7SHN3
     C           K#L46     SETLLGDGPL46
     C*
     C                     DO   *HIVAL
     C*
     C           K#L46     READEGDGPL46                  97
     C   97                LEAVE
     C*
     C           IEINVO    IFGT D@INV#
     C                     ITER
     C                     END
     C*
     C                     MOVELIEINVO    WEINVO
     C           WEINVO    IFGT WWINVO
     C                     MOVELWEINVO    WWINVO
     C                     END
     C                     Z-ADDIEODER    WEODER
     C           WEODER    IFLT WWODER
     C                     Z-ADDWEODER    WWODER
     C                     END
     C                     Z-ADDIEITEM    WEITEM
     C                     Z-ADDIEIKBN    WEIKBN
     C                     MOVELIEPARE    WEPARE
     C*
     C           IEIBOX    IFEQ *ZERO
     C                     Z-ADDIESBOX    WEBOX1
     C                     ELSE
     C           IESBOX    SUB  IEIBOX    WEBOX1
     C                     END
     C                     ADD  WEBOX1    W@TBOX
     C*
     C                     Z-ADD*ZERO     WEBOX2
     C                     Z-ADD*ZERO     WE#TAG
     C*
     C                     Z-ADDWSSDAT    WECRDT
     C                     Z-ADDWSSTM6    WECRTM
     C*
     C                     WRITEGDGWP461
     C*
     C                     ENDDO
     C*
     C                     Z-ADDW@TBOX    WEBOX1
     C           WEBOX1    IFGE WELOT
     C           WEBOX1    DIV  WELOT     W@N005  50
     C                     MVR            WEBOX2
TCHK2C           WEPRT1    IFEQ 'W1109'
TCHK2C           WEPRT2    ANDEQ'A4148'
TCHK2C           WEPRT3    ANDEQ*BLANK
TCHK2C                     Z-ADDW@N005    WE#TAG
TCHK2C                     ELSE
     C           W@N005    MULT WELOT     W@N105  50
     C           W@N105    DIV  4         WE#TAG
TCHK2C                     END
     C                     Z-ADDW@N005    WEKAN#
     C                     MOVEL'A'       WEGRP#
     C                     ELSE
     C                     Z-ADDWEBOX1    WEBOX2
     C                     Z-ADD*ZERO     WEKAN#
     C                     Z-ADD*ZERO     WE#TAG
     C                     MOVEL'B'       WEGRP#
     C                     END
     C*
     C                     MOVELWWINVO    WEINVO
     C                     Z-ADDWWODER    WEODER
     C                     Z-ADD*ZERO     WEITEM
     C                     Z-ADD*ZERO     WEIKBN
     C                     MOVEL*BLANK    WEPARE
     C*
     C                     Z-ADDWSSDAT    WECRDT
     C                     Z-ADDWSSTM6    WECRTM
     C*
     C                     WRITEGDGWP461
     C*
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SCREEN
      *------------------------------------------------------
     C           #SCRN     BEGSR
      *
     C                     EXSR #SCRN1
      *
     C                     DO   *HIVAL
     C*
     C                     WRITEDSP99
     C                     EXFMTCTL01
     C*
     C                     SELEC
     C* F1
     C           *INKA     WHEQ *ON
     C                     LEAVE
     C* F12
     C           *INKL     WHEQ *ON
     C                     MOVEL*BLANK    D@MSG
     C                     LEAVE
     C* F5
     C           *INKE     WHEQ *ON
     C                     EXSR #UPD
     C                     MOVEL*ON       *INKA
     C                     LEAVE
     C*
     C                     ENDSL
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *------------------------------------------------------
      *  SET DATA FOR SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1
     C                     MOVE *ON       *IN51
     C                     WRITECTL01
     C                     MOVE *OFF      *IN51
     C                     Z-ADD*ZERO     C1TAGS
      *
     C           *LOVAL    SETLLGDGWP46
      *
     C                     DO   *HIVAL
     C*
     C                     READ GDGWP46                  91
     C   91                LEAVE
     C           WEITEM    IFEQ *ZERO
     C           WEIKBN    ANDEQ*ZERO
     C           WEPARE    ANDEQ*BLANK
     C                     ELSE
     C                     ITER
     C                     END
     C           WEBOX1    IFEQ *ZERO
     C                     ITER
     C                     END
     C*
     C                     CLEARSFL01
     C*
     C                     MOVELWELOC2    W@LOC1
     C                     MOVEL'-'       W@LOCA
     C                     MOVELWELOC3    W@LOC2
     C                     MOVELW@LOC     S1LOC
     C                     MOVEL*BLANK    W@PRT
     C                     MOVELWEPRT1    W@PRT1
     C           W@PRT2    IFNE *BLANK
     C                     MOVEL'-'       W@PRTA
     C                     END
     C                     MOVELWEPRT2    W@PRT2
     C           W@PRT3    IFNE *BLANK
     C                     MOVEL'-'       W@PRTB
     C                     END
     C                     MOVELWEPRT3    W@PRT3
     C                     MOVELW@PRT     S1PART
     C                     Z-ADDWELOT     S1LOT
     C                     Z-ADDWEBOX1    S1BOXS
     C                     Z-ADDWE#TAG    S1TAGS
     C                     Z-ADDWEKAN#    S1KAN#
     C                     Z-ADDWEBOX2    S1BBOX
     C                     MOVELWEINVO    S1INVO
     C*
     C                     ADD  WE#TAG    C1TAGS
     C*
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C*
     C                     ENDDO
     C*
     C           RRN1      IFEQ *ZERO
     C                     CLEARSFL01
     C                     Z-ADD1         RRN1
     C                     WRITESFL01
     C                     MOVELERR,1     D@MSG
     C                     END
     C*
     C                     ENDSR
     C*------------------------------------------------------
     C*   UPDATE RECORDS
     C*------------------------------------------------------
     C           #UPD      BEGSR
     C*
     C                     CLOSEGDGWP47
     C                     MOVELCMD,1     P@CMD     P
     C                     Z-ADD75        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN GDGWP47
     C*
     C           *LOVAL    SETLLGDGWL46
     C*
     C                     DO   *HIVAL
     C*
     C                     READ GDGWL46                  93
     C   93                LEAVE
     C           WEBOX1    IFEQ *ZERO
     C                     ITER
     C                     END
     C*
     C           *IN88     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     MOVEL*ON       *IN88
     C                     MOVEL*OFF      *INOF
     C                     ENDIF
     C* TOTAL RECORD
     C           WEITEM    IFEQ *ZERO
     C           WEIKBN    ANDEQ*ZERO
     C           WEPARE    ANDEQ*BLANK
     C           WEBOX1    SUB  WEBOX2    W@BBOX  50
     C                     MOVELWELOC2    W@LOC1
     C                     MOVEL'-'       W@LOCA
     C                     MOVELWELOC3    W@LOC2
     C                     MOVEL*BLANK    W@PRT
     C                     MOVELWEPRT1    W@PRT1
     C           WEPRT2    IFNE *BLANK
     C                     MOVEL'-'       W@PRTA
     C                     END
     C                     MOVELWEPRT2    W@PRT2
     C           WEPRT3    IFNE *BLANK
     C                     MOVEL'-'       W@PRTB
     C                     END
     C                     MOVELWEPRT3    W@PRT3
     C                     Z-ADDWELOT     W@LOT   20
     C                     Z-ADDWE#TAG    W@TAG   50
     C                     Z-ADDWEBOX1    W@BOX1  50
     C                     Z-ADDWEBOX2    W@BOX2  50
     C                     Z-ADDWEKAN#    W@KAN   50
     C                     MOVELWEINVO    W@INVO  6
     C           WE#TAG    IFNE *ZERO
     C                     EXCPT@DTL
     C                     CLEARGDGWP471
TCHK1C*                    MOVELWEODER    W7ODER
TCHK1C                     MOVE D@INV#    W7INVN
     C                     MOVELW@LOC     W7LOC
     C                     Z-ADDWE#TAG    W7#TAG
     C                     WRITEGDGWP471
     C                     END
     C                     ITER
     C                     END
     C* WRITE OFF STRAT
     C           W@BBOX    IFEQ *ZERO
     C                     ELSE
     C*
     C           K#L45     KLIST
     C                     KFLD           WEODER
     C                     KFLD           WEITEM
     C                     KFLD           WEIKBN
     C                     KFLD           WEPARE
     C                     KFLD           WEINVO
     C           K#L45     CHAINGDGPL45              94
     C   94                ITER
     C*
     C                     TIME           WSDT
     C*
     C           IESBOX    SUB  IEIBOX    W@N105  50
     C           W@BBOX    IFGE W@N105
     C                     ADD  W@N105    IEIBOX
     C                     SUB  W@N105    W@BBOX
     C                     ELSE
     C                     ADD  W@BBOX    IEIBOX
     C                     Z-ADD*ZERO     W@BBOX
     C                     END
     C*
     C           IESBOX    IFEQ IEIBOX
     C                     Z-ADDWSSYYY    IECMPY
     C                     Z-ADDWSSMMM    IECMPM
     C                     Z-ADDWSSDDD    IECMPD
     C                     END
     C*
     C                     Z-ADDWSSYYY    IEISSY
     C                     Z-ADDWSSMMM    IEISSM
     C                     Z-ADDWSSDDD    IEISSD
     C*
     C                     Z-ADDWSSYYY    IEKOYY
     C                     Z-ADDWSSMMM    IEKOMM
     C                     Z-ADDWSSDDD    IEKODD
     C                     Z-ADDWSSHHH    IEKOHH
     C                     Z-ADDWSSNNN    IEKOSS
     C                     MOVEL#USER     IEKOME
     C*
     C                     UPDATGDGPP451
     C* WRITE OFF END
     C                     END
     C*
     C                     ENDDO
     C*
     C                     MOVEL#PGM      K#PGM   8 P
     C           K#PGM     CHAINAB#PPCT              99
     C           *IN99     IFEQ *ON
     C                     CLEARAB#PPCT1
     C                     MOVELK#PGM     CTKEY1
     C                     END
     C                     MOVELD@INV#    CTCHR1
     C   99                WRITEAB#PPCT1
     C  N99                UPDATAB#PPCT1
     C*
     C                     ENDSR
      *------------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         WSSDATY   56
     O                         WSSTM6    65 '  :  :  '
     O                                   68 'P.'
     O                         PAGE  Z   72
     O        E   03           @HED
     O                                   28 'LOT ID TAG'
     O                                   41 'FOR ASJ HALF'
     O                                   56 ' FINISHED PARTS'
     O        E   04           @HED
     O                                   17 'SELECT INVOICE#:'
     O                         D@INV#    23
     O        E   05           @HED
     O                                    6 'LOC'
     O                                   15 'PART#'
     O                                   27 'LOT'
     O                                   36 '#OF BOX'
     O                                   47 '#OF KAN'
     O                                   57 '#OF TAG'
     O                                   65 'B.BOX'
     O                                   76 'INVOICE#'
     O        E 1              @DTL
     O                         W@LOC      8
     O                         W@PRT     24
     O                         W@LOT     27
     O                         W@BOX12   36
     O                         W@KAN 2   47
     O                         W@TAG 2   57
     O                         W@BOX22   65
     O                         W@INVO    75
** ERR
NO DATA
ALREADY ISSUED.
INVOICE# ERROR.







** CMD
CLRPFM GDGWP47
CLRPFM GDGWP46
