     H            Y/                                    1
     FA#DPL12 IF  E           K        DISK
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     I                                        7  120WSSYM
     I*
     C           *ENTRY    PLIST
     C                     PARM           P@RUN   1
     C                     MOVEL*BLANK    P@RUN
     C*
     C                     TIME           WSDT
     C*
     C           K#AGP     KLIST
     C                     KFLD           WSSYYY
     C                     KFLD           WSSMMM
     C                     KFLD           WSSDDD
     C           K#AGP     CHAINA#DPL12              98
     C           *IN98     IFEQ *ON
     C                     MOVEL'1'       P@RUN
     C                     ELSE
     C           F8HIRU    IFEQ '*'
     C           F8YORU    OREQ '*'
     C                     MOVEL'1'       P@RUN
     C                     END
     C                     END
     C*
     C                     MOVEL*ON       *INLR
     C                     RETRN
