     H            Y.                                    1
      ** GDIR23 **********************
      *  IMPORT ORDER UPDATE SYSTEM  *
      *        K.YASUDA  2000.12.07  *
      * %0001  A.MAMIYA  2001.05.31  *
      ********************** GDIR23 **
     FGDIPW23 CF  E                    WORKSTN
     FGDIPL16 UF  E           K        DISK                      A
     F*GDGPL30 UF  E           K        DISK                      A
     FGCQPL12 IF  E           K        DISK
     FGDIWP23 O   F     128            DISK
     E                    UP1     1   3  1   UP2     8
     E                    ER      1  18 61
     I            DS
     I                                        1   80IISKHZ
     I                                        1   40IISKYY
     I                                        5   60IISKMM
     I                                        7   80IISKDD
     I            DS
     I                                        1   80IIKOHZ
     I                                        1   40IIKOYY
     I                                        5   60IIKOMM
     I                                        7   80IIKODD
     I            DS
     I                                        1   60IIKOTI
     I                                        1   20IIKOHH
     I                                        3   40IIKOSS
     I            DS
     I                                        1   80IIODHZ
     I                                        1   40IIODRY
     I                                        5   60IIODRM
     I                                        7   80IIODRD
     I            DS
     I                                        1   80IISPHZ
     I                                        1   40IISIPY
     I                                        5   60IISIPM
     I                                        7   80IISIPD
     I            DS
     I                                        1   80IIIFHZ
     I                                        1   40IIIFNY
     I                                        5   60IIIFNM
     I                                        7   80IIIFND
     I            DS
     I                                        1   80T6SKHZ
     I                                        1   40T7SKYY
     I                                        5   60T6SKMM
     I                                        7   80T6SKDD
     I            DS
     I                                        1   60ZODER
     I                                        1   20ZODR1
     I                                        3   40ZODR2
     I                                        5   60ZODR3
     I            DS
     I                                        1  12 IODER
     I                                        1   4 IBAR4
     I                                        5   6 IODR1
     I                                        7   7 IBAR5
     I                                        8   9 IODR2
     I                                       10  10 IBAR6
     I                                       11  12 IODR3
     I            DS
     I                                        1  11 OKATA
     I                                        1   2 IKAT1
     I                                        3   3 IBAR1
     I                                        4   7 IKAT2
     I                                        8   8 IBAR2
     I                                        9   9 IKAT3
     I                                       10  10 IBAR3
     I                                       11  11 IKAT4
     I            DS
     I                                        1   80IFSKHZ
     I                                        1   40IFSKYY
     I                                        5   60IFSKMM
     I                                        7   80IFSKDD
     I            DS
     I                                        1   80IFKOHZ
     I                                        1   40IFKOYY
     I                                        5   60IFKOMM
     I                                        7   80IFKODD
     I            DS
     I                                        1   60IFKOTM
     I                                        1   20IFKOHH
     I                                        3   40IFKOSS
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *-------------*
      * KEY1 - KEY2 *
      *-------------*
     C           KEY1      KLIST
     C                     KFLD           ZODER   60
     C                     KFLD           IITEM
      *
     C           KEY2      KLIST
     C                     KFLD           IKAT1
     C                     KFLD           IKAT2
      *----------------*
      * INITIALIZATION *
      *----------------*
     C           STP0      TAG
     C                     MOVE *BLANK    IUPDT
     C                     MOVE *BLANK    IODR1
     C                     MOVE *BLANK    IODR2
     C                     MOVE *BLANK    IODR3
     C                     Z-ADD0         IITEM
      *----------*
      * SCREEN 1 *
      *----------*
     C           STP1      TAG
     C                     EXFMTGDIPW231
     C                     SETOF                     010203
     C                     SETOF                     99
      *-------*
      * CMD-1 *
      *-------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     Z-ADD1         A       20
     C                     SETOF                     10
     C           IUPDT     LOKUPUP1,A                    10
     C           *IN10     IFEQ '0'
     C                     SETON                     0199
     C                     MOVELER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C                     MOVELUP2,A     OUPDT
     C                     MOVEL'-'       IBAR1
     C                     MOVEL'-'       IBAR2
     C                     MOVEL'-'       IBAR3
     C                     MOVEL'IAF-'    IBAR4
     C                     MOVEL'-'       IBAR5
     C                     MOVEL'-'       IBAR6
      *
%0001C*          IUPDT     IFNE '2'
     C           IODR1     IFEQ *BLANK
     C           IODR2     ANDEQ*BLANK
     C           IODR3     ANDEQ*BLANK
     C                     SETON                     0299
     C                     MOVELER,2      MSG
     C                     GOTO STP1
     C                     END
      *
     C                     Z-ADD0         ZODER
     C                     MOVELIODR1     ZODR1
     C                     MOVELIODR2     ZODR2
     C                     MOVELIODR3     ZODR3
      *
     C           ZODR2     IFLT 1
     C           ZODR2     ORGT 12
     C                     SETON                     0299
     C                     MOVELER,13     MSG
     C                     GOTO STP1
     C                     END
      *
     C           ZODR3     IFEQ 0
     C                     SETON                     0299
     C                     MOVELER,13     MSG
     C                     GOTO STP1
     C                     END
      *
     C           IITEM     IFEQ 0
     C                     SETON                     0399
     C                     MOVELER,3      MSG
     C                     GOTO STP1
     C                     END
     C*                    END
%0001 *
     C*          IUPDT     IFEQ '2'
     C*          IODR1     IFNE *BLANK
     C*          IODR2     ORNE *BLANK
     C*          IODR3     ORNE *BLANK
     C*                    SETON                     0299
     C*                    MOVELER,17     MSG
     C*                    GOTO STP1
     C*                    END
      *
     C*          IITEM     IFNE 0
     C*                    SETON                     0399
     C*                    MOVELER,18     MSG
     C*                    GOTO STP1
     C*                    END
      *
     C*                    Z-ADDUYEAR     ZODR1
     C*                    Z-ADDUMONTH    ZODR2
     C*                    SETOF                     10
     C*          'ORDER2'  CHAINGDGPL301             10
      *
     C*          *IN10     IFEQ '1'
     C*                    Z-ADD50        ZODR3
     C*                    END
      *
     C*          *IN10     IFEQ '0'
     C*          IFNO      ADD  1         ZODR3
     C*          IFYEAR    IFNE *YEAR
     C*                    Z-ADD50        ZODR3
     C*                    END
     C*          IFYEAR    IFEQ *YEAR
     C*          IFMONT    IFNE UMONTH
     C*                    Z-ADD50        ZODR3
     C*                    END
     C*                    END
     C*                    END
      *
     C*                    MOVELZODR1     IODR1
     C*                    MOVELZODR2     IODR2
     C*                    MOVELZODR3     IODR3
      *
     C*                    SETOF                     10
     C*          'ITEM4 '  CHAINGDGPL301             10
      *
     C*          *IN10     IFEQ '1'
     C*                    Z-ADD90001     IITEM
     C*                    END
      *
     C*          *IN10     IFEQ '0'
     C*          IFNO      ADD  1         IITEM
     C*          IFYEAR    IFNE *YEAR
     C*                    Z-ADD90001     IITEM
     C*                    END
     C*                    END
%0001C*                    END
      *------------*
      * DATA CHECK *
      *------------*
     C                     SETOF                     15
     C           KEY1      CHAINGDIPL161             15
      *
     C           IUPDT     IFEQ '0'
     C           IUPDT     OREQ '1'
     C           *IN15     IFEQ '1'
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVELER,4      MSG
     C                     GOTO STP1
     C                     END
      *
     C           *IN15     IFEQ '0'
     C           IISKJY    IFEQ 'D'
     C           IISKHZ    ANDLE*DATE
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVELER,4      MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C           IUPDT     IFEQ '0'
     C           IIIFMK    IFEQ 'C'
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVELER,5      MSG
     C                     GOTO STP1
     C                     END
      *
     C           IIIFMK    IFEQ '*'
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVELER,11     MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C           IUPDT     IFEQ '1'
     C           IIIFMK    IFEQ 'C'
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVELER,5      MSG
     C                     GOTO STP1
     C                     END
      *
     C           IIIFMK    IFEQ '*'
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVELER,11     MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C                     MOVELIIKAT1    IKAT1
     C                     MOVELIIKAT2    IKAT2
     C                     MOVELIIKAT3    IKAT3
     C                     MOVELIIKAT4    IKAT4
     C                     Z-ADDIISYOS    ISYOS
     C                     Z-ADDIIMAIS    IHAKO
     C                     Z-ADD0         ZOQTY
     C           ISYOS     MULT IHAKO     ZOQTY
     C                     Z-ADDIIODHZ    OODHZ
     C                     Z-ADDIISURY    OOQTY
     C                     Z-ADDIISPHZ    OSPHZ
     C                     Z-ADDIISURT    OSQTY
     C                     Z-ADDIIIFHZ    OREHZ
     C                     Z-ADDIIIFSU    ORQTY
      *------------*
      * DIE KANBAN *
      *------------*
     C                     SETOF                     20
     C           KEY2      CHAINGCQPL121             20
      *
     C           *IN20     IFEQ '0'
     C           T6SKJY    IFEQ 'D'
     C           T6SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDT6SYOS    OSYOS
     C                     END
     C                     END
      *
     C                     SETOF                     11
     C           IUPDT     IFEQ '0'
     C                     SETON                     11
     C                     END
     C                     GOTO STP3
     C                     END
      *
     C           IUPDT     IFEQ '2'
     C           *IN15     IFEQ '0'
     C           IISKJY    IFEQ 'D'
     C           IISKHZ    ANDLE*DATE
     C                     ELSE
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVELER,6      MSG
     C                     GOTO STP1
     C                     END
     C                     END
     C                     MOVE *BLANK    IKAT1
     C                     MOVE *BLANK    IKAT2
     C                     MOVE *BLANK    IKAT3
     C                     MOVE *BLANK    IKAT4
     C                     Z-ADD0         ISYOS
     C                     Z-ADD0         IHAKO
     C                     GOTO STP4
     C                     END
      *----------*
      * SCREEN 2 *
      *----------*
     C           STP3      TAG
     C                     EXFMTGDIPW232
     C                     SETOF                     010299
      *-------*
      * CMD-3 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO STP0
     C                     END
      *
     C           ISYOS     IFEQ 0
     C                     SETON                     0199
     C                     MOVELER,7      MSG
     C                     GOTO STP3
     C                     END
      *
     C           IHAKO     IFEQ 0
     C                     SETON                     0299
     C                     MOVELER,8      MSG
     C                     GOTO STP3
     C                     END
      *
     C                     Z-ADD0         ZOQTY
     C           ISYOS     MULT IHAKO     ZOQTY
      *-------*
      * CMD-5 *
      *-------*
     C           *INKE     IFEQ '0'
     C                     GOTO STP3
     C                     END
     C                     GOTO STP5
      *----------*
      * SCREEN 3 *
      *----------*
     C           STP4      TAG
     C                     EXFMTGDIPW233
     C                     SETOF                     010203
     C                     SETOF                     99
      *-------*
      * CMD-3 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO STP0
     C                     END
      *
     C           IKAT1     IFEQ *BLANK
     C           IKAT2     ANDEQ*BLANK
     C           IKAT3     ANDEQ*BLANK
     C           IKAT4     ANDEQ*BLANK
     C                     SETON                     0199
     C                     MOVELER,9      MSG
     C                     GOTO STP4
     C                     END
      *------------*
      * DIE KANBAN *
      *------------*
     C                     SETOF                     20
     C           KEY2      CHAINGCQPL121             20
      *
     C           *IN20     IFEQ '0'
     C           T6SKJY    IFEQ 'D'
     C           T6SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDT6SYOS    OSYOS
     C                     GOTO JUMP
     C                     END
     C                     END
      *
     C                     SETON                     0199
     C                     MOVELER,10     MSG
     C                     GOTO STP4
     C           JUMP      TAG
      *
     C           ISYOS     IFEQ 0
     C                     SETON                     0299
     C                     MOVELER,7      MSG
     C                     GOTO STP4
     C                     END
      *
     C           IHAKO     IFEQ 0
     C                     SETON                     0399
     C                     MOVELER,8      MSG
     C                     GOTO STP4
     C                     END
      *
     C                     Z-ADD0         ZOQTY
     C           ISYOS     MULT IHAKO     ZOQTY
      *-------*
      * CMD-5 *
      *-------*
     C           *INKE     IFEQ '0'
     C                     GOTO STP4
     C                     END
      *
     C           STP5      TAG
     C                     EXCPTDT
      *--------*
      * UPDATE *
      *--------*
     C                     MOVE *BLANK    IISKJY
     C                     Z-ADD0         IISKHZ
     C                     Z-ADD*DATE     IIKOHZ
     C                     TIME           IIKOTI
     C                     MOVELUS        IIKOME
      *
     C           IUPDT     IFEQ '0'
     C                     MOVE 'C'       IIIFMK
     C                     END
      *
     C           IUPDT     IFEQ '1'
     C                     Z-ADDISYOS     IISYOS
     C                     Z-ADDIHAKO     IIMAIS
     C                     Z-ADDZOQTY     IISURY
     C                     MOVE *BLANK    IIIFMK
     C           ORQTY     IFGE ZOQTY
     C                     MOVE '*'       IIIFMK
     C                     END
     C                     END
      *
     C           IUPDT     IFEQ '2'
     C                     Z-ADDZODER     IIODER
     C                     Z-ADDIITEM     IIITEM
     C                     MOVELIKAT1     IIKAT1
     C                     MOVELIKAT2     IIKAT2
     C                     MOVELIKAT3     IIKAT3
     C                     MOVELIKAT4     IIKAT4
     C                     Z-ADDISYOS     IISYOS
     C                     Z-ADDIHAKO     IIMAIS
     C                     Z-ADDISYOS     IISYOS
     C                     Z-ADDIHAKO     IIMAIS
     C           IHAKO     MULT ISYOS     IISURY
     C                     Z-ADD*DATE     IIODHZ
     C                     MOVE *BLANK    IIINVO
     C                     Z-ADD0         IISURT
     C                     Z-ADD0         IISPHZ
     C                     Z-ADD0         IIIFSU
     C                     Z-ADD0         IIIFHZ
     C                     MOVE *BLANK    IIIFMK
     C                     Z-ADD0         IIMJHZ
%0001 *
     C*                    SETOF                     20
     C*          'ORDER2'  CHAINGDGPL301             20
     C*          *IN20     IFEQ '1'
     C*                    MOVE *BLANK    IFSKJY
     C*                    Z-ADD0         IFSKYY
     C*                    Z-ADD0         IFSKMM
     C*                    Z-ADD0         IFSKDD
     C*                    Z-ADD*DATE     IFKOHZ
     C*                    TIME           IFKOTM
     C*                    MOVELUS        IFKOME
     C*                    MOVEL'ORDER2'  IFKEY
     C*                    Z-ADDZODR3     IFNO
     C*                    Z-ADDZODR2     IFMONT
     C*                    Z-ADD*YEAR     IFYEAR
     C*                    WRITEGDGPL301
     C*                    END
      *
     C*          *IN20     IFEQ '0'
     C*                    MOVE *BLANK    IFSKJY
     C*                    Z-ADD0         IFSKYY
     C*                    Z-ADD0         IFSKMM
     C*                    Z-ADD0         IFSKDD
     C*                    Z-ADD*DATE     IFKOHZ
     C*                    TIME           IFKOTM
     C*                    MOVELUS        IFKOME
     C*                    Z-ADDZODR3     IFNO
     C*                    Z-ADDZODR2     IFMONT
     C*                    Z-ADD*YEAR     IFYEAR
     C*                    UPDATGDGPL301
     C*                    END
      *
     C*                    SETOF                     20
     C*          'ITEM4 '  CHAINGDGPL301             20
     C*          *IN20     IFEQ '1'
     C*                    MOVE *BLANK    IFSKJY
     C*                    Z-ADD0         IFSKYY
     C*                    Z-ADD0         IFSKMM
     C*                    Z-ADD0         IFSKDD
     C*                    Z-ADD*DATE     IFKOHZ
     C*                    TIME           IFKOTM
     C*                    MOVELUS        IFKOME
     C*                    MOVEL'ITEM4 '  IFKEY
     C*                    Z-ADDIITEM     IFNO
     C*                    Z-ADD0         IFMONT
     C*                    Z-ADD*YEAR     IFYEAR
     C*                    WRITEGDGPL301
     C*                    END
      *
     C*          *IN20     IFEQ '0'
     C*                    MOVE *BLANK    IFSKJY
     C*                    Z-ADD0         IFSKYY
     C*                    Z-ADD0         IFSKMM
     C*                    Z-ADD0         IFSKDD
     C*                    Z-ADD*DATE     IFKOHZ
     C*                    TIME           IFKOTM
     C*                    MOVELUS        IFKOME
     C*                    Z-ADDIITEM     IFNO
     C*                    Z-ADD0         IFMONT
     C*                    Z-ADD*YEAR     IFYEAR
     C*                    UPDATGDGPL301
%0001C*                    END
      *
     C                     END
     C           *IN15     IFEQ '1'
     C                     WRITEGDIPL161
     C                     ELSE
     C                     UPDATGDIPL161
     C                     END
     C                     SETON                     U1
      *
     C                     GOTO STP0
      *-------------*
      * OUTPUT FILE *
      *-------------*
     OGDIWP23 E                DT
     O                         IUPDT
     O                         ZODR1
     O                         ZODR2
     O                         ZODR3
     O                                      'K'
     O                         IITEM
     O                         IKAT1
     O                         IKAT2
     O                         IKAT3
     O                         IKAT4
     O                         ISYOS
     O                         IHAKO
     O                         ZOQTY
** UP1/UP2
0DELETE
1CHANGE
2ADDITION
** MSG
E-01 INPUT RENEW CODE.
E-02 INPUT ORDER NUMBER.
E-03 INPUT ITEM NUMBER.
E-04 THIS DATA IS NOT IN DAYLY ORDER DATA FILE.
E-05 THIS DATA ALREADY HAS BEEN CANCEL.
E-06 THIS DATA ALREADY HAS BEEN INPUT.
E-07 INPUT Q'TY PAR BOX.
E-08 INPUT BOX Q'TY.
E-09 INPUT DIE NUMBER.
E-10 THIS DATA IS NOT IN DIE KANBAN MASTER.
E-11 THE DATA IS ALREADY COMPLETED.
E-12 THIS ITEM NO. HAS BEEN ALREADY USED.
E-13 INPUT DATA IS NOT CORRECT.
E-14 THIS ORDER NO. HAS BEEN ALREADY USED.
E-15 ORDER NO. MORE THAN 50 IS AVAILABLE FOR ORDER ADDITION.
E-16 ITEM NO. MORE THAN 90001 IS AVAILABE FOR ITEM ADDITION.
E-17 NOT INPUT ORDER NO. OF ADDITIONAL ORDER.
E-18 NOT INPUT ITEM NO. OF ADDITIONAL ORDER.
