     H            Y/                                    1
      *** GDIR83 *****************************************************
      *  PRINT DIE ORDER SORT BY LOCATION
      *  N.HYOTO 2001.04.26
      ****************************************************************
     FGDIPL31 IF  E           K        DISK
     FGDIPL15 IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
     E*****************************************************************
     E                    ODR     1  19  6
     E                    BOX        19  5 0
     E                    TOX        19  5 0
     I****************************************************************
     I* DIE NUMBER
     I            DS
     I                                        1   8 ILDIE
     I                                        1   2 K11
     I                                        3   6 K12
     I                                        7   7 K13
     I                                        8   8 K14
     I* ORDER NUMBER
     I            DS
     I                                        1   60IIODER
     I                                        1   6 WKODER
     I* SYSTEM DATE
     I            DS
     I                                        1  120WKTIME
     I                                        1   60WTIME
     C***********************************************************
     C*
     C                     EXSR @INZ
     C                     EXSR @MAIN
     C                     EXSR @END
     C***********************************************************
     C* @INZ:INITIALIZE WORK AREA
     C***********************************************************
     C           @INZ      BEGSR
     C*
     C                     Z-ADD0         I       20
     C                     Z-ADD*ZERO     TOX
     C                     TIME           WKTIME
     C*
     C           KEY1      KLIST
     C                     KFLD           K11
     C                     KFLD           K12
     C*                    KFLD           K13
     C*                    KFLD           K14
     C*
     C           KEY2      KLIST
     C                     KFLD           IIKAT1
     C                     KFLD           IIKAT2
     C                     KFLD           IIKAT3
     C                     KFLD           IIKAT4
     C*
     C                     EXCPT#HED1
     C*
     C                     ENDSR
     C***********************************************************
     C* @MAIN:CONTROL DISPLAY
     C***********************************************************
     C           @MAIN     BEGSR
     C*
     C           *LOVAL    SETLLGDIPL311
     C                     READ GDIPL311                 90
     C           *IN90     DOWEQ'0'
     C*
     C                     Z-ADD*ZERO     BOX
     C           KEY1      SETLLGDIPL151
     C           KEY1      READEGDIPL151                 91
     C*
     C           #READ     TAG
     C           *IN91     DOWEQ'0'
     C*
     C           IISKJY    IFNE 'D'
     C           IIIFMK    ANDNE'C'
     C           IIIFMK    ANDNE'*'
     C*
     C                     Z-ADD1         I
     C           WKODER    LOKUPODR,I                    92
     C           *IN92     IFEQ '1'
     C                     Z-ADDIIMAIS    BOX,I   50
     C                     END
     C*
     C                     END
     C*
     C           KEY2      READEGDIPL151                 91
     C                     END
     C*
     C                     XFOOTBOX       WKTOT   40
     C           WKTOT     IFNE *ZERO
     C   OF                EXCPT#HED1
     C   OF                SETOF                     OF
     C                     ADD  BOX       TOX
     C                     EXCPT#DTL
     C                     END
     C*
     C           KEY2      SETGTGDIPL15
     C           KEY1      READEGDIPL151                 91
     C*
     C                     READ GDIPL311                 90
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* @END:
     C***********************************************************
     C           @END      BEGSR
     C*
     C*                    XFOOTTOX       WKTOT
     C                     EXCPT#TTL
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ENDSR
     C**************************************************************************
     OQPRINT  E    2           #HED1
     O       OR        OF
     O                                    8 'GDIR83'
     O                                   35 'DIE ORDER LIST'
     O                                  131 '.....................'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                                  131 '.         .         .'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                                    9 'LOCATION'
     O                                   21 'DIE NUMBER'
     O                                   31 '00-12-01'
     O                                   40 '00-12-02'
     O                                   49 '00-12-03'
     O                                   58 '01-01-01'
     O                                   67 '01-01-02'
     O                                   76 '01-01-03'
     O                                   85 '01-01-04'
     O                                   94 '01-02-01'
     O                                  103 '01-02-02'
     O                                  112 '01-02-03'
     O                                  121 '01-02-04'
     O                                  130 '01-03-01'
     O                                  139 '01-03-02'
     O                                  148 '01-03-03'
     O                                  157 '01-03-04'
     O                                  166 '01-04-01'
     O                                  175 '01-04-02'
     O                                  184 '01-04-03'
     O                                  194 '01-04-04'
     O*                                 198 'TOTAL'
     O        E 1              #DTL
     O                         ILTKR1     2
     O                                    3 '-'
     O                         ILTKR2     5
     O                                    6 '-'
     O                         ILTKR3     8
     O                                    9 '-'
     O                         ILTKR4    10
     O*
     O*                        ILDIE     23 '  -    - - '
     O                         IIKAT1    14
     O                                   15 '-'
     O                         IIKAT2    19
     O                                   20 '-'
     O                         IIKAT3    21
     O                                   22 '-'
     O                         IIKAT4    23
     O*
     O                         BOX,1 1   31
     O                         BOX,2 1   40
     O                         BOX,3 1   49
     O                         BOX,4 1   58
     O                         BOX,5 1   67
     O                         BOX,6 1   76
     O                         BOX,7 1   85
     O                         BOX,8 1   94
     O                         BOX,9 1  103
     O                         BOX,101  112
     O                         BOX,111  121
     O                         BOX,121  130
     O                         BOX,131  139
     O                         BOX,141  148
     O                         BOX,151  157
     O                         BOX,161  167
     O                         BOX,171  176
     O                         BOX,181  185
     O                         BOX,191  194
     O*                        WKTOT 1  198
     O*
     O        E 1              #TTL
     O                         TOX,1 1   31
     O                         TOX,2 1   40
     O                         TOX,3 1   49
     O                         TOX,4 1   58
     O                         TOX,5 1   67
     O                         TOX,6 1   76
     O                         TOX,7 1   85
     O                         TOX,8 1   94
     O                         TOX,9 1  103
     O                         TOX,101  112
     O                         TOX,111  121
     O                         TOX,121  130
     O                         TOX,131  139
     O                         TOX,141  148
     O                         TOX,151  157
     O                         TOX,161  167
     O                         TOX,171  176
     O                         TOX,181  185
     O                         TOX,191  194
     O*                        WKTOT 1  198
     O*****************************************************************
** ODR
001201
001202
001203
010101
010102
010103
010104
010201
010202
010203
010204
010301
010302
010303
010304
010401
010402
010403
010404
