     H            Y/                                    1
      *** GDIR51 *****************************************************
      * MONTHLY TOTALIZATION HANDLING / PRINT OF ORDER RESULT TABLE
      *      G.B.C                         97/04/10
      ****************************************************************
     FGDIPL20 IF  E           K        DISK
     F*
     FQPRINT  O   F     132     OF     PRINTER
     I****************************************************************
     I            DS
     I                                        1   60@@TIME
     I                                        1   40@TIME
     I* DELETE DUE DATE
     I            DS
     I                                        1   80IJSKHZ
     I                                        1   40IJSKYY
     I                                        5   60IJSKMM
     I                                        7   80IJSKDD
     I            DS
     I                                        1   8 IJKATA
     I                                        1   2 IJKAT1
     I                                        3   6 IJKAT2
     I                                        7   7 IJKAT3
     I                                        8   8 IJKAT4
     I            DS
     I                                        1   80W1DATE
     I                                        1   40W1YEAR
     I                                        5   60W1MONT
     I                                        7   80W1DAY
     I*発注実績
     I            DS
     I                                        1   40WKJSYY
     I                                        5   60WKJSMM
     I                                        1   6 WKDATE
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     C****************************************************************
     C*           ＭＡＩＮ　ＲＯＵＴＩＮＥ                         *
     C****************************************************************
     C           *ENTRY    PLIST
     C                     PARM           PPUSER 10
     C                     PARM           PPDATE  6
     C****************************************************************
     C           KEY       KLIST
     C                     KFLD           WKJSYY
     C                     KFLD           WKJSMM
     C****************************************************************
     C                     MOVE PPDATE    WKDATE
     C                     SETON                     OF
     C                     Z-ADD*DATE     W1DATE
     C*
     C           KEY       SETLLGDIPL20
     C*--------------------
B1   C                     DO   *HIVAL
     C           KEY       READEGDIPL20                  90
     C   90                LEAVE
     C*
 B2  C           IJSKJY    IFEQ 'D'                        DELETE CODE
     C           IJSKHZ    ANDLE*DATE
     C                     ITER
 E2  C                     ENDIF
     C*----------
     C                     MOVE *BLANK    WKNAME 30
     C*
     C   OF                EXCPT#HED
     C   OF                SETOF                     OF
     C                     EXCPT#DTL
E1   C                     ENDDO
     C*--------------------
     C* <終　了>
     C           @END      TAG
     C                     SETON                     LR
     C                     RETRN
     O*****************************************************************
     OQPRINT  E   01           #HED
     O                                    7 'GDIR51'
     O                                   60 'ODER RESULT LIST'
     O                                  107 'DATE:'
     O                         W1MONT  +  0
     O                                 +  0 '/'
     O                         W1DAY   +  0
     O                                 +  0 '/'
     O                         W1YEAR  +  0
     O                                  127 'PAGE:'
     O                         PAGE  Z +  0
     O        E   03           #HED
     O                                   17 'DIE NO.'
     O                                   36 'ORDER QTY'
     O        E   04           #HED
     O                                   21 '-----------'
     O                                   36 '---------'
     O        E 1              #DTL
     O                         IJKAT1    12
     O                                   13 '-'
     O                         IJKAT2    17
     O                                   18 '-'
     O                         IJKAT3    19
     O                                   20 '-'
     O                         IJKAT4    21
     O                         IJSURY1   36
