      *** GDIR40 *****************************************************
      *   INPUT OF ARRIVAL INFORMATION
      *     G.B.C                           97/02/24
      *     ADDING    A.MAMIYA     2000.10.18
      *   CHANGE %001   N.HAYAKAWA   2004.01.15
      ****************************************************************
     H            Y/                                    1
     FGDIPW40 CF  E                    WORKSTN
     FGDIPL26 UF  E           K        DISK
     FGDIPL16 UF  E           K        DISK
     FRATPL01 IF  E           K        DISK
     FGDKPL01 IF  E           K        DISK
     FGDKPL05 O   E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    #ER         8  1
     E                    MSG     1   3 59               d[ｰ xｮﾈｰﾆﾞ
     E                    MM     13  13  2 0
     E                    ERR     1   6 62               d[ｰ xｮﾈｰﾆﾞ
     E                    CMT     1  12 72               d[ｰ xｮﾈｰﾆﾞ
     I            DS
     I                                        1   8 #ER
     I                                        1   8 WER
     I            DS
     I                                        1   80W1DATE
     I                                        1   40W1YEAR
     I                                        5   60W1MONT
     I                                        7   80W1DAY
     I            DS
     I                                        1   80D1DATE
     I                                        1   40D1YY
     I                                        5   60D1MM
     I                                        7   80D1DD
     I            DS
     I                                        1   60@@TIME
     I                                        1   40@TIME
     I                                        1   20@TIMEH
     I                                        3   40@TIMEM
     I            DS
     I                                        1   80IKSKHZ
     I                                        1   40IKSKYY
     I                                        5   60IKSKMM
     I                                        7   80IKSKDD
     I            DS
     I                                        1   80IKKOHZ
     I                                        1   40IKKOYY
     I                                        5   60IKKOMM
     I                                        7   80IKKODD
     I            DS
     I                                        1   80IKJYHZ
     I                                        1   40IKJYYY
     I                                        5   60IKJYMM
     I                                        7   80IKJYDD
     I            DS
     I                                        1   40IKKOTM
     I                                        1   20IKKOHH
     I                                        3   40IKKOSS
     I            DS
     I                                        1   80IISKHZ
     I                                        1   40IISKYY
     I                                        5   60IISKMM
     I                                        7   80IISKDD
     I            DS
     I                                        1   80IIKOHZ
     I                                        1   40IIKOYY
     I                                        5   60IIKOMM
     I                                        7   80IIKODD
     I            DS
     I                                        1   40IIKOTM
     I                                        1   20IIKOHH
     I                                        3   40IIKOSS
     I            DS
     I                                        1   80IIIFHZ
     I                                        1   40IIIFNY
     I                                        5   60IIIFNM
     I                                        7   80IIIFND
     I            DS
     I                                        1   8 IKKATA
     I                                        1   2 IKKAT1
     I                                        3   6 IKKAT2
     I                                        7   7 IKKAT3
     I                                        8   8 IKKAT4
     C****************************************************************
     C*  MAIN
     C****************************************************************
     C           *ENTRY    PLIST
     C                     PARM           PPUSER 10
     C           *NAMVAR   DEFN           GDKD01  20
     C                     IN   *NAMVAR
     C                     Z-ADDGDKD01    COUNT   20
     C*
     C                     EXSR #INIT
     C                     MOVE *BLANK    D1INVO
     C*
     C           @DSP01    TAG
     C                     EXFMTDSP01
     C                     MOVEA'00'      *IN,11
     C                     MOVEL'0'       *IN99
     C                     MOVE *BLANK    D#MSG
     C* < F1=ON >
     C           *INKA     CABEQ'1'       @END
     C*
     C                     EXSR #CHK01
     C           *IN99     CABEQ'1'       @DSP01
     C* < F5=OFF >
     C           *INKE     CABEQ'0'       @DSP01
     C*
     C*
     C*
     C*
     C*
     C           D1INVO    SETLLGDIPL261
     C                     DO   *HIVAL
     C           D1INVO    READEGDIPL261                 10
     C   10                LEAVE
     C           IKSKJY    IFEQ 'D'                        DELETE CODE
     C           IKSKHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
     C*<UPDATE>
     C                     EXSR #RAT01
     C                     EXSR #UPD01
     C                     ENDDO
      *
     C           *IN40     IFEQ '1'
     C                     EXCPT#TO
     C                     END
     C                     MOVE *BLANK    D1INVO
     C********             GOTO @DSP01
      *
     C* <END>
     C           @END      TAG
     C                     SETON                     LR
     C                     RETRN
     C****************************************************************
     C           #INIT     BEGSR                                     *
     C****************************************************************
     C****
     C                     MOVEA'00'      *IN,11
     C                     MOVEL'0'       *IN99
     C                     MOVE *BLANK    D#MSG
     C                     Z-ADD*DATE     W1DATE
     C                     Z-ADD*ZERO     D1DATE
     C*
     C                     ENDSR
     C****************************************************************
     C           #CHK01    BEGSR                                     *
     C****************************************************************
     C**第１画面チェック**
      *
     C           D1INVO    SETLLGDIPL261
     C                     DO   *HIVAL
     C           D1INVO    READEGDIPL261            N    77
     C   77                LEAVE
     C           IKSKJY    IFEQ 'D'                        DELETE CODE
     C           IKSKHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
     C                     LEAVE
     C                     ENDDO
     C**
     C           *IN77     IFEQ '1'
     C                     MOVEL'1'       *IN11
     C  N99                MOVELMSG,1     D#MSG
     C  N99                MOVEL'1'       *IN99
     C                     GOTO @CHK1E
     C                     END
     C           *IN77     IFEQ '0'
     C           IKNYUK    IFNE *BLANK
     C                     MOVEL'1'       *IN11
     C  N99                MOVELMSG,3     D#MSG
     C  N99                MOVEL'1'       *IN99
     C                     GOTO @CHK1E
     C                     END
     C                     END
      *
     C           D1YY      IFEQ 0
     C           D1MM      ORLT 01
     C           D1MM      ORGT 12
     C           D1DD      ORLT 01
     C           D1DD      ORGT 31
     C                     MOVEL'1'       *IN12
     C  N99                MOVELMSG,2     D#MSG
     C  N99                MOVEL'1'       *IN99
     C                     GOTO @CHK1E
     C                     END
      *
     C           D1DATE    IFGT *DATE
     C                     MOVEL'1'       *IN12
     C  N99                MOVELMSG,2     D#MSG
     C  N99                MOVEL'1'       *IN99
     C                     GOTO @CHK1E
     C                     END
      *
     C           @CHK1E    ENDSR
     C****************************************************************
     C           #RAT01    BEGSR                                     *
     C****************************************************************
     C*<>
     C*RATPL01 READ (RATE MASTER)
     C                     Z-ADDIKSKOY    @@YY    40
     C                     Z-ADDIKSKOM    @@MM    20
     C                     MOVE 'JPY'     @@CODE  3
     C           RATKEY    KLIST
     C                     KFLD           @@YY
     C                     KFLD           @@MM
     C                     KFLD           @@CODE
     C           RATKEY    CHAINRATPL011             10
     C   10                Z-ADD0         RARATE
     C*
     C                     ENDSR
     C****************************************************************
     C           #UPD01    BEGSR                                     *
     C****************************************************************
     C*<>
     C*
     C                     MOVEL*BLANK    #ER
     C                     TIME           @@TIME
     C                     Z-ADDD1YY      IKNYUY
     C                     Z-ADDD1MM      IKNYUM
     C                     Z-ADDD1DD      IKNYUD
     C                     MOVEL'*'       IKNYUK
     C                     EXSR #UPD02
     C                     Z-ADD*DATE     IKKOHZ
     C                     Z-ADD@TIME     IKKOTM
     C                     MOVELPPUSER    IKKOME
     C                     UPDATGDIPL261
     C                     EXSR #UPD03
     C*
     C                     ENDSR
     C****************************************************************
     C           #UPD02    BEGSR                                     *
     C****************************************************************
     C*<>
     C           KEY1      KLIST
     C                     KFLD           IKODER
     C                     KFLD           IKITEM
     C*
     C                     Z-ADD0         IIODRY
     C                     Z-ADD0         IIODRM
     C                     Z-ADD0         IIODRD
     C                     MOVE *BLANK    IIIFMK
     C                     TIME           @@TIME
     C                     SETOF                     10
     C           KEY1      SETLLGDIPL161
     C                     DO   *HIVAL
     C           KEY1      READEGDIPL161                 10
     C   10                LEAVE
     C           IISKJY    IFEQ 'D'                        DELETE CODE
     C           IISKHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
     C                     LEAVE
     C                     ENDDO
     C** 発注データなし
     C           *IN10     IFEQ '1'
     C                     MOVE '1'       #ER,1
     C                     END
     C**
     C           *IN10     IFEQ '0'
     C** すでに納入済み
     C           IIIFMK    IFEQ '*'
     C                     MOVE '2'       #ER,2
     C                     GOTO UPDEND
     C                     END
     C** キャンセル済み
     C           IIIFMK    IFEQ 'C'
     C                     MOVE '3'       #ER,3
     C                     GOTO UPDEND
     C                     END
     C                     ADD  IKSURY    IIIFSU
     C           IIIFSU    IFGE IISURY
     C                     MOVEL'*'       IIIFMK
     C                     Z-ADDW1YEAR    IIIFNY
     C                     Z-ADDW1MONT    IIIFNM
     C                     Z-ADDW1DAY     IIIFND
     C                     Z-ADDD1DATE    IIIFHZ
     C                     END
     C                     Z-ADD*DATE     IIKOHZ
     C                     Z-ADD@TIME     IIKOTM
     C                     MOVELPPUSER    IIKOME
     C                     UPDATGDIPL161
     C                     END
     C*
     C           UPDEND    ENDSR
     C*****************************************************************
     C           #UPD03    BEGSR                                     *
     C****************************************************************
     C*<>
     C           KEY2      KLIST
     C                     KFLD           WVEND
     C                     KFLD           WTYPE
     C                     KFLD           GDKKEY
     C*
     C                     MOVE '8990'    WVEND   4
     C                     MOVE 'K'       WTYPE   1
     C                     MOVE *BLANK    GDKKEY 20
     C                     MOVELIKKATA    GDKKEY
     C           KEY2      SETLLGDKPL011                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           ##1       TAG
     C           KEY2      READEGDKPL011                 10
     C           *IN10     IFEQ '0'
     C           ISSKJY    IFEQ 'D'
     C           ISSKHZ    IFLE *DATE
     C                     GOTO ##1
     C                     END
     C                     END
     C           ISSTHZ    IFGT IKJYHZ
     C                     GOTO ##1
     C                     END
     C           ISENHZ    IFLT IKJYHZ
     C                     GOTO ##1
     C                     END
     C                     MOVEA'1'       *IN,90
     C                     END
     C  N10                END
     C                     Z-ADD0         WTANK   82
     C           *IN90     IFEQ '0'
     C                     Z-ADD0         WTKP   145
     C                     MOVE '4'       #ER,4
     C                     ELSE
     C*          IKHANY    IFEQ 'S'
     C                     Z-ADDISTKP1    WTKP
     C                     Z-ADDISTKP1    WTANK   82
     C*                    END
     C*          IKHANY    IFEQ 'A'
     C*                    Z-ADDISTKP2    WTKP
     C*                    END
     C**ＩＡＦ単価とＡＳＪ単価アンマッチ
     C           WTKP      IFNE IKTANK
     C                     MOVE '5'       #ER,5
     C                     END
     C                     END
     C*
     C                     MOVE *BLANK    ITSKJY
     C                     Z-ADD0         ITSKYY
     C                     Z-ADD0         ITSKMM
     C                     Z-ADD0         ITSKDD
     C                     Z-ADD*YEAR     ITKOYY
     C                     Z-ADDUMONTH    ITKOMM
     C                     Z-ADDUDAY      ITKODD
     C                     Z-ADD@TIMEH    ITKOHH
     C                     Z-ADD@TIMEM    ITKOSS
     C                     MOVE PPUSER    ITKOME
     C                     MOVE IKINVO    ITINVO
     C                     Z-ADDIKODER    ITODER
     C                     Z-ADDIKITEM    ITITEM
     C                     Z-ADDIKIKBN    ITIKBN
 %001C                     MOVE IKPARE    ITPARE
     C                     Z-ADDIKBXNO    ITBXNO
     C                     MOVE WTYPE     ITTYPE
     C                     MOVELIKKATA    ITHIN
     C                     MOVEL*BLANK    ITNAME
     C                     MOVE WVEND     ITVEND
     C                     MOVE *BLANK    ITKAMO
     C                     Z-ADDIKSBOX    ITHAKO
     C                     Z-ADDIKSURY    ITSRY
     C                     Z-ADDWTKP      ITTAN
     C                     MOVE *BLANK    ITTKBN
     C           ITSRY     MULT ITTAN     ITKIN
     C                     Z-ADDRARATE    ITRATE
     C                     Z-ADD0         ITDOLL
     C           ITRATE    IFNE 0
     C           ITKIN     DIV  ITRATE    ITDOLL
     C                     END
     C                     Z-ADDIIODRY    ITHTYY
     C                     Z-ADDIIODRM    ITHTMM
     C                     Z-ADDIIODRD    ITHTDD
     C                     Z-ADDD1YY      ITUKYY
     C                     Z-ADDD1MM      ITUKMM
     C                     Z-ADDD1DD      ITUKDD
     C                     Z-ADDIKSKOY    ITSAYY
     C                     Z-ADDIKSKOM    ITSAMM
     C                     Z-ADDIKSKOD    ITSADD
     C                     Z-ADDIKSKOY    ITSIYY
     C                     Z-ADDIKSKOM    ITSIMM
     C                     Z-ADDIKSKOD    ITSIDD
     C                     MOVELIKHANY    ITYUSO
      *
     C                     DO   COUNT
     C           ITSIMM    IFEQ 12
     C                     ADD  1         ITSIYY
     C                     Z-ADD1         ITSIMM
     C                     ELSE
     C                     ADD  1         ITSIMM
     C                     END
     C                     END
     C                     Z-ADDITSIMM    A       20
     C           A         IFEQ 2
     C           ITSIYY    DIV  4         WWW001  40
     C                     MVR            WWW002  40
     C           WWW002    IFEQ 0
     C                     Z-ADD13        A
     C                     END
     C                     END
     C                     Z-ADDMM,A      ITSIDD
     C*
     C                     Z-ADD0         ITMMYY
     C                     Z-ADD0         ITMMMM
     C                     Z-ADD0         ITMMDD
     C                     WRITEGDKPL051
     C*
     C           WER       IFNE *BLANK
      *
     C           *IN40     IFEQ '0'
     C                     EXCPT#HED
     C                     SETON                     40
     C                     END
     C           *INOF     IFEQ '1'
     C                     EXCPT#TO
     C                     EXCPT#HED
     C                     MOVEL'0'       *INOF
     C                     END
      *
     C           IKHANY    IFEQ 'S'
     C                     MOVEL'SHIP'    WHANY   4
     C                     END
     C           IKHANY    IFEQ 'A'
     C                     MOVEL'AIR '    WHANY
     C                     END
     C                     EXCPT#DTL
     C                     END
     C*
     C                     ENDSR
     C*****************************************************************
     OQPRINT  E   02           #HED
     O                                    7 'GDIR40'
     O                                   60 'SHIPPING ERROR LIST'
     O                                  103 'DATE :'
     O                         W1MONT  +  1
     O                                 +  0 '/'
     O                         W1DAY   +  0
     O                                 +  0 '/'
     O                         W1YEAR  +  0
     O                                  121 'PAGE :'
     O                         PAGE  Z +  0
     O        E   03           #HED
     O                                   15 'INVOICE NO. :'
     O                         D1INVO  +  1
     O                                   38 'RECEIVE DATE :'
     O                         D1MM    +  1
     O                                 +  0 '/'
     O                         D1DD    +  0
     O                                 +  0 '/'
     O                         D1YY    +  0
     O        E   04           #HED
     O                                   73 'ASJ'
     O                                   84 'IAF'
     O                                  100 'SHIPMENT'
     O                                  110 'ARRIVAL'
     O                                  119 'SCHEDULE'
     O        E   05           #HED
     O                                   10 'ORDER NO.'
     O                                   19 'ITEM NO.'
     O                                   24 'PLT.'
     O                                   32 'BOX NO.'
     O                                   45 'TYPE/DIE NO.'
     O                                   56 'DELI QTY'
     O                                   64 'QTY/BOX'
     O                                   68 'BOX'
     O                                   80 'UNIT PRICE'
     O                                   91 'UNIT PRICE'
     O                                   96 'DATE'
     O                                  107 'DATE'
     O                                  120 'CARRY'
     O                                  130 'ERR CODE'
     O        E   0607         #HED
     O                                   10 '---------'
     O                                   19 '--------'
     O                                   24 '----'
     O                                   32 '-------'
     O                                   47 '--------------'
     O                                   56 '--------'
     O                                   64 '-------'
     O                                   69 '----'
     O                                   80 '----------'
     O                                   91 '----------'
     O                                  102 '----------'
     O                                  113 '----------'
     O                                  120 '-----'
     O                                  130 '--------'
     O        E  1             #DTL
     O                         IKODER     8
     O                         IKITEM    16
     O                                 +  0 '-'
     O                         IKIKBN  +  0
     O                         IKPARE    24
     O                         IKBXNO    30
     O                         WTYPE     35
     O                         IKKAT1    38
     O                                 +  0 '-'
     O                         IKKAT2  +  0
     O                                 +  0 '-'
     O                         IKKAT3  +  0
     O                                 +  0 '-'
     O                         IKKAT4  +  0
     O                         IKSURY1   56
     O                         IKSYOS1   64
     O                         IKSBOX1   69
     O                         IKTANK1   79
     O                         WTANK 1   91
     O                         IKSKOY    96
     O                                 +  0 '/'
     O                         IKSKOM  +  0
     O                                 +  0 '/'
     O                         IKSKOD  +  0
     O                         IKTOYY   107
     O                                 +  0 '/'
     O                         IKTOYM  +  0
     O                                 +  0 '/'
     O                         IKTOYD  +  0
     O                         WHANY    119
     O                         #ER      130
     O        E   52           #TO
     O                                   19 '* CONTENT OF ERROR'
     O                                   85 '* METHOD OF CORRESPONDEN'
     O                                   96 'CE OF ERROR'
     O        E   53           #TO
     O                         ERR,1     62
     O                         CMT,1    132
     O        E   54           #TO
     O                         CMT,2    132
     O        E   55           #TO
     O                         ERR,2     62
     O                         CMT,3    132
     O        E   56           #TO
     O                         CMT,4    132
     O        E   57           #TO
     O                         ERR,3     62
     O                         CMT,5    132
     O        E   58           #TO
     O                         CMT,6    132
     O        E   59           #TO
     O                         ERR,4     62
     O                         CMT,7    132
     O        E   60           #TO
     O                         CMT,8    132
     O        E   61           #TO
     O                         ERR,5     62
     O                         CMT,9    132
     O        E   62           #TO
     O                         CMT,10   132
**  MSG
INVOICE NUMBER  NOT FOUND IN INVOICE NO FILE.
INCORRECT DATE.
THE INVOICE NUMBER INPUT ALREADY EXIST.
**
31283130313031313031303129
**  ERR
1.THE ITEM NO. IS NOT FOUND IN ORDER DATA.
2.THIS ITEM IS COMPLETELY RECEIVED.
3.THIS ITEM IS CANCELLED BEFORE.
4.THE PART NO. IS NOT FOUND IN UNIT PRICE M/F.
5.THE UNIT PRICE IS DIFFERENT FROM IT IN UNIT PRICE M/F.
**  CMT
:ASK DETAILS TO OVERSEAS LOGISTICS TEAM IN ASJ.
 IF INVOICE DATA IS WRONG, CANCEL ACTUAL PURCHASE ORDER M/F.
:ASK DETAILS TO OVERSEAS LOGISTICS TEAM IN ASJ.
 IF INVOICE DATA IS WRONG, CANCEL ACTUAL PURCHASE ORDER M/F.
:ASK DETAILS TO OVERSEAS LOGISTICS TEAM IN ASJ.
 IF INVOICE DATA IS WRONG, CANCEL ACTUAL PURCHASE ORDER M/F.
:UPDATE UNIT PRICE IN M/F +
 UPDATE UNIT PRICE IN ACTUAL PURCHASE ORDER M/F.
:ASK DETAILS TO OVERSEAS LOGISTICS TEAM IN ASJ.
 UPDATE UNIT PRICE IN M/F + UNIT PRICE IN ACTUAL PURCHASE M/F IF NEEDED.
