     H            Y.                                    1
      ** GDIR38 *******************
      *  PRINT NON-DELIVERY LIST  *
      *  A.MAMIYA    2000.11.11   *
      *  COPY FROM GDIR36         *
      *  CHANGE %001 N.HAYAKAWA  2004.01.15
      ******************* GDIR38 **
     FGDIWP36 IP  F     128            DISK
     FGDIPL25 IF  E           K        DISK
     FQPRINT  O   F     158     OF     PRINTER
      *
     IGDIWP36 AA  01
     I                                        1   2 IKAT1
     I                                        3   6 IKAT2
     I                                        7   7 IKAT3
     I                                        8   8 IKAT4
     I                                        9  140IODER L1
     I                                        9  10 IODR1
     I                                       11  12 IODR2
     I                                       13  14 IODR3
     I                                       15  190IITEM
     I                                       20  270IODHZ
     I                                       28  300ISYOS
     I                                       31  350IMAIS
     I                                       36  420ISURY
      *
     I                                       43  43 IHANY
     I                                       44  510IDLHZ
      *
     I            DS
     I                                        1   80IKSKHZ
     I                                        1   40IKSKYY
     I                                        5   60IKSKMM
     I                                        7   80IKSKDD
     I            DS
     I                                        1   80IKSOHZ
     I                                        1   40IKSKOY
     I                                        5   60IKSKOM
     I                                        7   80IKSKOD
     I            DS
     I                                        1   80IKNYHZ
     I                                        1   40IKNYUY
     I                                        5   60IKNYUM
     I                                        7   80IKNYUD
     I            DS
     I                                        1   6 IINVO
     I                                        1   2 IIVO1
     I                                        3   6 IIVO2
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *
     C                     MOVE *BLANK    WUSER   9
     C                     MOVE *BLANK    WUSME  15
     C                     CALL 'APLR00'
     C                     PARM           US
     C                     PARM           WUSME
     C                     MOVELWUSME     WUSER
      *-----*
      * KEY *
      *-----*
     C           KEY       KLIST
     C                     KFLD           IODER
     C                     KFLD           IITEM
      *-----*
      * INZ *
      *-----*
     C           *IN05     IFEQ '0'
     C                     SETON                     05
     C                     Z-ADD0         GSKSU   70
     C                     Z-ADD0         GSKHK   30
     C                     Z-ADD0         GRESU   70
     C                     Z-ADD0         GREHK   30
     C                     Z-ADD0         GMISU   70
     C                     Z-ADD0         GMIHK   30
     C                     MOVE *BLANK    IINVO   6
     C                     Z-ADD0         ISYSU   70
     C                     Z-ADD0         ISKHK   50
     C                     Z-ADD0         ISOHZ   80
     C                     Z-ADD0         INYHZ   80
     C                     MOVE *BLANK    IPALE   4
     C                     Z-ADD0         IHKNO   40
     C                     TIME           WTIME   60
     C                     MOVE *BLANK    $HANY   1
     C                     EXCPTHD
     C                     END
      *
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
      *
     C           *INL1     IFEQ '1'
     C           *IN50     ANDEQ'1'
     C                     EXCPTDT1
     C                     END
     C                     SETON                     50
      *----------------------*
      * SHIPPING INFORMATION *
      *----------------------*
     C                     SETOF                     20
     C           KEY       SETLLGDIPL25
     C                     DO   *HIVAL
     C                     SETOF                     1077
     C           KEY       READEGDIPL251                 10
     C           *IN20     IFEQ '0'
     C           *IN10     IFEQ '1'
     C                     SETON                     2077
     C                     EXCPTDT2
     C                     END
     C                     END
     C           *IN10     IFEQ '0'
     C           IKSKJY    IFEQ 'D'
     C           IKSKHZ    ANDLE*DATE
     C                     ELSE
     C           *IN20     IFEQ '0'
     C                     SETON                     2077
     C                     END
      *
     C                     MOVE IKHANY    $HANY
     C                     MOVELIKINVO    IINVO
     C                     Z-ADDIKSURY    ISYSU
     C           ISYSU     DIV  ISYOS     ISKHK
     C*                    Z-ADDIKSBOX    ISKHK
     C                     Z-ADDIKSOHZ    ISOHZ
     C                     Z-ADDIKNYHZ    INYHZ
 %001C                     MOVE IKPARE    IPALE
     C                     Z-ADDIKBXNO    IHKNO
     C           IKNYUK    IFEQ *BLANK
     C                     ADD  IKSURY    GSKSU
     C                     ELSE
     C                     ADD  IKSURY    GSKSU
     C                     ADD  IKSURY    GRESU
     C                     END
     C                     EXCPTDT2
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C           ISURY     SUB  GSKSU     GMISU
     C           GMISU     DIV  ISYOS     GMIHK
     C           GSKSU     DIV  ISYOS     GSKHK
     C           GRESU     DIV  ISYOS     GREHK
     C                     EXCPTDT3
     C                     MOVE *BLANK    IINVO
     C                     Z-ADD0         ISYSU
     C                     Z-ADD0         ISKHK
     C                     Z-ADD0         ISOHZ
     C                     Z-ADD0         INYHZ
     C                     MOVE *BLANK    IPALE
     C                     Z-ADD0         IHKNO
     C                     Z-ADD0         GSKSU
     C                     Z-ADD0         GSKHK
     C                     Z-ADD0         GRESU
     C                     Z-ADD0         GREHK
     C                     Z-ADD0         GMISU
     C                     Z-ADD0         GMIHK
     C                     MOVE *BLANK    $HANY
     OQPRINT  E  103           HD
     O                                  151 '.....................'
      *
     O        E  1             HD
     O                                  151 '.         .         .'
      *
      *
     O        E  1             HD
     O                                  109 'TIME'
     O                         WTIME    118 '  :  :  '
     O                                  131 '.'
     O                                  141 '.'
     O                         WUSER    150
     O                                  151 '.'
      *
     O        E  1             HD
     O                                   68 '** NON-DELIVERY LIST **'
     O                                  109 'DATE'
     O                         UDATE    118 '  .  .  '
     O                                  124 'PAGE'
     O                         PAGE  Z  128
     O                                  151 '.....................'
      *
     O        E  1             HD
     O                                   18 'ORDER INFORMATION'
     O                                   38 '--------------------'
     O                                   58 '--------------------'
     O                                   70 '------------'
     O                                   83 '-------------'
     O                                  105 'SIHPING INFORMATION'
     O                                  125 '--------------------'
     O                                  132 '-------'
     O                                  151 'RECEIVE INFO----'
      *
      *
     A*         1         2         3         4         5         6         7
     A*1234567890123456789012345678901234567890123456789012345678901234567890
      * ORDER INFORMATION----------------------------------------------------
     O*  ORDER NO.    ITEM # ORDER DATE DIE NO.     QTY.      QTY./BOX BOX
     O*  ------------ ------ ---------- ----------- --------- -------- ------
     A*         7         8         9        10        11        12        13
     A*12345678901234567890123456789012345678901234567890123456789012345678901
     O* ----------------------   SIHPING INFORMATION---------------------------
     O*BOX BOX   CRY DELIVERY    INVOICE PALL. BOX# QTY.      BOX    SHIP DATE
     O*--- ------ - ----------   ------- ----- ---- --------- ------ ----------
     A*12       3         4         5        16
     A*1234567890123456789012345678901234567890
     O*------------   RECEIVE INFO----
     O*  SHIP DATE    RECEIVE DATE CRY
     O*- ----------   ------------  -
      *                9999-99-99
     O        E  1             HD
     O                                   11 'ORDER NO.'
     O                                   21 'ITEM #'
     O                                   32 'ORDER DATE'
     O                                   40 'DIE NO.'
     O                                   49 'QTY.'
     O                                   63 'QTY./BOX'
     O                                   67 'BOX'
     O                                   73 'CRY'
     O                                   82 'DELIVERY'
     O                                   93 'INVOICE'
     O                                   99 'PALL.'
     O                                  104 'BOX#'
     O                                  109 'QTY.'
     O                                  118 'BOX'
     O                                  131 'SHIP DATE'
     O                                  147 'RECEIVE DATE'
     O                                  151 'CRY'
      *
     O        E  1             HD
     O                                   14 '------------'
     O                                   21 '------'
     O                                   32 '----------'
     O                                   44 '-----------'
     O                                   54 '---------'
     O                                   63 '--------'
     O                                   70 '------'
     O                                   72 '-'
     O                                   83 '----------'
     O                                   93 '-------'
     O                                   99 '-----'
     O                                  104 '----'
     O                                  114 '---------'
     O                                  121 '------'
     O                                  132 '----------'
     O                                  147 '------------'
     O                                  150 '-'
     O        E  1             DT1
      *
     O        E  1             DT2
     O                 77                 1 '*'
     O                 77                 6 'IAF-'
     O                 77      IODR1      8
     O                 77                 9 '-'
     O                 77      IODR2     11
     O                 77                12 '-'
     O                 77      IODR3     14
     O                 77      IITEM     20
     O                 77      IODHZ     32 '    /  /  '
     O                 77      IKAT1     35
     O                 77                36 '-'
     O                 77      IKAT2     40
     O                 77                41 '-'
     O                 77      IKAT3     42
     O                 77                43 '-'
     O                 77      IKAT4     44
     O                 77      ISURY     54 ' ,   ,   '
     O                 77      ISYOS     63 ' ,   ,   '
     O                 77      IMAIS     70 '  ,   '
     O                 77      IHANY     72
     O                 77      IDLHZ     83 '    /  /  '
     O                         IIVO1     88
     O                N10                89 '-'
     O                         IIVO2     93
     O                         IPALE     99
     O                         IHKNO Z  104
     O                         ISYSU    114 ' ,   ,   '
     O                         ISKHK    121 '  ,   '
     O                         ISOHZ    132 '    /  /  '
     O                         INYHZ    146 '    /  /  '
     O                         $HANY    150
      *
     O        E  3             DT3
     O                                   11 'TOTAL...'
     O                                   23 '(SHIPPING-->'
     O                                   28 'QTY.'
     O                         GSKSU 1   37
     O                                   41 'BOX'
     O                         GSKHK 1   48
     O                                   49 ')'
     O                                   63 '(RECIVEING-->'
     O                                   68 'QTY.'
     O                         GRESU 1   77
     O                                   81 'BOX'
     O                         GREHK 1   88
     O                                   89 ')'
     O                                  106 '(NON-DELIVERY-->'
     O                                  111 'QTY.'
     O                         GMISU 1  120
     O                                  124 'BOX'
     O                         GMIHK 1  131
     O                                  132 ')'
