      ** GDIR13 ******************************************************
      *    ORDER FIXED HANDING / PRINT OF ORDER SHEET TABLE
      *    CHANGE CARRY CODE SHIP > AIR
      *     G.B.C                        2003.11.30
      *    %001 AIR TOTAL     2003.02.17  HAYA
      * ----------------------------------------------------------
      *    JW1   2024.05.09 ADD UTLR24D FOR GETTING DELIVERY DATE
      ****************************************************************
     H            Y/                                    1
     FGDIPW13 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN1  KSFILE SFREC1
      *
     FGDGPL30 UF  E           K        DISK                      A
     FGDIPL10 IF  E           K        DISK
     F*GDIPL40 IF  E           K        DISK
     FGDIPP15 O   E                    DISK
      *
     FGCQPL12 IF  E           K        DISK
      *
     FGDIWP13 O   F     150            DISK
     FGDIPR13 O   E                    PRINTER
     FGDIPR14 O   E                    PRINTER
     FGDGWPE2 O   F     128            DISK
      *================================================================
     E                    TBL     1   5  8   TOKU   18   SYSTEM NAME
     E                    MSG     1   7 60               d[ｰ xｮﾈｰﾆﾞ
      *================================================================
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *  DIE CODE
     I            DS
     I                                        1   8 IHKATA
     I                                        1   2 IHKAT1
     I                                        3   6 IHKAT2
     I                                        7   7 IHKAT3
     I                                        8   8 IHKAT4
     I            DS
     I                                        1  11 S1KATA
     I                                        1   2 S1KAT1
     I                                        3   3 S1HF1
     I                                        4   7 S1KAT2
     I                                        8   8 S1HF2
     I                                        9   9 S1KAT3
     I                                       10  10 S1HF3
     I                                       11  11 S1KAT4
      *  DELIVERY
     I            DS
     I                                        1   80D2DLVR
     I                                        1   20D2DLMM
     I                                        3   40D2DLDD
     I                                        5   80D2DLYY
     I            DS
     I                                        1   80S1DLVR
     I                                        1   20S1DLMM
     I                                        3   40S1DLDD
     I                                        5   80S1DLYY
     I            DS
     I                                        1   80IIDLVR
     I                                        1   40IIDLVY
     I                                        5   60IIDLVM
     I                                        7   80IIDLVD
     I            DS
     I                                        1   80D@DLVR
     I                                        1   40D@DLYY
     I                                        5   60D@DLMM
     I                                        7   80D@DLDD
      *
     I            DS
     I                                        1   60D1ODER
     I                                        1   20D1ODR1
     I                                        3   40D1ODR2
     I                                        5   60D1ODR3
     I            DS
     I                                        1   80W1DATE
     I                                        1   40W1YEAR
     I                                        5   60W1MONT
     I                                        7   80W1DAY
     I            DS
     I                                        1   60@@TIME
     I                                        1   40@TIME
      *
     I            DS
     I                                        1   80IISKHZ
     I                                        1   40IISKYY
     I                                        5   60IISKMM
     I                                        7   80IISKDD
     I            DS
     I                                        1   80IIKOHZ
     I                                        1   40IIKOYY
     I                                        5   60IIKOMM
     I                                        7   80IIKODD
     I            DS
     I                                        1   40IIKOTM
     I                                        1   20IIKOHH
     I                                        3   40IIKOSS
      *
     I            DS
     I                                        1   80IFKOHZ
     I                                        1   40IFKOYY
     I                                        5   60IFKOMM
     I                                        7   80IFKODD
     I            DS
     I                                        1   40IFKOTM
     I                                        1   20IFKOHH
     I                                        3   40IFKOSS
      *     <<
     I            DS
     I                                        1  18 @TOKU
     I                                        1   40@@TOKU
     I                                        5   5 @@TKOJ
     I                                        6   9 @@TUKE
     I                                       10  130@@NONY
     I                                       14  14 @@NKOJ
     I                                       15  18 @@NUKE
      * SYSTEM DATE
JW1  I            DS
 '   I                                        1  140SDATE
 '   I                                        1   60NOW
JW1  I                                        7  140TODAY
      *     <<
     I           SDS
     I                                        1  10 @@PGM
     I                                      254 263 @@USID
     I*             '0123456789'          C         DIGITS
     C*===============================================================
     C           *ENTRY    PLIST
     C                     PARM           P@SYS   8
     C*===============================================================
     C*  START  PROGRAM
     C*===============================================================
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C           @STEP     CASEQ'#SFSET  '#SFSET
     C           @STEP     CASEQ'#CHK1   '#CHK1
     C           @STEP     CASEQ'#CHG    '#CHG
     C           @STEP     CASEQ'#DSP2   '#DSP2
     C           @STEP     CASEQ'#CHK2   '#CHK2
     C           @STEP     CASEQ'#CHK2U  '#CHK2
     C           @STEP     CASEQ'#RESET  '#RESET
     C           @STEP     CASEQ'#LIST   '#LIST
     C           @STEP     CASEQ'#CONF   '#CONF
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C*   << INIT >>
     C*===============================================================
     C           #INIT     BEGSR
      *
JW1  C                     TIME           SDATE
      *
     C                     MOVEA*ALL'0'   *IN
     C                     MOVE *BLANK    D#MSG            エラー
     C*
     C                     Z-ADD1         X       20
     C           P@SYS     LOKUPTBL,X                    90
     C           *IN90     IFEQ *ON
     C                     MOVE TOKU,X    @TOKU
     C                     ELSE
     C                     MOVE TOKU,4    @TOKU
     C                     ENDIF
     C*
     C                     Z-ADD*DATE     W1DATE
     C                     MOVELP@SYS     D1ODRX
     C                     MOVELP@SYS     D1ODR0
     C                     Z-ADDUYEAR     D1ODR1
     C                     Z-ADDUMONTH    D1ODR2
     C                     Z-ADD0         D1ODR3
     C                     Z-ADD56        LINE    20
     C                     Z-ADD56        LINE2   20
     C                     Z-ADD0         @@KENS  50
     C*
     C           'ORDER '  CHAINGDGPL301             90
     C  N90                Z-ADDIFNO      D1ODR3
     C*
     C                     MOVE '#SFSET  '@STEP
     C*
     C                     ENDSR
     C*===============================================================
     C*   << SFSET >>
     C*===============================================================
     C           #SFSET    BEGSR
     C                     SETON                     83    SFLCLR
     C                     WRITESFCTL
     C                     SETOF                     83
     C                     Z-ADD0         RRN1    40
     C*
      * DAYLY ORDER DATA BEFOR ADDING FILE
     C           *LOVAL    SETLLGDIPL10
     C*--------------------
S1   C                     DO   *HIVAL
     C                     READ GDIPL10                  90
     C   90                LEAVE
 S2  C           IHSKJY    IFEQ 'D'
     C           IHSKHZ    ANDLE*DATE                                  )
     C                     ITER
 E2  C                     ENDIF
     C*
     C                     MOVE *BLANK    S1CHG            CHG
     C                     MOVE *BLANK    S1KATA           DIE NO.
     C                     MOVE IHKAT1    S1KAT1           DIE NO1
     C                     MOVE IHKAT2    S1KAT2           DIE NO2
     C                     MOVE IHKAT3    S1KAT3           DIE NO3
     C                     MOVE IHKAT4    S1KAT4           DIE NO4
     C                     MOVE '-'       S1HF1
     C                     MOVE '-'       S1HF2
     C                     MOVE '-'       S1HF3
     C           S1KAT4    IFEQ *BLANK
     C                     MOVE ' '       S1HF3
     C           S1KAT3    IFEQ *BLANK
     C                     MOVE ' '       S1HF2
     C           S1KAT2    IFEQ *BLANK
     C                     MOVE ' '       S1HF1
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     Z-ADDIHSURY    S1SURY           QTY
     C                     Z-ADDIHSYOS    S1SYOS           QTY/BOX
     C                     Z-ADDIHMAIS    S1MAIS           BOX
     C                     Z-ADDIHMAIS    S1SHIP           SHIP/BOX
     C                     Z-ADD0         S1AIR            AIR/BOX
     C                     Z-ADD0         S1DLVR           DELIVERY
     C                     ADD  1         RRN1
     C                     WRITESFREC1
E1   C                     ENDDO
     C*--------------------
     C                     Z-ADDRRN1      ENDRRN  40
     C                     Z-ADD1         RRN
     C                     MOVE '#DSP1   '@STEP
     C*
     C                     ENDSR
      *===============================================================
      *  画面１　表示
      *===============================================================
     C           #DSP1     BEGSR
     C*
     C                     WRITEDSP01
     C           ENDRRN    IFNE 0
     C                     SETON                     81
     C                     ENDIF
     C                     SETON                     82
     C                     EXFMTSFCTL
     C                     SETOF                     818299
     C                     MOVE *BLANK    D#MSG
     C                     Z-ADD$$RRN     TOPRRN  40
     C*
     C                     MOVE '#CHK1   '@STEP
     C*  < F1 >  EXIT
     C           *INKA     IFEQ *ON
     C                     MOVE '#CONF   '@STEP
     C                     ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *  画面１　チェック
      *===============================================================
     C           #CHK1     BEGSR
     C*
     C                     Z-ADD0         @SEL    40
     C                     Z-ADD0         ERRRRN  40
     C                     Z-ADD0         CHGRRN  40
     C*--------------------
S1   C                     DO   ENDRRN    RRN1
     C           RRN1      CHAINSFREC1               91
     C   91                LEAVE
     C                     SETOF                     11
     C*
 S2  C           S1CHG     IFNE *BLANK                     CHG
     C           S1CHG     ANDNE'1'                        CHG
     C                     MOVELMSG,1     D#MSG
     C                     SETON                     1199
     C                     Z-ADDRRN1      ERRRRN
 E2  C                     ENDIF
 S2  C           S1CHG     IFEQ '1'                        CHG
  S3 C           @SEL      IFEQ 0
     C                     Z-ADDRRN1      CHGRRN
  X3 C                     ELSE
     C                     SETON                     11
  S4 C           ERRRRN    IFEQ 0
     C                     Z-ADDRRN1      ERRRRN
  E4 C                     ENDIF
  E3 C                     ENDIF
     C                     ADD  1         @SEL
 E2  C                     ENDIF
     C*
     C                     UPDATSFREC1
E1   C  N99                ENDDO
     C*--------------------
     C           @SEL      IFEQ 0
     C                     MOVELMSG,2     D#MSG
     C                     SETON                     99
     C                     ELSE
     C           @SEL      IFNE 1
     C                     MOVELMSG,3     D#MSG
     C                     SETON                     99
     C                     ENDIF
     C                     ENDIF
     C*
S1   C           *IN99     IFEQ *OFF
     C                     MOVE '#CHG    '@STEP
X1   C                     ELSE
 S2  C           ERRRRN    IFNE 0
     C                     Z-ADDERRRRN    RRN
 X2  C                     ELSE
     C                     Z-ADDTOPRRN    RRN
 E2  C                     ENDIF
     C                     MOVE '#DSP1   '@STEP
E1   C                     ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *   SHIP > AIR CHANGE
      *===============================================================
     C           #CHG      BEGSR
     C*
     C                     SETOF                     212223
     C           CHGRRN    CHAINSFREC1               91
     C                     MOVELS1KATA    D2KATA           DIE NO.
     C                     Z-ADDS1SURY    D2SURY           QTY
     C                     Z-ADDS1MAIS    D2MAIS           BOX
     C                     Z-ADDS1SYOS    D2SYOS           QTY/BOX
     C                     Z-ADDS1SHIP    D2SHIP           SHIP/BOX
     C                     Z-ADDS1AIR     D2AIR            AIR/BOX
     C                     Z-ADDS1DLVR    D2DLVR           DELIVERY
JW1   * GET DELIVERY DATE
 .   C           D2DLVR    IFEQ 0
 .   C                     MOVELTODAY     $BDATE
 .   C                     CALL 'UTLR24D'
 .   C                     PARM           $BDATE  8
 .   C                     PARM           $FRIDY  8
 .   C                     MOVEL$FRIDY    $YMD
 .   C                     CALL 'EDTR07 '                   YYMMDD --> MMDDYY
 .   C                     PARM           $YMD    8
 .   C                     PARM           $MDY1   8
 .   C                     PARM           $MDY2   6
 .   C                     MOVEL$MDY1     D2DLVR
JW1  C                     ENDIF
      *
     C                     MOVE '#DSP2   '@STEP
     C                     ENDSR
      *===============================================================
      *  画面２　表示
      *===============================================================
     C           #DSP2     BEGSR
     C*
     C                     EXFMTDSP02
     C                     SETOF                     212223
     C                     SETOF                     99
     C                     MOVE *BLANK    D#MSG
     C*
     C                     MOVE '#CHK2   '@STEP
     C*  < F3 >  BACK
     C           *INKC     IFEQ *ON
     C                     Z-ADDTOPRRN    RRN
     C                     MOVE '#DSP1   '@STEP
     C                     ENDIF
     C*  < F5 >  INPUT
     C           *INKE     IFEQ *ON
     C                     MOVE '#CHK2U  '@STEP
     C                     ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *  画面２　チェック
      *===============================================================
     C           #CHK2     BEGSR
     C*
     C           D2AIR     IFGT D2MAIS                     AIR/BOX
     C                     MOVELMSG,4     D#MSG
     C                     SETON                     2299
     C                     ELSE
     C           D2MAIS    SUB  D2AIR     D2SHIP
     C                     ENDIF
     C*
S1   C  N99      D2AIR     IFNE 0                          AIR/BOX
 S2  C           D2DLVR    IFEQ 0                          DELIVERY
     C                     MOVELMSG,5     D#MSG
     C                     SETON                     2399
 X2  C                     ELSE
  S3 C           D2DLMM    IFLT 1                          DELIVERY
     C           D2DLMM    ORGT 12                         DELIVERY
     C                     MOVELMSG,6     D#MSG
     C                     SETON                     2399
  E3 C                     ENDIF
  S3 C  N99      D2DLDD    IFLT 1                          DELIVERY
     C           D2DLDD    ORGT 31                         DELIVERY
     C                     MOVELMSG,6     D#MSG
     C                     SETON                     2399
  E3 C                     ENDIF
 E2  C                     ENDIF
X1   C                     ELSE
 S2  C           D2DLVR    IFNE 0                          DELIVERY
     C                     MOVELMSG,6     D#MSG
     C                     SETON                     2399
 E2  C                     ENDIF
E1   C                     ENDIF
     C*
S1   C           *IN99     IFEQ *OFF
     C           D2DLVR    ANDNE0                          DELIVERY
     C                     Z-ADDD2DLYY    D@DLYY
     C                     Z-ADDD2DLMM    D@DLMM
     C                     Z-ADDD2DLDD    D@DLDD
     C           D@DLVR    IFLT *DATE
     C                     MOVELMSG,6     D#MSG
     C                     SETON                     2399
     C                     ENDIF
E1   C                     ENDIF
     C*
     C*
S1   C           *IN99     IFEQ *OFF
     C           @STEP     ANDEQ'#CHK2U  '
     C                     MOVE '#RESET  '@STEP
X1   C                     ELSE
     C                     MOVE '#DSP2   '@STEP
E1   C                     ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *
      *===============================================================
     C           #RESET    BEGSR
     C*
     C           CHGRRN    CHAINSFREC1               91
     C                     SETOF                     11
     C                     MOVE *BLANK    S1CHG            CHG
     C                     Z-ADDD2SHIP    S1SHIP           SHIP/BOX
     C                     Z-ADDD2AIR     S1AIR            AIR/BOX
     C                     Z-ADDD2DLVR    S1DLVR           DELIVERY
     C  N91                UPDATSFREC1
     C                     Z-ADDCHGRRN    RRN
     C                     MOVE '#DSP1   '@STEP
     C                     ENDSR
      *===============================================================
      *===============================================================
      *<ORDER SHEET>
      *===============================================================
     C           #LIST     BEGSR
     C                     MOVE ' '       @FIRST  1
     C                     MOVEL'1'       *INOF
     C                     Z-ADD0         IHTOTL
 %001C                     Z-ADD0         IHAIRT
 %001C                     Z-ADD0         IHSHPT
     C                     Z-ADD0         IITOTL
 %001C                     Z-ADD0         IIAIRT
 %001C                     Z-ADD0         IISHPT
     C                     EXCPTDT0
     C*--------------------
S1   C                     DO   ENDRRN    RRN1
     C           RRN1      CHAINSFREC1               91
     C   91                LEAVE
     C*
     C           @FIRST    IFEQ ' '
     C                     EXSR #ITEM
     C                     ENDIF
     C                     EXSR #WRT01
     C*
E1   C                     ENDDO
     C*--------------------
      * TOTAL
     C           IHTOTL    IFNE 0
     C           LINE      IFGE 56
     C                     WRITEGDIPR131
     C                     Z-ADD7         LINE
     C                     ENDIF
     C           LINE2     IFGE 56
     C                     WRITEGDIPR141
     C                     Z-ADD7         LINE2
     C                     ENDIF
     C                     WRITEGDIPR133
     C                     WRITEGDIPR143
 %001C                     WRITEGDIPR134
 %001C                     WRITEGDIPR144
     C                     ENDIF
      *
     C                     EXCPTDT9
     C*
S1   C           @@KENS    IFNE 0
     C           'ITEM2 '  CHAINGDGPL30              92
S1   C           *IN92     IFEQ *OFF
     C                     TIME           @@TIME
     C                     Z-ADD*DATE     IFKOHZ
     C                     Z-ADD@TIME     IFKOTM
     C                     MOVEL@@USID    IFKOME
     C                     MOVEL'ITEM2 '  IFKEY
     C                     Z-ADDW1NO      IFNO
     C                     Z-ADD*YEAR     IFYEAR
     C                     UPDATGDGPL301
E1   C                     ENDIF
E1   C                     ENDIF
      *
     C                     MOVE '#END    '@STEP
     C                     ENDSR
      *===============================================================
      *< abmwNO GET >
      *===============================================================
     C           #ITEM     BEGSR
     C*
     C           'ITEM2 '  CHAINGDGPL30              92
     C*
S1   C           *IN92     IFEQ *ON
     C                     TIME           @@TIME
     C                     MOVE *BLANK    IFSKJY
     C                     Z-ADD0         IFSKYY
     C                     Z-ADD0         IFSKMM
     C                     Z-ADD0         IFSKDD
     C                     Z-ADD*DATE     IFKOHZ
     C                     Z-ADD@TIME     IFKOTM
     C                     MOVEL@@USID    IFKOME
     C                     MOVEL'ITEM2 '  IFKEY
     C                     Z-ADD0         IFNO
     C                     Z-ADD0         IFMONT
     C                     Z-ADD*YEAR     IFYEAR
     C                     WRITEGDGPL301
E1   C                     ENDIF
     C*
     C                     Z-ADDIFNO      W1NO    50
S1   C           IFYEAR    IFNE *YEAR
     C                     Z-ADD0         W1NO
     C                     Z-ADD*YEAR     IFYEAR
E1   C                     ENDIF
     C                     MOVE '*'       @FIRST
     C                     ENDSR
      *===============================================================
      *
      *===============================================================
     C           #WRT01    BEGSR
     C*
     C                     TIME           @@TIME
     C                     MOVE *BLANK    IISKJY           DELETE CODE
     C                     Z-ADD0         IISKHZ
     C                     Z-ADD*DATE     IIKOHZ
     C                     Z-ADD@TIME     IIKOTM
     C                     MOVEL@@USID    IIKOME
     C*
     C                     Z-ADDD1ODER    IIODER
     C                     MOVELS1KAT1    IIKAT1
     C                     MOVELS1KAT2    IIKAT2
     C                     MOVELS1KAT3    IIKAT3
     C                     MOVELS1KAT4    IIKAT4
     C                     Z-ADDS1SYOS    IISYOS
     C                     Z-ADDS1SYOS    WWSYOS  70
     C                     Z-ADDW1YEAR    IIODRY
     C                     Z-ADDW1MONT    IIODRM
     C                     Z-ADDW1DAY     IIODRD
     C                     MOVE *BLANK    IIINVO
     C                     Z-ADD0         IISURT
     C                     Z-ADD0         IISIPY
     C                     Z-ADD0         IISIPM
     C                     Z-ADD0         IISIPD
     C                     MOVE *BLANK    IIIFMK
     C                     Z-ADD0         IIIFNY
     C                     Z-ADD0         IIIFNM
     C                     Z-ADD0         IIIFND
     C                     Z-ADD0         IIMJHZ
      *
     C                     ADD  S1MAIS    IHTOTL
     C*--------------------
     C           KEYA1     KLIST
     C                     KFLD           IIKAT1
     C                     KFLD           IIKAT2
     C                     KFLD           IIKAT3
     C                     MOVE *BLANK    $$HAKO  1
     C                     MOVE *BLANK    $$KTRK  1
     C                     MOVE *BLANK    $$KTRT  2
     C                     MOVE *BLANK    $$KTRR  2
     C                     MOVE *BLANK    $$KTRD  1
     C                     Z-ADD0         $$GEKN  92
     C                     Z-ADD0         $$TUSZ  20
     C                     MOVE *BLANK    $$SMEI 15
     C                     MOVE *BLANK    $$TMEI 15
     C                     MOVE *BLANK    $$DMEI 15
      *
     C           KEYA1     SETGTGCQPL12
S1   C                     DO   *HIVAL
     C           KEYA1     REDPEGCQPL12                  95
     C   95                LEAVE
 S2  C           T6SKJY    IFEQ 'D'
     C           T6SKHZ    ANDLE*DATE
     C                     ITER
 E2  C                     ENDIF
 S2  C           *DATE     IFGE T6KIHZ
     C                     MOVE T6SYOT    $$HAKO
     C                     MOVE T6TKR1    $$KTRK
     C                     MOVE T6TKR2    $$KTRT
     C                     MOVE T6TKR3    $$KTRR
     C                     MOVE T6TKR4    $$KTRD
     C                     Z-ADDT6SRYO    $$GEKN
     C                     LEAVE
 E2  C                     ENDIF
E1   C  N11                ENDDO
      *     < AIR >
     C           S1AIR     IFNE 0                          AIR/BOX
     C                     Z-ADDS1AIR     IIMAIS
     C           S1AIR     MULT S1SYOS    IISURY
     C                     Z-ADDS1DLYY    IIDLVY           DELLIVERY DATE YEAR
     C                     Z-ADDS1DLMM    IIDLVM           DELIVERY DATE MONTH
     C                     Z-ADDS1DLDD    IIDLVD           DELIVERY DATE DAY
     C                     MOVE 'A'       IIHANY           CARRY CODE
     C                     MOVEL' AIR'    W1CRY   4
 %001C                     ADD  IIMAIS    IHAIRT           TOTAL AIR
     C                     ADD  1         IIAIRT
     C                     ADD  1         IITOTL
     C                     EXSR #WRT02
     C           S1SURY    SUB  IISURY    S1SURY
     C                     ENDIF
      *     < SHIP >
     C           S1SURY    IFNE 0
     C                     Z-ADDS1SHIP    IIMAIS
     C                     Z-ADDS1SURY    IISURY
     C                     Z-ADD0         IIDLVY           DELLIVERY DATE YEAR
     C                     Z-ADD0         IIDLVM           DELIVERY DATE MONTH
     C                     Z-ADD0         IIDLVD           DELIVERY DATE DAY
     C                     MOVE 'S'       IIHANY           CARRY CODE
     C                     MOVEL'SHIP'    W1CRY
 %001C                     ADD  IIMAIS    IHSHPT           TOTAL SHIP
     C                     ADD  1         IISHPT
     C                     ADD  1         IITOTL
     C                     EXSR #WRT02
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      *
      *===============================================================
     C           #WRT02    BEGSR
     C*
     C                     ADD  1         W1NO
     C           W1NO      IFEQ 0
     C                     Z-ADD1         W1NO
     C                     ENDIF
     C                     Z-ADDW1NO      IIITEM
     C*
     C           LINE      IFGE 56
     C                     WRITEGDIPR131
     C                     Z-ADD7         LINE
     C                     ENDIF
     C           LINE2     IFGE 56
     C                     WRITEGDIPR141
     C                     Z-ADD7         LINE2
     C                     ENDIF
     C*
     C                     WRITEGDIPR132
     C                     WRITEGDIPR142
     C                     ADD  2         LINE
     C                     ADD  1         LINE2
     C*
     C                     WRITEGDIPP151
     C                     EXCPTDT
     C                     EXCPTDTE
     C                     ADD  1         @@KENS
     C*
     C                     ENDSR
      *===============================================================
      *  確認画面表示
      *===============================================================
     C           #CONF     BEGSR
      *
     C                     WRITEW1
     C                     EXFMTDSP09
      *  < F3 >  BACK
     C           *INKC     IFEQ *ON
     C                     MOVE '#DSP1   '@STEP
     C                     ENDIF
      *  < F5 >  OK
     C           *INKE     IFEQ *ON
     C                     MOVE '#LIST   '@STEP
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      *                       < HED >
     OGDIWP13 E                DT0
     O                                    1 'H'
     O                         W1DATE     9
     O                                   10 '1'
      *
      *                       <     >
     O        E                DT
     O                                    1 'D'
     O                         D1ODR0     4
     O                         D1ODER    10
     O                         W1NO      15
     O                         IIKAT1    17
     O                         IIKAT2    21
     O                         IIKAT3    22
     O                         IIKAT4    23
     O                         IISURY    30
     O*
     O                         @@TOKU    34
     O                         @@TKOJ    35
     O                         @@TUKE    39
     O                         @@NONY    43
     O                         @@NKOJ    44
     O                         @@NUKE    48
     O*
     O                                   53 'K'
     O                         $$KTRK    54
     O                         $$KTRT    56
     O                         $$KTRR    58
     O                         $$KTRD    59
     O*
     O                         WWSYOS    66
     O                         $$HAKO    67
     O                         $$GEKN    76
     O*
     O                         IIHANY   124
     O                         IIDLVY   128
     O                         IIDLVM   130
     O                         IIDLVD   132
      *                       <     >
     O        E                DT9
     O                                    1 'T'
     O                         @@KENS     6
      *
      *
      *
     OGDGWPE2 E                DTE
     O                                      'K-'
     O                         W1NO
     O                                      ';'
     O                         IIKAT1
     O                                      '-'
     O                         IIKAT2
     O                                      '-'
     O                         IIKAT3
     O                                      '-'
     O                         IIKAT4
     O                                      ';'
     O                         IISURY1
     O                                      ';'
     O                         IIMAIS3
     O                                      ';'
     O                         IISYOS1
     O                                      ';'
     O                                      '('
     O**                       IHAIR 4
     O                                      ')'
      *
      *===============================================================
**  TBL
IAF     0111     0111100
ATC     0002     0094100
ACZ     0170     0170100
        0000     0000
IAFAYM  0111     0111100
**  MSG
 CHANGE IS '1'
 SELECT CHANGE DATA.
 SELECT ONLY ONE.
 INCORRECT AIR BOX.
 INPUT DELIVERY DATE.
 INCORRECT DELIVERY DATE.
 INPUT 'Y' OR 'N'
