      ** GDIR16 ******************************************************
      *    ORDER FIXED HANDING / REISSUE  OF ORDER SHEET TABLE
      *     K.YASUDA                  2000/03/23
      ************************************************* GDIR16 ********
     H            Y/                                    1
     FGDIPL18 IF  E           K        DISK
     FGDIPR13 O   E             95     PRINTER
     FGDGWPE2 O   F     128            DISK
     I            DS
     I                                        1   80IISKHZ
     I                                        1   40IISKYY
     I                                        5   60IISKMM
     I                                        7   80IISKDD
     I            DS
     I                                        1   8 IIKATA
     I                                        1   2 IIKAT1
     I                                        3   6 IIKAT2
     I                                        7   7 IIKAT3
     I                                        8   8 IIKAT4
     I            DS
     I                                        1   8 IHKATA
     I                                        1   2 IHKAT1
     I                                        3   6 IHKAT2
     I                                        7   7 IHKAT3
     I                                        8   8 IHKAT4
     I            DS
     I                                        1   60IODER
     I                                        1   20IODR1
     I                                        3   40IODR2
     I                                        5   60IODR3
     I            DS
     I                                        1   80IIDLVR
     I                                        1   40IIDLVY
     I                                        5   60IIDLVM
     I                                        7   80IIDLVD
     C* MAIN
     C           *ENTRY    PLIST
     C                     PARM           PODR1   2
     C                     PARM           PODR2   2
     C                     PARM           PODR3   2
     C                     PARM           P@SYS   8
     C*
     C                     MOVELP@SYS     D1ODRX
     C                     MOVELP@SYS     D1ODR0
     C                     MOVELPODR1     IODR1
     C                     MOVELPODR2     IODR2
     C                     MOVELPODR3     IODR3
     C                     TIME           @@TIME  60
     C           IODER     SETLLGDIPL181
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           IODER     READEGDIPL18                  10
     C           *IN10     IFEQ '0'
     C           IISKJY    IFEQ 'D'
     C           IISKHZ    ANDLE*DATE
     C                     ELSE
     C           IIIFMK    IFNE 'C'
     C                     MOVELIODR1     D1ODR1
     C                     MOVELIODR2     D1ODR2
     C                     MOVELIODR3     D1ODR3
     C                     MOVELIIODRY    W1YEAR
     C                     MOVELIIODRM    W1MONT
     C                     MOVELIIODRD    W1DAY
     C                     MOVELIIITEM    W1NO
     C                     MOVEL*BLANK    W1CRY
     C           IIHANY    IFEQ 'A'
     C                     MOVEL'AIR'     W1CRY
     C                     ADD  IIMAIS    IHAIRT
     C                     END
     C           IIHANY    IFEQ 'S'
     C                     MOVEL'SHIP'    W1CRY
     C                     ADD  IIMAIS    IHSHPT
     C                     END
     C*                    MOVELIIKATA    IHKATA
     C*                    MOVELIISURY    IHSURY
     C*                    MOVELIIMAIS    IHMAIS
     C*                    MOVELIISYOS    IHSYOS
     C                     ADD  IIMAIS    IHTOTL
     C*
     C           *IN15     IFEQ '0'
     C           *IN95     OREQ '1'
     C                     SETON                     15
     C                     SETOF                     95
     C                     WRITEGDIPR131
     C                     END
     C                     WRITEGDIPR132
      *
     C                     EXCPTDTE
      *
     C                     END
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C           IHTOTL    IFNE 0
     C                     WRITEGDIPR133
     C                     WRITEGDIPR134
     C                     END
     C                     SETON                     LR
     C                     RETRN
     OGDGWPE2 E                DTE
     O                                      'K-'
     O                         W1NO
     O                                      ';'
     O                         IIKAT1
     O                                      '-'
     O                         IIKAT2
     O                                      '-'
     O                         IIKAT3
     O                                      '-'
     O                         IIKAT4
     O                                      ';'
     O                         IISURY1
     O                                      ';'
     O                         IIMAIS3
     O                                      ';'
     O                         IISYOS1
     O                                      ';'
     O                                      '('
     O**                       IIAIR 4
     O                                      ')'
