     H            Y/                                    1
     FGDIPP15 UP  E           K        DISK
      *
     C                     MOVEL*BLANK    IIINVO
     C                     Z-ADD0         IISURT
     C                     Z-ADD0         IISIPY
     C                     Z-ADD0         IISIPM
     C                     Z-ADD0         IISIPD
     C                     Z-ADD0         IIIFSU
     C                     MOVEL*BLANK    IIIFMK
     C                     Z-ADD0         IIIFNY
     C                     Z-ADD0         IIIFNM
     C                     Z-ADD0         IIIFND
     C                     Z-ADD0         IIMJHZ
      *
     C                     UPDATGDIPP151
