      *** GDIR15 *****************************************************
      *    PRINT OF ORDER TOTAL LIST (DIE)
      *  C:N.HAYAKAWA                     97/10/24
      *
      *  MODIFICATION
      *        TCH   2002/04/23    ADD AIR INFORMATION
      *                            GWIPL10 = OVERRIDDEN TO GDIPL10
      ****************************************************************
     H            Y/                                    1
     FGDIPL10 IP  E           K        DISK
     FGDIPL40 IF  E           K        DISK
     FGDIPL41 IF  E           K        DISK
     F            GDIPP401                          KRENAMEGDI4R
     FGWIPL10 IF  E           K        DISK
     F            GDIPL101                          KRENAMEGDIWR
     FQPRINT  O   F     132     OF     PRINTER
     I****************************************************************
     I            DS
     I                                        1   60@@TIME
     I                                        1   40@TIME
     I            DS
     I                                        1   8 IHKATA
     I                                        1   2 IHKAT1
     I                                        3   6 IHKAT2
     I                                        7   7 IHKAT3
     I                                        8   8 IHKAT4
     I            DS
     I                                        1   8 WWKATA
     I                                        1   2 DIKAT1
     I                                        3   6 DIKAT2
     I                                        7   7 DIKAT3
     I                                        8   8 DIKAT4
      *
     C           IHSKJY    CABNE*BLANK    @END
      *
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C                     TIME           @@TIME
     C                     EXCPTHD
     C                     END
      *
     C                     MOVE *BLANK    WASTR   2
      *
     C* TOTAL LIST PRINTING
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
     C                     ADD  IHMAIS    BOXALL  70
     C                     EXCPTME
      *
     C                     MOVE *OFF      *IN91
     C           K#GDX     SETLLGDIPL40
     C           *IN90     DOUEQ*ON
     C           K#GDX     READEGDIPL40                  90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDDIASDT    @@ASDT  40
     C                     Z-ADDDIORDT    @@ORDT  40
     C      OF             EXCPTHD
     C                     EXCPT@AIR
     C                     MOVE *ON       *IN91
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN91     IFEQ *OFF
     C                     EXCPT@SKP
     C                     ENDIF
      *
     C           @END      TAG
     C*
     CLR                   EXSR #LR
     C**LR                   EXCPTTO
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *------------------------------------------------------
     C           K#GDI     KLIST
     C                     KFLD           W@DAT   80
     C                     KFLD           IHKAT1
     C                     KFLD           IHKAT2
     C                     KFLD           IHKAT3
     C                     KFLD           IHKAT4
     C           K#GDX     KLIST
     C                     KFLD           IHKAT1
     C                     KFLD           IHKAT2
     C********             KFLD           IHKAT3
     C*********            KFLD           IHKAT4
      *
     C                     Z-ADD*DATE     W@DAT
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #LR       BEGSR
      *------------------------------------------------------
      * NOT SCANNED
     C           *LOVAL    SETLLGDIPL41
     C           *IN91     DOUEQ*ON
     C                     READ GDIPL41                  91
     C           *IN91     IFEQ *OFF
     C           WWKATA    CHAINGWIPL10              95
     C           *IN95     IFEQ *ON
     C           DIORDT    IFGT *DATE
     C                     LEAVE
     C                     ENDIF
      *
     C   OF                EXCPTHD
     C                     Z-ADDDIASDT    @@ASDT  40
     C                     Z-ADDDIORDT    @@ORDT  40
     C                     EXCPT@NOD
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     EXCPTTO
      *
     C                     ENDSR
      *------------------------------------------------------
     OQPRINT  E  102           HD
     O                                  131 '+-------------------+'
     O        E  1             HD
     O                                  131 '|         |         |'
     O        E  1             HD
     O                                   89 'TIME'
     O                         @@TIME    98 '  .  .  '
     O                                  131 '|         |         |'
     O        E  2             HD
     O                                   12 'GDIR15-1 '
     O                                   54 '**  KANBAN INPUT DATA'
     O                                   68 'TOTAL LIST **'
     O                                   75 '(DIE)'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        E  2             HD
     O                                   35 'DIE  NO.'
     O                                   52 'AMD QTY'
     O                                   63 'BOX'
     O                                   77 'QTY.'
     O                                   86 'AIR QTY'
     O                                   94 'ASJ DUE'
     O                                  103 'IAF ORDR'
     O        E  0             ME
     O                         WASTR     23
     O                         IHKAT1    26
     O                                   27 '-'
     O                         IHKAT2    31
     O                                   32 '-'
     O                         IHKAT3    33
     O                                   34 '-'
     O                         IHKAT4    35
     O                         IHSYOS2   52
     O                         IHMAIS2   63
     O                         IHSURY2   77
     O        E 01             @AIR
     O                         DIOQTY4   86
     O                         @@ASDT    93 '  /  '
     O                         @@ORDT   101 '  /  '
     O        E 01             @SKP
     O                                    1 ' '
     O        E  1             @NOD
     O                                   23 '**'
     O                         DIKAT1    26
     O                                   27 '-'
     O                         DIKAT2    31
     O                                   32 '-'
     O                         DIKAT3    33
     O                                   34 '-'
     O                         DIOQTY4   86
     O                         @@ASDT    93 '  /  '
     O                         @@ORDT   101 '  /  '
     O        E 11             TO
     O                                   50 '*** BOX OF TOTAL'
     O                         BOXALL2   63
