      ** GDIR88 ******************************************************
      *   REQUEST OF RE-PRINT ASJ KANBAN DATA (DIE)
      *                                  2004.01.13
      *
      ****************************************************************
     H            Y/                                    1
      *
     FGDGPL30 UF  E           K        DISK                      A
     FGDIWP87 IF  E           K        DISK
      *
     FGDIWP88 O   F     150            DISK
     FGDIPR88 O   E                    PRINTER
      *
      *================================================================
      *================================================================
      *
     I            DS
     I                                        1   80IFKOHZ
     I                                        1   40IFKOYY
     I                                        5   60IFKOMM
     I                                        7   80IFKODD
     I            DS
     I                                        1   60IFKOTM
     I                                        1   20IFKOHH
     I                                        3   40IFKOSS
      *
     I            DS
     I                                        1   80W1DATE
     I                                        1   40W1YEAR
     I                                        5   60W1MONT
     I                                        7   80W1DAY
      *
     I            DS
     I                                        1   60D1ODER
     I                                        1   20D1ODR1
     I                                        3   40D1ODR2
     I                                        5   60D1ODR3
     I                                        4   60D1ODR4
      *
     I            DS
     I                                        1   80G1NOHZ
     I                                        1   40G1NOKY
     I                                        5   60G1NOKM
     I                                        7   80G1NOKD
      *     <<
     I           SDS
     I                                        1  10 @@PGM
     I                                      254 263 @@USID
     I*             '0123456789'          C         DIGITS
     C*===============================================================
     C           *ENTRY    PLIST
     C                     PARM           P@SYS   8
     C*===============================================================
     C*  START  PROGRAM
     C*===============================================================
     C*
     C                     MOVEA*ALL'0'   *IN
     C*
     C                     Z-ADD*DATE     W1DATE
     C                     MOVELP@SYS     D1ODR0  3
     C                     Z-ADD99        D1ODR1
     C                     Z-ADD90        D1ODR2
     C                     Z-ADD0         D1ODR3
     C                     Z-ADD59        LINE    20
     C                     Z-ADD0         @@KENS  50
     C                     TIME           @@TIME
     C*
      *<ORDER SHEET>
     C                     MOVE ' '       @FIRST  1
     C                     MOVEL'1'       *INOF
     C                     Z-ADD0         IHTOTL
     C*
     C                     EXCPTDT0
     C*--------------------
     C*--------------------
S1   C                     DO   *HIVAL
     C                     READ GDIWP87                  91
     C   91                LEAVE
     C*
     C           @FIRST    IFEQ ' '
     C                     EXSR #ITEM
     C                     ENDIF
     C                     EXSR #WRT01
     C*
E1   C                     ENDDO
     C*--------------------
      * TOTAL
     C           IHTOTL    IFNE 0
     C           LINE      IFGE 59
     C                     WRITEGDIPR881
     C                     Z-ADD7         LINE
     C                     ENDIF
     C                     WRITEGDIPR883
     C                     ENDIF
      *
     C                     EXCPTDT9
      *
     C           'ITEMOF'  CHAINGDGPL301             92
S1   C           *IN92     IFEQ *OFF
     C                     Z-ADD*DATE     IFKOHZ
     C                     TIME           IFKOTM
     C                     MOVEL@@USID    IFKOME
     C                     MOVEL'ITEMOF'  IFKEY
     C                     Z-ADDW1NO      IFNO
     C                     Z-ADD*YEAR     IFYEAR
     C                     UPDATGDGPL301
E1   C                     ENDIF
     C*--------------------
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      *< eｰjﾞｰNO & abmwNO GET >
      *===============================================================
     C           #ITEM     BEGSR
     C*
     C*
     C           'OFFLIN'  CHAINGDGPL301             90
S1   C           *IN90     IFEQ *ON
     C                     MOVE *BLANK    IFSKJY
     C                     Z-ADD0         IFSKYY
     C                     Z-ADD0         IFSKMM
     C                     Z-ADD0         IFSKDD
     C                     Z-ADD*DATE     IFKOHZ
     C                     TIME           IFKOTM
     C                     MOVEL@@USID    IFKOME
     C                     MOVEL'OFFLIN'  IFKEY
     C                     Z-ADD1         IFNO
     C                     Z-ADD1         D1ODR4
     C                     Z-ADD0         IFMONT
     C                     Z-ADD*YEAR     IFYEAR
     C                     WRITEGDGPL301
X1   C                     ELSE
     C                     Z-ADD*DATE     IFKOHZ
     C                     TIME           IFKOTM
     C                     MOVEL@@USID    IFKOME
     C           IFNO      ADD  1         D1ODR4
     C           D1ODR3    IFEQ 0
     C                     ADD  1         D1ODR4
     C                     ENDIF
     C                     Z-ADDD1ODR4    IFNO
     C                     Z-ADD*YEAR     IFYEAR
     C                     UPDATGDGPL301
E1   C                     ENDIF
     C*
     C*
     C           'ITEMOF'  CHAINGDGPL301             92
S1   C           *IN92     IFEQ *ON
     C                     MOVE *BLANK    IFSKJY
     C                     Z-ADD0         IFSKYY
     C                     Z-ADD0         IFSKMM
     C                     Z-ADD0         IFSKDD
     C                     Z-ADD*DATE     IFKOHZ
     C                     TIME           IFKOTM
     C                     MOVEL@@USID    IFKOME
     C                     MOVEL'ITEMOF'  IFKEY
     C                     Z-ADD0         IFNO
     C                     Z-ADD0         IFMONT
     C                     Z-ADD*YEAR     IFYEAR
     C                     WRITEGDGPL301
E1   C                     ENDIF
     C*
     C                     Z-ADDIFNO      W1NO    50
S1   C           IFYEAR    IFNE *YEAR
     C                     Z-ADD0         W1NO
     C                     Z-ADD*YEAR     IFYEAR
E1   C                     ENDIF
     C                     MOVE '*'       @FIRST
     C                     ENDSR
      *===============================================================
      *
      *===============================================================
     C           #WRT01    BEGSR
     C*
     C*
     C                     MOVEL'SHIP'    W1CRY
     C*
     C                     ADD  1         W1NO
     C           W1NO      IFEQ 0
     C                     Z-ADD1         W1NO
     C                     ENDIF
     C*
     C           LINE      IFGE 59
     C                     WRITEGDIPR881
     C                     Z-ADD7         LINE
     C                     ENDIF
     C*
     C                     WRITEGDIPR882
     C                     ADD  2         LINE
     C*
     C                     EXCPTDT
     C                     ADD  1         @@KENS
     C*
     C                     ENDSR
      *===============================================================
      *                       < HED >
     OGDIWP88 E                DT0
     O                                    1 'H'
     O                         W1DATE     9
     O                                   10 'X'
      *
      *                       <     >
     O        E                DT
     O                                    1 'D'
     O                         D1ODR0     4
     O                         D1ODER    10
     O                         W1NO      15
     O                         G1KAT1    17
     O                         G1KAT2    21
     O                         G1KAT3    22
     O                         G1KAT4    23
     O                         G1JCHU    30
     O*
     O                         G1TOKU    34
     O                         G1TKOJ    35
     O                         G1TUKE    39
     O                         G1NONY    43
     O                         G1NKOJ    44
     O                         G1NUKE    48
     O*
     O                                   53 'K'
     O                         G1ITK1    54
     O                         G1ITK2    56
     O                         G1ITK3    58
     O                         G1ITK4    59
     O*
     O                         G1ISYS    66
     O                         G1IHAK    67
     O                         G1GEKN    76
     O*
     O                         G1HANY   124
     O                         G1NOKY   128
     O                         G1NOKM   130
     O                         G1NOKD   132
     O*
      *                       <     >
     O        E                DT9
     O                                    1 'T'
     O                         @@KENS     6
      *
      *
      *===============================================================
