     H            Y.                                    1
      ** GDIR26 **********************
      *  IMPORT ORDER UPDATE SYSTEM  *
      *        K.YASUDA  2000.12.07  *
      * %0001  A.MAMIYA  2001.05.31  *
      ********************** GDIR26 **
     FGDIPW26 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN1  KSFILE SFREC1
     F*
     FGDIPL18 IF  E           K        DISK
     FGDIPL16 UF  E           K        DISK
     FGDIWP23 O   F     128            DISK
      *================================================================
     E                    ER      1  18 61
      *================================================================
     IINFDS       DS
     I                                    B 378 3790$$RRN
     I            DS
     I                                        1   60D1ODR
     I                                        1   20D1ODR1
     I                                        3   40D1ODR2
     I                                        5   60D1ODR3
     I            DS
     I                                        1  11 S1KATA
     I                                        1   2 S1KAT1
     I                                        3   3 S1HF1
     I                                        4   7 S1KAT2
     I                                        8   8 S1HF2
     I                                        9   9 S1KAT3
     I                                       10  10 S1HF3
     I                                       11  11 S1KAT4
     I            DS
     I                                        1  12 D3ODR
     I                                        1   3 D3ODR0
     I                                        5   60D3ODR1
     I                                        8   90D3ODR2
     I                                       11  120D3ODR3
      ******************************************
     I            DS
     I                                        1   80IISKHZ
     I                                        1   40IISKYY
     I                                        5   60IISKMM
     I                                        7   80IISKDD
     I            DS
     I                                        1   80IIKOHZ
     I                                        1   40IIKOYY
     I                                        5   60IIKOMM
     I                                        7   80IIKODD
     I            DS
     I                                        1   60IIKOTI
     I                                        1   20IIKOHH
     I                                        3   40IIKOSS
     I            DS
     I                                        1   80IIODHZ
     I                                        1   40IIODRY
     I                                        5   60IIODRM
     I                                        7   80IIODRD
     I            DS
     I                                        1   80IISPHZ
     I                                        1   40IISIPY
     I                                        5   60IISIPM
     I                                        7   80IISIPD
     I            DS
     I                                        1   80IIIFHZ
     I                                        1   40IIIFNY
     I                                        5   60IIIFNM
     I                                        7   80IIIFND
     I            DS
     I                                        1   80IIDLHZ
     I                                        1   40IIDLVY
     I                                        5   60IIDLVM
     I                                        7   80IIDLVD
      *     <<
     I           SDS
     I                                        1  10 @@PGM
     I                                      254 263 @@USID
     C*===============================================================
     C*  START  PROGRAM
     C*===============================================================
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C           @STEP     CASEQ'#CHK1   '#CHK1
     C           @STEP     CASEQ'#SFSET  '#SFSET
     C           @STEP     CASEQ'#DSP2   '#DSP2
     C           @STEP     CASEQ'#CHK2   '#CHK2
     C           @STEP     CASEQ'#CHG    '#CHG
     C           @STEP     CASEQ'#DSP3   '#DSP3
     C           @STEP     CASEQ'#CHK3   '#CHK3
     C           @STEP     CASEQ'#CHK3U  '#CHK3
     C           @STEP     CASEQ'#UPDAT  '#UPDAT
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C*   << INIT >>
     C*===============================================================
     C           #INIT     BEGSR
     C                     MOVEA*ALL'0'   *IN
     C                     MOVE 'IAF'     D1ODR0
     C                     Z-ADD0         D1ODR1
     C                     Z-ADD0         D1ODR2
     C                     Z-ADD0         D1ODR3
     C                     MOVE *BLANK    D1KAT1
     C                     MOVE *BLANK    D1KAT2
     C                     MOVE *BLANK    D1KAT3
     C                     MOVE *BLANK    D1KAT4
     C                     MOVE *BLANK    D1MSG
     C                     MOVE '#DSP1   '@STEP
     C*
     C                     ENDSR
      *===============================================================
      *  画面１　表示
      *===============================================================
     C           #DSP1     BEGSR
     C*
     C                     EXFMTDSP01
     C                     SETOF                     020399
     C                     MOVE *BLANK    D1MSG
     C*
     C                     MOVE '#CHK1   '@STEP
     C*  < F1 >  EXIT
     C           *INKA     IFEQ *ON
     C                     MOVE '#END    '@STEP
     C                     ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *  画面１　チェック
      *===============================================================
     C           #CHK1     BEGSR
     C           D1ODR     IFEQ 0
     C                     SETON                     0299
     C                     MOVELER,1      D1MSG
     C                     ENDIF
     C*
S1   C           *IN99     IFEQ *OFF
     C                     MOVE '#SFSET  '@STEP
X1   C                     ELSE
     C                     MOVE '#DSP1   '@STEP
E1   C                     ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *
      *===============================================================
     C           #SFSET    BEGSR
     C           KEY01     KLIST
     C                     KFLD           D1ODR
     C           KEY01A    KLIST
     C                     KFLD           D1ODR
     C                     KFLD           IIODRY
     C                     KFLD           IIODRM
     C                     KFLD           IIODRD
     C                     KFLD           D1KAT1
     C                     KFLD           D1KAT2
     C                     KFLD           D1KAT3
     C                     KFLD           D1KAT4
     C                     SETON                     83    SFLCLR
     C                     WRITESFCTL
     C                     SETOF                     8311
     C                     Z-ADD0         RRN1    40
     C*
     C           KEY01     SETLLGDIPL18
     C           KEY01     READEGDIPL18                  90
     C  N90      KEY01A    SETLLGDIPL18
     C*--------------------
S1   C  N90                DO   *HIVAL
     C           D1ODR     READEGDIPL18                  90
     C   90                LEAVE
 S2  C           IISKJY    IFEQ 'D'
     C           IISKHZ    ANDLE*DATE                                  )
     C                     ITER
 E2  C                     ENDIF
     C*
 S2  C           IIIFMK    IFEQ 'C'
     C                     ITER
 E2  C                     ENDIF
     C*
     C                     MOVE *BLANK    S1CHG
     C                     MOVE *BLANK    S1KATA           DIE NO.
     C                     MOVE IIKAT1    S1KAT1           DIE NO1
     C                     MOVE IIKAT2    S1KAT2           DIE NO2
     C                     MOVE IIKAT3    S1KAT3           DIE NO3
     C                     MOVE IIKAT4    S1KAT4           DIE NO3
     C                     MOVE '-'       S1HF1
     C                     MOVE '-'       S1HF2
     C                     MOVE '-'       S1HF3
     C           S1KAT4    IFEQ *BLANK
     C                     MOVE ' '       S1HF3
     C           S1KAT3    IFEQ *BLANK
     C                     MOVE ' '       S1HF2
     C           S1KAT2    IFEQ *BLANK
     C                     MOVE ' '       S1HF1
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     Z-ADDIIITEM    S1ITEM           ITEM NO
     C           IIHANY    IFEQ 'A'
     C                     MOVE ' AIR'    S1CARY           CARRY
     C                     ELSE
     C                     MOVE 'SHIP'    S1CARY           CARRY
     C                     ENDIF
     C                     Z-ADDIIDLHZ    S1DLVR           DELIVERY
     C                     Z-ADDIISURY    S1SURY           QTY
     C                     Z-ADDIISYOS    S1SYOS           QTY/BOX
     C                     Z-ADDIIMAIS    S1MAIS           BOX
     C                     MOVE *BLANK    S1INVO           INVOICE
     C           IIINVO    IFNE *BLANK
     C                     MOVE '*'       S1INVO           INVOICE
     C                     ENDIF
     C                     ADD  1         RRN1
     C                     WRITESFREC1
E1   C                     ENDDO
     C*--------------------
     C           RRN1      IFEQ 0
     C                     SETON                     99
     C                     MOVELER,2      D1MSG
     C                     MOVE '#DSP1   '@STEP
     C                     ELSE
     C                     Z-ADDRRN1      ENDRRN  40
     C                     Z-ADD1         RRN
     C                     MOVE '#DSP2   '@STEP
E1   C                     ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *  画面２　表示
      *===============================================================
     C           #DSP2     BEGSR
     C*
     C                     WRITEDSP02
     C                     SETON                     8182
     C                     EXFMTSFCTL
     C                     SETOF                     818299
     C                     MOVE *BLANK    D2MSG
     C                     Z-ADD$$RRN     TOPRRN  40
     C*
     C                     MOVE '#CHK2   '@STEP
     C*  < F3 >  PRV SCREEN
     C           *INKC     IFEQ *ON
     C                     MOVE '#DSP1   '@STEP
     C                     ENDIF
     C*  < F5 >  INPUT OK
     C*          *INKE     IFEQ *ON
     C*                    MOVE '#CHK2   '@STEP
     C*                    ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *===============================================================
     C           #CHK2     BEGSR
     C*
     C                     Z-ADD0         @SEL    40
     C                     Z-ADD0         ERRRRN  40
     C                     Z-ADD0         CHGRRN  40
     C*--------------------
S1   C                     DO   ENDRRN    RRN1
     C           RRN1      CHAINSFREC1               91
     C   91                LEAVE
     C                     SETOF                     11
     C*
 S2  C           S1CHG     IFNE *BLANK                     CHG
     C           S1CHG     ANDNE'0'                        CHG
     C           S1CHG     ANDNE'1'                        CHG
     C                     MOVELER,3      D2MSG
     C                     SETON                     1199
     C                     Z-ADDRRN1      ERRRRN
 E2  C                     ENDIF
     C*
 S2  C           S1CHG     IFEQ '0'                        CHG
  2  C           S1CHG     OREQ '1'                        CHG
  S3 C           @SEL      IFEQ 0
     C                     Z-ADDRRN1      CHGRRN
  X3 C                     ELSE
     C                     SETON                     11
  S4 C           ERRRRN    IFEQ 0
     C                     Z-ADDRRN1      ERRRRN
  E4 C                     ENDIF
  E3 C                     ENDIF
     C                     ADD  1         @SEL
 E2  C                     ENDIF
     C*
     C                     UPDATSFREC1
E1   C  N99                ENDDO
     C*--------------------
     C           @SEL      IFEQ 0
     C                     MOVELER,4      D2MSG
     C                     SETON                     99
     C                     ELSE
     C           @SEL      IFNE 1
     C                     MOVELER,5      D2MSG
     C                     SETON                     99
     C                     ENDIF
     C                     ENDIF
     C*
S1   C           *IN99     IFEQ *OFF
     C                     MOVE '#CHG    '@STEP
X1   C                     ELSE
 S2  C           ERRRRN    IFNE 0
     C                     Z-ADDERRRRN    RRN
 X2  C                     ELSE
     C                     Z-ADDTOPRRN    RRN
 E2  C                     ENDIF
     C                     MOVE '#DSP2   '@STEP
E1   C                     ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *
      *===============================================================
     C           #CHG      BEGSR
     C*
     C           KEY02     KLIST
     C                     KFLD           D1ODR
     C                     KFLD           S1ITEM           ITEM NO
     C*
     C                     SETOF                     202122
     C                     SETOF                     2324
     C           CHGRRN    CHAINSFREC1               91
     C           KEY02     CHAINGDIPL16             N92
     C*
S1   C           *IN92     IFEQ *ON
     C                     MOVELER,6      D2MSG
     C                     SETON                     99
X1   C                     ELSE
     C*
 S2  C           IISKJY    IFEQ 'D'
     C           IISKHZ    ANDLE*DATE                                  )
     C                     MOVELER,6      D2MSG
     C                     SETON                     99
 E2  C                     ENDIF
     C*
 S2  C  N99      IIIFMK    IFEQ 'C'
     C                     SETON                     1199
     C                     MOVELER,6      D2MSG
 E2  C                     ENDIF
 S2  C  N99      IIIFMK    IFEQ '*'
     C                     SETON                     1199
     C                     MOVELER,11     D2MSG
 E2  C                     ENDIF
E1   C                     ENDIF
     C*
     C           *IN99     IFEQ *ON
     C  N91                UPDATSFREC1
     C                     Z-ADDCHGRRN    RRN
     C                     MOVE '#DSP2   '@STEP
     C                     ELSE
     C           S1CHG     COMP '0'                      20:DELET
     C                     MOVE S1CHG     D3CHG
     C   20                MOVE ' DELETE 'D3UPDT
     C   20                MOVE '0'       D3UPCD  1
     C  N20                MOVE ' CHANGE 'D3UPDT
     C  N20                MOVE '1'       D3UPCD
     C                     MOVELS1KATA    D3KATA           PART NO.
     C                     MOVE *ALL'-'   D3ODR
     C                     MOVE D1ODR0    D3ODR0
     C                     Z-ADDD1ODR1    D3ODR1
     C                     Z-ADDD1ODR2    D3ODR2
     C                     Z-ADDD1ODR3    D3ODR3
     C                     Z-ADDIIITEM    D3ITEM           ITEM NO
     C                     Z-ADDIISYOS    D3SYOS           QTY/BOX
     C                     Z-ADDIIMAIS    D3MAIS           BOX
     C                     Z-ADDIISURY    D3SURY           QTY
     C                     MOVE IIHANY    D3HANY
     C                     Z-ADDIIDLVY    D3DLVY           DELIVERY
     C                     Z-ADDIIDLVM    D3DLVM           DELIVERY
     C                     Z-ADDIIDLVD    D3DLVD           DELIVERY
     C                     MOVE *ALL'-'   D3LINE
     C                     MOVE IIINVO    D3INVO           INVOICE
     C                     Z-ADDIIODHZ    D3ODHZ
     C                     Z-ADDIISURY    D3ODSU
     C                     Z-ADDIISPHZ    D3SIHZ
     C                     Z-ADDIISURT    D3SURT
     C                     Z-ADDIIIFHZ    D3IFHZ
     C                     Z-ADDIIIFSU    D3IFSU
     C                     MOVE *BLANK    D3MSG
     C                     MOVE '#DSP3   '@STEP
     C                     ENDIF
     C                     ENDSR
      *===============================================================
      *  画面３　表示
      *===============================================================
     C           #DSP3     BEGSR
     C*
     C                     EXFMTDSP03
     C                     SETOF                     212223
     C                     SETOF                     24  99
     C                     MOVE *BLANK    D3MSG
     C*
     C                     MOVE '#CHK3   '@STEP
     C*  < F3 >  GO BACK
     C           *INKC     IFEQ *ON
     C                     Z-ADDCHGRRN    RRN
     C                     MOVE '#DSP2   '@STEP
     C                     ENDIF
     C*  < F5 >  UPDAT
     C           *INKE     IFEQ *ON
     C                     MOVE '#CHK3U  '@STEP
     C                     ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *
      *===============================================================
     C           #CHK3     BEGSR
      *-----------*
      * Q'TY/BOX  *
      *-----------*
     C           D3SYOS    IFEQ 0
     C                     SETON                     2199
     C                     MOVELER,7      D3MSG
     C                     END
      *----------*
      * BOX Q'TY *
      *----------*
     C  N99      D3MAIS    IFEQ 0
     C                     SETON                     2299
     C                     MOVELER,8      D3MSG
     C                     ENDIF
      *
     C           D3SYOS    MULT D3MAIS    D3SURY
      *
     C           D3INVO    IFNE *BLANK                     INVOICE
     C           D3SURY    ANDLTIISURY
     C                     SETON                     212299
     C                     MOVELER,13     D3MSG
     C                     ENDIF
      *----------*
     C  N99      D3HANY    IFNE 'S'
     C           D3HANY    ANDNE'A'
     C                     SETON                     2399
     C                     MOVELER,13     D3MSG
     C                     ENDIF
      *----------*
     C           D3HANY    IFEQ 'S'
     C           D3DLVY    IFEQ 0                          DELIVERY
     C           D3DLVM    ANDEQ0                          DELIVERY
     C           D3DLVD    ANDEQ0                          DELIVERY
     C                     ELSE
     C                     SETON                     2499
     C                     MOVELER,13     D3MSG
     C                     ENDIF
     C                     ENDIF
      *----------*
     C           D3HANY    IFEQ 'A'
     C*********  D3DLVY                                    DELIVERY
     C           D3DLVM    IFLT 1                          DELIVERY
     C           D3DLVM    ORGT 12                         DELIVERY
     C                     SETON                     2499
     C                     MOVELER,13     D3MSG
     C                     ENDIF
     C           D3DLVD    IFLT 1                          DELIVERY
     C           D3DLVD    ORGT 31                         DELIVERY
     C                     SETON                     2499
     C                     MOVELER,13     D3MSG
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN99     IFEQ *OFF
     C           @STEP     ANDEQ'#CHK3U  '
     C                     MOVE '#UPDAT  '@STEP
     C                     ELSE
     C                     MOVE '#DSP3   '@STEP
     C                     ENDIF
     C                     ENDSR
      *===============================================================
      *
      *===============================================================
     C           #UPDAT    BEGSR
     C                     EXCPTDT
      *--------*
      * UPDATE *
      *--------*
     C           KEY02     CHAINGDIPL16              92
     C                     MOVE *BLANK    IISKJY
     C                     Z-ADD0         IISKHZ
     C                     Z-ADD*DATE     IIKOHZ
     C                     TIME           IIKOTI
     C                     MOVEL@@USID    IIKOME
      *
     C           S1CHG     IFEQ '0'                        :DELET
     C                     MOVE 'C'       IIIFMK
     C                     ENDIF
      *
     C           S1CHG     IFEQ '1'                        :UPDATE
     C                     Z-ADDD3SYOS    IISYOS
     C                     Z-ADDD3MAIS    IIMAIS
     C           IIMAIS    MULT IISYOS    IISURY
     C                     MOVE *BLANK    IIIFMK
>>>> C           IIIFSU    IFGE IISURY
     C                     MOVE '*'       IIIFMK
     C                     ENDIF
     C                     MOVE D3HANY    IIHANY
     C                     Z-ADDD3DLVY    IIDLVY           DELIVERY
     C                     Z-ADDD3DLVM    IIDLVM           DELIVERY
     C                     Z-ADDD3DLVD    IIDLVD           DELIVERY
     C                     ENDIF
      *
     C  N92                UPDATGDIPL161
     C                     SETON                     U1
     C                     MOVE '#SFSET  '@STEP
      *
     C                     ENDSR
      *===============================================================
      *===============================================================
      *-------------*
      * OUTPUT FILE *
      *-------------*
     OGDIWP23 E                DT
     O                         D3UPDT
     O                         D3ODR1
     O                         D3ODR2
     O                         D3ODR3
     O                                      'K'
     O                         IIITEM
     O                         S1KAT1
     O                         S1KAT2
     O                         S1KAT3
     O                         S1KAT4
     O                         IISYOS
     O                         IIMAIS
     O                         IISURY
** MSG
E-01 INPUT ORDER NUMBER.
E-02 THIS DATA IS NOT IN THE DAYLY ORDER DATA FILE.
E-03 INPUT  '0' OR '1'
E-04 SELECT CHANGE DATA.
E-05 SELECT ONLY ONE.
E-06 THIS DATA ALREADY HAS BEEN CANCELLED.
E-07 INPUT Q'TY PAR BOX.
E-08 INPUT BOX Q'TY.
E-09 INPUT PART NUMBER.
E-10 PART NUMBER ERROR.
E-11 THE DATA IS ALREADY COMPLETED.
E-12 THIS ITEM NO. HAS BEEN ALREADY USED.
E-13 INPUT DATA IS NOT CORRECT.
E-14 THIS ORDER NO. HAS BEEN ALREADY USED.
E-15 ORDER NO. MORE THAN 50 IS AVAILABLE FOR ORDER ADDITION.
E-16 ITEM NO. MORE THAN 90001 IS AVAILABE FOR ITEM ADDITION.
E-17 NOT INPUT ORDER NO. OF ADDITIONAL ORDER.
E-18 NOT INPUT ITEM NO. OF ADDITIONAL ORDER.
