     H            Y/                                    1
     FGDIWP99 IP  F     256            DISK
     FGDIPL16 UF  E           K        DISK
     IGDIWP99 AA  01
     I                                       32  370IODER
     I                                       38  420IITEM
     I                                       43  44 IKAT1
     I                                       45  48 IKAT2
     I                                       49  49 IKAT3
     I                                       50  50 IKAT4
     I            DS
     I                                        1   8 IIKATA
     I                                        1   2 IIKAT1
     I                                        3   6 IIKAT2
     I                                        7   7 IIKAT3
     I                                        8   8 IIKAT4
     C           KEY1      KLIST
     C                     KFLD           IODER
     C                     KFLD           IITEM
     C*
     C                     SETOF                     10
     C           KEY1      CHAINGDIPL161             10
     C           *IN10     IFEQ '0'
     C           IIKATA    IFEQ *BLANK
     C                     MOVE IKAT1     IIKAT1
     C                     MOVE IKAT2     IIKAT2
     C                     MOVE IKAT3     IIKAT3
     C                     MOVE IKAT4     IIKAT4
     C                     UPDATGDIPL161
     C                     END
     C                     END
