      *** GDJR30 *************************************
      *        ACCUMULATED INVENTORY DATA CREAT      *
      *  G.B.C                         97/05/27      *
      ************************************************
     H            Y/                                    1
     FGDJPP01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     C           HINKEY    KLIST
     C                     KFLD           IMHIN1
     C                     KFLD           IMHIN2
     C                     KFLD           IMHIN3
     C                     Z-ADD0         OUTCNT  50
     C                     DO   *HIVAL
     C                     READ GDJPP011                 90
     C           *IN90     IFEQ '0'
     C           HINKEY    CHAINFCEPL011             91
     C           *IN91     IFEQ '0'
     C                     EXCPTDET
     C                     ADD  1         OUTCNT
     C                     END
     C           OUTCNT    IFGE 100
     C                     SETON                     90
     C                     END
     C                     END
     C  N90                END
     C                     SETON                     LR
     C                     RETRN
     OQPRINT  E 1              DET
     O                         IMHIN1    10
     O                         IMHIN2  +  1
     O                         IMHIN3  +  1
     O                         A2ZETI  +  1
