      *** GDJR05 *************************************
      *        INVENTORY UNIT PRICE M/F CREAT (DIE)  *
      *  G.B.C                         97/11/05      *
      ************************************************
     H            Y/                                    1
     FGDKPL01 IF  E           K        DISK
     FRATPL01 IF  E           K        DISK
     FGDJPP01 UF  E           K        DISK                      A
     I            DS
     I                                        1  12 IMHIN
     I                                        1   5 IMHIN1
     I                                        6  10 IMHIN2
     I                                       11  12 IMHIN3
     I            DS
     I                                        1   80WUYMD
     I                                        1   40WUYY
     I                                        5   60WUMM
      *
     C           KEY1      KLIST
     C                     KFLD           WUYY
     C                     KFLD           WUMM
     C                     KFLD           WCOD
      *
     C                     Z-ADD*DATE     WUYMD
     C                     MOVE 'USD'     WCOD    3
      *
     C                     SETOF                     20
     C                     Z-ADD0         WRATE  105
     C           KEY1      CHAINRATPL011             20
     C           *IN20     IFEQ '0'
     C           RASKJY    ANDEQ'D'
     C           RASKHZ    ANDLE*DATE
     C                     SETON                     20
     C                     END
     C           *IN20     IFEQ '0'
     C                     Z-ADDRARATE    WRATE
     C                     END
      *
     C                     DO   *HIVAL
     C                     READ GDKPL011                 90
     C           *IN90     IFEQ '0'
     C           ISSKJY    IFEQ *BLANK
     C           ISTYPE    IFEQ 'E'                        DIE
     C                     EXSR #DIE
     C                     END
     C                     END
     C                     END
     C  N90                END
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C*
     C*
     C           #DIE      BEGSR
     C                     MOVELISHIN     IMHIN
     C           IMKEY     KLIST
     C                     KFLD           IMHIN1
     C                     KFLD           IMHIN2
     C                     KFLD           IMHIN3
     C           IMKEY     CHAINGDJPP011             10
     C           *IN10     IFEQ '1'
     C                     MOVELISHIN     IMHIN
     C                     Z-ADD0         IMZAI
     C                     MOVE *BLANK    IMKO01
     C                     MOVE *BLANK    IMKO02
     C                     MOVE *BLANK    IMKO03
     C                     MOVE *BLANK    IMKO04
     C                     MOVE *BLANK    IMKO05
     C                     MOVE *BLANK    IMKO06
     C                     MOVE *BLANK    IMKO07
     C                     MOVE *BLANK    IMKO08
     C                     MOVE *BLANK    IMKO09
     C                     MOVE *BLANK    IMKO10
     C                     Z-ADD0         IMTA01
     C                     Z-ADD0         IMTA02
     C                     Z-ADD0         IMTA03
     C                     Z-ADD0         IMTA04
     C                     Z-ADD0         IMTA05
     C                     Z-ADD0         IMTA06
     C                     Z-ADD0         IMTA07
     C                     Z-ADD0         IMTA08
     C                     Z-ADD0         IMTA09
     C                     Z-ADD0         IMTA10
     C                     Z-ADD0         IMATST
     C                     Z-ADD0         IMTENT
     C                     Z-ADD0         IMNEST
     C                     Z-ADD0         IMHYOT
     C                     Z-ADD0         IMKNRT
     C                     Z-ADD0         IMKOST
     C                     Z-ADD0         IMKANT
     C                     Z-ADD0         IMAPIC
     C                     MOVE ISVEND    IMTOKU
     C                     END
     C           ISTKP1    MULT WRATE     IMKANT
     C   10                WRITEGDJPP011
     C  N10                UPDATGDJPP011
     C                     ENDSR
