      *** GDJR01 *************************************
      *        INVENTORY UNIT PRICE M/F CREAT        *
      *  G.B.C                         97/05/27      *
      ************************************************
     H            Y/                                    1
     FGBFTL53 IF  E           K        DISK
     FGDJPP10 IF  E           K        DISK
     FGDJPP01 O   E                    DISK
     E****************************************************************
     E** ﾌ]ﾌﾞbj]f vlyﾒgt] M/F **
     E                    KKO        10  3               ﾃcmb
     E                    GEN        10  6 4             iﾞ]f
     E** joeﾜﾆj]f M/F **
     E                    KO         10  3               ﾃcmb
     E                    TA         10  7 5             j]f
     E** ﾝｰh **
     E                    W@KKO      10  3               ﾃcmb
     E                    W@GEN      10  6 5             iﾞ]f
     I****************************************************************
     I* ﾆｫobﾍ]ﾌﾞ] BREAK ﾌ]jﾞ]ﾑc *
     I            DS
     I                                        1  12 W@SHN
     I                                        1   5 W@SHN1
     I                                        6  10 W@SHN2
     I                                       11  12 W@SHN3
     I* ﾆｫobﾍ]ﾌﾞ] ﾝｰh *
     I            DS
     I                                        1  12 W@HIN
     I                                        1   5 W@HIN1
     I                                        6  10 W@HIN2
     I                                       11  12 W@HIN3
     I* ﾌ]ﾌﾞbj]f vlyﾒgt] ﾎｦbﾓ *
     I* ﾃcmb *
     I            DS
     I                                        1  30 KKO
     I                                        1   3 G9KKO1
     I                                        4   6 G9KKO2
     I                                        7   9 G9KKO3
     I                                       10  12 G9KKO4
     I                                       13  15 G9KKO5
     I                                       16  18 G9KKO6
     I                                       19  21 G9KKO7
     I                                       22  24 G9KKO8
     I                                       25  27 G9KKO9
     I                                       28  30 G9KO10
     I* iﾞ]f *
     I            DS
     I                                        1  604GEN
     I                                        1   64G9GEN1
     I                                        7  124G9GEN2
     I                                       13  184G9GEN3
     I                                       19  244G9GEN4
     I                                       25  304G9GEN5
     I                                       31  364G9GEN6
     I                                       37  424G9GEN7
     I                                       43  484G9GEN8
     I                                       49  544G9GEN9
     I                                       55  604G9GN10
     I* joeﾜﾆ j]f uﾇjｰ *
     I* ﾃcmb *
     I            DS
     I                                        1  30 KO
     I                                        1   3 IMKO01
     I                                        4   6 IMKO02
     I                                        7   9 IMKO03
     I                                       10  12 IMKO04
     I                                       13  15 IMKO05
     I                                       16  18 IMKO06
     I                                       19  21 IMKO07
     I                                       22  24 IMKO08
     I                                       25  27 IMKO09
     I                                       28  30 IMKO10
     I* j]f *
     I            DS
     I                                        1  705TA
     I                                        1   75IMTA01
     I                                        8  145IMTA02
     I                                       15  215IMTA03
     I                                       22  285IMTA04
     I                                       29  355IMTA05
     I                                       36  425IMTA06
     I                                       43  495IMTA07
     I                                       50  565IMTA08
     I                                       57  635IMTA09
     I                                       64  705IMTA10
     C****************************************************************
     C*           MAIN ROUTINE             *
     C****************************************************************
     C                     EXSR #INIT
     C**
     C                     DO   *HIVAL
     C                     READ GBFTL531                 90
     C   90                LEAVE
     C* ﾍ]ﾌﾞ] ﾃﾞcﾈb *
     C                     MOVELG9SHN1    W@SHN1  5
     C                     MOVELG9SHN2    W@SHN2  5
     C                     MOVELG9SHN3    W@SHN3  2
     C* 1i]x *
     C           *IN40     IFEQ *ON
     C                     MOVELW@SHN     W@SHN# 12
     C                     EXSR #WKCLR
     C                     SETOF                     40
     C                     ENDIF
     C*
     C           W@SHN     IFNE W@SHN#
     C                     EXSR #FILE
     C                     EXSR #WKCLR
     C                     MOVELW@SHN     W@SHN#
     C                     ENDIF
     C*
     C           W@HIN     IFEQ *BLANK
     C           G9TOKU    OREQ 0541                       (TOYOTA)
     C           G9TOKU    OREQ 3347                       (TOYOTA)
     C           G9TOKU    OREQ 3503                       (TOYOTA)
     C           G9TOKU    OREQ 3411                       (TOYOTA)
     C                     MOVELW@SHN     W@HIN
     C                     Z-ADDG9ZAIH    W@ZAIH  75
     C                     MOVEAKKO       W@KKO
     C                     MOVEAGEN       W@GEN
     C                     Z-ADDG9TOKU    W@TOKU  40
     C                     ENDIF
     C*
     C                     ENDDO
     C**
     C           *IN40     CASEQ*OFF      #FILE
     C                     END
     C*
     C                     SETON                     LR
     C                     RETRN
     C****************************************************************
     C*          #INIT                                     *
     C****************************************************************
     C           #INIT     BEGSR                                     *
     C                     MOVEA*BLANK    KKO
     C                     MOVEA*BLANK    W@KKO
     C                     MOVEA*BLANK    KO
     C                     MOVEA*ZERO     GEN
     C                     MOVEA*ZERO     W@GEN
     C                     MOVEA*ZERO     TA
     C*
     C                     SETON                     40    1i]x
     C                     ENDSR
     C****************************************************************
     C*          #FILE                   *
     C****************************************************************
     C           #FILE     BEGSR                                     *
     C                     CLEARGDJPP011
     C**
     C                     MOVELW@HIN1    IMHIN1           ﾍ]ﾌﾞ]1
     C                     MOVELW@HIN2    IMHIN2           ﾍ]ﾌﾞ]2
     C                     MOVELW@HIN3    IMHIN3           ﾍ]ﾌﾞ]3
     C                     Z-ADDW@ZAIH    IMZAI            ﾅﾞbﾒｭcﾍ
     C                     MOVEAW@KKO     KO               ﾃcmb
     C                     DO   10        I
     C                     Z-ADDW@GEN,I   TA,I             j]f
     C                     ENDDO
     C                     Z-ADDW@TOKU    IMTOKU           nhbﾅg
     C**
     C                     DO   10        I       30
     C                     MOVELKO,I      INKOTE           ﾃcmb
     C           INKOTE    CHAINGDJPP101             91
     C           *IN91     IFEQ *ON
     C                     ITER
     C                     ENDIF
     C* j]f ﾓbib *
     C                     Z-ADDIMZAI     W@TAN   75       + ﾅﾞbﾒｭcﾍ
     C                     DO   I         J       30
     C           INKEIS    MULT TA,J      WWTAN   75H
     C                     ADD  WWTAN     W@TAN
     C                     ENDDO
     C*
     C                     SELEC
     C           INKKBN    WHEQ '1'
     C                     Z-ADDW@TAN     IMATST           alﾞc j]f
     C           INKKBN    WHEQ '2'
     C                     Z-ADDW@TAN     IMTENT           m]ﾞc j]f
     C           INKKBN    WHEQ '3'
     C                     Z-ADDW@TAN     IMNEST           rlﾆｭﾒ j]f
     C           INKKBN    WHEQ '4'
     C                     Z-ADDW@TAN     IMHYOT           ﾍｭcx]fﾃc j]f
     C           INKKBN    WHEQ '5'
     C                     Z-ADDW@TAN     IMKNRT           f]ﾒ ﾎﾞy] j]f
     C           INKKBN    WHEQ '6'
     C                     Z-ADDW@TAN     IMKOST           ﾃcﾈbﾍ]   j]f
     C           INKKBN    WHEQ '7'
     C                     Z-ADDW@TAN     IMKANT           fofﾞj    j]f
     C           INKKBN    WHEQ '8'
     C                     Z-ADDW@TAN     IMAPIC           A-PICSf] j]f
     C                     ENDSL
     C                     ENDDO
     C**
     C           IMATST    IFNE 0
     C                     Z-ADDIMATST    IMAPIC
     C                     END
     C           IMTENT    IFNE 0
     C                     Z-ADDIMTENT    IMAPIC
     C                     END
     C           IMNEST    IFNE 0
     C                     Z-ADDIMNEST    IMAPIC
     C                     END
     C           IMHYOT    IFNE 0
     C                     Z-ADDIMHYOT    IMAPIC
     C                     END
     C                     WRITEGDJPP011
     C                     ENDSR
     C****************************************************************
     C*          #WKCLR                    *
     C****************************************************************
     C           #WKCLR    BEGSR
     C                     MOVEL*BLANK    W@HIN            ﾍ]ﾌﾞ]
     C                     Z-ADD*ZERO     W@ZAIH  75       ﾅﾞbﾒｭcﾍ
     C                     MOVEA*BLANK    W@KKO            ﾃcmb
     C                     MOVEA*ZERO     W@GEN            iﾞ]f
     C                     Z-ADD*ZERO     W@TOKU  40       nhbﾅg
     C                     ENDSR
