      *** GDJR31 *************************************
      *        ACCUMULATED INVENTORY DATA CREAT (DIE)*
      *  G.B.C                         97/11/06      *
      ************************************************
     H            Y/                                    1
     FGDJPP23 IF  E           K        DISK
     FGDJPP26 O   E           K        DISK
     I****************************************************************
     I* DTAARA (GDJD01) *
     IGDJD01     UDS
     I                                        1   80W@TNDT
     I                                        1   20W@TNMM
     I                                        3   40W@TNDD
     I                                        5   80W@TNYY
     C****************************************************************
     C*           MAIN ROUTINE                                       *
     C****************************************************************
     C                     DO   *HIVAL
     C                     READ GDJPP231                 90
     C   90                LEAVE
     C*
     C                     Z-ADDW@TNYY    IRYYM
     C                     Z-ADDW@TNMM    IRMM
     C                     Z-ADDW@TNDD    IRDD
     C                     Z-ADDIPBUMN    IRBUMN
     C                     MOVE IPKKBN    IRKKBN
     C                     MOVE IPHIN1    IRHIN1
     C                     MOVE IPHIN2    IRHIN2
     C                     MOVE IPHIN3    IRHIN3
     C                     Z-ADDIPHAKO    IRHAKO
     C                     Z-ADDIPSYUY    IRSYUY
     C                     Z-ADDIPSRY     IRSRY
     C                     Z-ADDIPTANK    IRTANK
     C                     Z-ADDIPKIN     IRKIN
     C                     WRITEGDJPP261
     C*
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
