      *** GDJR08 *************************************
      *        INVENTORY DATA CONVERSION FROM PC     *
      *  G.B.C                         97/05/27      *
      ************************************************
     H            Y/                                    1
     FGDJWP15 IP  F      30            DISK
     FGDJPP15 IF  E           K        DISK                      A
     I****************************************************************
     IGDJWP15 NS  01
     I                                        1   1 @@KIKIL1
     I                                        2   2 @@KKBN
     I                                        3  19 @@BAR
     I                                       20  220@@MAIS
     C****************************************************************
     C*           KLIST                            *
     C****************************************************************
     C           INKEY     KLIST
     C                     KFLD           @@KIKI
     C                     KFLD           SEQNO
     C*           MAIN ROUTINE                                       *
     C****************************************************************
     C   L1                Z-ADD0         SEQNO   50
     C   L1                EXSR #SEQ
     C  N01                GOTO END
     C           ##1       TAG
     C                     ADD  1         SEQNO
     C           INKEY     SETLLGDJPP151                 20
     C           *IN20     CABEQ'1'       ##1
     C                     MOVE @@KIKI    IOKIKI           READER NO.
     C                     Z-ADDSEQNO     IOSEQ            SEQ NO.
     C                     MOVE @@KKBN    IOKKBN           PROCESS CLASS
     C                     MOVE @@BAR     IOBAR            BAR CODE
     C                     Z-ADD@@MAIS    IOMAIS           BOXES
     C                     WRITEGDJPP151
     C           END       TAG
     C*
     C*
     C*
     C           #SEQ      BEGSR
     C           @@KIKI    SETGTGDJPP151             91
     C  N91      @@KIKI    REDPEGDJPP151                 90
     C  N91N90             Z-ADDIOSEQ     SEQNO
     C                     ENDSR
