      *** GDJR12 *************************************
      *        KANBAN MASTER READ  SUB PROGRAM       *
      *  G.B.C                         97/05/27      *
      ************************************************
     H            Y/                                    1
     FFCETL11 IF  E           K        DISK
     FABHTL01 IF  E           K        DISK
     FAAFTL01 IF  E           K        DISK
     FADHTL01 IF  E           K        DISK
     FAAHTL01 IF  E           K        DISK
     FAAPTL01 IF  E           K        DISK
     FAANPL06 IF  E           K        DISK
     FAKBPL04 IF  E           K        DISK
     FAKGTL04 IF  E           K        DISK
     FAKITL04 IF  E           K        DISK
     FAKCPL02 IF  E           K        DISK
     FGCQPL12 IF  E           K        DISK
     E                    AK          4  3
     I            DS
     I                                        1  12 AK
     I                                        1   3 M6AKT1
     I                                        4   6 M6AKT2
     I                                        7   9 M6AKT3
     I                                       10  12 M6AKT4
     I***DLT 971128                          13  15 M6AKT5
     I            DS
     I                                        1  12 WWHIN
     I                                        1   5 WWHIN1
     I                                        6  10 WWHIN2
     I                                       11  12 WWHIN3
     I            DS
     I                                        1  12 PPHIN
     I                                        1   5 PPHIN1
     I                                        6  10 PPHIN2
     I                                       11  12 PPHIN3
     I            DS
     I                                        1   80IFSKHZ
     I                                        1   40IFSKYY
     I                                        5   60IFSKMM
     I                                        7   80IFSKDD
     I            DS
     I                                        1   80L7SKHZ
     I                                        1   40L7SKYY
     I                                        5   60L7SKMM
     I                                        7   80L7SKDD
     I            DS
     I                                        1   80L7STHZ
     I                                        1   40L7STYY
     I                                        5   60L7STMM
     I                                        7   80L7STDD
     I            DS
     I                                        1   80L7UKHZ
     I                                        1   40L7UKYY
     I                                        5   60L7UKMM
     I                                        7   80L7UKDD
     I            DS
     I                                        1   8 $$KATA
     I                                        1   2 $$KAT1
     I                                        3   6 $$KAT2
     I                                        7   7 $$KAT3
     I                                        8   8 $$KAT4
      *
     C****************************************************************
     C*           PLIST                                              *
     C****************************************************************
     C           *ENTRY    PLIST
     C* IN
     C                     PARM           @@KKBN  1        PROCESS CODE
     C                     PARM           @@KAN   1        KANBAN KBN
     C                     PARM           @@IDNO  4        ID NUMBER
     C                     PARM           @@SEIH  1        SEIHIN KBN
     C                     PARM           @@KATA  8        KATA NO.
     C                     PARM           @@KOTE  3        KOTE NO.
     C                     PARM           @@HIN  12        HINBAN
     C* OUT
     C                     PARM           @@SYOY  70       QUANTITY IN BOX
     C                     PARM           @@PART 12        PARTS NO.
     C                     PARM           @@DEP   40       DEPARTMENT
     C                     PARM           @@ERR   10       ERROR
      *** ADD 11/13 A.IDOTA ***
     C                     PARM           @@LOT   30       LOT
      *** ADD 11/13 A.IDOTA ***
      *
     C           HINKEY    KLIST
     C                     KFLD           PPHIN1
     C                     KFLD           PPHIN2
     C                     KFLD           PPHIN3
      *
     C           HINKY2    KLIST
     C                     KFLD           PPKOJY
     C                     KFLD           PPHIN1
     C                     KFLD           PPHIN2
     C                     KFLD           PPHIN3
     C                     Z-ADD0111      PPKOJY  40
      *
      *
     C                     Z-ADD0         @@SYOY
     C                     MOVE *BLANK    @@PART
     C                     Z-ADD0         @@ERR
      *** ADD 11/13 A.IDOTA ***
     C                     Z-ADD0         @@LOT
      *** ADD 11/13 A.IDOTA ***
      *
     C           @@KKBN    CASEQ'1'       #ATSU            ATSUZO
     C           @@KKBN    CASEQ'2'       #TENZ            TENZO
     C           @@KKBN    CASEQ'3'       #NETSU           NETSU SYORI
     C           @@KKBN    CASEQ'4'       #HYO             HYOMEN SYORI
     C           @@KKBN    CASEQ'5'       #INP             INPORT
     C           @@KKBN    CASEQ'6'       #KOSE            KOSEIHIN
     C           @@KKBN    CASEQ'7'       #KANA            KANAGATA
     C           @@KKBN    CASEQ'8'       #APIC            A-PICS
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
     C*
     C*ATSUZAO
     C*
     C           #ATSU     BEGSR
      *
     C                     MOVE *BLANK    PPHIN
     C                     EXSR #FCE
      *
     C           HINKY2    SETLLABHTL011                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           #ATSU1    TAG
     C           HINKY2    READEABHTL011                 10
     C           *IN10     IFEQ '0'
     C           M6SKJY    IFEQ 'D'
     C           M6SKHZ    IFLE *DATE
     C                     GOTO #ATSU1
     C                     END
     C                     END
     C           M6UKHZ    IFGT *DATE
     C                     GOTO #ATSU1
     C                     END
     C           M6STHZ    IFLT *DATE
     C                     GOTO #ATSU1
     C                     END
     C*
     C*                    MOVE *BLANK    M6AKT   3
     C*                    Z-ADD1         A       20
     C*          1         DO   5         A
     C*          M6AKT     IFEQ *BLANK
     C*                    MOVE AK,A      M6AKT
     C*                    END
     C*                    END
     C*
     C*          M6AKT     CABNE@@KOTE    #ATSU1
     C*
     C                     SETOF                     77
     C           @@KOTE    LOKUPAK                       77
     C           *IN77     IFEQ '0'
     C                     GOTO #ATSU1
     C                     END
      *
     C                     Z-ADDM6SYUY    @@SYOY
     C                     MOVE M6HIN1    WWHIN1
     C                     MOVE M6HIN2    WWHIN2
     C                     MOVE M6HIN3    WWHIN3
     C                     MOVE WWHIN     @@PART
     C                     Z-ADDM6BMON    @@DEP
     C                     Z-ADD0         @@ERR
      *** ADD 11/13 A.IDOTA ***
     C           M6HSYU    IFEQ 'G'
     C                     Z-ADDM6LOTK    @@LOT
     C                     END
      *** ADD 11/13 A.IDOTA ***
     C                     MOVEA'1'       *IN,90
     C                     MOVEA'1'       *IN,10
     C                     END
     C  N10                END
      *
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         @@ERR
     C                     END
      *
     C                     ENDSR
     C*
     C*TENZO
     C*
     C           #TENZ     BEGSR
      *
     C                     MOVE *BLANK    PPHIN
     C                     EXSR #FCE
     C*
     C           HINKY2    SETLLABHTL011                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           #TEN1     TAG
     C           HINKY2    READEABHTL011                 10
     C           *IN10     IFEQ '0'
     C           M6SKJY    IFEQ 'D'
     C           M6SKHZ    IFLE *DATE
     C                     GOTO #TEN1
     C                     END
     C                     END
     C           M6UKHZ    IFGT *DATE
     C                     GOTO #TEN1
     C                     END
     C           M6STHZ    IFLT *DATE
     C                     GOTO #TEN1
     C                     END
     C*
     C*                    MOVE *BLANK    M6AKT   3
     C*                    Z-ADD1         A       20
     C*          1         DO   5         A
     C*          M6AKT     IFEQ *BLANK
     C*                    MOVE AK,A      M6AKT
     C*                    END
     C*                    END
     C*
     C*          M6AKT     CABNE@@KOTE    #TEN1
     C*
     C                     SETOF                     77
     C           @@KOTE    LOKUPAK                       77
     C           *IN77     IFEQ '0'
     C                     GOTO #TEN1
     C                     END
      *
     C                     Z-ADDM6SYUY    @@SYOY
     C                     MOVE M6HIN1    WWHIN1
     C                     MOVE M6HIN2    WWHIN2
     C                     MOVE M6HIN3    WWHIN3
     C                     MOVE WWHIN     @@PART
     C                     Z-ADDM6BMON    @@DEP
     C                     Z-ADD0         @@ERR
      *** ADD 11/13 A.IDOTA ***
     C           M6HSYU    IFEQ 'G'
     C                     Z-ADDM6LOTK    @@LOT
     C                     END
      *** ADD 11/13 A.IDOTA ***
     C                     MOVEA'1'       *IN,90
     C                     MOVEA'1'       *IN,10
     C                     END
     C  N10                END
      *
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         @@ERR
     C                     END
      *
     C                     ENDSR
     C*
     C*NETSUSYORI
     C*
     C           #NETSU    BEGSR
      *
     C                     MOVE *BLANK    PPHIN
     C                     EXSR #FCE                       CHG RO PARTS
      *
     C           HINKEY    SETLLADHTL011                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           #NETS1    TAG
     C           HINKEY    READEADHTL011                 10
     C           *IN10     IFEQ '0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    IFLE *DATE
     C                     GOTO #NETS1
     C                     END
     C                     END
     C           J6UKHZ    IFGT *DATE
     C                     GOTO #NETS1
     C                     END
     C           J6STHZ    IFLT *DATE
     C                     GOTO #NETS1
     C                     END
     C                     Z-ADDJ6SYOS    @@SYOY
     C                     MOVE J6SHN1    WWHIN1
     C                     MOVE J6SHN2    WWHIN2
     C                     MOVE J6SHN3    WWHIN3
     C                     MOVE WWHIN     @@PART
     C                     Z-ADDJ6MAKB    @@DEP
     C                     Z-ADD0         @@ERR
     C                     MOVEA'1'       *IN,90
     C                     MOVEA'1'       *IN,10
     C                     END
     C  N10                END
      *
     C           *IN90     IFEQ '0'
     C                     EXSR #TENZ
     C                     END
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         @@ERR
     C                     END
      *
     C                     ENDSR
     C*
     C*HYOMEN
     C*
     C           #HYO      BEGSR
      *
     C                     MOVE *BLANK    PPHIN
     C                     EXSR #FCE
      *
     C           HINKEY    SETLLAAFTL011                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           #HYO1     TAG
     C           HINKEY    READEAAFTL011                 10
     C           *IN10     IFEQ '0'
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    IFLE *DATE
     C                     GOTO #HYO1
     C                     END
     C                     END
     C           A3UKHZ    IFGT *DATE
     C                     GOTO #HYO1
     C                     END
     C           A3STHZ    IFLT *DATE
     C                     GOTO #HYO1
     C                     END
     C                     Z-ADDA3SSYS    @@SYOY
     C                     MOVE A31HB5    WWHIN1
     C                     MOVE A32HB5    WWHIN2
     C                     MOVE A33HB2    WWHIN3
     C                     MOVE WWHIN     @@PART
     C                     Z-ADDA3MAKB    @@DEP
     C                     Z-ADD0         @@ERR
     C                     MOVEA'1'       *IN,90
     C                     MOVEA'1'       *IN,10
     C                     GOTO HYOEND
     C                     END
     C  N10                END
      *
     C                     Z-ADD1         @@ERR
      *
     C           HINKEY    SETLLAAHTL011                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           #HYO2     TAG
     C           HINKEY    READEAAHTL011                 10
     C           *IN10     IFEQ '0'
     C           L6SKJY    IFEQ 'D'
     C           L6SKHZ    IFLE *DATE
     C                     GOTO #HYO2
     C                     END
     C                     END
     C           L6UKHZ    IFGT *DATE
     C                     GOTO #HYO2
     C                     END
     C           L6STHZ    IFLT *DATE
     C                     GOTO #HYO2
     C                     END
     C                     Z-ADDL6SYOS    @@SYOY
     C                     MOVE L6SHN1    WWHIN1
     C                     MOVE L6SHN2    WWHIN2
     C                     MOVE L6SHN3    WWHIN3
     C                     MOVE WWHIN     @@PART
     C                     Z-ADDL6MAKB    @@DEP
     C                     Z-ADD0         @@ERR
     C                     MOVEA'1'       *IN,90
     C                     MOVEA'1'       *IN,10
     C                     END
     C  N10                END
      *
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         @@ERR
     C                     END
      *
     C           HYOEND    ENDSR
     C*
     C* b]tﾟｰn
     C*
     C           #INP      BEGSR
      *
     C                     MOVE *BLANK    PPHIN
     C                     EXSR #FCE
      *
     C           @@SEIH    IFEQ '0'
     C           HINKEY    SETLLAAPTL011                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           #INP1     TAG
     C           HINKEY    READEAAPTL011                 10
     C           *IN10     IFEQ '0'
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    IFLE *DATE
     C                     GOTO #INP1
     C                     END
     C                     END
     C           L5UKHZ    IFGT *DATE
     C                     GOTO #INP1
     C                     END
     C           L5STHZ    IFLT *DATE
     C                     GOTO #INP1
     C                     END
     C                     MOVELL5SHN1    WWHIN1
     C                     MOVELL5SHN2    WWHIN2
     C                     MOVELL5SHN3    WWHIN3
     C                     MOVELWWHIN     @@PART
     C                     Z-ADDL5BMON    @@DEP
     C                     Z-ADDL5SYOS    @@SYOY
     C                     Z-ADD0         @@ERR
     C                     MOVEA'1'       *IN,90
     C                     MOVEA'1'       *IN,10
     C                     END
     C  N10                END
      *
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         @@ERR
     C                     END
     C                     END
      *
      *
      *
     C           @@SEIH    IFEQ '6'
     C           HINKEY    SETLLAANPL061                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           #INP3     TAG
     C           HINKEY    READEAANPL061                 10
     C           *IN10     IFEQ '0'
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    IFLE *DATE
     C                     GOTO #INP3
     C                     END
     C                     END
     C           L7UKHZ    IFGT *DATE
     C                     GOTO #INP3
     C                     END
     C           L7STHZ    IFLT *DATE
     C                     GOTO #INP3
     C                     END
     C                     MOVELL7SHN1    WWHIN1
     C                     MOVELL7SHN2    WWHIN2
     C                     MOVELL7SHN3    WWHIN3
     C                     MOVELWWHIN     @@PART
     C                     Z-ADDL7BMON    @@DEP
     C                     Z-ADDL7SYOS    @@SYOY
     C                     Z-ADD0         @@ERR
     C                     MOVEA'1'       *IN,90
     C                     MOVEA'1'       *IN,10
     C                     END
     C  N10                END
      *
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         @@ERR
     C                     END
     C                     END
      *
      * KOUSEIHIN
      *
     C           @@SEIH    IFEQ '3'
     C                     EXSR #KOSE
     C                     END
      *
     C                     ENDSR
     C*
     C*KOUSEIHIN
     C*
     C           #KOSE     BEGSR
      *
     C                     MOVE *BLANK    PPHIN
     C                     EXSR #AKC
      *
     C           HINKEY    SETLLAKBPL041                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           #KOS1     TAG
     C           HINKEY    READEAKBPL041                 10
     C           *IN10     IFEQ '0'
     C           L1SKJY    IFEQ 'D'
     C           L1SKHZ    IFLE *DATE
     C                     GOTO #KOS1
     C                     END
     C                     END
     C           L1UKHZ    IFGT *DATE
     C                     GOTO #KOS1
     C                     END
     C           L1STHZ    IFLT *DATE
     C                     GOTO #KOS1
     C                     END
     C                     MOVELL1SHN1    WWHIN1
     C                     MOVELL1SHN2    WWHIN2
     C                     MOVELL1SHN3    WWHIN3
     C                     MOVELWWHIN     @@PART
     C                     Z-ADDL1BMON    @@DEP
     C                     Z-ADDL1SYOS    @@SYOY
     C                     Z-ADD0         @@ERR
     C                     MOVEA'1'       *IN,90
     C                     MOVEA'1'       *IN,10
     C                     GOTO KOSEND
     C                     END
     C  N10                END
      *
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         @@ERR
     C                     END
      *
      *
      *
     C           HINKEY    SETLLAKGTL041                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           #KOS2     TAG
     C           HINKEY    READEAKGTL041                 10
     C           *IN10     IFEQ '0'
     C           E1SKJY    IFEQ 'D'
     C           E1SKHZ    IFLE *DATE
     C                     GOTO #KOS2
     C                     END
     C                     END
     C           E1UKHZ    IFGT *DATE
     C                     GOTO #KOS2
     C                     END
     C           E1STHZ    IFLT *DATE
     C                     GOTO #KOS2
     C                     END
     C                     MOVELE1SHN1    WWHIN1
     C                     MOVELE1SHN2    WWHIN2
     C                     MOVELE1SHN3    WWHIN3
     C                     MOVELWWHIN     @@PART
     C                     Z-ADDE1ATOB    @@DEP
     C                     Z-ADDE1SSYS    @@SYOY
     C                     Z-ADD0         @@ERR
     C                     MOVEA'1'       *IN,90
     C                     MOVEA'1'       *IN,10
     C                     GOTO KOSEND
     C                     END
     C  N10                END
      *
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         @@ERR
     C                     END
      *
      *
      *
     C           HINKEY    SETLLAKITL041                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           #KOS3     TAG
     C           HINKEY    READEAKITL041                 10
     C           *IN10     IFEQ '0'
     C           E2SKJY    IFEQ 'D'
     C           E2SKHZ    IFLE *DATE
     C                     GOTO #KOS3
     C                     END
     C                     END
     C           E2UKHZ    IFGT *DATE
     C                     GOTO #KOS3
     C                     END
     C           E2STHZ    IFLT *DATE
     C                     GOTO #KOS3
     C                     END
     C                     MOVELE2SHN1    WWHIN1
     C                     MOVELE2SHN2    WWHIN2
     C                     MOVELE2SHN3    WWHIN3
     C                     MOVELWWHIN     @@PART
     C                     Z-ADDE2BMON    @@DEP
     C                     Z-ADDE2SYOS    @@SYOY
     C                     Z-ADD0         @@ERR
     C                     MOVEA'1'       *IN,90
     C                     MOVEA'1'       *IN,10
     C                     END
     C  N10                END
      *
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         @@ERR
     C                     END
      *
     C           KOSEND    ENDSR
     C*
     C*DIE
     C*
     C           #KANA     BEGSR
      *
     C           KEYA1     KLIST
     C                     KFLD           $$KAT1
     C                     KFLD           $$KAT2
     C                     KFLD           $$KAT3
      *
     C                     MOVEL@@KATA    $$KATA
     C                     MOVE *BLANK    $$KAT3
     C                     MOVE *BLANK    $$KAT4
      *
     C           KEYA1     SETGTGCQPL121
     C                     DO   *HIVAL
     C                     SETOF                     1090
     C           KEYA1     REDPEGCQPL121                 10
     C           *IN10     IFEQ '0'
     C           T6SKJY    IFEQ 'D'
     C           T6SKHZ    ANDLE*DATE
     C                     ELSE
     C           *DATE     IFGE T6KIHZ
     C                     SETON                     1090
     C                     MOVEL@@KATA    @@PART
     C                     Z-ADDT6SYOS    @@SYOY
     C                     Z-ADD0         @@DEP
     C                     Z-ADD0         @@ERR
     C                     END
     C                     END
     C                     END
     C  N10                END
      *
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         @@ERR
     C                     END
      *
     C                     ENDSR
     C*
     C* A-PICS
     C*
     C           #APIC     BEGSR
      *
     C                     MOVE *BLANK    PPHIN
     C                     EXSR #FCE
      *
     C           HINKEY    SETLLAAFTL011                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           #APIC1    TAG
     C           HINKEY    READEAAFTL011                 10
     C           *IN10     IFEQ '0'
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    IFLE *DATE
     C                     GOTO #APIC1
     C                     END
     C                     END
     C           A3UKHZ    IFGT *DATE
     C                     GOTO #APIC1
     C                     END
     C           A3STHZ    IFLT *DATE
     C                     GOTO #APIC1
     C                     END
     C                     Z-ADDA3SSYS    @@SYOY
     C                     MOVE A31HB5    WWHIN1
     C                     MOVE A32HB5    WWHIN2
     C                     MOVE A33HB2    WWHIN3
     C                     MOVE WWHIN     @@PART
     C                     Z-ADDA3MAKB    @@DEP
     C                     Z-ADD0         @@ERR
     C                     MOVEA'1'       *IN,90
     C                     MOVEA'1'       *IN,10
     C                     GOTO APCEND
     C                     END
     C  N10                END
      *
     C                     Z-ADD1         @@ERR
      *
     C           HINKY2    SETLLABHTL011                 10
     C                     MOVEA'0'       *IN,90
     C                     DO   *HIVAL
     C           #APIC2    TAG
     C           HINKY2    READEABHTL011                 10
     C           *IN10     IFEQ '0'
     C           M6SKJY    IFEQ 'D'
     C           M6SKHZ    IFLE *DATE
     C                     GOTO #APIC2
     C                     END
     C                     END
     C           M6UKHZ    IFGT *DATE
     C                     GOTO #APIC2
     C                     END
     C           M6STHZ    IFLT *DATE
     C                     GOTO #APIC2
     C                     END
     C                     Z-ADDM6SYUY    @@SYOY
     C                     MOVE M6HIN1    WWHIN1
     C                     MOVE M6HIN2    WWHIN2
     C                     MOVE M6HIN3    WWHIN3
     C                     MOVE WWHIN     @@PART
     C                     Z-ADDM6BMON    @@DEP
     C                     Z-ADD0         @@ERR
      *** ADD 11/13 A.IDOTA ***
     C           M6HSYU    IFEQ 'G'
     C                     Z-ADDM6LOTK    @@LOT
     C                     END
      *** ADD 11/13 A.IDOTA ***
     C                     MOVEA'1'       *IN,90
     C                     MOVEA'1'       *IN,10
     C                     END
     C  N10                END
      *
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         @@ERR
     C                     END
      *
     C           APCEND    ENDSR
      *
      *
     C*****************************************************************
     C*  ID NUMBER --> PARTS NO.                                      *
     C*****************************************************************
     C           #FCE      BEGSR
      *
     C           @@HIN     IFNE *BLANK
     C                     MOVE @@HIN     PPHIN
     C                     GOTO FCEEND
     C                     END
      *
     C           @@IDNO    CHAINFCETL111             10
     C   10                MOVE *BLANK    PPHIN
     C  N10                MOVELA2BHB1    PPHIN1
     C  N10                MOVELA2BHB2    PPHIN2
     C  N10                MOVELA2BHB3    PPHIN3
      *
     C           FCEEND    ENDSR
      *
      *
     C*****************************************************************
     C*  ID NUMBER --> PARTS NO.                                      *
     C*****************************************************************
     C           #AKC      BEGSR
      *
     C           @@HIN     IFNE *BLANK
     C                     MOVE @@HIN     PPHIN
     C                     GOTO AKCEND
     C                     END
      *
     C           @@IDNO    CHAINAKCPL021             10
     C   10                MOVE *BLANK    PPHIN
     C  N10                MOVELM1KHN1    PPHIN1
     C  N10                MOVELM1KHN2    PPHIN2
     C  N10                MOVELM1KHN3    PPHIN3
      *
     C           AKCEND    ENDSR
