      *** GDJR30 *************************************
      *        ACCUMULATED INVENTORY DATA CREAT      *
      *  G.B.C                         97/05/27      *
      ************************************************
     H            Y/                                    1
     FGDJPP24 IF  E           K        DISK
     FGDJPP25 O   E           K        DISK
     I****************************************************************
     I* DTAARA (GDJD01) *
     IGDJD01     UDS
     I                                        1   80W@TNDT
     I                                        1   20W@TNMM
     I                                        3   40W@TNDD
     I                                        5   80W@TNYY
     C****************************************************************
     C*           MAIN ROUTINE                                       *
     C****************************************************************
     C                     DO   *HIVAL
     C                     READ GDJPP241                 90
     C   90                LEAVE
     C*
     C                     Z-ADDW@TNYY    IQYYM
     C                     Z-ADDW@TNMM    IQMM
     C                     Z-ADDW@TNDD    IQDD
     C                     Z-ADDIPBUMN    IQBUMN
     C                     MOVE IPKKBN    IQKKBN
     C                     MOVE IPHIN1    IQHIN1
     C                     MOVE IPHIN2    IQHIN2
     C                     MOVE IPHIN3    IQHIN3
     C                     Z-ADDIPHAKO    IQHAKO
     C                     Z-ADDIPSYUY    IQSYUY
     C                     Z-ADDIPSRY     IQSRY
     C                     Z-ADDIPTANK    IQTANK
     C                     Z-ADDIPKIN     IQKIN
     C                     WRITEGDJPP251
     C*
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
