      *** GDKR14 *************************************
      *        UNIT PRICE MASTER REFERENCE           *
      *  G.B.C                                       *
      *                              2000/11/01      *
      ************************************************
     H            Y/                                    1
     F*
     FGDKPW14 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL01
     F                                        RRN2  KSFILE SFL02
     F                                              KINFDS INFWS
     F*
      *        DETAIL CODE MANAGEMENT RECORD .LAYOUT ..LOGICAL FILE .. *
     FFGBPL01 IF  E           K        DISK
      *
      * INPORT GOODS UNIT PRICE MASTER     *
     FGDKPL03 IF  E           K        DISK
     FGDKPL01 IF  E           K        DISK
     F*
     E*================================================================
     E                    PT      1   9  1   PTN    30
     E                    MSG     1   9 59
     I*================================================================
     IINFWS       DS
     I                                    B 370 3710@CORSR
     I                                    B 378 3790@TOPRN
     I            DS
     I                                        1   60W@TIME
     I                                        1   40W@HM
     I            DS
     I                                        1  20 D1HIN
     I                                        1   5 D1HIN1
     I                                        6  10 D1HIN2
     I                                       11  12 D1HIN3
     I                                        1   2 D1KAT1
     I                                        3   6 D1KAT2
     I                                        7   7 D1KAT3
     I                                        8   8 D1KAT4
     I                                       13  20 D1HINX
     I                                        9  20 D1HINY
     I            DS
     I                                        1  14 WWHIN
     I                                        1   5 WWHIN1
     I                                        6   6 WWH1
     I                                        7  11 WWHIN2
     I                                       12  12 WWH2
     I                                       13  14 WWHIN3
     I            DS
     I                                        1  14 WWKATA
     I                                        1   2 WWKAT1
     I                                        3   3 WWKA1
     I                                        4   7 WWKAT2
     I                                        8   8 WWKA2
     I                                        9   9 WWKAT3
     I                                       10  10 WWKA3
     I                                       11  11 WWKAT4
     I*  SAKUJYO
     I            DS
     I                                        1   80ISSKDT
     I                                        1   40ISSKYY
     I                                        5   60ISSKMM
     I                                        7   80ISSKDD
     I*  KOUSINN
     I            DS
     I                                        1   80ISKODT
     I                                        1   40ISKOYY
     I                                        5   60ISKOMM
     I                                        7   80ISKODD
     I*
     I            DS
     I                                        1   40ISKOHS
     I                                        1   20ISKOHH
     I                                        3   40ISKOSS
     I* STARTING DATE *
     I            DS
     I                                        1   80S1STDT
     I                                        1   40S1STYY
     I                                        5   60S1STMM
     I                                        7   80S1STDD
     I* ENDING DATE *
     I            DS
     I                                        1   80S1ENDT
     I                                        1   40S1ENYY
     I                                        5   60S1ENMM
     I                                        7   80S1ENDD
     I            DS
     I                                        1   80F8DATE
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I* DATE *
     I            DS
     I                                        1   80WWYMD
     I                                        1   40WWYY
     I                                        5   60WWMM
     I                                        7   80WWDD
     C*================================================================
     C*           PARM LIST                                          *
     C*================================================================
     C           *ENTRY    PLIST
     C                     PARM           PPUSER 10
     C*================================================================
     C*           KEY LIST                                           *
     C*================================================================
     C*** INPORT GOODS UNIT PRICE M/F *** (GDKPL01)
     C           ISKEY3    KLIST
     C                     KFLD           ISHIN
     C                     KFLD           ISVEND
     C                     KFLD           ISTYPE
     C           ISKEY1    KLIST
     C                     KFLD           D2VEND
     C                     KFLD           D2TYPE
     C                     KFLD           D1HIN
     C*
     C* AOYAMA PRODUCTION PLACE CALENDAR FILE(INCLUDE HOLIDAY)
     C           F8KEY     KLIST
     C                     KFLD           WWYY
     C                     KFLD           WWMM
     C                     KFLD           WWDD
     C*================================================================
     C*           MAIN ROUTINE                                       *
     C*================================================================
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C           @STEP     CASEQ'#CHK1   '#CHK1
     C           @STEP     CASEQ'#SET1   '#SET1
     C           @STEP     CASEQ'#DSP2   '#DSP2
     C           @STEP     CASEQ'#CHK2   '#CHK2
     C*          @STEP     CASEQ'#UPD    '#UPD
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*================================================================
     C*  INIT
     C*================================================================
     C           #INIT     BEGSR
     C                     MOVEA*ALL'0'   *IN
     C                     MOVE *BLANK    D1HIN
     C                     MOVE *BLANK    D1ERR
     C*
     C                     MOVE '#DSP1   '@STEP
     C*
     C                     ENDSR
     C*================================================================
     C*  DSP1
     C*================================================================
     C           #DSP1     BEGSR
     C                     EXFMTDSP01
     C                     MOVE '#CHK1   '@STEP
     C* < F1=ON >
     C           *INKA     IFEQ *ON
     C                     MOVE '#END    '@STEP
     C                     ENDIF
     C                     ENDSR
     C*================================================================
     C*  CHK1
     C*================================================================
     C           #CHK1     BEGSR
     C                     MOVEA'0'       *IN,11           <11>
     C                     MOVEA'0'       *IN,99           <99>
     C                     MOVE *BLANK    D1ERR
     C*
     C** PARTS NO *
     C*
     C           D1HIN     IFEQ *BLANK
     C  N99                MOVELMSG,4     D1ERR
     C                     SETON                     1199
     C                     ENDIF
     C*
     C** FILE **
     C*
S1   C           *IN99     IFEQ *OFF
     C           D1HIN     SETLLGDKPL03
     C                     MOVE ' '       @@UMU   1
     C*----------
 S2  C                     DO   *HIVAL
     C           D1HIN     READEGDKPL03                  90
     C   90                LEAVE
  S3 C           ISSKJY    IFEQ 'D'                        DELETE CODE
     C           ISSKHZ    ANDLE*DATE                      DELETE DATE
     C                     ITER
  E3 C                     ENDIF
     C                     MOVE '1'       @@UMU
     C                     LEAVE
 E2  C                     ENDDO
     C*----------
     C           @@UMU     IFEQ ' '
     C                     MOVELMSG,2     D1ERR
     C                     SETON                     1199
     C                     ENDIF
E1   C                     ENDIF
     C*
      *
     C           *IN99     IFEQ *ON
     C                     MOVE '#DSP1   '@STEP
     C                     ELSE
     C                     MOVE '#SET1   '@STEP
     C                     ENDIF
     C*
     C                     ENDSR
     C*================================================================
      *  SET1
     C*================================================================
     C           #SET1     BEGSR
     C*
     C                     MOVEA'0'       *IN,99           <99>
     C                     MOVE *BLANK    D2ERR
     C                     MOVELD1HIN     D2HIN
     C** FILE **
     C*
     C** SFLCLR **
     C                     SETON                     21
     C                     WRITECTL01
     C                     SETOF                     21
     C                     Z-ADD*ZERO     RRN     40
     C                     Z-ADD*ZERO     LSTRRN  40
     C**
     C           D1HIN     SETLLGDKPL03
     C*--------------------
S1   C                     DO   *HIVAL
     C           D1HIN     READEGDKPL03                  90
     C   90                LEAVE
     C           ISSKJY    IFEQ 'D'                        DELETE CODE
     C           ISSKHZ    ANDLE*DATE                      DELETE DATE
     C                     ITER
     C                     ENDIF
     C*
     C           ISKEY3    SETGTGDKPL03
 S2  C                     DO   *HIVAL
     C           ISKEY3    REDPEGDKPL03                  91
     C   91                LEAVE
     C           ISSKJY    IFEQ 'D'                        DELETE CODE
     C           ISSKHZ    ANDLE*DATE                      DELETE DATE
     C                     ITER
     C                     ENDIF
     C                     EXSR #SFSET
     C                     LEAVE
 E2  C                     ENDDO
     C*
     C           ISKEY3    SETGTGDKPL03
E1   C                     ENDDO
     C*--------------------
     C                     Z-ADDRRN       LSTRRN
     C                     Z-ADD1         RRN1
     C                     MOVE '#DSP2   '@STEP
     C*
     C                     ENDSR
     C*================================================================
     C           #SFSET    BEGSR
     C*
     C                     MOVE ISVEND    S1VEND
     C                     MOVE ISTYPE    S1TYPE
     C                     MOVE *BLANK    S1SEL
     C                     Z-ADDISSTHZ    S1STDT
     C                     Z-ADDISENHZ    S1ENDT
     C                     Z-ADDISTKP1    S1SEA
     C                     Z-ADDISTKP2    S1AIR
     C                     ADD  1         RRN
     C                     WRITESFL01
     C*
     C                     ENDSR
     C*================================================================
     C*  DSP2
     C*================================================================
     C           #DSP2     BEGSR
     C                     WRITEDSP02
     C                     SETON                     20
     C                     EXFMTCTL01
     C                     SETOF                     20
     C                     Z-ADD@TOPRN    TOPRRN  40
     C                     Z-ADD@RRN1     CSRRRN  50
     C                     MOVE '#CHK2   '@STEP
     C* < F3=ON >
     C           *INKC     IFEQ *ON
     C                     MOVE '#INIT   '@STEP
     C                     ENDIF
     C                     ENDSR
     C*================================================================
     C*  CHK2
     C*================================================================
     C           #CHK2     BEGSR
     C                     Z-ADD0         DSPRRN  40
     C*--------------------
     C*--------------------
S1   C                     DO   LSTRRN    RRN
     C           RRN       CHAINSFL01                90
     C   90                LEAVE
     C*
     C           S1SEL     IFEQ 'M'
     C                     EXSR #DSP3
     C                     Z-ADDRRN       DSPRRN
     C                     ENDIF
      *
     C                     MOVE *BLANK    S1SEL
     C                     UPDATSFL01
E1   C                     ENDDO
     C*--------------------
     C*--------------------
     C*
     C           DSPRRN    IFNE 0
     C                     Z-ADDDSPRRN    RRN1
     C                     ELSE
     C           CSRRRN    IFNE 0
     C                     Z-ADDCSRRRN    RRN1
     C                     ELSE
     C                     Z-ADDTOPRRN    RRN1
     C                     ENDIF
     C                     ENDIF
     C                     MOVE '#DSP2   '@STEP
     C*
     C                     ENDSR
     C*================================================================
     C*
     C*================================================================
     C           #DSP3     BEGSR
     C*
     C                     MOVELS1VEND    D2VEND
     C                     MOVELS1TYPE    D2TYPE
     C                     MOVELD1HIN     D2HIN
     C                     MOVE *BLANK    D2VDNM
     C                     MOVELD2VEND    B2CODE
     C           B2CODE    CHAINFGBPL011             92
     C  N92                MOVELB2SMEI    D2VDNM
     C                     Z-ADD1         J       20
     C                     MOVEL*BLANK    D2PTNM
     C           D2TYPE    LOKUPPT,J                     92
     C   92                MOVELPTN,J     D2PTNM
     C*
S1   C           D2TYPE    IFEQ '0'                        FNINSHED PARTS
     C           D2TYPE    OREQ '3'                        WASHER
     C           D2TYPE    OREQ '6'                        HALF-FINISHED PARTS
     C                     MOVE *BLANK    D2HIN
     C                     MOVE *BLANK    WWHIN
     C                     MOVE D1HIN1    WWHIN1
     C                     MOVE D1HIN2    WWHIN2
     C                     MOVE D1HIN3    WWHIN3
     C                     MOVE '-'       WWH1
 S2  C           WWHIN3    IFNE *BLANK
     C                     MOVE '-'       WWH2
 E2  C                     ENDIF
     C                     MOVELWWHIN     D2HIN
E1   C                     ENDIF
     C*
S1   C           D2TYPE    IFEQ 'K'                        DIE
     C                     MOVE *BLANK    D2HIN
     C                     MOVE *BLANK    WWKATA
     C                     MOVE D1KAT1    WWKAT1
     C                     MOVE D1KAT2    WWKAT2
     C                     MOVE D1KAT3    WWKAT3
     C                     MOVE D1KAT4    WWKAT4
     C                     MOVE '-'       WWKA1
     C                     MOVE '-'       WWKA2
     C                     MOVE '-'       WWKA3
 S2  C           WWKAT4    IFEQ *BLANK
     C                     MOVE ' '       WWKA3
  S3 C           WWKAT3    IFEQ *BLANK
     C                     MOVE ' '       WWKA2
  E3 C                     ENDIF
 E2  C                     ENDIF
     C                     MOVELWWKATA    D2HIN
E1   C                     END
     C*
     C** FILE **
     C*
     C** SFLCLR **
     C                     SETON                     23
     C                     WRITECTL02
     C                     SETOF                     23
     C                     Z-ADD*ZERO     RRN2    40
     C**
     C           ISKEY1    SETGTGDKPL011
     C*--------------------
S1   C                     DO   *HIVAL
     C           ISKEY1    REDPEGDKPL011                 92
     C   92                LEAVE
     C           ISSKJY    IFEQ 'D'                        DELETE CODE
     C           ISSKHZ    ANDLE*DATE                      DELETE DATE
     C                     ITER
     C                     ENDIF
     C*
     C                     Z-ADDISSTHZ    S2STDT
     C                     Z-ADDISENHZ    S2ENDT
     C                     Z-ADDISTKP1    S2SEA
     C                     Z-ADDISTKP2    S2AIR
     C                     ADD  1         RRN2
     C                     WRITESFL02
E1   C                     ENDDO
     C                     Z-ADD1         RRN2
     C*--------------------
     C*
     C*--------------------
     C           @DSP3     TAG
     C                     WRITEDSP03
     C                     SETON                     22
     C                     EXFMTCTL02
     C                     SETOF                     22
     C                     Z-ADD@TOPRN    RRN2
     C* < F3=OFF>
     C           *INKC     IFEQ *OFF
     C                     GOTO @DSP3
     C                     ENDIF
     C                     ENDSR
     C*================================================================
     C*================================================================
**  PT
0 FINISHED PARTS
6 HALF-FINESHED PARTS
3 WASHER
M MACHINERY
W WIRE
S INDIRECT MATERIAL
R WIRE ROD
P MACHINERY PARTS
K DIE
**  MSG  **
INPUT ERROR.
UNIT PRICE MASTER FILE NOT FOUND.
UNIT PRICE MASTER FILE FOUND.
NO INPUT ERROR.
DATA OVERLAP.
INCORRECT DATE.
DETAIL M/F <CODE COMPLETION> NOT FOUND.
INPUT ERROR. ONLY THE LATEST RECORD CAN BE ERASED.
INPUT ERROR. THE DIGITS FOR PART NUMBER IS TOO LONG.
