      *** GDKR10 *************************************
      *        UNIT PRICE MASTER LIST                *
      *  G.B.C                         97/07/25      *
      ************************************************
     H            Y/                                    1
     FGDKPW10 CF  E                    WORKSTN
     FGDKPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E****************************************************************
     E                    MSG     1   3 59
     E                    PT      1   8  1   PTN    30
     I****************************************************************
     I*
     I            DS
     I                                        1  20 W1HIN
     I                                        1   5 W1HIN1
     I                                        6  10 W1HIN2
     I                                       11  12 W1HIN3
     I                                        1   2 W1KAT1
     I                                        3   6 W1KAT2
     I                                        7   7 W1KAT3
     I                                        8   8 W1KAT4
     I            DS
     I                                        1  14 WWHIN
     I                                        1   5 WWHIN1
     I                                        6   6 WWH1
     I                                        7  11 WWHIN2
     I                                       12  12 WWH2
     I                                       13  14 WWHIN3
     I            DS
     I                                        1  14 WWKATA
     I                                        1   2 WWKAT1
     I                                        3   3 WWKA1
     I                                        4   7 WWKAT2
     I                                        8   8 WWKA2
     I                                        9   9 WWKAT3
     I                                       10  10 WWKA3
     I                                       11  11 WWKAT4
     I            DS
     I                                        1   80W@YMD
     I                                        1   40W@YY
     I                                        5   60W@MM
     I                                        7   80W@DD
     I*
     I            DS
     I                                        1   80W@DATE
     I                                        1   20W@MM1
     I                                        3   40W@DD1
     I                                        5   80W@YY1
     I* STARTING DATE *
     I            DS
     I                                        1   80D1STRT
     I                                        1   20D1STMM
     I                                        3   40D1STDD
     I                                        5   80D1STYY
     I            DS
     I                                        1   80D2STRT
     I                                        1   40D2STYY
     I                                        5   60D2STMM
     I                                        7   80D2STDD
     I            DS
     I                                        1   80W1STRT
     I                                        1   40W1STYY
     I                                        5   60W1STMM
     I                                        7   80W1STDD
     I            DS
     I                                        1   80W2STRT
     I                                        1   20W2STMM
     I                                        3   40W2STDD
     I                                        5   80W2STYY
     I* ENDING DATE *
     I            DS
     I                                        1   80D1END
     I                                        1   20D1ENMM
     I                                        3   40D1ENDD
     I                                        5   80D1ENYY
     I            DS
     I                                        1   80D2END
     I                                        1   40D2ENYY
     I                                        5   60D2ENMM
     I                                        7   80D2ENDD
     I            DS
     I                                        1   80W1END
     I                                        1   40W1ENYY
     I                                        5   60W1ENMM
     I                                        7   80W1ENDD
     I            DS
     I                                        1   80W2END
     I                                        1   20W2ENMM
     I                                        3   40W2ENDD
     I                                        5   80W2ENYY
     C****************************************************************
     C*           KEY LIST                                           *
     C****************************************************************
     C*** INPORT GOODS UNIT PRICE M/F *** (GDKPL01)
     C           ISKEY1    KLIST
     C                     KFLD           K@VEND  4
     C                     KFLD           K@TYPE  1
     C****************************************************************
     C*           MAIN ROUTINE                                       *
     C****************************************************************
     C           @START    TAG
     C                     CLEARDSP01
     C                     MOVE *ON       *IN40            FIRST
     C*** DSP01 ***
     C           @DSP01    TAG
     C                     WRITEDSP02
     C                     EXFMTDSP01
     C*
     C                     MOVEA'0000'    *IN,11
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    D#MSG
     C*
     C           *INKA     CABEQ'1'       @END
     C*
     C                     EXSR #D1CHK
     C           *IN99     CABEQ'1'       @DSP01
     C*
     C           *INKE     CABEQ'0'       @DSP01
     C**
     C                     EXSR #LIST
     C**
     C           *IN40     IFEQ *ON
     C  N99                MOVELMSG,1     D#MSG
     C*                    SETON                     991112
     C                     SETON                     99
     C                     GOTO @DSP01
     C                     ENDIF
     C***
     C           @END      TAG
     C                     SETON                     LR
     C                     RETRN
     C****************************************************************
     C*          #D1CHK    DSP01 CHECK                               *
     C****************************************************************
     C           #D1CHK    BEGSR                                     *
     C                     Z-ADD0         D2STRT
     C                     Z-ADD0         D2END
     C                     Z-ADDD1STYY    D2STYY
     C                     Z-ADDD1STMM    D2STMM
     C                     Z-ADDD1STDD    D2STDD
     C                     Z-ADDD1ENYY    D2ENYY
     C                     Z-ADDD1ENMM    D2ENMM
     C                     Z-ADDD1ENDD    D2ENDD
     C           D1STRT    IFNE 0
     C           D1STYY    IFEQ 0
     C  N99                MOVELMSG,2     D#MSG
     C                     SETON                     9913
     C                     END
     C           D1STMM    IFLT 1
     C           D1STMM    ORGT 12
     C  N99                MOVELMSG,2     D#MSG
     C                     SETON                     9913
     C                     END
     C           D1STDD    IFLT 1
     C           D1STDD    ORGT 31
     C  N99                MOVELMSG,2     D#MSG
     C                     SETON                     9913
     C                     END
     C                     END
     C           D1END     IFNE 0
     C           D1ENYY    IFEQ 0
     C  N99                MOVELMSG,2     D#MSG
     C                     SETON                     9914
     C                     END
     C           D1ENMM    IFLT 1
     C           D1ENMM    ORGT 12
     C  N99                MOVELMSG,2     D#MSG
     C                     SETON                     9914
     C                     END
     C           D1ENDD    IFLT 1
     C           D1ENDD    ORGT 31
     C  N99                MOVELMSG,2     D#MSG
     C                     SETON                     9914
     C                     END
     C           D1STRT    IFGT D1END
     C  N99                MOVELMSG,3     D#MSG
     C                     SETON                     991314
     C                     END
     C                     END
     C                     ENDSR
     C****************************************************************
     C*          #LIST     LIST                                      *
     C****************************************************************
     C           #LIST     BEGSR
     C                     EXSR #KYSET
     C*
     C                     DO   *HIVAL
     C                     READ GDKPL011                 90
     C   90                LEAVE
     C**
     C           ISVEND    IFGT E@VEND
     C                     LEAVE
     C                     ENDIF
     C*
     C           ISTYPE    IFLT K@TYPE
     C           ISTYPE    ORGT E@TYPE
     C                     ITER
     C                     ENDIF
     C*
     C           D2END     IFNE 0
     C           ISSTHZ    IFGT D2END
     C                     ITER
     C                     ENDIF
     C                     ENDIF
     C           ISENHZ    IFLT D2STRT
     C                     ITER
     C                     ENDIF
     C** FIRST **
     C           *IN40     IFEQ *ON
     C                     MOVELISVEND    W@VEND  4
     C                     MOVELISTYPE    W@TYPE  1
     C                     MOVE *OFF      *IN40
     C                     MOVE *ON       *INOF
     C                     ENDIF
     C** VENDOR OR PART TYPE BREAK? **
     C           ISVEND    IFNE W@VEND
     C           ISTYPE    ORNE W@TYPE
     C                     EXSR #HEAD
     C                     MOVELISVEND    W@VEND
     C                     MOVELISTYPE    W@TYPE
     C                     ENDIF
     C** OVERFLOW ? **
     C           *INOF     CASEQ*ON       #HEAD
     C                     END
     C**
     C                     Z-ADDISSTHZ    W1STRT
     C                     Z-ADDISENHZ    W1END
     C           ISSTHZ    IFLT D2STRT
     C***** 97/10/15       Z-ADDD2STRT    W1STRT
     C                     END
     C           ISENHZ    IFGT D2END
     C***** 97/10/15       Z-ADDD2END     W1END
     C                     END
     C                     Z-ADD0         W2STRT
     C                     Z-ADD0         W2END
     C                     Z-ADDW1STYY    W2STYY
     C                     Z-ADDW1STMM    W2STMM
     C                     Z-ADDW1STDD    W2STDD
     C                     Z-ADDW1ENYY    W2ENYY
     C                     Z-ADDW1ENMM    W2ENMM
     C                     Z-ADDW1ENDD    W2ENDD
     C*
     C                     MOVE *BLANK    W2HIN  20
     C                     MOVELISHIN     W1HIN
     C                     MOVELISHIN     W2HIN
     C           ISTYPE    IFEQ 'B'
     C           ISTYPE    OREQ 'C'
     C           ISTYPE    OREQ 'D'
     C                     MOVE *BLANK    W2HIN
     C                     MOVE *BLANK    WWHIN
     C                     MOVE W1HIN1    WWHIN1
     C                     MOVE W1HIN2    WWHIN2
     C                     MOVE W1HIN3    WWHIN3
     C                     MOVE '-'       WWH1
     C           WWHIN3    IFNE *BLANK
     C                     MOVE '-'       WWH2
     C                     END
     C                     MOVELWWHIN     W2HIN
     C                     END
     C           ISTYPE    IFEQ 'E'
     C                     MOVE *BLANK    W2HIN
     C                     MOVE *BLANK    WWKATA
     C                     MOVE W1KAT1    WWKAT1
     C                     MOVE W1KAT2    WWKAT2
     C                     MOVE W1KAT3    WWKAT3
     C                     MOVE W1KAT4    WWKAT4
     C                     MOVE '-'       WWKA1
     C           WWKAT3    IFNE *BLANK
     C                     MOVE '-'       WWKA2
     C                     END
     C           WWKAT4    IFNE *BLANK
     C                     MOVE '-'       WWKA3
     C                     END
     C                     MOVELWWKATA    W2HIN
     C                     END
     C**
     C                     EXCPT@DETL
     C                     ENDDO
     C**
     C                     ENDSR
     C****************************************************************
     C*          #KYSET    KEY SET                                   *
     C****************************************************************
     C           #KYSET    BEGSR
     C** KEY SET **
     C           D1VEND    IFEQ *BLANK
     C                     MOVE *BLANK    K@VEND  4
     C                     MOVEL*HIVAL    E@VEND  4
     C                     ELSE
     C                     MOVELD1VEND    K@VEND
     C                     MOVELD1VEND    E@VEND
     C                     ENDIF
     C*
     C           D1TYPE    IFEQ *BLANK
     C                     MOVEL*BLANK    K@TYPE  1
     C                     MOVEL*HIVAL    E@TYPE  1
     C                     ELSE
     C                     MOVELD1TYPE    K@TYPE
     C                     MOVELD1TYPE    E@TYPE
     C                     ENDIF
     C*
     C           ISKEY1    SETLLGDKPL011
     C                     ENDSR
     C****************************************************************
     C*          #HEAD     HEAD PRINT                                *
     C****************************************************************
     C           #HEAD     BEGSR
     C*
     C                     Z-ADD*DATE     W@YMD
     C                     Z-ADDW@YY      W@YY1
     C                     Z-ADDW@MM      W@MM1
     C                     Z-ADDW@DD      W@DD1
     C                     MOVEL*BLANK    W@VNNM 30
     C                     MOVEL*BLANK    W@TPNM 29
     C                     MOVE ISVEND    B2CODE
     C           B2CODE    CHAINFGBPL011             50
     C  N50                MOVELB2SMEI    W@VNNM
     C                     Z-ADD1         ZZ      20
     C           ISTYPE    LOKUPPT,ZZ                    50
     C   50                MOVE PTN,ZZ    W@TPNM
     C**
     C                     EXCPT@HEAD
     C**
     C                     MOVE *OFF      *INOF
     C                     ENDSR
     C****************************************************************
     O****************************************************************
     OQPRINT  E   01           @HEAD
     O                                    7 'GDKR10'
     O                                   28 'UNIT PRICE'
     O                                 +  1 'MASTER LIST'
     O                                   66 'PAGE'
     O                         PAGE  Z   77
     O        E   02           @HEAD
     O                                   66 'DATE'
     O                         W@DATE    77 '  /  /    '
     O        E   03           @HEAD
     O                                   15 'CONTRACT DATE'
     O                                 +  1 '(FROM)'
     O                         D1STRT  +  1 '  /  /    '
     O                                 +  3 '(TO)'
     O                         D1END   +  1 '  /  /    '
     O        E   05           @HEAD
     O                                    8 'VENDOR'
     O                         ISVEND    14
     O                         W@VNNM    46
     O                                   65 'BUYER INDIANA'
     O                                   76 'AUTOMOTIVE'
     O        E   06           @HEAD
     O                                   76 'FASTENERS,INC'
     O        E   07           @HEAD
     O                                   11 'PART TYPE'
     O                         ISTYPE    14
     O                         W@TPNM  +  2
     O        E   09           @HEAD
     O                                   38 '.............'
     O                                   48 'UNIT PRICE'
     O                                   61 '.............'
     O                                   85 '....EFFECTIVE TERM....'
     O        E   10           @HEAD
     O                                   11 'PARTS NO.'
     O                                   42 'BY SEA'
     O                                   61 'BY AIR'
     O                                   73 ' STARTING '
     O                                   85 '  ENDING  '
     O        E   11           @HEAD
     O                                   22 '--------------------'
     O                                   42 '-----------------'
     O                                   61 '-----------------'
     O                                   73 '----------'
     O                                   85 '----------'
     C**
     O        E 1              @DETL
     O                         W2HIN     22
     O                         ISTKP1    42 '   ,   , 0 .     '
     O                         ISTKP2    61 '   ,   , 0 .     '
     O                         W2STRT    73 '  .  .    '
     O                         W2END     85 '  .  .    '
**  MSG  **
NO DATA.
INCORRECT DATE.
INPUT ERROR.
**  PT
A:MAIN MATERIAL EXPENSES
B:HALF-FINESHED GOODS
C:PARTS PURCHASE EXPENSES
D:PURCHASED GOODS
E:DIE EXPENSES
F:INDIRECT MATERIAL EXPENSES
M:MACHINERY
N:MACHINE MAINTENANCE PARTS
