      *** GDKR08 ****************************************
      *       UPDAT TO ACTUAL PURCHSE OF INPORTED GOODS *
      *  G.B.C                         98/01/12         *
      ***************************************************
     H            Y/                                    1
     FGDKPW08 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL01
     FRATPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGDKPL01 IF  E           K        DISK
     FGDKPL07 UF  E           K        DISK                      A
     E****************************************************************
     E                    MSG     1  14 59
     E                    MM     13  13  2 0
     I****************************************************************
     I*
     I            DS
     I                                        1   60TIMEX
     I                                        1   20TIMEH
     I                                        3   40TIMEM
     I* ORDER DATE *
     I            DS
     I                                        1   80ITHTDT
     I                                        1   20ITHTMM
     I                                        3   40ITHTDD
     I                                        5   80ITHTYY
     I* RECEIPT DATE *
     I            DS
     I                                        1   80ITUKDT
     I                                        1   20ITUKMM
     I                                        3   40ITUKDD
     I                                        5   80ITUKYY
     I* DUE DATE *
     I            DS
     I                                        1   80ITSIDT
     I                                        1   20ITSIMM
     I                                        3   40ITSIDD
     I                                        5   80ITSIYY
     I* SAILING ON *
     I            DS
     I                                        1   80C1SYHZ
     I                                        1   20C1SYMM
     I                                        3   40C1SYDD
     I                                        5   80C1SYYY
     I* RECEIPT DATE *
     I            DS
     I                                        1   80C1UKHZ
     I                                        1   20C1UKMM
     I                                        3   40C1UKDD
     I                                        5   80C1UKYY
     I* DUE DATE *
     I            DS
     I                                        1   80C1SIHZ
     I                                        1   20C1SIMM
     I                                        3   40C1SIDD
     I                                        5   80C1SIYY
     I* WORK DATE *
     I            DS
     I                                        1   80WWDATE
     I                                        1   40WWYY
     I                                        5   60WWMM
     I                                        7   80WWDD
     I* DIE 6CHAR *
     I            DS
     I                                        1  20 S1HIN
     I                                        1   6 S1HIN6
     I* DIE 6CHAR *
     I            DS
     I                                        1  20 ISHIN
     I                                        1   6 ISHIN6
     C           *ENTRY    PLIST
     C                     PARM           PPUSER 10
     C           *NAMVAR   DEFN           GDKD01  20
     C                     IN   *NAMVAR
     C                     Z-ADDGDKD01    COUNT   20
     C****************************************************************
     C*           KEY LIST                                           *
     C****************************************************************
     C*** ACTUAL PRUCHACE OF INPRTED GODDS ** (GDKPL07)
     C           ITKEY1    KLIST
     C                     KFLD           D1INVO
     C                     KFLD           D1ODER
     C           ISKEY1    KLIST
     C                     KFLD           C1VEND
     C                     KFLD           S1TYPE
     C                     KFLD           S1HIN
     C           ISKEY2    KLIST
     C                     KFLD           C1VEND
     C                     KFLD           S1TYPE
     C                     KFLD           WWHIN  20
     C****************************************************************
     C*           MAIN ROUTINE                                       *
     C****************************************************************
     C           @START    TAG
     C                     CLEARDSP01
     C*** DSP01 ***
     C           @DSP01    TAG
     C                     EXFMTDSP01
     C*
     C                     EXSR #CLEAR
     C           *INKA     CABEQ'1'       @END
     C*
     C                     EXSR #D1CHK
     C           *IN99     CABEQ'1'       @DSP01
     C*
     C                     EXSR #S1SET
     C           @SFL01    TAG
     C                     WRITEDSP02
     C                     SETON                     26
     C                     EXFMTCTL01
     C                     SETOF                     26
     C                     EXSR #CLEAR
     C*
     C           *INKA     CABEQ*ON       @END
     C           *INKC     CABEQ*ON       @DSP01
     C           *IN95     IFEQ '1'
     C                     EXSR #ROLL
     C                     GOTO @SFL01
     C                     END
     C*
     C                     EXSR #S1CHK
     C           *IN99     CABEQ'1'       @SFL01
     C*
     C           *INKE     CABEQ*OFF      @SFL01
     C                     EXSR #UPD
     C**
     C                     GOTO @START
     C**
     C           @END      TAG
     C                     SETON                     LR
     C                     RETRN
     C****************************************************************
     C*          #CLEAR    INDICATOR & MSG CLEAR                     *
     C****************************************************************
     C           #CLEAR    BEGSR                                     *
     C                     MOVEA'00'      *IN,11
     C                     SETOF                     010399
     C                     MOVE *BLANK    D#MSG
     C                     ENDSR
     C****************************************************************
     C*          #D1CHK    DSP01 CHECK                               *
     C****************************************************************
     C           #D1CHK    BEGSR                                     *
     C                     MOVEA'0'       *IN,90
     C                     MOVEA'0'       *IN,99
     C           D1KBN     IFEQ 1
     C           D1KBN     OREQ 2
     C                     ELSE
     C           *IN90     IFEQ *OFF
     C  N99                MOVELMSG,1     D#MSG
     C                     ENDIF
     C                     SETON                     9911
     C                     END
     C** INVOICE NO. **
     C           D1INVO    IFEQ *BLANK
     C           *IN90     IFEQ *OFF
     C  N99                MOVELMSG,2     D#MSG
     C                     ENDIF
     C                     SETON                     9912
     C                     ENDIF
     C*
     C*
     C           D1KBN     IFEQ 1
     C           D1INVO    SETLLGDKPL071                 10
     C           *IN10     IFEQ '0'
     C  N99                MOVELMSG,6     D#MSG
     C                     SETON                     9911
     C                     SETON                     121314
     C                     ENDIF
     C                     END
     C*
     C                     ENDSR
     C****************************************************************
     C*          #S1SET    DSP02 SET                                 *
     C****************************************************************
     C           #S1SET    BEGSR
     C                     MOVE D1INVO    C1INVO
     C                     Z-ADD0         C1SYHZ
     C                     Z-ADD0         C1UKHZ
     C                     MOVE *BLANK    C1YUSO
     C                     MOVE *BLANK    C1YUNM
     C                     MOVE *BLANK    C1VEND
     C                     MOVE *BLANK    C1VENM
     C                     Z-ADD0         D2DOLL
     C                     Z-ADD0         D2RATE
     C                     Z-ADD0         D2KIN
     C                     Z-ADD0         C1SIHZ
     C                     MOVEA'00000000'*IN,11
     C                     MOVEA'00000000'*IN,21
     C                     MOVEA'0'       *IN,98
     C*
     C                     Z-ADD0         RRN     40
     C                     Z-ADD0         RRNMAX  40
     C                     Z-ADD1         RECNO
     C                     SETON                     25
     C                     WRITECTL01
     C                     SETOF                     25
     C                     Z-ADD0         D1ODER  60
     C*
     C           D1KBN     IFEQ 1
     C                     MOVE 'UPDATE'  C1MODE
     C                     END
     C           D1KBN     IFEQ 2
     C                     MOVE ' ADD  '  C1MODE
     C                     END
     C           D1KBN     IFEQ 0
     C                     MOVE 'DELETE'  C1MODE
     C                     END
     C*
     C                     Z-ADD0         D2KIN
     C*
     C           D1KBN     IFEQ 1
     C           ITKEY1    SETLLGDKPL071
     C                     DO   *HIVAL
     C           ITKEY1    READEGDKPL071                 10
     C           *IN10     IFEQ *OFF
     C                     MOVE *BLANK    S1REF
     C                     Z-ADDITITEM    S1ITEM
     C                     MOVE ITTYPE    S1TYPE
     C                     MOVE ITHIN     S1HIN
     C                     Z-ADDITSRY     S1SRY
     C                     Z-ADDITTAN     S1TAN
     C                     MOVE ITTKBN    S1TKBN
     C                     Z-ADDITKIN     S1KIN
     C                     MOVE ITNAME    S1NAME
     C                     MOVE ITKAMO    S1KAMO
     C                     ADD  S1KIN     D2KIN
     C                     ADD  1         RRN
     C                     WRITESFL01
     C                     ENDIF
     C  N10                ENDDO
     C                     Z-ADDITSAYY    C1SYYY
     C                     Z-ADDITSAMM    C1SYMM
     C                     Z-ADDITSADD    C1SYDD
     C*                    Z-ADDITUKYY    C1UKYY
     C*                    Z-ADDITUKMM    C1UKMM
     C*                    Z-ADDITUKDD    C1UKDD
     C                     MOVE ITYUSO    C1YUSO
     C                     MOVE '   '     C1YUNM
     C           C1YUSO    IFEQ 'S'
     C                     MOVE 'SEA'     C1YUNM
     C                     ELSE
     C                     MOVE 'AIR'     C1YUNM
     C                     END
     C                     MOVE ITVEND    C1VEND
     C*                    Z-ADDITSIYY    C1SIYY
     C*                    Z-ADDITSIMM    C1SIMM
     C*                    Z-ADDITSIDD    C1SIDD
     C                     MOVE *BLANK    C1VENM
     C                     MOVE C1VEND    B2CODE
     C           B2CODE    CHAINFGBPL011             09
     C           *IN09     IFEQ '0'
     C                     MOVELB2SMEI    C1VENM
     C                     END
     C                     MOVEA'1'       *IN,98
     C                     Z-ADD0         D2RATE
     C                     Z-ADDC1SYYY    KEYYY   40
     C                     Z-ADDC1SYMM    KEYMM   20
     C           RATKEY    KLIST
     C                     KFLD           KEYYY
     C                     KFLD           KEYMM
     C           RATKEY    SETLLRATPL011
     C                     DO   *HIVAL
     C           RATKEY    READERATPL011                 10
     C           *IN10     IFEQ '0'
     C           RACODE    IFEQ 'JPY'
     C                     Z-ADDRARATE    D2RATE
     C                     SETON                     10
     C                     MOVEA'0'       *IN,98
     C                     END
     C                     END
     C  N10                END
     C*
     C                     Z-ADD0         D2DOLL
     C           D2RATE    IFNE 0
     C           D2KIN     DIV  D2RATE    D2DOLL
     C                     END
     C*
     C                     Z-ADDRRN       RRNMAX  40
     C                     ENDIF
     C*
     C           RRNMAX    DIV  6         AA      40
     C                     MVR            BB      40
     C           6         SUB  BB        CC      40
     C                     DO   CC
     C                     CLEARSFL01
     C                     MOVE '0'       S1TKBN
     C                     ADD  1         RRN
     C                     WRITESFL01
     C                     END
     C                     Z-ADDRRN       RRNMAX
     C*
     C                     ENDSR
     C****************************************************************
     C*          #ROLL     DSP02 SET                                 *
     C****************************************************************
     C           #ROLL     BEGSR
     C*
     C                     Z-ADDRRNMAX    RRN
     C           RRNMAX    DIV  6         AA      40
     C                     MVR            BB      40
     C           6         SUB  BB        CC      40
     C                     DO   CC
     C                     CLEARSFL01
     C                     MOVE '0'       S1TKBN
     C                     ADD  1         RRN
     C                     WRITESFL01
     C                     END
     C                     Z-ADDRRN       RRNMAX
     C                     Z-ADDRRN       RECNO
     C                     ENDSR
     C****************************************************************
     C*          #S1CHK    DSP02 CHECK                               *
     C****************************************************************
     C           #S1CHK    BEGSR
     C*
     C                     MOVEA'0'       *IN,90
     C                     MOVEA'0'       *IN,99
     C                     MOVEA'0000000' *IN,21
     C*
     C           C1SYHZ    IFNE 0
     C                     Z-ADDC1SYYY    C1SIYY
     C                     Z-ADDC1SYMM    C1SIMM
     C                     Z-ADDC1SYDD    C1SIDD
     C           C1SIMM    IFGE 1
     C           C1SIMM    ANDLE12
     C                     DO   COUNT
     C           C1SIMM    IFEQ 12
     C                     ADD  1         C1SIYY
     C                     Z-ADD1         C1SIMM
     C                     ELSE
     C                     ADD  1         C1SIMM
     C                     END
     C                     END
     C                     Z-ADDC1SIMM    A       20
     C           A         IFEQ 2
     C           C1SIYY    DIV  4         WWW001  40
     C                     MVR            WWW002  40
     C           WWW002    IFEQ 0
     C                     Z-ADD13        A
     C                     END
     C                     END
     C                     Z-ADDMM,A      C1SIDD
     C                     END
     C                     END
     C           C1SIHZ    IFEQ 0
     C  N99                MOVELMSG,3     D#MSG
     C                     SETON                     2199
     C                     END
     C           C1UKHZ    IFEQ 0
     C  N99                MOVELMSG,4     D#MSG
     C                     SETON                     2299
     C                     END
     C*
     C           C1SYYY    IFEQ 0
     C  N99                MOVELMSG,9     D#MSG
     C                     SETON                     2199
     C                     END
     C           C1SYMM    IFLT 1
     C           C1SYMM    ORGT 12
     C  N99                MOVELMSG,9     D#MSG
     C                     SETON                     2199
     C                     END
     C           C1SYDD    IFLT 1
     C           C1SYDD    ORGT 31
     C  N99                MOVELMSG,9     D#MSG
     C                     SETON                     2199
     C                     END
     C*
     C           C1UKYY    IFEQ 0
     C  N99                MOVELMSG,9     D#MSG
     C                     SETON                     2299
     C                     END
     C           C1UKMM    IFLT 1
     C           C1UKMM    ORGT 12
     C  N99                MOVELMSG,9     D#MSG
     C                     SETON                     2299
     C                     END
     C           C1UKDD    IFLT 1
     C           C1UKDD    ORGT 31
     C  N99                MOVELMSG,9     D#MSG
     C                     SETON                     2299
     C                     END
     C*
     C                     Z-ADD0         WWDATE
     C                     Z-ADDC1SYYY    WWYY
     C                     Z-ADDC1SYMM    WWMM
     C                     Z-ADDC1SYDD    WWDD
     C                     Z-ADDWWDATE    WWSYHZ  80
     C                     Z-ADDC1UKYY    WWYY
     C                     Z-ADDC1UKMM    WWMM
     C                     Z-ADDC1UKDD    WWDD
     C                     Z-ADDWWDATE    WWUKHZ  80
     C           WWSYHZ    IFGT WWUKHZ
     C  N99                MOVELMSG,9     D#MSG
     C                     SETON                     212299
     C                     END
     C*
     C*
     C                     MOVE '   '     C1YUNM
     C           C1YUSO    IFEQ 'S'
     C           C1YUSO    OREQ 'A'
     C                     ELSE
     C  N99                MOVELMSG,13    D#MSG
     C                     SETON                     2499
     C                     END
     C           C1YUSO    IFEQ 'S'
     C                     MOVE 'SEA'     C1YUNM
     C                     ELSE
     C                     MOVE 'AIR'     C1YUNM
     C                     END
     C*
     C                     MOVE *BLANK    C1VENM
     C                     MOVE C1VEND    B2CODE
     C           B2CODE    CHAINFGBPL011             09
     C           *IN09     IFEQ '1'
     C  N99                MOVELMSG,12    D#MSG
     C                     SETON                     2399
     C                     ELSE
     C                     MOVELB2SMEI    C1VENM
     C                     END
     C*
     C*
     C*
     C                     Z-ADD0         D2KIN
     C*
     C                     Z-ADD1         RECNO
     C                     Z-ADD1         RRN
     C           1         DO   *HIVAL    RRN
     C           RRN       CHAINSFL01                10
     C           *IN10     IFEQ '0'
     C                     MOVEA'000000'  *IN,11
     C                     Z-ADD0         S1KIN
     C           S1ITEM    IFEQ 0
     C           S1ITEM    ANDEQ0
     C           S1TYPE    ANDEQ*BLANK
     C           S1HIN     ANDEQ*BLANK
     C           S1SRY     ANDEQ0
     C           S1TAN     ANDEQ0
     C                     ELSE
     C           S1TYPE    IFEQ 'A'
     C           S1TYPE    OREQ 'B'
     C           S1TYPE    OREQ 'C'
     C           S1TYPE    OREQ 'D'
     C           S1TYPE    OREQ 'E'
     C           S1TYPE    OREQ 'F'
     C           S1TYPE    OREQ 'M'
     C           S1TYPE    OREQ 'N'
     C                     ELSE
     C  N99                MOVELMSG,10    D#MSG
     C                     SETON                     1499
     C                     Z-ADDRRN       RECNO
     C                     END
B01  C           S1TKBN    IFNE '9'
     C           ISKEY1    SETLLGDKPL011             09
     C                     MOVE '*'       ERSW    1
B02  C                     DO   *HIVAL
     C           ##1       TAG
     C           ISKEY1    READEGDKPL011                 09
B03  C           *IN09     IFEQ '0'
B04  C           ISSKJY    IFEQ 'D'
B05  C           ISSKHZ    IFLE *DATE
     C                     GOTO ##1
E05  C                     END
E04  C                     END
     C           ISSTHZ    IFGT *DATE
     C                     GOTO ##1
     C                     END
     C           ISENHZ    IFLT *DATE
     C                     GOTO ##1
     C                     END
     C                     MOVE *BLANK    ERSW
     C                     MOVELISNAME    S1NAME
B04  C           C1YUSO    IFEQ 'S'
     C                     Z-ADDISTKP1    S1TAN
     C                     ELSE
     C                     Z-ADDISTKP2    S1TAN
E04  C                     END
     C                     SETON                     09
E03  C                     END
E02  C  N09                END
     C*
     C           ERSW      IFNE *BLANK
     C           S1TYPE    IFEQ 'E'
     C                     EXSR #2SET
     C                     END
     C                     END
     C*
     C           ERSW      IFNE *BLANK
     C  N99                MOVELMSG,5     D#MSG
     C                     SETON                     111499
     C                     Z-ADDRRN       RECNO
     C                     END
E01  C                     END
     C*
     C           S1TKBN    IFEQ '9'
     C           S1HIN     ANDEQ*BLANK
     C           S1NAME    ANDEQ*BLANK
     C  N99                MOVELMSG,14    D#MSG
     C                     SETON                     151199
     C                     Z-ADDRRN       RECNO
     C                     END
     C*
     C           S1SRY     IFEQ 0
     C  N99                MOVELMSG,7     D#MSG
     C                     SETON                     1299
     C                     Z-ADDRRN       RECNO
     C                     END
     C           S1TKBN    IFNE '9'
     C           S1TAN     IFEQ 0
     C  N99                MOVELMSG,8     D#MSG
     C                     SETON                     1399
     C                     Z-ADDRRN       RECNO
     C                     END
     C                     END
     C           S1SRY     MULT S1TAN     S1KIN
     C                     ADD  S1KIN     D2KIN
     C                     END
     C                     UPDATSFL01
     C                     END
     C  N10                END
     C*
     C                     MOVEA'1'       *IN,98
     C                     Z-ADD0         D2RATE
     C                     Z-ADDC1SYYY    KEYYY   40
     C                     Z-ADDC1SYMM    KEYMM   20
     C           RATKEY    SETLLRATPL011
     C                     DO   *HIVAL
     C           RATKEY    READERATPL011                 10
     C           *IN10     IFEQ '0'
     C           RACODE    IFEQ 'JPY'
     C                     Z-ADDRARATE    D2RATE
     C                     SETON                     10
     C                     MOVEA'0'       *IN,98
     C                     END
     C                     END
     C  N10                END
     C*
     C                     Z-ADD0         D2DOLL
     C           D2RATE    IFNE 0
     C           D2KIN     DIV  D2RATE    D2DOLL
     C                     END
     C*
     C                     ENDSR
     C****************************************************************
     C*          #2SET     BEGSR                                     *
     C****************************************************************
     C           #2SET     BEGSR
     C                     MOVE *BLANK    WWHIN
     C                     MOVELS1HIN6    WWHIN
     C           ISKEY2    SETLLGDKPL011             09
     C                     MOVE '*'       ERSW    1
B02  C                     DO   *HIVAL
     C           ##2       TAG
     C                     READ GDKPL011                 09
     C           *IN09     IFEQ '0'
     C           ISVEND    IFEQ C1VEND
     C           ISTYPE    ANDEQS1TYPE
     C           ISHIN6    ANDEQS1HIN6
     C                     ELSE
     C                     MOVEA'1'       *IN,09
     C                     END
     C                     END
B03  C           *IN09     IFEQ '0'
B04  C           ISSKJY    IFEQ 'D'
B05  C           ISSKHZ    IFLE *DATE
     C                     GOTO ##2
E05  C                     END
E04  C                     END
     C           ISSTHZ    IFGT *DATE
     C                     GOTO ##2
     C                     END
     C           ISENHZ    IFLT *DATE
     C                     GOTO ##2
     C                     END
     C                     MOVE *BLANK    ERSW
     C                     MOVELISNAME    S1NAME
B04  C           C1YUSO    IFEQ 'S'
     C                     Z-ADDISTKP1    S1TAN
     C                     ELSE
     C                     Z-ADDISTKP2    S1TAN
E04  C                     END
     C                     SETON                     09
E03  C                     END
E02  C  N09                END
     C                     ENDSR
     C****************************************************************
     C*          #UPD      UPDATE                                    *
     C****************************************************************
     C           #UPD      BEGSR
     C*
     C*
     C                     TIME           TIMEX
     C*
     C           D1KBN     IFEQ 1
     C           ITKEY1    SETLLGDKPL071
     C                     DO   *HIVAL
     C           ITKEY1    READEGDKPL071                 10
     C  N10                DELETGDKPL071
     C  N10                END
     C                     END
     C*
     C*
     C                     Z-ADD1         RRN
     C           1         DO   *HIVAL    RRN
     C           RRN       CHAINSFL01                10
     C           *IN10     IFEQ '0'
     C           S1ITEM    IFEQ 0
     C           S1ITEM    ANDEQ0
     C           S1TYPE    ANDEQ*BLANK
     C           S1HIN     ANDEQ*BLANK
     C           S1SRY     ANDEQ0
     C           S1TAN     ANDEQ0
     C                     ELSE
     C           S1REF     IFNE '0'
     C                     MOVE *BLANK    ITSKJY
     C                     Z-ADD0         ITSKYY
     C                     Z-ADD0         ITSKMM
     C                     Z-ADD0         ITSKDD
     C                     Z-ADD*YEAR     ITKOYY
     C                     Z-ADDUMONTH    ITKOMM
     C                     Z-ADDUDAY      ITKODD
     C                     Z-ADDTIMEH     ITKOHH
     C                     Z-ADDTIMEM     ITKOSS
     C                     MOVE PPUSER    ITKOME
     C                     MOVE D1INVO    ITINVO
     C                     Z-ADD0         ITODER
     C                     Z-ADDS1ITEM    ITITEM
     C                     MOVE S1TYPE    ITTYPE
     C                     MOVE S1HIN     ITHIN
     C                     MOVE S1NAME    ITNAME
     C                     MOVE C1VEND    ITVEND
     C                     MOVE S1KAMO    ITKAMO
     C                     Z-ADD1         ITHAKO
     C                     Z-ADDS1SRY     ITSRY
     C                     Z-ADDS1TAN     ITTAN
     C                     MOVE S1TKBN    ITTKBN
     C                     Z-ADDS1KIN     ITKIN
     C                     Z-ADDD2RATE    ITRATE
     C                     Z-ADDD2DOLL    ITDOLL
     C                     Z-ADD0         ITHTYY
     C                     Z-ADD0         ITHTMM
     C                     Z-ADD0         ITHTDD
     C                     Z-ADDC1UKYY    ITUKYY
     C                     Z-ADDC1UKMM    ITUKMM
     C                     Z-ADDC1UKDD    ITUKDD
     C                     Z-ADDC1SYYY    ITSAYY
     C                     Z-ADDC1SYMM    ITSAMM
     C                     Z-ADDC1SYDD    ITSADD
     C                     Z-ADDC1SIYY    ITSIYY
     C                     Z-ADDC1SIMM    ITSIMM
     C                     Z-ADDC1SIDD    ITSIDD
     C                     MOVE C1YUSO    ITYUSO
     C                     Z-ADD0         ITMMYY
     C                     Z-ADD0         ITMMMM
     C                     Z-ADD0         ITMMDD
     C                     WRITEGDKPL071
     C                     END
     C                     END
     C                     END
     C  N10                END
     C           UPDEND    ENDSR
**  MSG  **
INCORRECT UPDATE.
INPUT THE INVOICE NO.
INPUT THE SAILING ON DATE.
INPUT THE RECEIPT DATE.
UNIT PRICE MASTER NOT FOUND.
ACTUAL PURCHASE OF INPORTED NOT FOUND.
INPUT THE QTY.
INPUT THE UNIT PRICE.
INCORRECT DATE.
INCORRECT PARTS TYPE.
INPUT THE PARTS NAME.
INCORRECT VENDOR.
INCORRECT DELIVERY INSTR.
INPUT THE PARTS NO. OR PARTS NAME.
**
31283130313031313031303129
