     H            Y.
     FQQRYOUTYUP  E                    DISK
     F            QQRYOUTY                          KRENAMEQQRYY
      *
      *
     I            DS
     I                                        1   80WKYMD
     I                                        1   40WKY
     I                                        5   60WKM
     I                                        7   80WKD
      *
     C                     MOVE SCH       PDATE
     C                     MOVEL'+'       PPORM
     C                     MOVEL'0001'    PDAYS
     C                     CALL 'DATR1A'
     C                     PARM           PDATE   8
     C                     PARM           PPORM   1        + OR -
     C                     PARM           PDAYS   4
     C                     PARM           PRDAT   8
     C                     PARM           PRTN    1
      *
     C                     MOVE PRDAT     SCH
      *
     C                     UPDATQQRYY
     C*
     C*
     C*
