     H            Y.                                    1
      ** GDLR12 *******************************
      *  REISSUE MATERIAL ORDER SHEET SYSTEM  *
      *                 K.YASUDA  2000.07.17  *
      *
      *   ADD ORDER DATE FIELD
      *        10/13/2003 TCHK
      *
      * TCHK1 10/03/07 RMV PRINTER CONTROL
      *                ADD SUPPLIER CONTROL
      * TCHK2 01/01/08 CHG ORDER SELECT FOR 0002 & 8990
JW1   * JW    01/12/18 ADD NSCI (4530)
JW2   * JW    09/09/20 ADD CHARTER STEEL (4540)
JW3   * JW    12/13/20 ADD POSCO         (4550)
JW3   * JW    01/04/21 ADD TSUSHO        (4560)
      ******************************* GDLR12 **
     FGDLPW12 CF  E                    WORKSTN
     FGDLPL10 IF  E           K        DISK
     FGDLPL1B IF  E           K        DISK
TCHK1FGDLPR10 O   E             95     PRINTER
TCHK1E*                   CMD     1   1 70
TCHK1E*                   ER      1   2 59               d[ｰ xｮﾈｰﾆﾞ
TCHK1E                    ER      1   3 59               d[ｰ xｮﾈｰﾆﾞ
     E                    ARY        70  1
      *
     I            DS
     I                                        1   40XYEAR
     I                                        3   40ORDER1
     I            DS
     I                                        1   80LBSKHZ
     I                                        1   40LBSKYY
     I                                        5   60LBSKMM
     I                                        7   80LBSKDD
     I            DS
     I                                        1   80LBKOHZ
     I                                        1   40LBKOYY
     I                                        5   60LBKOMM
     I                                        7   80LBKODD
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           US     10
TCHK1C*          P#CMD     PLIST
TCHK1C*                    PARM           P@CMD 256
TCHK1C*                    PARM           P@LEN  155
      *
      *-----*
      * KEY *
      *-----*
     C           KEY1      KLIST
     C                     KFLD           ORDER1
     C                     KFLD           ORDER2
     C                     KFLD           ORDER3
     C           K#1B      KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *----------*
      * SCREEN 1 *
      *----------*
TCHK1C*                    MOVE '1'       D@PRT
     C                     Z-ADD0         ORDER1
     C                     Z-ADD0         ORDER2
     C                     Z-ADD0         ORDER3
TCHK1C                     MOVEL'Y'       F1@ASJ
TCHK1C                     MOVEL*BLANK    F1@OK
JW1  C                     MOVEL*BLANK    F1@NSC
JW2  C                     MOVEL*BLANK    F1@CHR
     C           STP1      TAG
     C                     EXFMTGDLPW121
      *
     C                     SETOF                     010203
     C                     SETOF                     99
TCHK1C                     SETOF                     4142
JW1  C                     SETOF                     43
JW2  C                     SETOF                     44
JW3  C                     SETOF                     45
JW3  C                     SETOF                     46
     C                     MOVE *BLANK    MSG
      *-------*
      * CMD-1 *
      *-------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *-----------*
      * ORDER NO. *
      *-----------*
TCHK1C           F1@ASJ    IFEQ *BLANK
TCHK1C           F1@OK     ANDEQ*BLANK
JW1  C           F1@NSC    ANDEQ*BLANK
JW2  C           F1@CHR    ANDEQ*BLANK
JW3  C           F1@POS    ANDEQ*BLANK
JW3  C           F1@TSU    ANDEQ*BLANK
TCHK1C                     SETON                     414299
JW1  C                     SETON                     43
JW2  C                     SETON                     44
JW3  C                     SETON                     45
JW3  C                     SETON                     46
TCHK1C                     MOVELER,3      MSG
TCHK1C                     GOTO STP1
TCHK1C                     END
      *
TCHK1C           F1@ASJ    IFNE *BLANK
TCHK1C           F1@OK     ANDNE*BLANK
TCHK1C                     SETON                     414299
TCHK1C                     MOVELER,3      MSG
TCHK1C                     GOTO STP1
TCHK1C                     END
      *
JW1  C           F1@ASJ    IFNE *BLANK
 |   C           F1@NSC    ANDNE*BLANK
 |   C                     SETON                     414399
 |   C                     MOVELER,3      MSG
 |   C                     GOTO STP1
 |   C                     ENDIF
      *
JW2  C           F1@ASJ    IFNE *BLANK
 |   C           F1@CHR    ANDNE*BLANK
 |   C                     SETON                     414499
 |   C                     MOVELER,3      MSG
 |   C                     GOTO STP1
 |   C                     ENDIF
      *
JW3  C           F1@ASJ    IFNE *BLANK
 |   C           F1@POS    ANDNE*BLANK
 |   C                     SETON                     414599
 |   C                     MOVELER,3      MSG
 |   C                     GOTO STP1
 |   C                     ENDIF
JW3  C           F1@ASJ    IFNE *BLANK
 |   C           F1@TSU    ANDNE*BLANK
 |   C                     SETON                     414699
 |   C                     MOVELER,3      MSG
 |   C                     GOTO STP1
 |   C                     ENDIF
      *
JW1  C           F1@OK     IFNE *BLANK
 |   C           F1@NSC    ANDNE*BLANK
 |   C                     SETON                     424399
 |   C                     MOVELER,3      MSG
 |   C                     GOTO STP1
 |   C                     ENDIF
      *
JW2  C           F1@OK     IFNE *BLANK
 |   C           F1@CHR    ANDNE*BLANK
 |   C                     SETON                     424499
 |   C                     MOVELER,3      MSG
 |   C                     GOTO STP1
 |   C                     ENDIF
      *
JW3  C           F1@OK     IFNE *BLANK
 |   C           F1@POS    ANDNE*BLANK
 |   C                     SETON                     424599
 |   C                     MOVELER,3      MSG
 |   C                     GOTO STP1
 |   C                     ENDIF
      *
JW3  C           F1@OK     IFNE *BLANK
 |   C           F1@TSU    ANDNE*BLANK
 |   C                     SETON                     424699
 |   C                     MOVELER,3      MSG
 |   C                     GOTO STP1
 |   C                     ENDIF
      *
JW2  C           F1@NSC    IFNE *BLANK
 |   C           F1@CHR    ANDNE*BLANK
 |   C                     SETON                     434499
 |   C                     MOVELER,3      MSG
 |   C                     GOTO STP1
JW1  C                     ENDIF
      *
JW3  C           F1@NSC    IFNE *BLANK
 |   C           F1@POS    ANDNE*BLANK
 |   C                     SETON                     434599
 |   C                     MOVELER,3      MSG
 |   C                     GOTO STP1
JW3  C                     ENDIF
      *
JW3  C           F1@NSC    IFNE *BLANK
 |   C           F1@TSU    ANDNE*BLANK
 |   C                     SETON                     434699
 |   C                     MOVELER,3      MSG
 |   C                     GOTO STP1
JW3  C                     ENDIF
      *
JW3  C           F1@POS    IFNE *BLANK
 |   C           F1@TSU    ANDNE*BLANK
 |   C                     SETON                     454699
 |   C                     MOVELER,3      MSG
 |   C                     GOTO STP1
JW3  C                     ENDIF
      *
     C           ORDER1    IFEQ 0
     C           ORDER2    ANDEQ0
     C           ORDER3    ANDEQ0
     C           D@ORDT    ANDEQ0
     C                     SETON                     019902
     C                     MOVELER,1      MSG
     C                     GOTO STP1
     C                     END
      *
TCHK1C*          D@PRT     IFLT '1'
TCHK1C*          D@PRT     ORGT '3'
TCHK1C*                    SETON                     0299
TCHK1C*                    MOVELER,2      MSG
TCHK1C*                    GOTO STP1
TCHK1C*                    ENDIF
      *-------*
      * CMD-5 *
      *-------*
     C           *INKE     IFEQ '0'
     C                     GOTO STP1
     C                     END
      *
TCHK1C*                    SELEC
TCHK1C*          D@PRT     WHEQ '1'
TCHK1C*                    MOVEL'LANPRT03'@PRNTR  8
TCHK1C*          D@PRT     WHEQ '2'
TCHK1C*                    MOVEL'LANPRT02'@PRNTR  8
TCHK1C*          D@PRT     WHEQ '3'
TCHK1C*                    MOVEL'LANPRT07'@PRNTR  8
TCHK1C*                    ENDSL
      *
TCHK1C*                    MOVEACMD,1     ARY
TCHK1C*                    MOVEA@PRNTR    ARY,60
TCHK1C*                    MOVEAARY       P@CMD
TCHK1C*                    Z-ADD70        P@LEN
TCHK1C*                    CALL 'QCMDEXC' P#CMD
TCHK1C*                    OPEN GDLPR10
      *
     C           D@ORDT    IFNE *ZERO
     C                     Z-ADDD@ORDT    K@YMD
     C           K#1B      SETLLGDLPL1B
     C                     ELSE
     C           KEY1      SETLLGDLPL101
     C                     ENDIF
      *
     C                     DO   *HIVAL
     C           D@ORDT    IFNE *ZERO
     C           K#1B      READEGDLPL1B                  10
     C                     ELSE
     C           KEY1      READEGDLPL10                  10
     C                     ENDIF
      *
     C           *IN10     IFEQ '1'
     C                     LEAVE
     C                     ELSE
      *
     C           LBSKJY    IFEQ 'D'
     C           LBSKHZ    ANDLE*DATE
     C                     ELSE
TCHK1C*
TCHK1C**JW1      F1@ASJ    IFNE *BLANK
TCHK2C**         LBSIRE    IFEQ 0002
TCHK2C**         LBSIRE    OREQ 8990
TCHK2C**                   ELSE
TCHK2C**                   ITER
TCHK2C**                   END
TCHK1C**                   ELSE
TCHK1C**         LBSIRE    IFNE 4511
TCHK1C**                   ITER
TCHK1C**                   END
TCHK1C**                   END
      *
JW1  C           F1@ASJ    IFNE *BLANK
 |   C           LBSIRE    IFEQ 0002
 |   C           LBSIRE    OREQ 8990
 |   C                     ELSE
 |   C                     ITER
 |   C                     ENDIF
 |   C                     ENDIF
 |    *
 |   C           F1@OK     IFNE *BLANK
 |   C           LBSIRE    IFEQ 4511
 |   C                     ELSE
 |   C                     ITER
 |   C                     ENDIF
 |   C                     ENDIF
 |    *
 |   C           F1@NSC    IFNE *BLANK
 |   C           LBSIRE    IFEQ 4530
 |   C                     ELSE
 |   C                     ITER
 |   C                     ENDIF
JW1  C                     ENDIF
      *
JW2  C           F1@CHR    IFNE *BLANK
 |   C           LBSIRE    IFEQ 4540
 |   C                     ELSE
 |   C                     ITER
 |   C                     ENDIF
JW2  C                     ENDIF
      *
JW3  C           F1@POS    IFNE *BLANK
 |   C           LBSIRE    IFEQ 4550
 |   C                     ELSE
 |   C                     ITER
 |   C                     ENDIF
JW3  C                     ENDIF
      *
JW3  C           F1@TSU    IFNE *BLANK
 |   C           LBSIRE    IFEQ 4560
 |   C                     ELSE
 |   C                     ITER
 |   C                     ENDIF
JW3  C                     ENDIF
      *
     C                     Z-ADD0         ITEM    50
     C                     Z-ADD0         MAIS    30
     C           *IN77     IFEQ '0'
     C                     SETON                     77
     C                     Z-ADD*YEAR     YEAR
     C                     Z-ADDUMONTH    MONTH
     C                     Z-ADDUDAY      DAY
     C                     Z-ADDLBODR1    ORDER1
     C                     Z-ADDLBODR2    ORDER2
     C                     Z-ADDLBODR3    ORDER3
     C                     WRITEGDLPR101
     C                     END
      *
     C           *IN95     IFEQ '1'
     C                     SETOF                     95
     C                     WRITEGDLPR101
     C                     END
      *
     C                     Z-ADDLBITEM    ITEM
     C                     Z-ADDLBMAIS    MAIS
     C                     MOVELLBPTCD    LAPTCD
     C                     MOVELLBZAIS    LAZAIS
     C                     Z-ADDLBZAIK    LAZAIK
      *
     C                     WRITEGDLPR102
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
TCHK1C* OVRPRTF
TCHK1C* FILE(GDLPR10) DEVTYPE(*AFPDS) PAGESIZE(66 80) OUTQ(        )
** MSG
E-01 ENTER ORDER NUMBER!
E-02 SELECT A PRINTER!
E-03 SELECT ONE SUPPLIER!
