     H            Y/
     F***************************************************
     F*   MATERIAL - SCANNED & INPUT MANUALLY           *
     F*                                                 *
     F*                                                 *
     F***************************************************
     FGDLPW06 CF  E                    WORKSTN
     F                                              KINFDS @INFDS
     FGDLWL01 IF  E           K        DISK
     FIZAPL02 IF  E           K        DISK
     FGDLWP03 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *------------------------------------------------------------
     E                    MSG     1   1 78
     E                    TTL     1   1 45
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #DSP01
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#KEY     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#IZA     KLIST
     C                     KFLD           W@PTCD
     C                     KFLD           W@ZETI
      *
     C           *LIKE     DEFN ZCZAIK    W@ZAIK
     C           *LIKE     DEFN ZCZAIS    W@ZAIS
     C           *LIKE     DEFN WAPTCD    W@PTCD
     C           *LIKE     DEFN WAZETI    W@ZETI
      *
     C                     MOVEL'01'      W@ID    2
     C                     TIME           W@TIME  60
      *
     C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #DSP01    BEGSR
      *
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C           *INKC     OREQ *ON
     C                     MOVEL'99'      W@ID
      *
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     MOVEL'99'      W@ID
     C                     EXSR #OUT
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
     C                     Z-ADDD@DATE    K@YMD
     C           K#KEY     CHAINGDLWL01              90
     C   90      K#KEY     CHAINGDLWP03              90
     C           *IN90     IFEQ *ON
     C                     SETON                     9961
     C                     MOVE MSG,1     D@MSG
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CLEAR
      *------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00000000'*IN,60
     C                     MOVE *BLANK    D@MSG
      *
     C                     ENDSR
      *------------------------------------------------------
      *  OUTPUT
      *------------------------------------------------------
     C           #OUT      BEGSR
      *
     C                     MOVE *ALL'-'   @@LINE 66
     C                     MOVE *OFF      *IN98
     C                     MOVE *BLANK    W@PTCD
     C                     MOVE *BLANK    W@ZETI
     C                     Z-ADD*ZERO     W@CNT   30
      *
     C           K#KEY     SETLLGDLWL01
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEGDLWL01                  90
     C           *IN90     IFEQ *OFF
      *
     C           *INOF     IFEQ *ON
     C           *IN98     OREQ *OFF
     C                     EXCPT@HED
     C                     EXCPT@HED1
     C                     ENDIF
      *
     C           W@PTCD    IFNE *BLANK
     C           W@PTCD    IFNE WAPTCD
     C           W@ZETI    ORNE WAZETI
     C                     EXSR #DTL1
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE WAPTCD    W@PTCD
     C                     MOVE WAZETI    W@ZETI
     C                     ADD  1         W@CNT
      *
     C  N98                MOVE *ON       *IN98
     C                     ENDIF
     C                     ENDDO
      *
     C           W@CNT     IFNE *ZERO
     C                     EXSR #DTL1
     C                     ENDIF
      * MANUAL INPUT
     C                     MOVE *BLANK    W@ZAIS
     C                     Z-ADD*ZERO     W@ZAIK
     C                     Z-ADD*ZERO     W@CNT   30
     C                     MOVE *OFF      *IN97
     C           K#KEY     SETLLGDLWP03
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEGDLWP03                  90
     C           *IN90     IFEQ *OFF
     C           GASKJY    ANDEQ*BLANK
      *
     C           *INOF     IFEQ *ON
     C           *IN98     OREQ *OFF
     C                     EXCPT@HED
     C                     EXCPT@HED2
     C                     ELSE
     C           *IN97     IFEQ *OFF
     C                     EXCPT@HED2
     C                     ENDIF
     C                     ENDIF
      *
     C           W@ZAIS    IFNE GAZAIS
     C           W@ZAIK    ORNE GAZAIK
     C           W@CNT     IFNE *ZERO
     C                     EXSR #DTL2
     C                     ENDIF
     C                     ENDIF
      *
     C  N98                MOVE *ON       *IN98
     C  N97                MOVE *ON       *IN97
      *
     C                     MOVE GAZAIS    W@ZAIS
     C                     Z-ADDGAZAIK    W@ZAIK
     C                     ADD  GAMAIS    W@CNT
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           W@CNT     IFNE *ZERO
     C                     EXSR #DTL2
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #DTL1     BEGSR
      *------------------------------------------------------
     C                     MOVE *BLANK    W@ZAIS
     C                     Z-ADD*ZERO     W@ZAIK
     C           K#IZA     SETGTIZAPL02
     C           *IN95     DOUEQ*ON
     C           K#IZA     REDPEIZAPL02                  95
     C           *IN95     IFEQ *OFF
     C           ZCSKJY    ANDEQ*BLANK
     C                     MOVE ZCZAIS    W@ZAIS
     C                     Z-ADDZCZAIK    W@ZAIK
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     EXCPT@DTL1
     C                     Z-ADD*ZERO     W@CNT
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #DTL2     BEGSR
      *------------------------------------------------------
      *
     C                     EXCPT@DTL2
     C                     Z-ADD*ZERO     W@CNT
      *
     C                     ENDSR
      *------------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         UDATE Y   59
     O                                   62 'P.'
     O                         PAGE  Z   66
     O        E   02           @HED
     O                         TTL,1     47
     O                         W@TIME    59 '  :  :  '
     O        E   03           @HED
     O                                      'DATE:'
     O                         D@DATE       '    /  /  '
     O        E   05           @HED
     O                                   13 'MATERIAL'
     O                                   28 'DIAMETER'
     O                                   43 '# OF KANBANS'
     O        E   06           @HED
     O                         @@LINE    66
     O        E 1              @HED1
     O                                    9 '<SCANNED>'
     O        E 1              @DTL1
     O                         W@ZAIS    20
     O                         W@ZAIK4   26
     O                         W@CNT J   39
     O        E 1              @HED2
     O                                   16 '<MANUALLY INPUT>'
     O        E 1              @DTL2
     O                         W@ZAIS    20
     O                         W@ZAIK4   26
     O                         W@CNT J   39
**  MSG
     NO DATA
** TTL
<< MATERIAL LIST: SCANNED & INPUT MANUALLY >>
