     H            Y.                                    1
      ** GDLR01 ******************************
      *  MATERIAL ORDER DATA READIMG SYSTEM  *
      *                K.YASUDA  2000.06.30  *
TCH87 *       TCH     2054.07.18 ADDED IICSD FILE
TCHK  *       TCHK    2005.09.14 ADD 4511(O&K)
TCHK1 *       TCHK1   2008.01.01 CHG 0002 TO 8990
TCHK2 *       TCHK2   2012.06.15 ADD O&K NEW BARCODE,FUNCTION
JW1   *       JW      2018.01.11 ADD 4530(NSCI)
JW2   *       JW      2020.09.01 ADD 4540(CHARTER STEEL)
JW3   *       JW      2020.12.23 ADD 4550(POSCO)
JW3   *       JW      2021.01.04 ADD 4560(TSUSHO)
      *       LEC     2022.10.12 IF SCAN > 1 YR, NO ERROR
      ***************************** GDLPW01 **
     FGDLPW01 CF  E                    WORKSTN
     FGDLPL01 UF  E           K        DISK                      A
     FGDLPL20 UF  E           K        DISK                      A
     FFGBPL01 IF  E           K        DISK
     FIZAPL01 IF  E           K        DISK
     FIZBPL01 IF  E           K        DISK
     FIZAPL02 IF  E           K        DISK
     FIZBPL02 IF  E           K        DISK
TCHK2FGDLQP01 IF  E           K        DISK
JW1  FGDLQP02 IF  E           K        DISK
JW2  FGDLQP03 IF  E           K        DISK
JW3  FGDLQP04 IF  E           K        DISK
JW3  FGDLQP05 IF  E           K        DISK
     FGDLWP01 IF  E           K        DISK                      A
TCHK2FGDLWL012IF  E           K        DISK
TCHK2F            GDLWP011                          KRENAMEGDLWL01B
TCH87FIICSD   IF  E           K        DISK                      A
      *
     E                    ER      1   9 59               ERROR MSG
     E                    CD1     1  43  1   CD2     2 0 C/D
     E                    @BCD       16  1               BARCODE C/D
     E                    #BCD       16  2 0             BARCODE C/D
TCHK I*
TCHK1I* ASJ(8990) BARCODE FORMAT
     I            DS
     I                                        1  17 PBAR
     I                                        1   60@ODR
     I                                        7  110@CAS
     I                                       12  12 @PCD
     I                                       13  16 @ZET
     I                                       17  17 @CHK
     I                                        1  16 @BCD
      ** O&K(4511), NSCI(4530) & CHARTER(4540) BARCODE FORMAT
TCHK I            DS
TCHK I                                        1   8 PBAR8
TCHK I                                        1   1 @#COCD
TCHK I                                        2   5 @#ZETI
TCHK I                                        6   8 @#HKNO
      *
TCHK2I            DS
TCHK2I                                        1  17 PBAROK
TCHK2I                                        1   1 @@COCD
TCHK2I                                        2   5 @@ZETI
TCHK2I                                        6  12 @@M#
TCHK2I                                       13  15 @@HKNO
TCHK2I                                       16  16 @@FILR
TCHK2I                                       17  17 @@CHKD
      *
     I            DS
     I                                        1   80LASKHZ
     I                                        1   40LASKYY
     I                                        5   60LASKMM
     I                                        7   80LASKDD
     I            DS
     I                                        1   80LAKOHZ
     I                                        1   40LAKOYY
     I                                        5   60LAKOMM
     I                                        7   80LAKODD
     I            DS
     I                                        1   60LAKOTI
     I                                        1   20LAKOHH
     I                                        3   40LAKOSS
     I            DS
     I                                        1   80LARDHZ
     I                                        1   40LAREDY
     I                                        5   60LAREDM
     I                                        7   80LAREDD
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
     I            DS
     I                                        1   80ZDSKHZ
     I                                        1   40ZDSKYY
     I                                        5   60ZDSKMM
     I                                        7   80ZDSKDD
     I            DS
     I                                        1   80ZCUKHZ
     I                                        1   40ZCUKYY
     I                                        5   60ZCUKMM
     I                                        7   80ZCUKDD
     I            DS
     I                                        1   80ZCSTHZ
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
     I            DS
     I                                        1   80ZDUKHZ
     I                                        1   40ZDUKYY
     I                                        5   60ZDUKMM
     I                                        7   80ZDUKDD
     I            DS
     I                                        1   80ZDSTHZ
     I                                        1   40ZDSTYY
     I                                        5   60ZDSTMM
     I                                        7   80ZDSTDD
     I            DS
     I                                        1   80WATOHZ
     I                                        1   40WATOYY
     I                                        5   60WATOMM
     I                                        7   80WATODD
     I            DS
     I                                        1  17 WABRCD
     I                                        1   60WAODER
     I                                        7  110WACASE
     I                                       12  12 WAPTCD
     I                                       13  16 WAZETI
     I                                       17  17 WACHCK
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80LCSKHZ
     I                                        1   40LCSKYY
     I                                        5   60LCSKMM
     I                                        7   80LCSKDD
     I            DS
     I                                        1   80LCKOHZ
     I                                        1   40LCKOYY
     I                                        5   60LCKOMM
     I                                        7   80LCKODD
     I            DS
     I                                        1   60LCKOTM
     I                                        1   20LCKOHH
     I                                        3   40LCKOSS
      *
     I            DS
     I                                        1   80LDSKHZ
     I                                        1   40LDSKYY
     I                                        5   60LDSKMM
     I                                        7   80LDSKDD
     I            DS
     I                                        1   80LDKOHZ
     I                                        1   40LDKOYY
     I                                        5   60LDKOMM
     I                                        7   80LDKODD
     I            DS
     I                                        1   60LDKOTM
     I                                        1   20LDKOHH
     I                                        3   40LDKOSS
TCH87I            DS
   | I                                        1  140DTTM
   | I                                        1   60DTIM
TCH87I                                        7  140DDAT
TCHK2I            DS
TCHK2I                                        1   60GQODR
TCHK2I                                        1   20GQODR1
TCHK2I                                        3   40GQODR2
TCHK2I                                        5   60GQODR3
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *-------------*
      * KEY1 - KEY4 *
      *-------------*
     C           KEY1      KLIST
     C                     KFLD           PWIR
     C                     KFLD           PSIZ
     C                     KFLD           PKOJ
     C                     KFLD           PSIR
      *
     C           KEY2      KLIST
     C                     KFLD           @PCD
     C                     KFLD           @ZET
     C                     KFLD           @ODR
     C                     KFLD           @CAS
     C*                    KFLD           @CHK
      *
     C           KEY3      KLIST
     C                     KFLD           PSIR
     C                     KFLD           PWIR
     C                     KFLD           PSIZ
      *
     C           KEY4      KLIST
TCHK C*                    KFLD           @PCD
TCHK C*                    KFLD           @ZET
TCHK C                     KFLD           W@PCD   1
TCHK C                     KFLD           W@ZET   4
      *
     C           KEY5      KLIST
     C                     KFLD           ZAIS   15
     C                     KFLD           ZAIK    52
TCH87C           KEY11     KLIST
   | C                     KFLD           XXKNO2
TCH87C                     KFLD           XXKNO3
      *
      *****************************************************************
      *  GET DATE OF ONE YEAR AGO....
      *
     C                     TIME           DTTM
     C                     MOVELDDAT      CURDAT
      *
     C                     CALL 'UTLR10'
     C                     PARM           CURDAT  8
     C                     PARM '-'       SIGN    1
     C                     PARM '0365'    DAYS    4
     C                     PARM 'N'       IAFNO   1
     C                     PARM           PRVDAT  8
     C                     PARM           RTN     1
      *
     C                     MOVELPRVDAT    ONEYR   80       1 YEAR AGO
      *
      *****
TCH87C           *HIVAL    SETGTIICSD01
   | C                     READPIICSD01                  94
     C           *IN94     IFEQ '0'
     C                     Z-ADDIIIDNO    ID#     60
     C                     ELSE
   | C                     Z-ADD0         ID#     60
TCH87C                     END
      *----------*
      * SCREEN 1 *
      *----------*
     C           STPA      TAG
     C                     MOVE *BLANK    PSIRE
      *
     C           STP0      TAG
     C                     EXFMTGDLPW011
     C                     SETOF                     0199
      *
B0   C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
E0   C                     END
      *
B0   C           PSIRE     IFEQ *BLANK
     C                     MOVELER,5      MSG
     C                     SETON                     0199
     C                     GOTO STP0
E0   C                     END
      *
     C                     MOVEL'0111'    PKOJ    40
     C                     MOVELPSIRE     PSIR    40
      *
     C           PSIR      CHAINFGBPL011             05
B0   C           *IN05     IFEQ '1'
     C                     SETON                     0199
     C                     MOVELER,6      MSG
     C                     GOTO STP0
E0   C                     END
      *
B0   C           *IN05     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     0199
     C                     MOVELER,6      MSG
     C                     GOTO STP0
     C                     END
E0   C                     END
      *
TCHK2C                     MOVEL*ON       W@OKNW  1
      *
     C           STP1      TAG
     C                     MOVE *BLANK    PBAR
TCHK C                     MOVE *BLANK    PBAR8
TCHK2C                     MOVE *BLANK    PBAROK
      *----------*
      * SCREEN 2 *
      *----------*
     C           STP2      TAG
TCHK C*
TCHK2C           PSIRE     IFEQ '8990'
TCHK2C           W@OKNW    OREQ *ON
     C                     EXFMTGDLPW012
TCHK2C                     ELSE
TCHK2C                     EXFMTGDLPW01B
TCHK2C                     END
     C                     SETOF                     0199
      *
     C           *INKC     IFEQ '1'
     C                     GOTO STPA
     C                     END
      *
     C           *INKG     IFEQ '1'
TCHK2C           PSIRE     IFEQ '4511'
JW1  C           PSIRE     OREQ '4530'
JW2  C           PSIRE     OREQ '4540'
JW3  C           PSIRE     OREQ '4550'
JW3  C           PSIRE     OREQ '4560'
TCHK2C           W@OKNW    IFEQ *ON
TCHK2C                     MOVEL*OFF      W@OKNW
TCHK2C                     ELSE
TCHK2C                     MOVEL*ON       W@OKNW
TCHK2C                     ENDIF
TCHK2C                     ENDIF
      *
     C                     GOTO STP2
     C                     ENDIF
      *
TCHK1C           PSIRE     IFEQ '8990'
     C           PBAR      IFEQ *BLANK
     C                     GOTO STP2
     C                     ENDIF
TCHK C                     ELSE
TCHK2C           W@OKNW    IFEQ *ON
TCHK2C           PBAR      IFEQ *BLANK
TCHK2C                     GOTO STP2
TCHK2C                     END
TCHK2C                     ELSE
TCHK C           PBAR8     IFEQ *BLANK
TCHK C                     GOTO STP2
TCHK C                     END
TCHK2C                     END
TCHK C                     END
      *
TCHK2C           W@OKNW    IFEQ *ON
TCHK2C                     MOVELPBAR      PBAROK
TCHK2C                     ELSE
TCHK2C                     MOVEL*BLANK    PBAROK
TCHK2C                     END
TCHK2 *
TCHK1C           PSIRE     IFEQ '8990'
     C           @PCD      IFNE 'W'
     C           @PCD      ANDNE'R'
     C                     SETON                     99
     C                     MOVELER,9      MSG
     C                     GOTO STP2
     C                     END
TCHK C                     ELSE
TCHK2C           W@OKNW    IFEQ *ON
TCHK2C           @@COCD    IFNE 'W'
TCHK2C                     SETON                     99
TCHK2C                     MOVELER,9      MSG
TCHK2C                     GOTO STP2
TCHK2C                     END
TCHK2C                     ELSE
TCHK C           @#COCD    IFNE 'W'
TCHK C                     SETON                     99
TCHK C                     MOVELER,9      MSG
TCHK C                     GOTO STP2
TCHK C                     END
TCHK2C                     END
TCHK C                     END
TCHK  *
TCHK  *
     C                     GOTO JUMP
TCHK  *
TCHK  *
TCHK  *
      *---------------*
      * CHECK DEGITTE *
      *---------------*
B0   C                     DO   16        L       20
     C                     Z-ADD1         L1      20
     C           @BCD,L    LOKUPCD1,L1                   10
     C           *IN10     IFEQ '0'
     C                     SETON                     99
     C                     MOVELER,1      MSG
     C                     GOTO STP2
     C                     ELSE
     C                     Z-ADDCD2,L1    #BCD,L
     C                     END
E0   C                     ENDDO
      *
     C                     XFOOT#BCD      WKBAR   40
     C           WKBAR     DIV  43        WKBAR1  40
     C                     MVR            L1
     C                     ADD  1         L1
B0   C           CD1,L1    IFNE @CHK
     C                     SETON                     0199
     C                     MOVELER,1      MSG
     C                     GOTO STP2
E0   C                     ENDIF
      *
TCHK  *
     C           JUMP      TAG
TCHK  *
TCHK  *
TCHK1C           PSIRE     IFEQ '8990'
TCHK C                     MOVEL@PCD      W@PCD
TCHK C                     MOVEL@ZET      W@ZET
TCHK C                     ELSE
TCHK2C           W@OKNW    IFEQ *ON
TCHK C                     MOVEL@@COCD    W@PCD
TCHK C                     MOVEL@@ZETI    W@ZET
TCHK2C                     ELSE
TCHK C                     MOVEL@#COCD    W@PCD
TCHK C                     MOVEL@#ZETI    W@ZET
TCHK2C                     END
TCHK C                     END
TCHK  *
      *-------------*
      * WIRE KANBAN *
      *-------------*
     C                     MOVE *BLANK    PZET    4
     C                     MOVE *BLANK    ZAIS   15
     C                     Z-ADD0         ZAIK    52
TCHK C*          @PCD      IFEQ 'W'
TCHK C           W@PCD     IFEQ 'W'
     C                     SETOF                     20
     C           KEY4      SETGTIZAPL02
B1   C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY4      REDPEIZAPL021                 10
      *
B2   C           *IN10     IFEQ '0'
B3   C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ELSE
B4   C           ZCUKHZ    IFLE *DATE
     C           ZCSTHZ    ANDGT*DATE
B5   C           ZCKAKE    IFNE PSIR
     C                     SETON                     0199
     C                     MOVELER,7      MSG
     C                     GOTO STP2
E5   C                     END
     C                     MOVELZCZAIS    ZAIS
     C                     MOVELZCZAIK    ZAIK
     C                     SETON                     20
E4   C                     END
E3   C                     END
E2   C                     END
E1   C  N10                ENDDO
      *
B1   C           *IN20     IFEQ '0'
     C                     SETON                     010299
     C                     MOVELER,7      MSG
     C                     GOTO STP2
E1   C                     END
E0   C                     END
      *------------*
      * ROD KANBAN *
      *------------*
TCHK C*          @PCD      IFEQ 'R'
TCHK C           W@PCD     IFEQ 'R'
     C                     SETOF                     20
     C           KEY4      SETGTIZBPL02
B1   C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY4      REDPEIZBPL021                 10
      *
B2   C           *IN10     IFEQ '0'
B3   C           ZDSKJY    IFEQ 'D'
     C           ZDSKHZ    ANDLE*DATE
     C                     ELSE
B4   C           ZDUKHZ    IFLE *DATE
     C           ZDSTHZ    ANDGT*DATE
B5   C           ZDSIRE    IFNE PSIR
     C                     SETON                     0199
     C                     MOVELER,8      MSG
     C                     GOTO STP2
E5   C                     END
     C                     MOVELZDZAIS    ZAIS
     C                     MOVELZDZAIK    ZAIK
     C                     SETON                     20
E4   C                     END
E3   C                     END
E2   C                     END
E1   C  N10                ENDDO
      *
B1   C           *IN20     IFEQ '0'
     C                     SETON                     010299
     C                     MOVELER,8      MSG
     C                     GOTO STP2
E1   C                     END
E0   C                     END
      *
     C                     SETOF                     10
TCHK1C           PSIRE     IFEQ '8990'
     C           KEY2      CHAINGDLWP011             10
B0   C           *IN10     IFEQ '0'
 B1  C           WATOHZ    IFGT ONEYR
     C                     MOVELER,2      MSG
     C                     SETON                     0199
     C                     GOTO STP2
 E1  C                     END
E0   C                     END
TCHK C                     END
TCHK2C*
B0   C           W@OKNW    IFEQ *ON
TCHK2C           K#012     KLIST
TCHK2C                     KFLD           @@M#
TCHK2C                     KFLD           @@HKNO
TCHK2C           K#012     CHAINGDLWL012             10
 B1  C           *IN10     IFEQ '0'
  B2 C           WATOHZ    IFGT ONEYR
TCHK2C                     MOVELER,2      MSG
TCHK2C                     SETON                     0199
TCHK2C                     GOTO STP2
  E2 C                     END
 E1  C                     END
E0   C                     END
      *
     C                     SETON                         U1
     C                     MOVELPSIR      WASIRE
     C                     MOVEL'0111'    WAUKEI
     C                     MOVEL*BLANK    WAUKOJ
     C                     MOVEL*BLANK    WAUUKE
     C                     Z-ADD0         WATOHZ
TCHK1C           PSIRE     IFEQ '8990'
     C                     MOVELPBAR      WABRCD
TCHK2C                     MOVEL*BLANK    WAM#
TCHK2C                     MOVEL*BLANK    WAC#
TCHK C                     ELSE
TCHK2C           W@OKNW    IFEQ *ON
TCHK2C                     MOVEL@@COCD    WAPTCD
TCHK2C                     MOVEL@@ZETI    WAZETI
TCHK2C                     MOVEL@@HKNO    W##03N  30
TCHK2C                     Z-ADDW##03N    WACASE
TCHK2C                     MOVEL@@CHKD    WACHCK
TCHK2C                     MOVEL@@M#      WAM#
TCHK2C                     MOVEL@@HKNO    WAC#
      *
     C**JW2      PSIRE     IFEQ '4511'
TCHK2C**         K#012     SETLLGDLQP01
     C**                   ELSE
JW1  C**         K#012     SETLLGDLQP02
     C**                   ENDIF
      *
JW2  C                     SELEC
 |   C           PSIRE     WHEQ '4511'
 |   C           K#012     SETLLGDLQP01
 |    *
 |   C           PSIRE     WHEQ '4530'
 |   C           K#012     SETLLGDLQP02
 |    *
 |   C           PSIRE     WHEQ '4540'
JW2  C           K#012     SETLLGDLQP03
      *
JW3  C           PSIRE     WHEQ '4550'
JW3  C           K#012     SETLLGDLQP04
      *
JW3  C           PSIRE     WHEQ '4560'
JW3  C           K#012     SETLLGDLQP05
     C                     ENDSL
      *
TCHK2C                     DO   *HIVAL
     C**JW2      PSIRE     IFEQ '4511'
TCHK2C**         K#012     READEGDLQP01                  88
     C**                   ELSE
JW1  C**         K#012     READEGDLQP02                  88
     C**                   ENDIF
      *
JW2  C                     SELEC
 |   C           PSIRE     WHEQ '4511'
 |   C           K#012     READEGDLQP01                  88
 |    *
 |   C           PSIRE     WHEQ '4530'
 |   C           K#012     READEGDLQP02                  88
 |    *
 |   C           PSIRE     WHEQ '4540'
JW2  C           K#012     READEGDLQP03                  88
      *
JW3  C           PSIRE     WHEQ '4550'
JW3  C           K#012     READEGDLQP04                  88
      *
JW3  C           PSIRE     WHEQ '4560'
JW3  C           K#012     READEGDLQP05                  88
     C                     ENDSL
      *
TCHK2C   88                LEAVE
TCHK2C           GQSKJY    IFNE *BLANK
TCHK2C                     ITER
TCHK2C                     END
TCHK2C                     LEAVE
TCHK2C                     ENDDO
      *
TCHK2C           *IN88     IFEQ *OFF
TCHK2C                     Z-ADDGQODR     WAODER
TCHK2C                     ELSE
TCHK2C                     Z-ADD*ZERO     WAODER
TCHK2C                     END
TCHK2C                     ELSE
TCHK C                     MOVEL@#COCD    WAPTCD
TCHK C                     MOVEL@#ZETI    WAZETI
TCHK C                     MOVEL@#HKNO    W##03N  30
TCHK C                     Z-ADDW##03N    WACASE
TCHK C                     Z-ADD*ZERO     WAODER
TCHK C                     MOVEL*BLANK    WACHCK
TCHK2C                     END
TCHK C                     END
     C                     WRITEGDLWP011
TCH87C                     EXSR #IICSD
      *------------------*
      * SUPPLEMENT STOCK *
      *------------------*
     C                     SETOF                     25
     C           KEY5      CHAINGDLPL201             25
      *
     C           *IN25     IFEQ '0'
     C           LCSKJY    IFEQ 'D'
     C           LCSKHZ    ANDLE*DATE
     C                     SETON                       25
     C                     END
     C                     END
      *
     C                     MOVE *BLANK    LCSKJY
     C                     Z-ADD0         LCSKHZ
     C                     Z-ADD*DATE     LCKOHZ
     C                     TIME           LCKOTM
     C                     MOVELUS        LCKOME
      *
     C                     MOVELZAIS      LCZAIS
     C                     Z-ADDZAIK      LCZAIK
     C                     MOVELLAZETI    LCZETI
     C                     MOVELLAPTCD    LCPTCD
     C           *IN25     IFEQ '1'
     C                     Z-ADD-1        LCSTCK
     C                     ELSE
     C                     SUB  1         LCSTCK
     C                     END
     C           *IN25     IFEQ '1'
     C                     WRITEGDLPL201
     C                     ELSE
     C                     UPDATGDLPL201
     C                     END
      *
     C                     GOTO STP1
      *
     C           STP3      TAG
     C                     MOVE *BLANK    PWIR
     C                     Z-ADD0         PSIZ
     C                     Z-ADD0         PMAI
     C                     MOVE 'W'       PCOD
     C                     Z-ADD*DATE     PDAT
      *----------*
      * SCREEN 3 *
      *----------*
     C           STP4      TAG
     C                     EXFMTGDLPW013
     C                     SETOF                     010203
     C                     SETOF                     040599
      *-------*
      * CMD-3 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO STP1
     C                     END
      *-------------*
      * WIRE KANBAN *
      *-------------*
     C                     MOVE *BLANK    PZET    4
     C           PCOD      IFEQ 'W'
     C                     SETOF                     20
     C           KEY1      SETGTIZAPL01
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      REDPEIZAPL011                 10
      *
     C           *IN10     IFEQ '0'
     C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZCUKHZ    IFLE PDAT
     C           ZCSTHZ    ANDGTPDAT
     C                     SETON                     20
     C                     MOVELZCKNO3    PZET
     C                     END
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C           *IN20     IFEQ '0'
     C                     SETON                     010299
     C                     MOVELER,3      MSG
     C                     GOTO STP4
     C                     END
     C                     END
      *------------*
      * ROD KANBAN *
      *------------*
     C           PCOD      IFEQ 'R'
     C                     SETOF                     20
     C           KEY1      SETGTIZBPL01
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      REDPEIZBPL011                 10
      *
     C           *IN10     IFEQ '0'
     C           ZDSKJY    IFEQ 'D'
     C           ZDSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZDUKHZ    IFLE PDAT
     C           ZDSTHZ    ANDGTPDAT
     C                     SETON                     20
     C                     MOVELZDKNO3    PZET
     C                     END
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C           *IN20     IFEQ '0'
     C                     SETON                     010299
     C                     MOVELER,4      MSG
     C                     GOTO STP4
     C                     END
     C                     END
      *-------*
      * CMD-5 *
      *-------*
     C           *INKE     IFEQ '0'
     C                     GOTO STP4
     C                     END
      *
     C                     SETOF                     15
     C           KEY3      CHAINGDLPL011             15
      *
     C                     MOVE *BLANK    LASKJY
     C                     Z-ADD0         LASKHZ
     C                     Z-ADD0         LAKOHZ
     C                     TIME           LAKOTI
     C                     MOVELUS        LAKOME
     C                     MOVELPSIR      LASIRE
     C                     MOVEL'0111'    LAUKEI
     C                     MOVEL*BLANK    LAUKOJ
     C                     MOVEL*BLANK    LAUUKE
     C                     MOVELPWIR      LAZAIS
     C                     Z-ADDPSIZ      LAZAIK
     C                     MOVELPZET      LAZETI
     C                     MOVELPCOD      LAPTCD
     C                     Z-ADDPMAI      LAMAIS
     C                     Z-ADDPDAT      LARDHZ
      *
     C           *IN15     IFEQ '1'
     C                     WRITEGDLPL011
     C                     ELSE
     C                     UPDATGDLPL011
     C                     END
     C           *IN55     IFEQ '0'
     C                     SETON                     55
     C                     TIME           @@TIME  60
      *
     C                     Z-ADD0         MAIS    30
     C                     END
      *
     C                     SETON                     U1
     C                     GOTO STP3
TCH87C****************************************************************
     C           #IICSD    BEGSR                                     *
     C                     CLEARIICSD01
     C                     MOVE 'W'       XXKNO2  1
     C                     MOVE WAZETI    XXKNO3  4
     C           KEY11     CHAINIZAPL021             56
     C           *IN56     IFEQ '0'
     C                     MOVE ZCADR1    IILOC1
     C                     MOVE ZCADR2    IILOC2
     C                     MOVE ZCADR3    IILOC3
     C                     MOVE ZCADR4    IILOC4
     C                     ENDIF
     C                     ADD  1         ID#
     C                     Z-ADDID#       IIIDNO
     C                     MOVELZCZAIS    IIPAR1
      *DIAMENTER
     C                     MOVE ZCZAIK    D4      4
     C                     MOVELD4        D41     2
     C                     MOVE D4        D42     2
     C           D41       CAT  '.'       D43     3
     C           D43       CAT  D42       IIPAR2    P
     C                     MOVEL'C'       IITYPE
     C                     TIME           DTTM
     C                     Z-ADDDDAT      IIDATE
     C                     Z-ADDDTIM      IITIME
     C                     WRITEIICSD01
TCH87C                     ENDSR
**
E-01 M43 CHECK ERROR
E-02 KANBAN HAS ALREADY BEEN READ.
E-03 THIS IS NOT IN WIRE KANBAN MASTER FILE.
E-04 THIS IS NOT IN ROD KANBAN MASTER FILE.
E-05 ENTER SUPPLIER CODE.
E-06 SUPPLIER IS NOT CORRECT.
E-07 THIS KANBAN IS DIFFERENT FORM WIRE KANBAN MASTER.
E-08 THIS KANBAN IS DIFFERENT FROM ROD KANBAN MASTER.
E-09 KANBAN IS NOT CORRECT.
**
000
101
202
303
404
505
606
707
808
909
A10
B11
C12
D13
E14
F15
G16
H17
I18
J19
K20
L21
M22
N23
O24
P25
Q26
R27
S28
T29
U30
V31
W32
X33
Y34
Z35
-36
.37
 38
$39
/40
+41
%42
