     H            Y.                                    1
      ** GDLR40 *****************************
      *  MATERIAL ORDER VALIOUS LIST PRINT  *
      *               K.YASUDA  2000.11.21  *
      ***************************** GDLR40 **
     FGDLPW40 CF  E                    WORKSTN
     FFGBPL01 IF  E           K        DISK
     FGDLPL10 IF  E           K        DISK
     FGDLPL12 IF  E           K        DISK
     FGDLWP4A O   F     128            DISK
     E                    ER      1   5 59
     E                    MD1     1   2  1   MD2    20
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     I            DS
     I                                        1   80LBSKHZ
     I                                        1   40LBSKYY
     I                                        5   60LBSKMM
     I                                        7   80LBSKDD
      *
     I            DS
     I                                        1   6 ISODR
     I                                        5   60IODR1
     I                                        8   90IODR2
     I                                       11  120IODR3
      *
     I            DS
     I                                        1   60LBODER
     I                                        1   20LBODR1
     I                                        3   40LBODR2
     I                                        5   60LBODR3
      *
     I            DS
     I                                        1   80LBKNHZ
     I                                        1   40LBKANY
     I                                        5   60LBKANM
     I                                        7   80LBKAND
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           PNO     1
      *------*
      * KEY1 *
      *------*
     C           KEY1      KLIST
     C                     KFLD           IODR1
     C                     KFLD           IODR2
     C                     KFLD           IODR3
      *
     C           KEY2      KLIST
     C                     KFLD           IZAIS
     C                     KFLD           IZAIK
      *
     C           KEY3      KLIST
     C                     KFLD           OSIRE
     C                     KFLD           IZAIS
     C                     KFLD           IZAIK
      *-----*
      * INZ *
      *-----*
     C           STP1      TAG
     C                     MOVE *BLANK    @NO
     C                     MOVE *BLANK    ISIRE
     C                     MOVE *BLANK    IZAIS
     C                     Z-ADD0         IZAIK
     C                     MOVE *BLANK    ISODR
     C                     MOVE *BLANK    IEODR
      *----------*
      * SCREEN 1 *
      *----------*
     C           STP2      TAG
     C                     EXFMTGDLPW401
     C                     SETOF                     0199
      *-------*
      * CMD-1 *
      *-------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LRU1
     C                     RETRN
     C                     END
      *------------*
      * SELECT NO. *
      *------------*
     C           @NO       IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVELER,1      MSG
     C                     GOTO STP2
     C                     END
      *
     C           @NO       IFNE '1'
     C           @NO       ANDNE'2'
     C                     SETON                     0199
     C                     MOVELER,2      MSG
     C                     GOTO STP2
     C                     END
      *
     C                     Z-ADD1         A       20
     C           @NO       LOKUPMD1,A                    15
     C   15                MOVELMD2,A     ILIST
      *----------*
      * SCREEN 2 *
      *----------*
     C           STP3      TAG
     C                     EXFMTGDLPW402
     C                     SETOF                     010203
     C                     SETOF                     99
      *-------*
      * CMD-3 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO STP1
     C                     END
      *----------*
      * SUPPLIER *
      *----------*
     C           ISIRE     IFNE *BLANK
     C                     MOVELISIRE     OSIRE   40
     C                     SETOF                     10
     C           OSIRE     CHAINFGBPL01              10
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
      *
     C           *IN10     IFEQ '1'
     C                     SETON                     0199
     C                     MOVELER,3      MSG
     C                     GOTO STP3
     C                     END
     C                     END
      *-----------*
      * ORDER NO. *
      *-----------*
     C                     Z-ADD0         OSODR   60
     C                     Z-ADD0         OEODR   60
     C           ISODR     IFNE *BLANK
     C                     MOVELISODR     OSODR
     C                     END
      *
     C           IEODR     IFNE *BLANK
     C                     MOVELIEODR     OEODR
     C                     END
      *
     C           OSODR     IFNE 0
     C           OEODR     ANDNE0
     C           OSODR     IFGT OEODR
     C                     SETON                     020399
     C                     MOVELER,4      MSG
     C                     GOTO STP3
     C                     END
     C                     END
      *-------*
      * CMD-5 *
      *-------*
     C           *INKE     IFEQ '0'
     C                     GOTO STP3
     C                     END
      *
     C                     MOVE *BLANK    @CHK    1
     C           OSIRE     IFNE 0
     C           IZAIS     ANDNE*BLANK
     C           IZAIK     ANDNE0
     C           KEY3      SETLLGDLPL12
     C                     DO   *HIVAL
     C           KEY3      READEGDLPL12                  10
     C           *IN10     IFEQ '0'
     C           LBSKJY    IFEQ 'D'
     C           LBSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           OSODR     IFNE 0
     C           OEODR     ANDNE0
     C           LBODER    IFLT OSODR
     C           LBODER    ORGT OEODR
     C                     GOTO SKIP1
     C                     END
     C                     END
      *
     C           OSODR     IFNE 0
     C           OEODR     ANDEQ0
     C           LBODER    IFLT OSODR
     C                     GOTO SKIP1
     C                     END
     C                     END
      *
     C           OSODR     IFEQ 0
     C           OEODR     ANDNE0
     C           LBODER    IFGT OEODR
     C                     GOTO SKIP1
     C                     END
     C                     END
      *
     C*                    Z-ADD0         IMIMA   30
     C           @NO       IFEQ '1'
     C*          LBMAIS    SUB  LBREMA    IMIMA
     C*          IMIMA     IFNE 0
     C           LBKNHZ    IFEQ 0
     C                     EXCPTDT
     C                     MOVEL'*'       @CHK
     C                     END
     C*                    END
     C                     ELSE
     C*          LBMAIS    SUB  LBREMA    IMIMA
     C                     EXCPTDT
     C                     MOVEL'*'       @CHK
     C                     END
      *
     C           SKIP1     TAG
     C                     END
     C                     END
     C  N10                ENDDO
     C                     GOTO JUMP
     C                     END
      *
     C           *LOVAL    SETLLGDLPL10
     C                     DO   *HIVAL
     C                     SETOF                     10
     C                     READ GDLPL10                  10
     C           *IN10     IFEQ '0'
     C           LBSKJY    IFEQ 'D'
     C           LBSKHZ    ANDLE*DATE
     C                     ELSE
     C           OSIRE     IFNE 0
     C           LBSIRE    IFNE OSIRE
     C                     GOTO SKIP2
     C                     END
     C                     END
      *
     C           IZAIS     IFNE *BLANK
     C           LBZAIS    IFNE IZAIS
     C                     GOTO SKIP2
     C                     END
     C                     END
      *
     C           IZAIK     IFNE 0
     C           LBZAIK    IFNE IZAIK
     C                     GOTO SKIP2
     C                     END
     C                     END
      *
     C           OSODR     IFNE 0
     C           OEODR     ANDNE0
     C           LBODER    IFLT OSODR
     C           LBODER    ORGT OEODR
     C                     GOTO SKIP2
     C                     END
     C                     END
      *
     C           OSODR     IFNE 0
     C           OEODR     ANDEQ0
     C           LBODER    IFLT OSODR
     C                     GOTO SKIP2
     C                     END
     C                     END
      *
     C           OSODR     IFEQ 0
     C           OEODR     ANDNE0
     C           LBODER    IFGT OEODR
     C                     GOTO SKIP2
     C                     END
     C                     END
      *
     C*                    Z-ADD0         IMIMA
     C           @NO       IFEQ '1'
     C*          LBMAIS    SUB  LBREMA    IMIMA
     C*          IMIMA     IFNE 0
     C           LBKNHZ    IFEQ 0
     C                     EXCPTDT
     C                     MOVEL'*'       @CHK
     C                     END
     C*                    END
     C                     ELSE
     C*          LBMAIS    SUB  LBREMA    IMIMA
     C                     EXCPTDT
     C                     MOVEL'*'       @CHK
     C                     END
     C           SKIP2     TAG
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C           JUMP      TAG
     C           @CHK      IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,5      MSG
     C                     GOTO STP3
     C                     END
     C                     MOVEL@NO       PNO
     C                     SETON                     LR
     C                     RETRN
      *
     OGDLWP4A E                DT
     O                         LBSIRE     4
     O                         LBZAIS    19
     O                         LBZAIK    24
     O                         LBODR1    26
     O                         LBODR2    28
     O                         LBODR3    30
     O                         LBITEM    35
     O                         LBMAIS    38
     O                         LBODRY    42
     O                         LBODRM    44
     O                         LBODRD    46
     O*                        LBREMA    49
     O*                        IMIMA     52
** MSG
E-01 INPUT NO.
E-02 INPUT NUMBER IS DIFFERENT.
E-03 THIS IS NOT IN DETAIL MASTER FILE.
E-04 THE DATA IS PAST OF START DATA.
E-05 THIS IS NOT IN ORDER DATA FILE.
** MID
1NON-DELIVERY LIST
2HISTORY LIST
