     H            Y.                                    1
     H** GDLR20 ****************************************************************
     H* MATERIAL INSPECTION SYSTEM                                             *
     H*                                                                        *
     H* TCH 2000.08.11                                                         *
     H**************************************************************************
     H*
     H* *INKC = 1(CF03)
     H* *IN30 = ERROR
     H* *IN31 = 1(BARCODE ERROR)
     H* *IN32 = 1(NOT EXIST ACTUAL SHIPPED FILE)
     H* *IN33 = 1(ALREADY EXIST AP FILE)
     H* *IN34 = 1(NOT EXIST ORDERED FILE)
     H* *IN35 = 1(NOT EXIST ROD MATERIAL MASTER)
     H* *IN36 = 1(NOT EXIST IN-PROCESS FILE)
     H* *IN37 = 1(NOT EXIST FINISHED PART MASTER)
     H* *IN38 = 1(WRONG PART CODE)
     H* *IN39 = 1(UNIT PRICE MASTER)
     H* *IN90 = 1(GDLPL40 NOT READ)
     H* *IN91 = 1(GDLPL30 NOT READ)
     H* *IN92 = 1(GDLPL10 NOT READ)
     H* *IN93 = 1(GDLPL20 NOT READ)
     H* *IN94 = 1(GDLPL25 NOT READ)
     H* *IN95 = 1(IZAPP01 NOT READ)
     H* *IN96 = 1(IZAPP02 NOT READ)
     H* *IN97 = 1(GDLPP80 NOT READ)
     H**************************************************************************
     FGDLPW20 CF  E                    WORKSTN
     FIZAPL01 IF  E           K        DISK
     FIZBPL01 IF  E           K        DISK
     FGDLPL10 UF  E           K        DISK
     FGDLPL80 IF  E           K        DISK
     FGDLPL20 UF  E           K        DISK                      A
     FGDLPL25 UF  E           K        DISK
     FGDLPL30 UF  E           K        DISK
     FGDLPL40 UF  E           K        DISK                      A
     FQPRINT  O   F     132     OF     PRINTER
     F**************************************************************************
     E                    BCD        17  1
     E                    ERR     1  11 15
     I**************************************************************************
     I* BARCODE
     I            DS
     I                                        1  17 BCD
     I                                        1  17 BARCD
     I                                        1   2 BODR1
     I                                        1   20K11
     I                                        3   4 BODR2
     I                                        3   40K12
     I                                        5   6 BODR3
     I                                        5   60K13
     I                                        7  110BCASE
     I                                        7  11 K62
     I                                       12  12 BPTCD
     I                                       13  16 BZETI
     I* SYSTEM DATE
     I            DS
     I                                        1  120WWTIME
     I                                        1   60WTIME
     I                                        1   20WWHHHH
     I                                        3   40WWNNNN
     I                                        5   60WWSSSS
     I                                        7   80WWYYYY
     I                                        9  100WWMMMM
     I                                       11  120WWDDDD
     I* INSPECTION DATE(SHIPPING RESULT GDLPP30)
     I            DS
     I                                        1   80LEINDT
     I                                        1   40LEINSY
     I                                        5   60LEINSM
     I                                        7   80LEINSD
     I* INVOICE(SHIPPING RESULT GDLPP30)
     I            DS
     I                                        1   4 LEINV2
     I                                        1   40K61
     I* BEGINNING DATE(GDLPP80)
     I            DS
     I                                        1   80BDATE
     I                                        1   40LHSTYY
     I                                        5   60LHSTMM
     I                                        7   80LHSTDD
     I* ORDERED DATE(GDLPP10)
     I            DS
     I                                        1   80ODATE
     I                                        1   40LBODRY
     I                                        5   60LBODRM
     I                                        7   80LBODRD
     C**************************************************************************
     C           *NAMVAR   DEFN           GDKD01  20
     C                     IN   *NAMVAR
     C                     Z-ADDGDKD01    COUNT   20
     C*
     C           *ENTRY    PLIST
     C                     PARM           PUSR    6
     C* GDLPL30
     C           K1        KLIST
     C                     KFLD           K11              ORDER # 1
     C                     KFLD           K12                      2
     C                     KFLD           K13                      3
     C                     KFLD           K62              CASE #
     C                     KFLD           BPTCD            SEHIN KUBUN
     C                     KFLD           BZETI            ABSOLUTE #
     C* GDLPL20 & GDLPP25
     C           K2        KLIST
     C                     KFLD           LEZAIS
     C                     KFLD           LEZAIK
     C* GDLPL10
     C           K3        KLIST
     C                     KFLD           K11              ORDER # 1
     C                     KFLD           K12                      2
     C                     KFLD           K13                      3
     C                     KFLD           LEITEM           ITEM #
     C*                    KFLD           BPTCD            SEHIN KUBUN
     C*                    KFLD           BZETI            ABSOLUTE #
     C                     KFLD           LEZAIS           WIRE
     C                     KFLD           LEZAIK           WIRE DIAMETER
     C* IZAPP01 & IZAPP02
     C           K4        KLIST
     C                     KFLD           LEZAIS           WIRE
     C                     KFLD           LEZAIK           WIRE DIAMETER
     C                     KFLD           K42              RECEIVING
     C                     KFLD           K41              SUPPLIER
     C* GDLPL80
     C           K5        KLIST
     C                     KFLD           K51              SUPPLIER
     C                     KFLD           K52              SUPPLIER FACTORY
     C                     KFLD           LEZAIS           WIRE
     C                     KFLD           LEZAIK           WIRE DIAMETER
     C                     KFLD           LEPTCD           PART CODE   R
     C* GDLPP40
     C           K6        KLIST
     C                     KFLD           K11              ORDER # 1
     C                     KFLD           K12                      2
     C                     KFLD           K13                      3
     C                     KFLD           LEINV1           INVOIVE #1
     C                     KFLD           LEINV2                    2
     C                     KFLD           LEITEM           ITEM #
     C                     KFLD           K62              CASE #
     C                     KFLD           LEZAIS           WIRE
     C                     KFLD           LEZAIK           WIRE DIAMETER
     C*
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C                     EXSR @INT
     C                     EXSR @MAIN
     C                     EXSR @END
     C**************************************************************************
     C*                    @INT
     C**************************************************************************
     C           @INT      BEGSR
     C*
     C                     TIME           WWTIME
     C                     Z-ADD*ZERO     I       20
     C                     MOVE *BLANK    BCD
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @MAIN
     C**************************************************************************
     C           @MAIN     BEGSR
     C*
B01  C           *INKC     DOWEQ'0'
     C           *IN30     IFEQ '1'
     C           #ERR      TAG
     C                     EXFMTGDLPW209
     C                     MOVEA'00000000'*IN,30
     C                     MOVE *BLANK    EMSG
     C                     MOVE *BLANK    EMSG2
     C                     END
     C* ENTER
     C                     EXFMTGDLPW200
     C* F3=END
B02  C           *INKC     IFEQ '1'
     C*
     C                     ELSE
     C                     EXSR @CHK1                      1ST. DISP
     C           *IN30     IFEQ '0'
     C                     EXSR @UPD1                      SHIP RESULT
     C                     EXSR @UPD2                      ACTUAL STOCK
     C                     EXSR @UPD3                      SUPPLEMENT
     C                     EXSR @UPD4                      ORDER ACUUM
     C                     EXSR @WRT                       ACCOUNT PAYABLE
     C                     MOVE *BLANK    BARCD
E03  C                     END
E02  C                     END
E01  C                     END
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK1
     C**************************************************************************
     C           @CHK1     BEGSR
     C*
     C* DATA ENTERED ?
     C           BARCD     IFEQ *BLANK
     C                     SETON                     3031
     C                     MOVEAERR,1     EMSG
     C                     GOTO #END
     C                     END
     C*
     C                     Z-ADD1         I
     C                     DO   17        I
     C           BCD,I     IFEQ *BLANK
     C                     SETON                     30
     C                     END
     C                     END
     C*
     C                     Z-ADD1         I
     C                     DO   11        I
     C           BCD,I     IFLT *ZERO
     C           BCD,I     ORGT '9'
     C                     SETON                     30
     C                     END
     C                     END
     C*
     C           *IN30     IFEQ '1'
     C                     SETON                     31
     C                     MOVEAERR,1     EMSG
     C                     GOTO #END
     C                     END
     C*
     C* EXIST SHIPPING RESULT FILE?
     C           K1        CHAINGDLPL301             91
     C           *IN91     IFEQ '1'
     C                     SETON                     3032
     C                     MOVEAERR,2     EMSG
     C                     GOTO #END
     C*
     C                     ELSE
     C*
     C* ALREADY UPDATED ?
     C           LEINDT    IFNE *ZERO
     C                     SETON                     3032
     C                     MOVEAERR,9     EMSG
     C                     MOVEAERR,10    EMSG2
     C                     GOTO #END
     C*
     C                     ELSE
     C                     UPDATGDLPL301
     C                     END
     C                     END
     C*
     C* DUPLICATE CHECK(MATERIAL ACCOUNT AGGREGATION DATA FILE)
     C           K6        CHAINGDLPL401             90
     C           *IN90     IFEQ '0'
     C                     SETON                     3033
     C                     MOVEAERR,3     EMSG
     C                     UPDATGDLPL401
     C                     GOTO #END
     C                     END
     C*
     C* EXIST MATERIAL ORDER DATA FILE ?
     C           K3        CHAINGDLPL101             92
     C           *IN92     IFEQ '1'
     C                     SETON                     3034
     C                     MOVEAERR,4     EMSG
     C                     GOTO #END
     C*
     C                     ELSE
     C                     UPDATGDLPL101
     C           LBSKJY    IFEQ 'D'
     C                     SETON                     3034
     C                     MOVEAERR,4     EMSG
     C                     GOTO #END
     C                     END
     C                     END
     C*
     C* EXIST MATERIAL SUPPLEMENT STOCK IN PROCESS DATA FILE
     C           K2        CHAINGDLPL251             94
     C           *IN94     IFEQ '1'
     C                     SETON                     3036
     C                     MOVEAERR,6     EMSG
     C                     GOTO #END
     C*
     C                     ELSE
     C*
     C                     UPDATGDLPL251
     C           LDSKJY    IFEQ 'D'
     C                     SETON                     3036
     C                     MOVEAERR,6     EMSG
     C                     GOTO #END
     C                     END
     C                     END
     C*
     C* EXIST KANBAN MASTER ?
B01  C           BPTCD     IFEQ 'W'
     C                     Z-ADDLESIRE    K41     40
     C                     Z-ADDLEUKEI    K42     40
     C           K4        CHAINIZAPL011             95
B02  C           *IN95     IFEQ '1'
     C                     SETON                     3037
     C                     MOVEAERR,7     EMSG
     C                     GOTO #END
     C*
     C                     ELSE
     C           ZCSKJY    IFEQ 'D'
     C                     SETON                     3037
     C                     MOVEAERR,7     EMSG
     C                     GOTO #END
     C                     END
E02  C                     END
E01  C                     END
     C*
B01  C           BPTCD     IFEQ 'R'
     C                     Z-ADDLESIRE    K41     40
     C                     Z-ADDLEUKEI    K42     40
     C           K4        CHAINIZBPL011             96
B02  C           *IN96     IFEQ '1'
     C                     SETON                     3035
     C                     MOVEAERR,5     EMSG
     C                     GOTO #END
     C*
     C                     ELSE
     C           ZDSKJY    IFEQ 'D'
     C                     SETON                     3037
     C                     MOVEAERR,5     EMSG
     C                     GOTO #END
     C                     END
E02  C                     END
E01  C                     END
     C*
     C* PART CODE CORRECT?
B01  C           BPTCD     IFEQ 'W'
     C           BPTCD     OREQ 'R'
     C*
     C                     ELSE
     C                     SETON                     3038
     C                     MOVEAERR,8     EMSG
     C                     GOTO #END
E01  C                     END
     C*
     C* UNIT PRICE CHECK
     C                     SETOF                     39
     C                     MOVE LESIRE    K51     40
     C                     MOVE *BLANK    K52     1
     C           K5        SETLLGDLPL801
     C           #READ1    TAG
     C           K5        READEGDLPL801                 97
     C           *IN97     IFEQ '0'
     C           ODATE     IFGE BDATE
     C                     MOVE LHUNIT    WFUTCD  3        UNIT PRICE CODE
     C                     Z-ADDLHTANK    WFTANK 103       UNIT PRICE
     C                     SETON                     39
     C*
     C                     ELSE
     C                     GOTO #READ1
     C                     END
     C                     END
     C*
     C*
     C           *IN39     IFEQ '0'
     C                     SETON                     3039
     C                     MOVEAERR,11    EMSG
     C                     GOTO #END
     C                     END
     C*
     C           #END      ENDSR
     C**************************************************************************
     C*          @WRT(WRITE MATERIAL AGGREGATION DATA FILE)
     C**************************************************************************
     C           @WRT      BEGSR
     C*
     C                     CLEARGDLPL401
     C*
     C                     Z-ADD2000      LFKOYY           UPDATE YEAR
     C                     ADD  WWYYYY    LFKOYY
     C                     Z-ADDWWMMMM    LFKOMM                  MONTH
     C                     Z-ADDWWDDDD    LFKODD                  DAY
     C                     Z-ADDWWHHHH    LFKOHH                  HOUR
     C                     Z-ADDWWNNNN    LFKOSS                  MINUTE
     C                     MOVELPUSR      LFKOME           WORKER CODE
     C*
     C           LEPTCD    IFEQ 'W'                        --SUPPPLIER--
     C                     Z-ADDZCKAKE    LFSIRE           FINISHED MATERI
     C*
     C                     ELSE
     C                     Z-ADDZDSIRE    LFSIRE           ROD MATERIAL
     C                     END
     C*
     C                     MOVE *BLANK    LFSIRK           SUPP FACT
     C                     Z-ADD*ZERO     LFSELL           SELLER CODE
     C                     MOVE *BLANK    LFSELK           SELL FACTORY
     C                     Z-ADD*ZERO     LFMANU           MANUFACT CD
     C                     MOVE *BLANK    LFMANK           MANU FACTORY
     C                     Z-ADD0111      LFRECE           RECEIVER CD
     C                     MOVE *BLANK    LFRECK           RECEIV FACTO
     C                     Z-ADD*ZERO     LFTRAD           TRADER CODE
     C                     MOVE *BLANK    LFTRAK           TRADER FACTO
     C                     MOVE BODR1     LFORD1           ORDER # 1
     C                     MOVE BODR2     LFORD2           ORDER # 2
     C                     MOVE BODR3     LFORD3           ORDER # 3
     C                     MOVE LEINV1    LFINV1           INVOICE # 1
     C                     MOVE LEINV2    LFINV2                     2
     C                     Z-ADDLEITEM    LFITEM           ITEM #
     C                     Z-ADDLEIKBN    LFIKBN           ITEM DIVISION CD
     C                     MOVE BCASE     LFCASE           CASE #
     C                     MOVE BZETI     LFZETI           ABSOLUTE#
     C                     MOVE LEZAIS    LFZAIS           WIRE
     C                     Z-ADDLEZAIK    LFZAIK           WIRE DIAMETER
     C                     MOVE BPTCD     LFPTCD           PART CODES
     C                     Z-ADDLEJURY    LFJRYO           WEIGHT
     C                     Z-ADDLBODRY    LFODRY           ORDER DATE YYYY
     C                     Z-ADDLBODRM    LFODRM                      MM
     C                     Z-ADDLBODRD    LFODRD                      DD
     C                     MOVE LEHANY    LFHANY           CARRY CODE
     C                     Z-ADD2000      LFUKYY
     C                     ADD  WWYYYY    LFUKYY           INSPECTION YY DATE
     C                     Z-ADDWWMMMM    LFUKMM                      MM
     C                     Z-ADDWWDDDD    LFUKDD                      DD
     C*
     C* UNIT PRICE MASTER
     C*                    MOVE LESIRE    K51     40
     C*                    MOVE *BLANK    K52     1
     C*          K5        SETLLGDLPL801
     C*          #READ1    TAG
     C*          K5        READEGDLPL801                 97
     C*          *IN97     IFEQ '0'
     C*          ODATE     IFGE BDATE
     C*
     C*                    ELSE
     C*                    GOTO #READ1
     C*                    END
     C*
     C*                    ELSE
     C*
     C   97                EXCPT#HED1
     C                     MOVE WFUTCD    LFUTCD
     C                     Z-ADDWFTANK    LFTANK
     C                     Z-ADDWFTANK    LFRATE
     C*
     C                     Z-ADD*ZERO     LFKAIY           AP DATE YY
     C                     Z-ADD*ZERO     LFKAIM                   MM
     C                     Z-ADD*ZERO     LFKAID                   DD
     C                     Z-ADDLESKOY    LFSHPY           SHIP DAT YY
     C                     Z-ADDLESKOM    LFSHPM                    MM
     C                     Z-ADDLESKOD    LFSHPD                    DD
     C                     Z-ADDLESKOY    LFSIYY           PAYMENT  YY
     C                     Z-ADDLESKOM    LFSIMM                    MM
     C                     ADD  COUNT     LFSIMM
     C           LFSIMM    IFGT 12
     C           LFSIMM    SUB  12        LFSIMM
     C                     ADD  1         LFSIYY
     C                     END
     C                     Z-ADDLESKOD    LFSIDD                    DD
     C*
     C                     WRITEGDLPL401
     C*
     C                     ENDSR
     C**************************************************************************
     C*          @UPD1(UPDATE ASJ SHIPPING RESULT FILE):GDLPL30
     C**************************************************************************
     C           @UPD1     BEGSR
     C*
     C* ASJ WIRE SHIPPING RESULT FILE
     C           K1        CHAINGDLPL301             91
     C                     Z-ADD2000      LEINSY
     C                     ADD  WWYYYY    LEINSY
     C                     Z-ADDWWMMMM    LEINSM
     C                     Z-ADDWWDDDD    LEINSD
     C*
     C                     UPDATGDLPL301
     C*
     C                     ENDSR
     C**************************************************************************
     C*          @UPD2(UPDATE MATERIAL PRESENT STOCK DATA FILE)
     C**************************************************************************
     C           @UPD2     BEGSR
     C*
     C           K2        CHAINGDLPL201             93
     C           *IN93     IFEQ '0'
     C                     ADD  1         LCSTCK
     C                     UPDATGDLPL201
     C*
     C                     ELSE
     C                     CLEARGDLPL201
     C                     Z-ADD2000      LCKOYY
     C                     ADD  WWYYYY    LCKOYY           UPDATE YEAR
     C                     Z-ADDWWMMMM    LCKOMM                  MONTH
     C                     Z-ADDWWDDDD    LCKODD                  DAY
     C                     Z-ADDWWHHHH    LCKOHH                  HOUR
     C                     Z-ADDWWNNNN    LCKOSS                  MINUTE
     C                     MOVELPUSR      LCKOME           WORKER CD
     C                     MOVE LEZAIS    LCZAIS           WIRE
     C                     Z-ADDLEZAIK    LCZAIK           WIRE DIAMATER
     C                     MOVE LEZETI    LCZETI           ABSOLUTE #
     C                     MOVE LEPTCD    LCPTCD           PART CODE
     C                     Z-ADD1         LCSTCK           PRESENT STOCK
     C                     WRITEGDLPL201
     C                     END
     C*
     C                     ENDSR
     C**************************************************************************
     C*          @UPD3(UPDATE SUPPLEMENT FILE)
     C**************************************************************************
     C           @UPD3     BEGSR
     C*
     C           K2        CHAINGDLPL251             94
     C           *IN94     IFEQ '0'
     C                     SUB  1         LDSTCK
     C                     UPDATGDLPL251
     C                     END
     C*
     C                     ENDSR
     C**************************************************************************
     C*          @UPD4(UPDATE ORDER ACCUMLATE)
     C**************************************************************************
     C           @UPD4     BEGSR
     C*
     C           K3        CHAINGDLPL101             92
     C           *IN92     IFEQ '0'
     C                     ADD  1         LBREMA
     C*
     C           LBREMA    IFGT LBMAIS
     C                     Z-ADD2000      LBKANY
     C                     ADD  WWYYYY    LBKANY
     C                     Z-ADDWWMMMM    LBKANM
     C                     Z-ADDWWDDDD    LBKAND
     C                     END
     C*
     C                     Z-ADD2000      LBREYY
     C                     ADD  WWYYYY    LBREYY
     C                     Z-ADDWWMMMM    LBREMM
     C                     Z-ADDWWDDDD    LBREDD
     C*
     C                     UPDATGDLPL101
     C                     END
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @END
     C**************************************************************************
     C           @END      BEGSR
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ENDSR
     C**************************************************************************
     OQPRINT  E    2           #HED1
     O       OR        OF
     O                                    8 'GDLR20'
     O                                   32 'MATERIAL INSPECTION'
     O                                   75 '** UNIT PRICE ERROR **'
     O                                  131 '.....................'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                                  131 '.         .         .'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O*
** ERR
BARCODE BLANK
NO ACTUAL SHIP
ALREADY POSTED
NO ORDERED DAT
NO ROD MASTER
NO IN-PROCESS
NO FINISHED M
WRONG PARTS CD
ALREADY
      INSPECTED
NO UNIT PRICE M
