     H            Y.                                    1
      ** GDLR05 *****************************
      *  MATERIAL ORDER DATA UPDATE SYSTEM  *
      *               K.YASUDA  2000.07.04  *
      *
      *  WRITE RECORDS TO GDLWP03
      *      2002/01/28 (TCH)
      *  DEFAULT SUPPLIER -> 0002
      *      2002/03/01 (TCH)
      *  ADD DAILY SETTIN
      *      2004/07/01 (TCH)
      * TCHK1 01/01/08 CHG 0002 TO 8990
      * TCHK2 11/05/09 BUG FIX
      * TCHK3 01/13/11 ADD LOT-SIZE
      ***************************** GDLR05 **
     FGDLPW05 CF  E                    WORKSTN
     FGDLPL01 UF  E           K        DISK                      A
     FFGBPL01 IF  E           K        DISK
     FIZAPL01 IF  E           K        DISK
     FIZBPL01 IF  E           K        DISK
     FGDLWP03 O   E           K        DISK
     E                    ZS         12 15
     E                    ZK         12  5 2
     E                    MS         12  3 0
     E                    ST         12  5 2
     E                    SP         12  1
TCHK3E                    LT         12  2 0
     E                    ER      1  15 59
     E                    UP1     1   3  1   UP2    10
      *
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80LASKHZ
     I                                        1   40LASKYY
     I                                        5   60LASKMM
     I                                        7   80LASKDD
     I            DS
     I                                        1   80LAKOHZ
     I                                        1   40LAKOYY
     I                                        5   60LAKOMM
     I                                        7   80LAKODD
     I            DS
     I                                        1   60LAKOTI
     I                                        1   20LAKOHH
     I                                        3   40LAKOSS
     I            DS
     I                                        1   80LARDHZ
     I                                        1   40LAREDY
     I                                        5   60LAREDM
     I                                        7   80LAREDD
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
     I            DS
     I                                        1   80ZDSKHZ
     I                                        1   40ZDSKYY
     I                                        5   60ZDSKMM
     I                                        7   80ZDSKDD
     I            DS
     I                                        1   80ZCUKHZ
     I                                        1   40ZCUKYY
     I                                        5   60ZCUKMM
     I                                        7   80ZCUKDD
     I            DS
     I                                        1   80ZCSTHZ
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
     I            DS
     I                                        1   80ZDUKHZ
     I                                        1   40ZDUKYY
     I                                        5   60ZDUKMM
     I                                        7   80ZDUKDD
     I            DS
     I                                        1   80ZDSTHZ
     I                                        1   40ZDSTYY
     I                                        5   60ZDSTMM
     I                                        7   80ZDSTDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1 180 ZS
     I                                        1  15 ZS01
     I                                       16  30 ZS02
     I                                       31  45 ZS03
     I                                       46  60 ZS04
     I                                       61  75 ZS05
     I                                       76  90 ZS06
     I                                       91 105 ZS07
     I                                      106 120 ZS08
     I                                      121 135 ZS09
     I                                      136 150 ZS10
     I                                      151 165 ZS11
     I                                      166 180 ZS12
     I            DS
     I                                        1  60 ZK
     I                                        1   52ZK01
     I                                        6  102ZK02
     I                                       11  152ZK03
     I                                       16  202ZK04
     I                                       21  252ZK05
     I                                       26  302ZK06
     I                                       31  352ZK07
     I                                       36  402ZK08
     I                                       41  452ZK09
     I                                       46  502ZK10
     I                                       51  552ZK11
     I                                       56  602ZK12
     I            DS
     I                                        1  36 MS
     I                                        1   30MS01
     I                                        4   60MS02
     I                                        7   90MS03
     I                                       10  120MS04
     I                                       13  150MS05
     I                                       16  180MS06
     I                                       19  210MS07
     I                                       22  240MS08
     I                                       25  270MS09
     I                                       28  300MS10
     I                                       31  330MS11
     I                                       34  360MS12
     I            DS
     I                                        1  60 ST
     I                                        1   52ST01
     I                                        6  102ST02
     I                                       11  152ST03
     I                                       16  202ST04
     I                                       21  252ST05
     I                                       26  302ST06
     I                                       31  352ST07
     I                                       36  402ST08
     I                                       41  452ST09
     I                                       46  502ST10
     I                                       51  552ST11
     I                                       56  602ST12
     I            DS
     I                                        1  12 SP
     I                                        1   1 SP01
     I                                        2   2 SP02
     I                                        3   3 SP03
     I                                        4   4 SP04
     I                                        5   5 SP05
     I                                        6   6 SP06
     I                                        7   7 SP07
     I                                        8   8 SP08
     I                                        9   9 SP09
     I                                       10  10 SP10
     I                                       11  11 SP11
     I                                       12  12 SP12
TCHK3I            DS
TCHK3I                                        1  24 LT
TCHK3I                                        1   20LT01
TCHK3I                                        3   40LT02
TCHK3I                                        5   60LT03
TCHK3I                                        7   80LT04
TCHK3I                                        9  100LT05
TCHK3I                                       11  120LT06
TCHK3I                                       13  140LT07
TCHK3I                                       15  160LT08
TCHK3I                                       17  180LT09
TCHK3I                                       19  200LT10
TCHK3I                                       21  220LT11
TCHK3I                                       23  240LT12
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *-------------*
      * KEY1 - KEY3 *
      *-------------*
     C           KEY1      KLIST
     C                     KFLD           ISIRE   40
     C                     KFLD           XZAIS  15
     C                     KFLD           XZAIK   52
      *
     C           KEY2      KLIST
     C                     KFLD           ISIRE   40
     C                     KFLD           ZZAIS  15
     C                     KFLD           ZZAIK   52
      *
     C           KEY3      KLIST
     C                     KFLD           IZAIS  15
     C                     KFLD           IZAIK   52
     C                     KFLD           IKOJE   40
     C                     KFLD           ISIRE   40
     C           KEY3X     KLIST
     C                     KFLD           LAZAIS
     C                     KFLD           LAZAIK
     C                     KFLD           IKOJE   40
     C                     KFLD           ISIRE   40
     C           KEY3W     KLIST
     C                     KFLD           LAZAIS
     C                     KFLD           LAZAIK
      *
     C           KEY4      KLIST
     C                     KFLD           ISIRE   40
     C                     KFLD           IZAIS  15
     C                     KFLD           IZAIK   52
      *
     C                     Z-ADD*DATE     K@YMD
TCHK1C*                    MOVE '0002'    PSIRE
TCHK1C                     MOVE '8990'    PSIRE
      *----------*
      * SCREEN 1 *
      *----------*
     C           STPA      TAG
     C********             MOVE *BLANK    PSIRE
      *
     C           STP0      TAG
     C                     EXFMTGDLPW051
     C                     SETOF                     0199
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           PSIRE     IFEQ *BLANK
     C                     MOVELER,9      MSG
     C                     SETON                     99
     C                     GOTO STP0
     C                     END
      *
     C                     MOVEL'0111'    IKOJE   40
     C                     MOVELPSIRE     ISIRE   40
      *
     C                     SETOF                     05
     C           ISIRE     CHAINFGBPL011             05
      *
     C           *IN05     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     15
     C                     END
     C                     END
      *
     C           *IN05     IFEQ '1'
     C                     SETON                     0199
     C                     MOVELER,13     MSG
     C                     GOTO STP0
     C                     END
      *-----------*
      * INZ FIELD *
      *-----------*
     C           STP1      TAG
     C                     MOVE *BLANK    ZS
     C                     Z-ADD0         ZK
     C                     Z-ADD0         MS
     C                     Z-ADD0         ST
     C                     MOVE *BLANK    SP
TCHK3C                     Z-ADD*ZERO     LT
     C                     Z-ADD1         A       20
     C                     SETOF                     77
TCHK2C*                    MOVE *BLANK    @@DLT   1
      *
     C           ISIRE     SETLLGDLPL01
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           ISIRE     READEGDLPL011                 10
     C           *IN10     IFEQ '0'
     C           LASKJY    IFEQ 'D'
     C           LASKHZ    ANDLE*DATE
TCHK2C*                    MOVE '1'       @@DLT   1
     C                     ELSE
     C           A         IFLE 12
     C                     MOVELLAZAIS    ZS,A
     C                     Z-ADDLAZAIK    ZK,A
     C                     Z-ADDLAMAIS    MS,A
     C           KEY3X     SETGTIZAPL01
     C           *IN80     DOUEQ*ON
     C           KEY3X     REDPEIZAPL011                 80
     C           *IN80     IFEQ *OFF
     C           ZCSKJY    ANDEQ*BLANK
     C           ZCUKHZ    ANDLE*DATE
     C           ZCSTHZ    ANDGT*DATE
     C           ZCTKJR    IFNE 0
     C           ZCMSJR    DIV  ZCTKJR    @@DAYW 112H
     C                     ELSE
     C                     Z-ADD0         @@DAYW
     C                     ENDIF
     C           @@DAYW    DIV  20        ST,A      H
TCHK3C           ZCLOTO    IFGT 1
TCHK3C                     Z-ADDZCLOTO    LT,A
TCHK3C                     END
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN80     IFEQ *ON
     C           KEY3W     SETLLIZAPL01
     C           *IN80     DOUEQ*ON
     C           KEY3W     READEIZAPL011                 80
     C           *IN80     IFEQ *OFF
     C           ZCSKJY    ANDEQ*BLANK
     C           ZCUKHZ    ANDLE*DATE
     C           ZCSTHZ    ANDGT*DATE
     C           ZCTKJR    IFNE 0
     C           ZCMSJR    DIV  ZCTKJR    @@DAYW 112H
     C                     ELSE
     C                     Z-ADD0         @@DAYW
     C                     ENDIF
     C           @@DAYW    DIV  20        ST,A      H
     C                     MOVE '*'       SP,A
TCHK3C           ZCLOTO    IFGT 1
TCHK3C                     Z-ADDZCLOTO    LT,A
TCHK3C                     END
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           A         IFEQ 12
     C                     MOVELLAZAIS    XZAIS
     C                     MOVELLAZAIK    XZAIK
     C                     LEAVE
     C                     END
     C                     ADD  1         A
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C****       A         IFLE 12
     C           *IN10     IFEQ *ON
     C                     SETON                     77
     C                     END
      *
     C                     Z-ADD1         CONT    30
      *----------*
      * SCREEN 2 *
      *----------*
     C           STP4      TAG
     C                     MOVE *BLANK    IUPDT
     C                     MOVE *BLANK    IZAIS
     C                     Z-ADD0         IZAIK
     C                     MOVE 'W'       IPTCD
     C                     Z-ADD0         IMAIS
     C           STP2      TAG
     C                     EXFMTGDLPW052
     C                     SETOF                     010203
     C                     SETOF                     049970
      *-------*
      * CMD-1 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO STPA
     C                     END
      *----------------------*
      * ROLL-UP (FRONT PAGE) *
      *----------------------*
     C           *IN95     IFEQ '1'
     C           CONT      IFEQ 1
     C                     SETON                     99
     C                     MOVELER,1      MSG
     C                     GOTO STP2
     C                     END
     C                     SUB  1         CONT
      *
     C           CONT      IFEQ 1
     C                     GOTO STP1
     C                     END
      *
     C                     EXSR RLUP
     C                     GOTO STP2
     C                     END
      *-----------------------*
      * ROLL-DOWN (NEXT PAGE) *
      *-----------------------*
     C           *IN90     IFEQ '1'
     C           *IN77     IFEQ '1'
     C                     SETON                     99
     C                     MOVELER,2      MSG
     C                     GOTO STP2
     C                     END
      *
     C                     ADD  1         CONT
     C                     EXSR RLDN
     C                     GOTO STP2
     C                     END
     C           IUPDT     IFNE *BLANK
      *------------*
      * RENEW CODE *
      *------------*
     C                     SETOF                     25
     C                     Z-ADD1         X       20
     C           IUPDT     LOKUPUP1,X                    25
     C           *IN25     IFEQ '0'
     C                     SETON                     0199
     C                     MOVELER,5      MSG
     C                     GOTO STP2
     C                     END
     C   25                MOVELUP2,X     OUPDT
      *
     C           IUPDT     IFEQ '0'
     C                     SETON                     70
     C                     END
      *----------------------*
      * WIRE / WIRE DIAMETER *
      *----------------------*
     C           IZAIS     IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVELER,10     MSG
     C                     GOTO STP2
     C                     END
      *
     C           IZAIK     IFEQ 0
     C                     SETON                     0399
     C                     MOVELER,11     MSG
     C                     GOTO STP2
     C                     END
      *
     C           IPTCD     IFNE 'W'
     C           IPTCD     ANDNE'R'
     C                     SETON                     0499
     C                     MOVELER,12     MSG
     C                     GOTO STP2
     C                     END
     C                     MOVE *BLANK    ZETI    4
      *-------------*
      * WIRE KANBAN *
      *-------------*
     C           IPTCD     IFEQ 'W'
     C                     SETOF                     20
     C           KEY3      SETGTIZAPL01
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY3      REDPEIZAPL011                 10
      *
     C           *IN10     IFEQ '0'
     C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZCUKHZ    IFLE *DATE
     C           ZCSTHZ    ANDGT*DATE
     C                     SETON                     20
     C                     MOVELZCKNO3    ZETI
     C                     END
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C           *IN20     IFEQ '0'
     C                     SETON                     010203
     C                     SETON                     0499
     C                     MOVELER,3      MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *------------*
      * ROD KANBAN *
      *------------*
     C           IPTCD     IFEQ 'R'
     C                     SETOF                     20
     C           KEY3      SETGTIZBPL01
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY3      REDPEIZBPL011                 10
      *
     C           *IN10     IFEQ '0'
     C           ZDSKJY    IFEQ 'D'
     C           ZDSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZDUKHZ    IFLE *DATE
     C           ZDSTHZ    ANDGT*DATE
     C                     SETON                     20
     C                     MOVELZDKNO3    ZETI
     C                     END
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C           *IN20     IFEQ '0'
     C                     SETON                     010203
     C                     SETON                     0499
     C                     MOVELER,4      MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *
TCHK2C                     MOVEL*BLANK    @@DLT   1
TCHK2C                     Z-ADD*ZERO     IMAIS
TCHK2C*
     C                     SETOF                     30
     C           KEY4      CHAINGDLPL011             30
      *
     C           *IN30     IFEQ '1'
     C           IUPDT     IFEQ '0'
TCHK2C*          IUPDT     ANDEQ'1'
TCHK2C           IUPDT     OREQ '1'
     C                     SETON                     020399
     C                     MOVELER,6      MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           *IN30     IFEQ '0'
     C           LASKJY    IFEQ 'D'
     C           LASKHZ    ANDLE*DATE
     C           IUPDT     IFEQ '0'
TCHK2C*          IUPDT     ANDEQ'1'
TCHK2C           IUPDT     OREQ '1'
     C                     SETON                     020399
     C                     MOVELER,7      MSG
     C                     GOTO STP2
     C                     END
TCHK2C                     MOVEL*ON       @@DLT
     C                     ELSE
     C           IUPDT     IFEQ '0'
     C           IUPDT     OREQ '1'
     C                     Z-ADDLAMAIS    IMAIS
     C                     END
     C           IUPDT     IFEQ '2'
     C                     SETON                     020399
     C                     MOVELER,8      MSG
     C                     GOTO STP2
     C                     END
     C                     END
     C                     END
      *
     C                     GOTO STP3
     C                     END
      *
     C                     GOTO STP2
      *----------*
      * SCREEN 3 *
      *----------*
     C           STP3      TAG
     C                     EXFMTGDLPW053
     C                     SETOF                     0199
      *-------*
      * CMD-3 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO STP4
     C                     END
      *
      *
      *
     C           IMAIS     IFEQ 0
     C                     SETON                     0199
     C                     MOVELER,14     MSG
     C                     GOTO STP3
     C                     END
      *-------*
      * CMD-5 *
      *-------*
     C           *INKE     IFEQ '0'
     C                     GOTO STP3
     C                     END
      *
     C                     Z-ADD*ZERO     @@MAIS  30
      *
     C                     TIME           LAKOTI
     C                     Z-ADD*DATE     LAKOHZ
     C                     MOVELUS        LAKOME
     C           IUPDT     IFEQ '0'
     C                     MOVE 'D'       LASKJY
     C                     Z-ADD*DATE     LASKHZ
     C                     Z-SUBIMAIS     @@MAIS
     C                     END
      *
     C           IUPDT     IFEQ '1'
     C           IUPDT     OREQ '2'
      *
     C           *IN30     IFEQ *ON
     C                     Z-ADDIMAIS     @@MAIS
     C                     ELSE
     C           @@DLT     IFEQ '1'
     C                     Z-ADDIMAIS     @@MAIS
     C                     ELSE
     C           IMAIS     SUB  LAMAIS    @@MAIS
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE *BLANK    LASKJY
     C                     Z-ADD0         LASKHZ
     C                     MOVELISIRE     LASIRE
     C                     MOVEL'0111'    LAUKEI
     C                     MOVEL*BLANK    LAUKOJ
     C                     MOVEL*BLANK    LAUUKE
     C                     MOVELIZAIS     LAZAIS
     C                     Z-ADDIZAIK     LAZAIK
     C                     MOVELIPTCD     LAPTCD
     C                     MOVELZETI      LAZETI
     C                     Z-ADDIMAIS     LAMAIS
     C                     Z-ADD*DATE     LARDHZ
     C                     END
      *
     C           *IN30     IFEQ '1'
     C                     WRITEGDLPL011
     C                     ELSE
     C                     UPDATGDLPL011
     C                     END
      *
     C           @@MAIS    IFNE *ZERO
      * ADD
     C                     CLEARGDLWP031
     C                     Z-ADD*YEAR     GAKOYY
     C                     Z-ADD*MONTH    GAKOMM
     C                     Z-ADD*DAY      GAKODD
     C                     TIME           GAKOTM
     C                     MOVELUS        GAKOME
     C                     Z-ADDISIRE     GASIRE
     C                     MOVEL'0111'    GAUKEI
     C                     MOVEL*BLANK    GAUKOJ
     C                     MOVEL*BLANK    GAUUKE
     C                     MOVELIZAIS     GAZAIS
     C                     Z-ADDIZAIK     GAZAIK
     C                     MOVELIPTCD     GAPTCD
     C                     MOVELZETI      GAZETI
     C                     Z-ADD@@MAIS    GAMAIS
     C                     WRITEGDLWP031
     C                     ENDIF
      *
TCHK2C*          CONT      IFEQ 1
TCHK2C*                    GOTO STP1
TCHK2C*                    ELSE
TCHK2C*                    GOTO STP2
TCHK2C*                    END
TCHK2C*
TCHK2C                     GOTO STP1
TCHK2C*
      *---------*
      * ROLL-UP *
      *---------*
     C           RLUP      BEGSR
     C                     Z-ADD12        A
     C                     MOVE *BLANK    ZS
     C                     Z-ADD*ZERO     ZK
     C                     Z-ADD*ZERO     MS
     C                     Z-ADD*ZERO     ST
     C                     MOVE *BLANK    SP
TCHK3C                     Z-ADD*ZERO     LT
     C           KEY2      SETLLGDLPL01
     C                     DO   *HIVAL
     C*                    READPGDLPL011                 15
     C           ISIRE     REDPEGDLPL011                 15
     C           *IN15     IFEQ '0'
     C           LASKJY    IFEQ 'D'
     C           LASKHZ    ANDLE*DATE
     C                     ELSE
     C           A         IFGT 0
     C           A         IFLE 12
     C                     MOVELLAZAIS    ZS,A
     C                     Z-ADDLAZAIK    ZK,A
     C                     Z-ADDLAMAIS    MS,A
     C           KEY3X     SETGTIZAPL01
     C           *IN80     DOUEQ*ON
     C           KEY3X     REDPEIZAPL011                 80
     C           *IN80     IFEQ *OFF
     C           ZCSKJY    ANDEQ*BLANK
     C           ZCUKHZ    ANDLE*DATE
     C           ZCSTHZ    ANDGT*DATE
     C           ZCTKJR    IFNE 0
     C           ZCMSJR    DIV  ZCTKJR    @@DAYW 112H
     C                     ELSE
     C                     Z-ADD0         @@DAYW
     C                     ENDIF
     C           @@DAYW    DIV  20        ST,A      H
TCHK3C           ZCLOTO    IFGT 1
TCHK3C                     Z-ADDZCLOTO    LT,A
TCHK3C                     END
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           *IN80     IFEQ *ON
     C           KEY3W     SETLLIZAPL01
     C           *IN80     DOUEQ*ON
     C           KEY3W     READEIZAPL011                 80
     C           *IN80     IFEQ *OFF
     C           ZCSKJY    ANDEQ*BLANK
     C           ZCUKHZ    ANDLE*DATE
     C           ZCSTHZ    ANDGT*DATE
     C           ZCTKJR    IFNE 0
     C           ZCMSJR    DIV  ZCTKJR    @@DAYW 112H
     C                     ELSE
     C                     Z-ADD0         @@DAYW
     C                     ENDIF
     C           @@DAYW    DIV  20        ST,A      H
     C                     MOVE '*'       SP,A
TCHK3C           ZCLOTO    IFGT 1
TCHK3C                     Z-ADDZCLOTO    LT,A
TCHK3C                     END
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
     C                     END
      *
     C           A         IFEQ 1
     C*******              MOVELLAZAIS    XZAIS
     C*******              MOVELLAZAIK    XZAIK
     C                     MOVELLAZAIS    ZZAIS
     C                     MOVELLAZAIK    ZZAIK
     C                     END
      *
     C           A         IFEQ 12
     C                     MOVELLAZAIS    XZAIS
     C                     MOVELLAZAIK    XZAIK
     C******               MOVELLAZAIS    ZZAIS
     C*****                MOVELLAZAIK    ZZAIK
     C                     END
     C                     SUB  1         A
     C                     END
     C                     END
     C                     END
     C  N15                ENDDO
     C                     ENDSR
      *-----------*
      * ROLL-DOWN *
      *-----------*
     C           RLDN      BEGSR
     C                     Z-ADD1         A
     C                     MOVE *BLANK    ZS
     C                     Z-ADD*ZERO     ZK
     C                     Z-ADD*ZERO     MS
     C                     Z-ADD*ZERO     ST
     C                     MOVE *BLANK    SP
TCHK3C                     Z-ADD*ZERO     LT
     C****       KEY4      SETGTGDLPL01
     C           KEY1      SETGTGDLPL01
     C                     DO   *HIVAL
     C*                    READ GDLPL011                 15
     C           ISIRE     READEGDLPL011                 15
     C           *IN15     IFEQ '0'
     C           LASKJY    IFEQ 'D'
     C           LASKHZ    ANDLE*DATE
     C                     ELSE
     C           A         IFLE 12
     C                     MOVELLAZAIS    ZS,A
     C                     Z-ADDLAZAIK    ZK,A
     C                     Z-ADDLAMAIS    MS,A
     C           KEY3X     SETGTIZAPL01
     C           *IN80     DOUEQ*ON
     C           KEY3X     REDPEIZAPL011                 80
     C           *IN80     IFEQ *OFF
     C           ZCSKJY    ANDEQ*BLANK
     C           ZCUKHZ    ANDLE*DATE
     C           ZCSTHZ    ANDGT*DATE
     C           ZCTKJR    IFNE 0
     C           ZCMSJR    DIV  ZCTKJR    @@DAYW 112H
     C                     ELSE
     C                     Z-ADD0         @@DAYW
     C                     ENDIF
     C           @@DAYW    DIV  20        ST,A      H
TCHK3C           ZCLOTO    IFGT 1
TCHK3C                     Z-ADDZCLOTO    LT,A
TCHK3C                     END
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           *IN80     IFEQ *ON
     C           KEY3W     SETLLIZAPL01
     C           *IN80     DOUEQ*ON
     C           KEY3W     READEIZAPL011                 80
     C           *IN80     IFEQ *OFF
     C           ZCSKJY    ANDEQ*BLANK
     C           ZCUKHZ    ANDLE*DATE
     C           ZCSTHZ    ANDGT*DATE
     C           ZCTKJR    IFNE 0
     C           ZCMSJR    DIV  ZCTKJR    @@DAYW 112H
     C                     ELSE
     C                     Z-ADD0         @@DAYW
     C                     ENDIF
     C           @@DAYW    DIV  20        ST,A      H
     C                     MOVE '*'       SP,A
TCHK3C           ZCLOTO    IFGT 1
TCHK3C                     Z-ADDZCLOTO    LT,A
TCHK3C                     END
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
     C                     END
      *
     C           A         IFEQ 1
     C*******              MOVELLAZAIS    XZAIS
     C*******              MOVELLAZAIK    XZAIK
     C                     MOVELLAZAIS    ZZAIS
     C                     MOVELLAZAIK    ZZAIK
     C                     END
      *
     C           A         IFEQ 12
     C                     MOVELLAZAIS    XZAIS
     C                     MOVELLAZAIK    XZAIK
     C*******              MOVELLAZAIS    ZZAIS
     C********             MOVELLAZAIK    ZZAIK
     C                     END
     C                     ADD  1         A
     C                     END
     C                     END
     C  N15                ENDDO
      *
     C           A         IFLE 13
     C                     SETON                     77
     C                     END
     C                     ENDSR
** MSG
E-01 THIS PAGE IS DISPLAYED THE DATA OF TOP PAGE.
E-02 THIS PAGE IS DISPLAYED THR DATA OF BOTTOM PAGE.
E-03 THIS DATA IS NOT IN WIRE KANBAN MASTER FILE.
E-04 THIS DATA IS NOT IN ROD KANBAN MASTER FILE.
E-05 INPUT CODE IS DIFFERENT.
E-06 THIS DATA IS NOT IN ORDER TEMPORARY FILE.
E-07 THIS DATA ALREADY HAS BEEN DELETED.
E-08 THIS DATA ALREADY HAS BEEN INPUT.
E-09 INPUT SUPPLIER CODE.
E-10 INPUT WIRE DATA.
E-11 INPUT WIRE DIAMETER DATA.
E-12 INPUT PARTS CDOE IS DIFFERENT.
E-13 THIS IS NOT IN  DETAIL MASTER FILE.
E-14 INPUT NUMBER OF KANBAN.
** UP1/UP2
00-DELETE
11-CHANGE
22-ADDITION
