     H            Y.
     F** GDLR36 ********************************
     F*  DAILY ACCOUNT PAYABLE PROCESS         *
     F*      A.MAMIYA        2000.11.08        *
     F******************************** GDLR36 **
     FGDLPL42 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    #PT     1   2  1   WPT    15
     E                    #CD     1   2  1   WCD     4
     I            DS
     I                                        1   80LFSKHZ
     I                                        1   40LFSKYY
     I                                        5   60LFSKMM
     I                                        7   80LFSKDD
     I            DS
     I                                        1   80LFKOHZ
     I                                        1   40LFKOYY
     I                                        5   60LFKOMM
     I                                        7   80LFKODD
     I            DS
     I                                        1   60LFKOTI
     I                                        1   20LFKOHH
     I                                        3   40LFKOSS
     I            DS
     I                                        1   80LFUKHZ
     I                                        1   40LFUKYY
     I                                        5   60LFUKMM
     I                                        7   80LFUKDD
     I            DS
     I                                        1   80LFSIHZ
     I                                        1   40LFSIYY
     I                                        5   60LFSIMM
     I                                        7   80LFSIDD
     I            DS
     I                                        1   60WSIHZ
     I                                        1   40WSIYY
     I                                        5   60WSIMM
     C           *ENTRY    PLIST
     C                     PARM           PSIRE   4
     C                     PARM           PSKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           PNKOJ   1
     C                     PARM           PSIHZ   60
     C                     PARM           PFLG    1
     C*
     C                     MOVE PSIRE     WSIRE   40
     C                     MOVELPSKOJ     WSKOJ   1
     C                     MOVE PNUKE     WNUKE   40
     C                     MOVELPNKOJ     WNKOJ   1
     C                     Z-ADDPSIHZ     WSIHZ   60
     C*
     C           KEY1      KLIST
     C                     KFLD           WSIYY
     C                     KFLD           WSIMM
     C                     KFLD           WSIRE
     C                     KFLD           WSKOJ
     C                     KFLD           WNUKE
     C                     KFLD           WNKOJ
     C*
     C                     MOVEL*BLANK    WPTCD   1
     C                     MOVEL*BLANK    WPTNM  10
     C                     SETOF                     90
     C           KEY1      SETLLGDLPL421
     C                     DO   *HIVAL
     C                     MOVEL*BLANK    WFLG    1
     C                     MOVEL*BLANK    WCARRY  4
     C           KEY1      READEGDLPL421                 90
     C           *IN90     IFEQ '0'
     C           LFSKJY    IFEQ 'D'
     C           LFSKHZ    ANDLE*DATE
     C                     ELSE
     C           LFPTCD    IFNE WPTCD
     C           *INOF     OREQ '1'
     C                     MOVELLFPTCD    WPTCD
     C*PTCD CODE
     C                     Z-ADD1         X       20
     C           LFPTCD    LOKUP#PT,X                    30
     C   30                MOVELWPT,X     WPTNM
     C                     EXCPT#HED
     C                     SETOF                     OF
     C                     MOVEL'1'       PFLG
     C                     END
     C*CARRY CODE
     C                     Z-ADD1         X       20
     C           LFHANY    LOKUP#CD,X                    30
     C   30                MOVELWCD,X     WCARRY
     C*UNIT PRICE ERR
     C           LFTANK    IFEQ 0
     C                     MOVEL'*'       WFLG
     C                     END
     C*
     C                     Z-ADD0         WKIN   100
     C           LFTANK    MULT LFJRYO    WKIN
     C                     EXCPT#DTL
     C                     END
     C                     END
     C  N90                ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     OQPRINT  E   02           #HED
     O                                    7 'GDLR36'
     O                                   67 '*** MONTHLY ACCOUNT PAYA'
     O                                   78 'BLE LIST ***'
     O                                  103 'DATE :'
     O                         *YEAR   +  1
     O                                 +  0 '/'
     O                         UMONTH  +  0
     O                                 +  0 '/'
     O                         UDAY    +  0
     O                                  121 'PAGE :'
     O                         PAGE  Z +  0
     O        E   03           #HED
     O                                   15 'PAYMENT DATE :'
     O                         LFSIYY  +  1
     O                                 +  0 '/'
     O                         LFSIMM  +  0
     O                                   34 'TYPE :'
     O                         LFPTCD  +  0
     O                                 +  0 '-'
     O                         WPTNM   +  0
     O        E   05           #HED
     O                                    9 'INVOICE'
     O                                   19 'ORDER NO.'
     O                                   28 'ITEM NO.'
     O                                   33 'CASE'
     O                                   41 'ID NO.'
     O                                   46 'WIRE'
     O                                   66 'DIAMETER'
     O                                   73 'WEIGNT'
     O                                   88 'IAF UNIT PRICE'
     O                                  102 'AMOUNT'
     O                                  114 'RECEIVE DAY'
     O                                  120 'CARRY'
     O        E   0607         #HED
     O                                    9 '-------'
     O                                   19 '---------'
     O                                   28 '--------'
     O                                   34 '-----'
     O                                   41 '------'
     O                                   57 '---------------'
     O                                   66 '--------'
     O                                   73 '------'
     O                                   88 '-------------'
     O                                  102 '-------------'
     O                                  114 '-----------'
     O                                  120 '-----'
     O        E  1             #DTL
     O                         WFLG       1
     O                         LFINV1     4
     O                         LFINV2  +  0
     O                         LFORD1    13
     O                         LFORD2  +  0
     O                         LFORD3  +  0
     O                         LFITEM    25
     O                                 +  0 '-'
     O                         LFIKBN  +  0
     O                         LFCASE    34
     O                         LFZETI    40
     O                         LFZAIS    57
     O                         LFZAIK1   65
     O                         LFJRYO1   71
     O                                 +  0 'KG'
     O                         LFTANK1   88
     O                         WKIN  1  102
     O                         LFUKYY   107
     O                                 +  0 '/'
     O                         LFUKMM  +  0
     O                                 +  0 '/'
     O                         LFUKDD  +  0
     O                         WCARRY   119
** #PT/WPT
WWIRE
RWIRE ROD
** #CD/WCD
AAIR
SSHIP
