     H            Y.
     F** GDLR35 ********************************
     F*  MONTHLY ACCOUNT PAYABLE PROCESS       *
     F*      A.MAMIYA        2000.11.07        *
     F******************************** GDLR35 **
     FGDLPL42 IF  E           K        DISK
     FGDLWP41 O   E                    DISK
     I            DS
     I                                        1   80LFSKHZ
     I                                        1   40LFSKYY
     I                                        5   60LFSKMM
     I                                        7   80LFSKDD
     I            DS
     I                                        1   80LFKOHZ
     I                                        1   40LFKOYY
     I                                        5   60LFKOMM
     I                                        7   80LFKODD
     I            DS
     I                                        1   60LFKOTI
     I                                        1   20LFKOHH
     I                                        3   40LFKOSS
     I            DS
     I                                        1   80LFUKHZ
     I                                        1   40LFUKYY
     I                                        5   60LFUKMM
     I                                        7   80LFUKDD
     I            DS
     I                                        1   80LFSIHZ
     I                                        1   40LFSIYY
     I                                        5   60LFSIMM
     I                                        7   80LFSIDD
     I            DS
     I                                        1   60WSIHZ
     I                                        1   40WSIYY
     I                                        5   60WSIMM
     C           #CHG      PLIST
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C*
     C           *ENTRY    PLIST
     C                     PARM           PSIRE   4
     C                     PARM           PSKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           PNKOJ   1
     C                     PARM           PSIHZ   60
     C*
     C                     MOVE PSIRE     WSIRE   40
     C                     MOVELPSKOJ     WSKOJ   1
     C                     MOVE PNUKE     WNUKE   40
     C                     MOVELPNKOJ     WNKOJ   1
     C                     Z-ADDPSIHZ     WSIHZ   60
     C*
     C           KEY1      KLIST
     C                     KFLD           WSIYY
     C                     KFLD           WSIMM
     C                     KFLD           WSIRE
     C                     KFLD           WSKOJ
     C                     KFLD           WNUKE
     C                     KFLD           WNKOJ
     C*
     C                     SETOF                     90
     C           KEY1      SETLLGDLPL421
     C                     DO   *HIVAL
     C           KEY1      READEGDLPL421                 90
     C           *IN90     IFEQ '0'
     C           LFSKJY    IFEQ 'D'
     C           LFSKHZ    ANDLE*DATE
     C                     ELSE
     C*
     C                     Z-ADD2         PLEN
     C                     Z-ADDLFZAIK    PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      LFZAI1
     C*
     C                     Z-ADD5         PLEN
     C                     Z-ADDLFTANK    PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      LFTAN1
     C*
     C                     Z-ADD5         PLEN
     C                     Z-ADDLFRATE    PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      LFRAT1
     C*
     C                     WRITEGDLWP411
     C                     END
     C                     END
     C  N90                ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
