     H            Y.
     F** GDLR60 ******************************************
     F*  UPDATE MATERIAL ACCUOUNTS AGGREGATION DATA FILE *
     F*      A.MAMIYA        2000.11.27                  *
     F* TCHK1 01/01/08 CHG 0002 TO 8990                  *
     F****************************************** GDLR60 **
     FGDLPW60 CF  E                    WORKSTN
     FGDLPL43 UF  E           K        DISK                      A
     FGDLPL44 IF  E           K        DISK
     FGDLPL45 IF  E           K        DISK
     FGDLPL80 IF  E           K        DISK
     FIZAPL01 IF  E           K        DISK
     FIZBPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     E                    WIN        99  1
     E                    #NO        10  1
     E                    #IN        10  6
     E                    #OD        10 12
     E                    #IT        10 10
     E                    #TY        10  1
     E                    #WI        10 15
     E                    #DI        10  5
     E                    #WE        10  4 0
     E                    #CA        10  5
     E                    MM     13  13  2 0
     E                    ER      1  50 60
     I            DS
     I                                        1  99 WIN
     I                                        1  99 PIN
     I            DS
     I                                        1   80LFSKHZ
     I                                        1   40LFSKYY
     I                                        5   60LFSKMM
     I                                        7   80LFSKDD
     I            DS
     I                                        1   80LFKOHZ
     I                                        1   40LFKOYY
     I                                        5   60LFKOMM
     I                                        7   80LFKODD
     I            DS
     I                                        1   60LFKOTI
     I                                        1   20LFKOHH
     I                                        3   40LFKOSS
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80LHSKHZ
     I                                        1   40LHSKYY
     I                                        5   60LHSKMM
     I                                        7   80LHSKDD
     I            DS
     I                                        1   80LFUKHZ
     I                                        1   40LFUKYY
     I                                        5   60LFUKMM
     I                                        7   80LFUKDD
     I            DS
     I                                        1   80LFODHZ
     I                                        1   40LFODRY
     I                                        5   60LFODRM
     I                                        7   80LFODRD
     I            DS
     I                                        1   80LFSHHZ
     I                                        1   40LFSHPY
     I                                        5   60LFSHPM
     I                                        7   80LFSHPD
     I            DS
     I                                        1   80LFSIHZ
     I                                        1   40LFSIYY
     I                                        5   60LFSIMM
     I                                        7   80LFSIDD
     I            DS
     I                                        1   80WODHZ
     I                                        1   40WODYY
     I                                        5   60WODMM
     I                                        7   80WODDD
     I            DS
     I                                        1   80WPOHZ
     I                                        1   40WPOYY
     I                                        5   60WPOMM
     I                                        7   80WPODD
     I            DS
     I                                        1   80WREHZ
     I                                        1   40WREYY
     I                                        5   60WREMM
     I                                        7   80WREDD
     I            DS
     I                                        1   80WPAHZ
     I                                        1   40WPAYY
     I                                        5   60WPAMM
     I                                        7   80WPADD
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
     I            DS
     I                                        1   80ZDSKHZ
     I                                        1   40ZDSKYY
     I                                        5   60ZDSKMM
     I                                        7   80ZDSKDD
     I            DS
     I                                        1   80ZCUKHZ
     I                                        1   40ZCUKYY
     I                                        5   60ZCUKMM
     I                                        7   80ZCUKDD
     I            DS
     I                                        1   80ZCSTHZ
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
     I            DS
     I                                        1   80ZDUKHZ
     I                                        1   40ZDUKYY
     I                                        5   60ZDUKMM
     I                                        7   80ZDUKDD
     I            DS
     I                                        1   80ZDSTHZ
     I                                        1   40ZDSTYY
     I                                        5   60ZDSTMM
     I                                        7   80ZDSTDD
     I            DS
     I                                        1   6 LFINVO
     I                                        1   2 LFINV1
     I                                        3   6 LFINV2
     I            DS
     I                                        1   60LFODER
     I                                        1   20LFORD1
     I                                        3   40LFORD2
     I                                        5   60LFORD3
     I            DS
     I                                        1   6 KINVO
     I                                        1   2 KINV1
     I                                        3   6 KINV2
     I            DS
     I                                        1   60KODER
     I                                        1   20KORD1
     I                                        3   40KORD2
     I                                        5   60KORD3
     I            DS
     I                                        1  10 #NO
     I                                        1  10 PNO
     I                                        1   1 WNO1
     I                                        2   2 WNO2
     I                                        3   3 WNO3
     I                                        4   4 WNO4
     I                                        5   5 WNO5
     I                                        6   6 WNO6
     I                                        7   7 WNO7
     I                                        8   8 WNO8
     I                                        9   9 WNO9
     I                                       10  10 WNO0
     I            DS
     I                                        1  60 #IN
     I                                        1   6 WINV1
     I                                        7  12 WINV2
     I                                       13  18 WINV3
     I                                       19  24 WINV4
     I                                       25  30 WINV5
     I                                       31  36 WINV6
     I                                       37  42 WINV7
     I                                       43  48 WINV8
     I                                       49  54 WINV9
     I                                       55  60 WINV0
     I            DS
     I                                        1 120 #OD
     I                                        1  12 WODE1
     I                                       13  24 WODE2
     I                                       25  36 WODE3
     I                                       37  48 WODE4
     I                                       49  60 WODE5
     I                                       61  72 WODE6
     I                                       73  84 WODE7
     I                                       85  96 WODE8
     I                                       97 108 WODE9
     I                                      109 120 WODE0
     I            DS
     I                                        1 100 #IT
     I                                        1  10 WITE1
     I                                       11  20 WITE2
     I                                       21  30 WITE3
     I                                       31  40 WITE4
     I                                       41  50 WITE5
     I                                       51  60 WITE6
     I                                       61  70 WITE7
     I                                       71  80 WITE8
     I                                       81  90 WITE9
     I                                       91 100 WITE0
     I            DS
     I                                        1  10 #TY
     I                                        1   1 WTYP1
     I                                        2   2 WTYP2
     I                                        3   3 WTYP3
     I                                        4   4 WTYP4
     I                                        5   5 WTYP5
     I                                        6   6 WTYP6
     I                                        7   7 WTYP7
     I                                        8   8 WTYP8
     I                                        9   9 WTYP9
     I                                       10  10 WTYP0
     I            DS
     I                                        1 150 #WI
     I                                        1  15 WWIR1
     I                                       16  30 WWIR2
     I                                       31  45 WWIR3
     I                                       46  60 WWIR4
     I                                       61  75 WWIR5
     I                                       76  90 WWIR6
     I                                       91 105 WWIR7
     I                                      106 120 WWIR8
     I                                      121 135 WWIR9
     I                                      136 150 WWIR0
     I            DS
     I                                        1  50 #DI
     I                                        1   52WDIA1
     I                                        6  102WDIA2
     I                                       11  152WDIA3
     I                                       16  202WDIA4
     I                                       21  252WDIA5
     I                                       26  302WDIA6
     I                                       31  352WDIA7
     I                                       36  402WDIA8
     I                                       41  452WDIA9
     I                                       46  502WDIA0
     I            DS
     I                                        1  400#WE
     I                                        1   40WWEI1
     I                                        5   80WWEI2
     I                                        9  120WWEI3
     I                                       13  160WWEI4
     I                                       17  200WWEI5
     I                                       21  240WWEI6
     I                                       25  280WWEI7
     I                                       29  320WWEI8
     I                                       33  360WWEI9
     I                                       37  400WWEI0
     I            DS
     I                                        1  50 #CA
     I                                        1   5 WCAS1
     I                                        6  10 WCAS2
     I                                       11  15 WCAS3
     I                                       16  20 WCAS4
     I                                       21  25 WCAS5
     I                                       26  30 WCAS6
     I                                       31  35 WCAS7
     I                                       36  40 WCAS8
     I                                       41  45 WCAS9
     I                                       46  50 WCAS0
      ****************
      *    PARM      *
      ****************
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C           *NAMVAR   DEFN           GDKD01  20
     C                     IN   *NAMVAR
     C                     Z-ADDGDKD01    COUNT   20
      *
     C           @STP0     TAG
     C                     MOVEL*BLANK    @INVO
     C                     MOVEL*BLANK    @ODER
     C                     MOVEL*BLANK    @TYPE
     C                     MOVEL*BLANK    @ZAIS
     C                     Z-ADD0         @ZAIK
TCHK1C*                    MOVEL'0002'    @SIRE
TCHK1C                     MOVEL'8990'    @SIRE
     C                     Z-ADD0111      @UKEI   40
     C                     MOVE *BLANK    @ERR
     C                     Z-ADD0         KSIRE   40
     C                     MOVEL*BLANK    KINV1   2
     C                     MOVEL*BLANK    KINV2   4
     C                     Z-ADD0         KODE1   20
     C                     Z-ADD0         KODE2   20
     C                     Z-ADD0         KODE3   20
     C                     MOVEL*BLANK    KTYPE   1
     C                     MOVEL*BLANK    KZAIS  15
     C                     Z-ADD0         KZAIK   52
     C                     Z-ADD0         KITEM   50
     C                     Z-ADD0         KIKBN   20
     C                     MOVEL*BLANK    KCASE   5
     C                     MOVEL*BLANK    LINVO
     C                     Z-ADD0         LODER
     C                     MOVEL*BLANK    LTYPE
     C                     MOVEL*BLANK    LZAIS
     C                     Z-ADD0         LZAIK
     C                     Z-ADD0         LITEM
     C                     Z-ADD0         LIKBN
     C                     MOVEL*BLANK    LCASE
     C                     MOVEL*BLANK    HINVO
     C                     Z-ADD0         HODER
     C                     MOVEL*BLANK    HTYPE
     C                     MOVEL*BLANK    HZAIS
     C                     Z-ADD0         HZAIK
     C                     Z-ADD0         HITEM
     C                     Z-ADD0         HIKBN
     C                     MOVEL*BLANK    HCASE
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     99
      *
      *--------*
      *画面１*
      *--------*
     C           @STP1     TAG
     C                     EXFMTGDLPW601
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     0699
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *--------------*
      *  ERR CHECK   *
      *--------------*
      *
     C           @TYPE     IFNE *BLANK
     C           @ZAIS     ORNE *BLANK
     C           @ZAIK     ORNE 0
     C           @TYPE     IFEQ *BLANK
     C                     MOVELER,1      @ERR
     C                     SETON                     0399
     C                     GOTO @STP1
     C                     END
     C           @TYPE     IFEQ 'W'
     C           @TYPE     OREQ 'R'
     C                     ELSE
     C                     MOVELER,41     @ERR
     C                     SETON                     0399
     C                     GOTO @STP1
     C                     END
     C           @ZAIS     IFEQ *BLANK
     C                     MOVELER,2      @ERR
     C                     SETON                     0499
     C                     GOTO @STP1
     C                     END
     C           @ZAIK     IFEQ 0
     C                     MOVELER,3      @ERR
     C                     SETON                     0599
     C                     GOTO @STP1
     C                     END
     C                     END
      * CHAR CHECK
     C           @ODER     IFNE *BLANK
     C                     MOVEL@ODER     PIN    99
     C                     Z-ADD6         PKT     20
     C                     EXSR #CHECK
     C           WFLG      IFEQ '*'
     C                     MOVELER,4      @ERR
     C                     SETON                     0299
     C                     GOTO @STP1
     C                     END
     C                     END
      *
     C           @SIRE     IFEQ *BLANK
     C                     MOVELER,5      @ERR
     C                     SETON                     0699
     C                     GOTO @STP1
     C                     END
      *
     C                     MOVE @SIRE     WSIRE   40
     C                     MOVE @SIRE     KSIRE
     C                     SETOF                     20
     C           WSIRE     CHAINFGBPL011             20
     C           *IN20     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     20
     C                     END
     C           *IN20     IFEQ '1'
     C                     SETON                     0699
     C                     MOVELER,6      @ERR
     C                     GOTO @STP1
     C                     END
     C                     MOVELB2SMEI    @SINM
      *HAIRETU SET
     C                     EXSR #KEY
     C                     EXSR #SET
      *--------*
      *画面２*
      *--------*
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     070899
     C           @STP2     TAG
     C                     EXFMTGDLPW602
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     070899
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     373839
     C                     SETOF                     40
     C                     MOVEL*BLANK    WKOSN   1
      *-------*
      * CMD-3 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO @STP0
     C                     END
      *
     C           *IN90     IFEQ '1'
     C                     EXSR #ROLUP
     C           Z         IFEQ 0
     C                     MOVELER,7      @ERR
     C                     SETON                     99
     C                     GOTO @STP2
     C                     END
     C                     END
     C           *IN95     IFEQ '1'
     C                     EXSR #ROLDW
     C           Z         IFEQ 11
     C                     MOVELER,8      @ERR
     C                     SETON                     99
     C                     GOTO @STP2
     C                     END
     C           Z         IFNE 1
     C                     EXSR #SET
     C                     GOTO @STP2
     C                     END
     C                     END
      *
     C           PNO       IFNE *BLANK
     C                     Z-ADD0         KK      20
     C                     Z-ADD30        LL      20
     C           1         DO   10
     C                     ADD  1         KK
     C                     ADD  1         LL
     C           #NO,KK    IFEQ *BLANK
     C           #NO,KK    OREQ '0'
     C           #NO,KK    OREQ '1'
     C           #NO,KK    IFEQ '0'
     C           #NO,KK    OREQ '1'
     C           #IN,KK    IFEQ *BLANK
     C                     MOVELER,9      @ERR
     C                     MOVEA'1'       *IN,LL
     C                     SETON                     99
     C                     GOTO @STP2
     C                     END
     C                     END
     C                     ELSE
     C                     MOVELER,10     @ERR
     C                     MOVEA'1'       *IN,LL
     C                     SETON                     99
     C                     GOTO @STP2
     C                     END
     C                     ENDDO
      *
     C                     Z-ADD0         KK      20
     C           1         DO   10
     C                     ADD  1         KK
     C           #NO,KK    IFNE *BLANK
     C           #NO,KK    IFEQ '0'
     C                     MOVEL'0'       WKOSN
     C                     END
     C           #NO,KK    IFEQ '1'
     C                     MOVEL'1'       WKOSN
     C                     END
     C                     GOTO @JUMP
     C                     END
     C                     ENDDO
      *
     C                     END
      *
     C           WINVO     IFEQ *BLANK
     C           WODER     ANDEQ*BLANK
     C           WITEM     ANDEQ*BLANK
     C           WIKBN     ANDEQ*BLANK
     C           WTYPE     ANDEQ*BLANK
     C           WZAIS     ANDEQ*BLANK
     C           WZAIK     ANDEQ0
     C           WCASE     ANDEQ*BLANK
     C                     GOTO @STP2
     C                     END
      *ADDING
     C                     MOVEL'2'       WKOSN
      *
     C           WINVO     IFEQ *BLANK
     C                     MOVELER,11     @ERR
     C                     SETON                     0199
     C                     GOTO @STP2
     C                     END
      *
     C           WODER     IFEQ *BLANK
     C                     MOVELER,12     @ERR
     C                     SETON                     0299
     C                     GOTO @STP2
     C                     END
     C                     MOVELWODER     PIN    99
     C                     Z-ADD6         PKT     20
     C                     EXSR #CHECK
     C           WFLG      IFEQ '*'
     C                     MOVELER,13     @ERR
     C                     SETON                     0299
     C                     GOTO @STP2
     C                     END
      *
     C           WITEM     IFEQ *BLANK
     C                     MOVELER,14     @ERR
     C                     SETON                     0399
     C                     GOTO @STP2
     C                     END
     C                     MOVELWITEM     PIN    99
     C                     Z-ADD5         PKT     20
     C                     EXSR #CHECK
     C           WFLG      IFEQ '*'
     C                     MOVELER,15     @ERR
     C                     SETON                     0399
     C                     GOTO @STP2
     C                     END
      *
     C           WIKBN     IFEQ *BLANK
     C                     MOVELER,16     @ERR
     C                     SETON                     0499
     C                     GOTO @STP2
     C                     END
     C                     MOVELWIKBN     PIN    99
     C                     Z-ADD2         PKT     20
     C                     EXSR #CHECK
     C           WFLG      IFEQ '*'
     C                     MOVELER,17     @ERR
     C                     SETON                     0499
     C                     GOTO @STP2
     C                     END
      *
     C           WTYPE     IFEQ *BLANK
     C                     MOVELER,18     @ERR
     C                     SETON                     0599
     C                     GOTO @STP2
     C                     END
     C           WTYPE     IFEQ 'W'
     C           WTYPE     OREQ 'R'
     C                     ELSE
     C                     MOVELER,19     @ERR
     C                     SETON                     0599
     C                     GOTO @STP2
     C                     END
      *
     C           WZAIS     IFEQ *BLANK
     C                     MOVELER,20     @ERR
     C                     SETON                     0699
     C                     GOTO @STP2
     C                     END
      *
     C           WZAIK     IFEQ 0
     C                     MOVELER,21     @ERR
     C                     SETON                     0799
     C                     GOTO @STP2
     C                     END
      *
     C           KEY1      KLIST
     C                     KFLD           WZAIS
     C                     KFLD           WZAIK
     C                     KFLD           @UKEI
     C                     KFLD           WSIRE
     C           KEY2      KLIST
     C                     KFLD           WSIRE
     C                     KFLD           @SIRK
     C                     KFLD           WZAIS
     C                     KFLD           WZAIK
      *
      *--------------------------------------*
      *母材・完成材かんばんマスターチェック*
      *--------------------------------------*
     C                     MOVEL*BLANK    @DATA   1
      *-------------*
      * WIRE KANBAN *
      *-------------*
     C           WTYPE     IFEQ 'W'
     C                     SETOF                     41
     C           KEY1      SETGTIZAPL011
     C                     DO   *HIVAL
     C           KEY1      REDPEIZAPL011                 41
      *
     C           *IN41     IFEQ '0'
     C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZCUKHZ    IFLE *DATE
     C           ZCSTHZ    ANDGT*DATE
     C                     MOVEL'*'       @DATA
     C                     END
     C                     END
     C                     END
     C  N41                ENDDO
      *
     C           @DATA     IFEQ *BLANK
     C                     SETON                     050607
     C                     SETON                     99
     C                     MOVELER,22     @ERR
     C                     GOTO @STP2
     C                     END
     C                     END
      *------------*
      * ROD KANBAN *
      *------------*
     C           WTYPE     IFEQ 'R'
     C                     SETOF                     41
     C           KEY1      SETGTIZBPL011
     C                     DO   *HIVAL
     C           KEY1      REDPEIZBPL011                 41
      *
     C           *IN41     IFEQ '0'
     C           ZDSKJY    IFEQ 'D'
     C           ZDSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZDUKHZ    IFLE *DATE
     C           ZDSTHZ    ANDGT*DATE
     C                     MOVEL'*'       @DATA
     C                     END
     C                     END
     C                     END
     C  N41                ENDDO
      *
     C           @DATA     IFEQ *BLANK
     C                     SETON                     050607
     C                     SETON                     99
     C                     MOVELER,23     @ERR
     C                     GOTO @STP2
     C                     END
     C                     END
      *
     C                     MOVEL*BLANK    @SIRK   1
     C                     SETOF                     41
     C           KEY2      CHAINGDLPL801             41
     C           *IN41     IFEQ '0'
     C           LHSKJY    IFEQ 'D'
     C           LHSKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELLHTANK    WUNIT
     C                     END
     C                     END
      *
     C           WCASE     IFEQ *BLANK
     C                     MOVELER,24     @ERR
     C                     SETON                     0899
     C                     GOTO @STP2
     C                     END
     C                     MOVELWCASE     PIN    99
     C                     Z-ADD5         PKT     20
     C                     EXSR #CHECK
     C           WFLG      IFEQ '*'
     C                     MOVELER,25     @ERR
     C                     SETON                     0899
     C                     GOTO @STP2
     C                     END
      *
     C           @JUMP     TAG
     C           WKOSN     IFEQ '2'
     C                     MOVELWINVO     KINVO
     C                     MOVE WODER     KODER
     C                     MOVE WITEM     KITEM
     C                     MOVE WIKBN     KIKBN
     C                     MOVELWTYPE     KTYPE
     C                     MOVELWZAIS     KZAIS
     C                     Z-ADDWZAIK     KZAIK
     C                     MOVELWCASE     KCASE
     C                     ELSE
     C                     MOVEL#IN,KK    KINVO
     C                     MOVE #OD,KK    KODER
     C                     MOVEL#IT,KK    KITEM
     C                     MOVE #IT,KK    KIKBN
     C                     MOVEL#TY,KK    KTYPE
     C                     MOVEL#WI,KK    KZAIS
     C                     MOVEL#DI,KK    KZAIK
     C                     MOVEL#CA,KK    KCASE
     C                     MOVEL#IN,KK    WINVO
     C                     MOVE #OD,KK    WODER
     C                     MOVEL#IT,KK    WITEM
     C                     MOVE #IT,KK    WIKBN
     C                     MOVEL#TY,KK    WTYPE
     C                     MOVEL#WI,KK    WZAIS
     C                     MOVE #DI,KK    WZAIK
     C                     MOVEL#CA,KK    WCASE
     C                     END
      *
     C                     MOVEL*BLANK    @KOSN   1
     C                     SETOF                     20
     C           KEY08     CHAINGDLPL431             20
     C           *IN20     IFEQ '0'
     C                     MOVEL'1'       @KOSN
     C           LFSKJY    IFEQ 'D'
     C           LFSKHZ    ANDLE*DATE
     C                     SETON                     20
     C                     END
     C                     END
      *
     C           WKOSN     IFEQ '0'
     C           WKOSN     OREQ '1'
     C           *IN20     IFEQ '1'
     C                     SETON                     010203
     C                     SETON                     040506
     C                     SETON                     070899
     C                     MOVELER,26     @ERR
     C                     GOTO @STP2
     C                     END
     C                     Z-ADDLFODHZ    WODHZ
     C                     Z-ADDLFSHHZ    WPOHZ
     C                     Z-ADDLFUKHZ    WREHZ
     C                     Z-ADDLFSIHZ    WPAHZ
     C                     MOVELLFHANY    WTRAN
     C                     Z-ADDLFJRYO    WWEIG
     C                     Z-ADDLFTANK    WUNIT
     C                     MOVELLFUTCD    WCODE
     C                     Z-ADDLFRATE    WRATE
     C           LFJRYO    MULT LFTANK    WYEN#
     C           LFRATE    IFNE 0
     C           WYEN#     DIV  LFRATE    WDOLL
     C                     END
     C                     ELSE
     C           *IN20     IFEQ '0'
     C                     SETON                     010203
     C                     SETON                     040506
     C                     SETON                     070899
     C                     MOVELER,27     @ERR
     C                     GOTO @STP2
     C                     END
     C                     Z-ADD0         WODHZ
     C                     Z-ADD0         WPOHZ
     C                     Z-ADD0         WREHZ
     C                     Z-ADD0         WPAHZ
     C                     MOVEL*BLANK    WTRAN
     C                     Z-ADD0         WWEIG
     C                     Z-ADD0         WUNIT
     C                     MOVEL*BLANK    WCODE
     C                     Z-ADD0         WRATE
     C                     Z-ADD0         WYEN#
     C                     Z-ADD0         WDOLL
     C                     END
      *--------*
      *画面３*
      *--------*
     C                     SETOF                     50
     C           WKOSN     IFEQ '0'
     C                     SETON                     50
     C                     END
      *
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     070809
     C                     SETOF                     101199
     C           @STP3     TAG
     C                     EXFMTGDLPW603
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     070809
     C                     SETOF                     101199
      *-------*
      * CMD-3 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     EXSR #SET
     C                     GOTO @STP2
     C                     END
      *
     C           WODHZ     IFEQ 0
     C                     SETON                     0199
     C                     MOVELER,28     @ERR
     C                     GOTO @STP3
     C                     END
      *
     C           WODYY     IFLT 2000
     C                     MOVELER,29     @ERR
     C                     SETON                     0199
     C                     GOTO @STP3
     C                     END
     C           WODMM     IFLE 0
     C           WODMM     ORGT 12
     C                     MOVELER,29     @ERR
     C                     SETON                     0199
     C                     GOTO @STP3
     C                     END
     C           WODDD     IFLE 0
     C           WODDD     ORGT 31
     C                     MOVELER,29     @ERR
     C                     SETON                     0199
     C                     GOTO @STP3
     C                     END
      *
     C           WPOHZ     IFEQ 0
     C                     SETON                     0299
     C                     MOVELER,30     @ERR
     C                     GOTO @STP3
     C                     END
      *
     C           WPOYY     IFLT 2000
     C                     MOVELER,31     @ERR
     C                     SETON                     0299
     C                     GOTO @STP3
     C                     END
     C           WPOMM     IFLE 0
     C           WPOMM     ORGT 12
     C                     MOVELER,31     @ERR
     C                     SETON                     0299
     C                     GOTO @STP3
     C                     END
     C           WPODD     IFLE 0
     C           WPODD     ORGT 31
     C                     MOVELER,31     @ERR
     C                     SETON                     0299
     C                     GOTO @STP3
     C                     END
      *
     C           WREHZ     IFEQ 0
     C                     SETON                     0399
     C                     MOVELER,32     @ERR
     C                     GOTO @STP3
     C                     END
      *
     C           WREYY     IFLT 2000
     C                     MOVELER,33     @ERR
     C                     SETON                     0399
     C                     GOTO @STP3
     C                     END
     C           WREMM     IFLE 0
     C           WREMM     ORGT 12
     C                     MOVELER,33     @ERR
     C                     SETON                     0399
     C                     GOTO @STP3
     C                     END
     C           WREDD     IFLE 0
     C           WREDD     ORGT 31
     C                     MOVELER,33     @ERR
     C                     SETON                     0399
     C                     GOTO @STP3
     C                     END
      *
     C*          WPAHZ     IFEQ 0
     C*                    SETON                     0499
     C*                    MOVELER,34     @ERR
     C*                    GOTO @STP3
     C*                    END
      *
     C*          WPAYY     IFLT 2000
     C*                    MOVELER,35     @ERR
     C*                    SETON                     0499
     C*                    GOTO @STP3
     C*                    END
     C*          WPAMM     IFLE 0
     C*          WPAMM     ORGT 12
     C*                    MOVELER,35     @ERR
     C*                    SETON                     0499
     C*                    GOTO @STP3
     C*                    END
     C*          WPADD     IFLE 0
     C*          WPADD     ORGT 31
     C*                    MOVELER,35     @ERR
     C*                    SETON                     0499
     C*                    GOTO @STP3
     C*                    END
      *
     C                     Z-ADDWPOHZ     WPAHZ
     C                     DO   COUNT
     C           WPAMM     IFEQ 12
     C                     ADD  1         WPAYY
     C                     Z-ADD1         WPAMM
     C                     ELSE
     C                     ADD  1         WPAMM
     C                     END
     C                     END
     C                     Z-ADDWPAMM     A       20
     C           A         IFEQ 2
     C           WPAYY     DIV  4         WWW001  40
     C                     MVR            WWW002  40
     C           WWW002    IFEQ 0
     C                     Z-ADD13        A
     C                     END
     C                     END
     C                     Z-ADDMM,A      WPADD
      *
     C           WTRAN     IFEQ *BLANK
     C                     SETON                     0599
     C                     MOVELER,36     @ERR
     C                     GOTO @STP3
     C                     END
      *
     C           WTRAN     IFEQ 'A'
     C           WTRAN     OREQ 'S'
     C                     ELSE
     C                     SETON                     0599
     C                     MOVELER,37     @ERR
     C                     GOTO @STP3
     C                     END
      *
     C           WWEIG     IFEQ 0
     C                     SETON                     0699
     C                     MOVELER,38     @ERR
     C                     GOTO @STP3
     C                     END
      *
     C           WUNIT     IFEQ 0
     C                     SETON                     0799
     C                     MOVELER,39     @ERR
     C                     GOTO @STP3
     C                     END
      *
     C           WCODE     IFEQ 'YEN'
     C           WCODE     OREQ 'US '
     C                     ELSE
     C                     SETON                     0899
     C                     MOVELER,40     @ERR
     C                     GOTO @STP3
     C                     END
      *
     C           WWEIG     MULT WUNIT     WYEN#
     C                     Z-ADD0         WDOLL
     C           WRATE     IFNE 0
     C           WYEN#     DIV  WRATE     WDOLL
     C                     END
      *-------*
      * CMD-5 *
      *-------*
     C           *INKE     IFEQ '0'
     C                     GOTO @STP3
     C                     END
      *------*
      *取消*
      *------*
     C           WKOSN     IFEQ '0'
     C                     MOVEL'D'       LFSKJY
     C                     Z-ADD*DATE     LFSKHZ
     C                     Z-ADD*DATE     LFKOHZ
     C                     TIME           LFKOTI
     C                     MOVELUS        LFKOME
     C                     END
      *------*
      *変更*
      *------*
     C           WKOSN     IFEQ '1'
     C           WKOSN     OREQ '2'
     C                     MOVE *BLANK    LFSKJY
     C                     Z-ADD0         LFSKHZ
     C                     Z-ADD*DATE     LFKOHZ
     C                     TIME           LFKOTI
     C                     MOVELUS        LFKOME
     C                     MOVELWINVO     LFINVO
     C                     MOVE WODER     LFODER
     C                     MOVE WITEM     LFITEM
     C                     MOVE WIKBN     LFIKBN
     C                     MOVELWTYPE     LFPTCD
     C                     MOVELWZAIS     LFZAIS
     C                     Z-ADDWZAIK     LFZAIK
     C                     MOVELWCASE     LFCASE
     C                     MOVE @SIRE     LFSIRE
     C                     MOVE @UKEI     LFRECE
     C                     Z-ADDWWEIG     LFJRYO
     C                     Z-ADDWUNIT     LFTANK
     C                     MOVELWCODE     LFUTCD
     C                     Z-ADDWRATE     LFRATE
     C                     Z-ADDWODHZ     LFODHZ
     C                     Z-ADDWREHZ     LFUKHZ
     C                     Z-ADDWPOHZ     LFSHHZ
     C                     Z-ADDWPAHZ     LFSIHZ
     C                     MOVELWTRAN     LFHANY
     C                     END
      *
     C           @KOSN     IFEQ '1'
     C                     UPDATGDLPL431
     C                     ELSE
     C                     WRITEGDLPL431
     C                     END
      *
     C                     EXSR #SET
     C                     GOTO @STP2
     C*----------------------------------------------------*
     C           #SET      BEGSR
     C*----------------------------------------------------*
     C                     MOVEL*BLANK    WKOSN
     C                     MOVEL*BLANK    WINVO
     C                     MOVEL*BLANK    WODER
     C                     MOVEL*BLANK    WITEM
     C                     MOVEL*BLANK    WIKBN
     C                     MOVEL*BLANK    WTYPE
     C                     MOVEL*BLANK    WZAIS
     C                     Z-ADD0         WZAIK
     C                     MOVEL*BLANK    WCASE
     C                     MOVEL*BLANK    #NO
     C                     MOVEL*BLANK    #IN
     C                     MOVEL*BLANK    #OD
     C                     MOVEL*BLANK    #IT
     C                     MOVEL*BLANK    #TY
     C                     MOVEL*BLANK    #WI
     C                     MOVEL*ALL'0'   #DI
     C                     Z-ADD0         #WE
     C                     MOVEL*BLANK    #CA
      *
     C                     Z-ADD0         Z       30
     C                     SETOF                     20
     C   51      KEY01     SETLLGDLPL431
     C   52      KEY02     SETLLGDLPL431
     C   53      KEY03     SETLLGDLPL431
     C   54      KEY04     SETLLGDLPL451
     C   55      KEY05     SETLLGDLPL441
     C   56      KEY06     SETLLGDLPL441
     C   57      KEY07     SETLLGDLPL451
     C   58      KEY08     SETLLGDLPL431
     C                     DO   *HIVAL
     C   51      KEY01     READEGDLPL431                 20
     C   52      KEY02     READEGDLPL431                 20
     C   53      KEY03     READEGDLPL431                 20
     C   54      KEY04     READEGDLPL451                 20
     C   55      KEY05     READEGDLPL441                 20
     C   56      KEY06     READEGDLPL441                 20
     C   57      KEY07     READEGDLPL451                 20
     C   58      KEY08     READEGDLPL431                 20
     C           *IN20     IFEQ '0'
     C           LFSKJY    IFEQ 'D'
     C           LFSKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  1         Z
     C                     MOVELLFINVO    #IN,Z
     C                     MOVEL'IAF -'   #OD,Z
     C                     MOVE LFODER    #OD,Z
     C                     MOVE '-   '    #IT,Z
     C                     MOVELLFITEM    #IT,Z
     C                     MOVE LFIKBN    #IT,Z
     C                     MOVELLFPTCD    #TY,Z
     C                     MOVELLFZAIS    #WI,Z
     C                     MOVE LFZAIK    #DI,Z
     C                     Z-ADDLFJRYO    #WE,Z
     C                     MOVELLFCASE    #CA,Z
      *HI-KEY
     C                     MOVELLFSIRE    HSIRE   4
     C                     MOVELLFINVO    HINVO   6
     C                     Z-ADDLFODER    HODER   60
     C                     Z-ADDLFITEM    HITEM   50
     C                     Z-ADDLFIKBN    HIKBN   20
     C                     MOVELLFPTCD    HTYPE   1
     C                     MOVELLFZAIS    HZAIS  15
     C                     Z-ADDLFZAIK    HZAIK   52
     C                     MOVELLFCASE    HCASE   5
      *LO-KEY
     C           Z         IFEQ 1
     C                     MOVELLFSIRE    LSIRE   4
     C                     MOVELLFINVO    LINVO   6
     C                     Z-ADDLFODER    LODER   60
     C                     Z-ADDLFITEM    LITEM   50
     C                     Z-ADDLFIKBN    LIKBN   20
     C                     MOVELLFPTCD    LTYPE   1
     C                     MOVELLFZAIS    LZAIS  15
     C                     Z-ADDLFZAIK    LZAIK   52
     C                     MOVELLFCASE    LCASE   5
     C                     END
     C           Z         IFEQ 10
     C                     SETON                     20
     C                     END
     C                     END
     C                     END
     C  N20                ENDDO
     C           ESET      ENDSR
      *----------------------------------------------------*
      *    ROLL UP                                       *
      *----------------------------------------------------*
     CSR         #ROLUP    BEGSR
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     070899
     C                     MOVE HSIRE     KSIRE
     C                     MOVELHINVO     KINVO
     C                     Z-ADDHODER     KODER
     C                     Z-ADDHITEM     KITEM
     C                     MOVELHIKBN     KIKBN
     C                     MOVELHTYPE     KTYPE
     C                     MOVELHZAIS     KZAIS
     C                     Z-ADDHZAIK     KZAIK
     C                     MOVELHCASE     KCASE
     C                     Z-ADD0         Z
     C                     SETOF                       20
     C   81      KEY08     SETGTGDLPL431
     C   82      KEY09     SETGTGDLPL441
     C   83      KEY10     SETGTGDLPL451
     C                     DO   *HIVAL
     C   51      KEY01     READEGDLPL431                 20
     C   52      KEY02     READEGDLPL431                 20
     C   53      KEY03     READEGDLPL431                 20
     C   54      KEY04     READEGDLPL451                 20
     C   55      KEY05     READEGDLPL441                 20
     C   56      KEY06     READEGDLPL441                 20
     C   57      KEY07     READEGDLPL451                 20
     C   58      KEY08     READEGDLPL431                 20
     C           *IN20     IFEQ '0'
     C           LFSKJY    IFEQ 'D'
     C           LFSKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  1         Z
     C           Z         IFEQ 1
     C                     MOVEL*BLANK    #NO
     C                     MOVEL*BLANK    #IN
     C                     MOVEL*BLANK    #OD
     C                     MOVEL*BLANK    #IT
     C                     MOVEL*BLANK    #TY
     C                     MOVEL*BLANK    #WI
     C                     MOVEL*ALL'0'   #DI
     C                     Z-ADD0         #WE
     C                     MOVEL*BLANK    #CA
     C                     MOVELLFINVO    LINVO
     C                     Z-ADDLFODER    LODER
     C                     Z-ADDLFITEM    LITEM
     C                     Z-ADDLFIKBN    LIKBN
     C                     MOVELLFPTCD    LTYPE
     C                     MOVELLFZAIS    LZAIS
     C                     Z-ADDLFZAIK    LZAIK
     C                     MOVELLFCASE    LCASE
     C                     END
     C                     MOVELLFINVO    #IN,Z
     C                     MOVEL'IAF -'   #OD,Z
     C                     MOVE LFODER    #OD,Z
     C                     MOVE '-   '    #IT,Z
     C                     MOVELLFITEM    #IT,Z
     C                     MOVE LFIKBN    #IT,Z
     C                     MOVELLFPTCD    #TY,Z
     C                     MOVELLFZAIS    #WI,Z
     C                     MOVE LFZAIK    #DI,Z
     C                     Z-ADDLFJRYO    #WE,Z
     C                     MOVELLFCASE    #CA,Z
     C                     MOVELLFINVO    HINVO
     C                     Z-ADDLFODER    HODER
     C                     Z-ADDLFITEM    HITEM
     C                     Z-ADDLFIKBN    HIKBN
     C                     MOVELLFPTCD    HTYPE
     C                     MOVELLFZAIS    HZAIS
     C                     Z-ADDLFZAIK    HZAIK
     C                     MOVELLFCASE    HCASE
     C           Z         IFEQ 10
     C                     GOTO EROLUP
     C                     END
     C                     END
     C                     END
     C  N20                ENDDO
     CSR         EROLUP    ENDSR
      *----------------------------------------------------*
      *    ROLL DWN                                      *
      *----------------------------------------------------*
     CSR         #ROLDW    BEGSR
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     070899
     C                     MOVE LSIRE     KSIRE
     C                     MOVELLINVO     KINVO
     C                     Z-ADDLODER     KODER
     C                     Z-ADDLITEM     KITEM
     C                     MOVELLIKBN     KIKBN
     C                     MOVELLTYPE     KTYPE
     C                     MOVELLZAIS     KZAIS
     C                     Z-ADDLZAIK     KZAIK
     C                     MOVELLCASE     KCASE
     C                     Z-ADD11        Z
     C                     SETOF                       20
     C   81      KEY08     SETLLGDLPL431
     C   82      KEY09     SETLLGDLPL441
     C   83      KEY10     SETLLGDLPL451
     C                     DO   *HIVAL
     C   51      KEY01     REDPEGDLPL431                 20
     C   52      KEY02     REDPEGDLPL431                 20
     C   53      KEY03     REDPEGDLPL431                 20
     C   54      KEY04     REDPEGDLPL451                 20
     C   55      KEY05     REDPEGDLPL441                 20
     C   56      KEY06     REDPEGDLPL441                 20
     C   57      KEY07     REDPEGDLPL451                 20
     C   58      KEY08     REDPEGDLPL431                 20
     C           *IN20     IFEQ '0'
     C           LFSKJY    IFEQ 'D'
     C           LFSKHZ    ANDLE*DATE
     C                     ELSE
     C                     SUB  1         Z
     C           Z         IFEQ 10
     C                     MOVEL*BLANK    #NO
     C                     MOVEL*BLANK    #IN
     C                     MOVEL*BLANK    #OD
     C                     MOVEL*BLANK    #IT
     C                     MOVEL*BLANK    #TY
     C                     MOVEL*BLANK    #WI
     C                     MOVE *ALL'0'   #DI
     C                     Z-ADD0         #WE
     C                     MOVEL*BLANK    #CA
     C                     MOVELLFINVO    HINVO
     C                     Z-ADDLFODER    HODER
     C                     Z-ADDLFITEM    HITEM
     C                     Z-ADDLFIKBN    HIKBN
     C                     MOVELLFPTCD    HTYPE
     C                     MOVELLFZAIS    HZAIS
     C                     Z-ADDLFZAIK    HZAIK
     C                     MOVELLFCASE    HCASE
     C                     END
     C                     MOVELLFINVO    #IN,Z
     C                     MOVEL'IAF -'   #OD,Z
     C                     MOVE LFODER    #OD,Z
     C                     MOVE '-   '    #IT,Z
     C                     MOVELLFITEM    #IT,Z
     C                     MOVE LFIKBN    #IT,Z
     C                     MOVELLFPTCD    #TY,Z
     C                     MOVELLFZAIS    #WI,Z
     C                     MOVE LFZAIK    #DI,Z
     C                     Z-ADDLFJRYO    #WE,Z
     C                     MOVELLFCASE    #CA,Z
     C                     MOVELLFINVO    LINVO
     C                     Z-ADDLFODER    LODER
     C                     Z-ADDLFITEM    LITEM
     C                     Z-ADDLFIKBN    LIKBN
     C                     MOVELLFPTCD    LTYPE
     C                     MOVELLFZAIS    LZAIS
     C                     Z-ADDLFZAIK    LZAIK
     C                     MOVELLFCASE    LCASE
     C           Z         IFEQ 1
     C                     GOTO EROLDW
     C                     END
     C                     END
     C                     END
     C  N20                ENDDO
     CSR         EROLDW    ENDSR
     C*----------------------------------------------------*
     C           #KEY      BEGSR
     C*----------------------------------------------------*
     C           KEY01     KLIST
     C                     KFLD           KSIRE
     C           KEY02     KLIST
     C                     KFLD           KSIRE
     C                     KFLD           KINV1
     C                     KFLD           KINV2
     C           KEY03     KLIST
     C                     KFLD           KSIRE
     C                     KFLD           KINV1
     C                     KFLD           KINV2
     C                     KFLD           KORD1
     C                     KFLD           KORD2
     C                     KFLD           KORD3
     C           KEY04     KLIST
     C                     KFLD           KSIRE
     C                     KFLD           KTYPE
     C                     KFLD           KZAIS
     C                     KFLD           KZAIK
     C                     KFLD           KINV1
     C                     KFLD           KINV2
     C           KEY05     KLIST
     C                     KFLD           KSIRE
     C                     KFLD           KORD1
     C                     KFLD           KORD2
     C                     KFLD           KORD3
     C           KEY06     KLIST
     C                     KFLD           KSIRE
     C                     KFLD           KORD1
     C                     KFLD           KORD2
     C                     KFLD           KORD3
     C                     KFLD           KTYPE
     C                     KFLD           KZAIS
     C                     KFLD           KZAIK
     C           KEY07     KLIST
     C                     KFLD           KSIRE
     C                     KFLD           KTYPE
     C                     KFLD           KZAIS
     C                     KFLD           KZAIK
     C           KEY08     KLIST
     C                     KFLD           KSIRE
     C                     KFLD           KINV1
     C                     KFLD           KINV2
     C                     KFLD           KORD1
     C                     KFLD           KORD2
     C                     KFLD           KORD3
     C                     KFLD           KTYPE
     C                     KFLD           KZAIS
     C                     KFLD           KZAIK
     C           KEY09     KLIST
     C                     KFLD           KSIRE
     C                     KFLD           KORD1
     C                     KFLD           KORD2
     C                     KFLD           KORD3
     C                     KFLD           KTYPE
     C                     KFLD           KZAIS
     C                     KFLD           KZAIK
     C                     KFLD           KINV1
     C                     KFLD           KINV2
     C           KEY10     KLIST
     C                     KFLD           KSIRE
     C                     KFLD           KTYPE
     C                     KFLD           KZAIS
     C                     KFLD           KZAIK
     C                     KFLD           KINV1
     C                     KFLD           KINV2
     C                     KFLD           KORD1
     C                     KFLD           KORD2
     C                     KFLD           KORD3
      *
     C                     MOVEA'00000000'*IN,51
     C                     MOVEA'000'     *IN,81
      *
     C                     MOVEL@INVO     KINVO
     C                     MOVE @ODER     KODER
     C                     MOVEL@TYPE     KTYPE
     C                     MOVEL@ZAIS     KZAIS
     C                     Z-ADD@ZAIK     KZAIK
      *
     C           @INVO     IFEQ *BLANK
     C           @ODER     ANDEQ*BLANK
     C           @TYPE     ANDEQ*BLANK
     C                     SETON                     5181
     C                     END
      *
     C           @INVO     IFNE *BLANK
     C           @ODER     ANDEQ*BLANK
     C           @TYPE     ANDEQ*BLANK
     C                     SETON                     5281
     C                     END
      *
     C           @INVO     IFNE *BLANK
     C           @ODER     ANDNE*BLANK
     C           @TYPE     ANDEQ*BLANK
     C                     SETON                     5381
     C                     END
      *
     C           @INVO     IFNE *BLANK
     C           @ODER     ANDEQ*BLANK
     C           @TYPE     ANDNE*BLANK
     C                     SETON                     5481
     C                     END
      *
     C           @INVO     IFEQ *BLANK
     C           @ODER     ANDNE*BLANK
     C           @TYPE     ANDEQ*BLANK
     C                     SETON                     5582
     C                     END
      *
     C           @INVO     IFEQ *BLANK
     C           @ODER     ANDNE*BLANK
     C           @TYPE     ANDNE*BLANK
     C                     SETON                     5682
     C                     END
      *
     C           @INVO     IFEQ *BLANK
     C           @ODER     ANDEQ*BLANK
     C           @TYPE     ANDNE*BLANK
     C                     SETON                     5783
     C                     END
      *
     C           @INVO     IFNE *BLANK
     C           @ODER     ANDNE*BLANK
     C           @TYPE     ANDNE*BLANK
     C                     SETON                     5881
     C                     END
      *
     C           EKEY      ENDSR
      *----------------------------------------------------*
     C           #CHECK    BEGSR
      *----------------------------------------------------*
     C                     Z-ADDPKT       WKT     20
     C                     MOVEL*BLANK    WFLG    1
     C                     SETOF                     20
     C                     Z-ADD*ZERO     I       20
     C* SERCH FIRST
     C                     DO   WKT
     C                     ADD  1         I
     C           WIN,I     IFLT '0'
     C           WIN,I     ORGT '9'
     C                     SETON                     20
     C                     MOVE '*'       WFLG
     C                     END
     C  N20                ENDDO
     C                     MOVEL*BLANK    WIN
      *
     C           ECHECK    ENDSR
** MM
31283130313031313031303129
** @ERR
E-01 INPUT WIRE TYPE.
E-02 INPUT WIRE.
E-03 INPUT WIRE DIAMETER.
E-04 ORDER NO IS WRONG.
E-05 INPUT SUPPLIER.
E-06 SUPPLIER IS NOT FOUND IN DETAIL MGR M/F (SAIMOKU MASTER).
E-07 THIS PAGE IS DISPLAYED THE DATA OF BOTTOM PAGE.
E-08 THIS PAGE IS DISPLAYED THE DATA OF TOP PAGE.
E-09 NO DATA.
E-10 RENEW CODE IS WRONG.
E-11 INPUT INVOICE NO.
E-12 INPUT ORDER NO.
E-13 ORDER NO IS WRONG.
E-14 INPUT ITEM NO.
E-15 ITEM NO IS WRONG.
E-16 INPUT ITEM NO.
E-17 ITEM NO IS WRONG.
E-18 INPUT WIRE TYPE.
E-19 WIRE TYPE IS WRONG<'W' OR 'R'>.
E-20 INPUT WIRE.
E-21 INPUT WIRE DIAMETER.
E-22 DATA NOT FOUND IN WIRE KANBAN M/F.
E-23 DATA NOT FOUND IN ROD KANBAN M/F.
E-24 INPUT CASE NO.
E-25 CASE NO IS WRONG.
E-26 DATA NOT FOUND IN MATERIAL ACCUOUNTS AGGREGATION DATA FILE.
E-27 SAME DATA IS ALREADY ENTERED.
E-28 INPUT ORDER DATE.
E-29 ORDER DATE IS WRONG.
E-30 INPUT DEPARTURE JP PORT DATE.
E-31 DEPARTURE JP PORT DATE IS WRONG.
E-32 INPUT RECIEPT DATE.
E-33 RECIEPT DATE IS WRONG.
E-34 INPUT PAYMENT DATE.
E-35 PAYMENT DATE IS WRONG.
E-36 INPUT TRANSPORTATION.
E-37 TRANSPORTATION IS WRONG.
E-38 INPUT WEIGHT.
E-39 INPUT UNIT PRICE.
E-40 PRICE CODE IS WRONG<'YEN' OR 'US '>.
E-41 WIRE TYPE IS WRONG<'W' OR 'R'>.
