     H            Y.                                    1
      ** GDLR85 *****************************
      *  PRINTING MATERIAL UNIT PRICE LIST  *
      *               K.YASUDA  2000.10.03  *
      ***************************** GDLR85 **
     FGDLPW85 CF  E                    WORKSTN
     FGDLPL80 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGDLWP85 O   F     128            DISK
     E                    ER      1   3 59               ERROR
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     I            DS
     I                                        1   80LHSKHZ
     I                                        1   40LHSKYY
     I                                        5   60LHSKMM
     I                                        7   80LHSKDD
     I            DS
     I                                        1   80LHSTHZ
     I                                        1   40LHSTYY
     I                                        5   60LHSTMM
     I                                        7   80LHSTDD
     I            DS
     I                                        1   80LHEDHZ
     I                                        1   40LHENYY
     I                                        5   60LHENMM
     I                                        7   80LHENDD
      *
     C                     MOVE *BLANK    ISIRE
      *----------*
      * SCREEN 1 *
      *----------*
     C           STP1      TAG
     C                     EXFMTGDLPW851
     C                     SETOF                     0199
      *-------*
      * CMD-1 *
      *-------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LRU1
     C                     RETRN
     C                     END
      *----------*
      * SUPPLIER *
      *----------*
     C           ISIRE     IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVELER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C                     Z-ADD0         OSIRE   40
     C                     MOVELISIRE     OSIRE
      *
     C           ISIRE     IFNE '9999'
     C                     SETOF                     10
     C           OSIRE     CHAINFGBPL011             10
      *
     C           *IN10     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C                     END
      *
     C           *IN10     IFEQ '1'
     C                     SETON                     0199
     C                     MOVELER,2      MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *-------*
      * CMD-5 *
      *-------*
     C           *INKE     IFEQ '0'
     C                     GOTO STP1
     C                     END
      *
     C           OSIRE     IFEQ 9999
     C           *LOVAL    SETLLGDLPL801
     C                     ELSE
     C           OSIRE     SETLLGDLPL801
     C                     END
      *
     C                     DO   *HIVAL
     C                     SETOF                     20
     C           OSIRE     IFEQ 9999
     C                     READ GDLPL801                 20
     C                     ELSE
     C           OSIRE     READEGDLPL801                 20
     C                     END
      *
     C           *IN20     IFEQ '0'
     C           LHSKJY    IFEQ 'D'
     C           LHSKHZ    ANDLE*DATE
     C                     ELSE
     C           LHEDHZ    IFGE *DATE
     C                     EXCPTDT
     C                     SETON                     30
     C                     END
     C                     END
     C                     END
     C  N20                ENDDO
      *
     C           *IN30     IFEQ '0'
     C                     SETON                     99
     C                     MOVELER,3      MSG
     C                     GOTO STP1
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
     OGDLWP85 E                DT
     O                         LHSIRE
     O                         LHSIRK
     O                         LHZAIS
     O                         LHZAIK
     O                         LHPTCD
     O                         LHUNIT
     O                         LHTANK
     O                         LHTANC
     O                         LHSTHZ
     O                         LHEDHZ
**
ER-01 INPUT SUPPLIER CODE.
ER-02 THIS IS NOT IN DETAIL MASTER FILE.
ER-03 NO UNIT PRICE DATA OF SUPPLIER.
