     H            Y.
     FGDLPPB0 IF  E           K        DISK
     C           *ENTRY    PLIST
     C                     PARM           P@ZAIS 15
     C                     PARM           P@ZAIK  52
     C                     PARM           P@KISU  52
      *
     C                     MOVELP@ZAIS    P@ZAIS
     C                     Z-ADDP@ZAIK    P@ZAIK
      *
     C           KEY       KLIST
     C                     KFLD           P@ZAIS
     C                     KFLD           P@ZAIK
      *
     C           KEY       CHAINGDLPPB0              88
     C           *IN88     IFEQ '0'
     C           AISKJY    IFEQ 'D'
     C                     SETON                     88
     C                     END
     C                     END
     C           *IN88     IFEQ '0'
     C                     Z-ADDAIKISU    P@KISU
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
