     H            Y.                                    1
     H** GDLR5D ********************************************
     H*  TSUSHO  MATERIAL ORDER RECEIVE                    *
     H*                                                    *
     H******************************************************
JW   FTSUSHO  IP  F     500            DISK
JW   FGDLWP5D O   E                    DISK
      *-----------------------------------------
     E                    ARY       500  1
     E                    AZS        15  1
     E                    A21         2  1
     E                    A22         2  1
     E                    A31         3  1
     E                    A32         3  1
     E                    A61         6  1
     E                    A62         6  1
      *-----------------------------------------
JW   ITSUSHO  AA  01
     I                                        1  12 SEQ
     I                                        1   4 I@SEQ#
     I                                       13 268 DATA
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  140W@TIME
     I                                        1   60W@THMS
     I                                        1   20W@TH
     I                                        3   40W@TM
     I                                        5   60W@TS
     I                                        7  140W@TYMD
     I                                        7  100W@DY
     I                                        7   80W@DY1
     I                                        9  100W@DY2
     I                                       11  120W@DM
     I                                       13  140W@DD
     I            DS
     I                                        1   80DATE
     I                                        1   4 YEAR
     I                                        5   6 MM
     I                                        7   8 DD
     I            DS
     I                                        1   52W@ZAIK
     I                                        1   30W@ZK01
     I                                        4   50W@ZK02
     I            DS
     I                                        1   82W@WHT
     I                                        1   60W@WHT1
     I                                        7   80W@WHT2
      *-----------------------------------------
     C                     MOVEADATA      ARY
     C* HEADER SEARCH
     C           *IN99     IFEQ *OFF
     C                     Z-ADD1         X       30
     C           'PO#'     SCAN DATA      X              10
     C  N10      'Po#'     SCAN DATA      X              10
     C  N10                GOTO @END
     C  N99                MOVE *ON       *IN99
     C                     GOTO @END
     C                     END
     C*
     C* DETAIL
JW   C                     CLEARGDLWP5D1
     C                     Z-ADD*ZERO     X       30
     C                     Z-ADD*ZERO     Y       30
     C                     Z-ADD*ZERO     Z       30
     C* PO#(PO DATE)
     C                     MOVEL*ZERO     DATE
     C* MM
     C                     MOVEAARY,1     A21
     C           A21,2     IFGE '0'
     C           A21,2     ANDLE'9'
     C                     MOVE A21,2     MM
     C           A21,1     IFGE '0'
     C           A21,1     ANDLE'9'
     C                     MOVELA21,1     MM
     C                     END
     C                     ELSE
     C           A21,1     IFGE '0'
     C           A21,1     ANDLE'9'
     C                     MOVE A21,1     MM
     C                     END
     C                     END
     C           MM        IFEQ *ZERO
     C                     GOTO @END
     C                     END
     C* DD
     C                     Z-ADD1         X
     C           '/'       LOKUPARY,X                    10
     C  N10                GOTO @END
     C                     ADD  1         X
     C                     MOVEAARY,X     A21
     C           A21,2     IFGE '0'
     C           A21,2     ANDLE'9'
     C                     MOVE A21,2     DD
     C           A21,1     IFGE '0'
     C           A21,1     ANDLE'9'
     C                     MOVELA21,1     DD
     C                     END
     C                     ELSE
     C           A21,1     IFGE '0'
     C           A21,1     ANDLE'9'
     C                     MOVE A21,1     DD
     C                     END
     C                     END
     C           DD        IFEQ *ZERO
     C                     GOTO @END
     C                     END
     C* YYYY
     C                     ADD  1         X
     C           '/'       LOKUPARY,X                    10
     C  N10                GOTO @END
     C                     ADD  1         X
     C                     MOVEAARY,X     YEAR
     C           YEAR      IFEQ *ZERO
     C                     GOTO @END
     C                     END
     C*
     C                     MOVELYEAR      GDDTYY
     C                     MOVELMM        GDDTMM
     C                     MOVELDD        GDDTDD
     C*
     C           ','       LOKUPARY,X                    10
     C  N10                GOTO @END
     C* ZAIS
     C                     CLEARAZS
     C                     Z-ADD*ZERO     Y
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           ARY,X     IFEQ ','
     C                     LEAVE
     C                     END
     C           ARY,X     IFEQ ' '
     C                     ITER
     C                     END
     C                     ADD  1         Y
     C                     MOVELARY,X     AZS,Y
     C                     ENDDO
     C                     MOVEAAZS       GDZAIS
     C* TYPE
     C                     CLEARAZS
     C                     Z-ADD*ZERO     Y
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           ARY,X     IFEQ ','
     C                     LEAVE
     C                     END
     C           ARY,X     IFEQ ' '
     C                     ITER
     C                     END
     C                     ADD  1         Y
     C                     MOVELARY,X     AZS,Y
     C                     ENDDO
     C                     MOVEAAZS       W@A015 15
     C                     MOVELW@A015    GDTYPE
     C* ZAIK
     C                     Z-ADD*ZERO     W@ZAIK
     C                     Z-ADD*ZERO     Y
     C                     CLEARA31
     C                     MOVEA'000'     A32
     C                     CLEARA21
     C                     MOVEL'00'      A22
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           ARY,X     IFEQ '.'
     C           ARY,X     OREQ ','
     C                     LEAVE
     C                     END
     C                     ADD  1         Y
     C                     MOVELARY,X     A31,Y
     C                     ENDDO
     C                     Z-ADD3         Y
     C                     Z-ADD3         Z       30
     C                     DO   *HIVAL
     C           A31,Y     IFGE '0'
     C           A31,Y     ANDLE'9'
     C                     MOVELA31,Y     A32,Z
     C                     SUB  1         Z
     C                     END
     C                     SUB  1         Y
     C           Y         IFEQ *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     MOVEAA32       W@@A03  3
     C                     MOVELW@@A03    W@ZK01
      *
     C           ARY,X     IFNE ','
     C                     Z-ADD*ZERO     Y
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           ARY,X     IFEQ ','
     C                     LEAVE
     C                     END
     C           ARY,X     IFEQ ' '
     C                     ITER
     C                     END
     C                     ADD  1         Y
     C                     MOVELARY,X     A21,Y
     C                     ENDDO
     C                     Z-ADD1         Y
     C                     Z-ADD*ZERO     Z       30
     C                     DO   *HIVAL
     C           A21,Y     IFGE '0'
     C           A21,Y     ANDLE'9'
     C                     ADD  1         Z
     C                     MOVELA21,Y     A22,Z
     C                     END
     C                     ADD  1         Y
     C           Y         IFGT 2
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     MOVEAA22       W@@A02  2
     C                     MOVELW@@A02    W@ZK02
     C                     END
     C                     Z-ADDW@ZAIK    GDZAIK
     C* HEAT#
     C                     CLEARAZS
     C                     Z-ADD*ZERO     Y
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           ARY,X     IFEQ ','
     C                     LEAVE
     C                     END
     C           ARY,X     IFEQ ' '
     C                     ITER
     C                     END
     C                     ADD  1         Y
     C                     MOVELARY,X     AZS,Y
     C                     ENDDO
     C                     MOVEAAZS       W@A015
     C                     MOVELW@A015    GDHEAT
     C* WEIGHT
     C                     Z-ADD*ZERO     W@WHT
     C                     Z-ADD*ZERO     Y
     C                     CLEARA61
     C                     MOVEA'000000'  A62
     C                     CLEARA21
     C                     MOVEL'00'      A22
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           ARY,X     IFEQ '.'
     C           ARY,X     OREQ ','
     C                     LEAVE
     C                     END
     C                     ADD  1         Y
     C                     MOVELARY,X     A61,Y
     C                     ENDDO
     C                     Z-ADD6         Y
     C                     Z-ADD6         Z       30
     C                     DO   *HIVAL
     C           A61,Y     IFGE '0'
     C           A61,Y     ANDLE'9'
     C                     MOVELA61,Y     A62,Z
     C                     SUB  1         Z
     C                     END
     C                     SUB  1         Y
     C           Y         IFEQ *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     MOVEAA62       W@@A06  6
     C                     MOVELW@@A06    W@WHT1
      *                                     小数点以下３桁目
%1   C                     MOVEL' '       WW003   1                    3
     C           ARY,X     IFNE ','
     C                     Z-ADD*ZERO     Y
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           ARY,X     IFEQ ','
     C                     LEAVE
     C                     END
     C           ARY,X     IFEQ ' '
     C                     ITER
     C                     END
     C                     ADD  1         Y
%1   C           Y         IFLE 2
     C                     MOVELARY,X     A21,Y
%1   C                     ENDIF
%1   C           Y         IFEQ 3
%1   C                     MOVELARY,X     WW003
%1   C                     ENDIF
     C                     ENDDO
     C                     Z-ADD1         Y
     C                     Z-ADD*ZERO     Z       30
     C                     DO   *HIVAL
     C           A21,Y     IFGE '0'
     C           A21,Y     ANDLE'9'
     C                     ADD  1         Z
     C                     MOVELA21,Y     A22,Z
     C                     END
     C                     ADD  1         Y
     C           Y         IFGT 2
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     MOVEAA22       W@@A02  2
     C                     MOVELW@@A02    W@WHT2
%1   C*******  小数点以下３桁目
%1   C           WW003     IFGE '5'                                    3
%1   C           WW003     ANDNE'9'                                    3
%1   C                     ADD  1         W@WHT2
%1   C                     ENDIF
     C                     END
     C                     Z-ADDW@WHT     GDWHT
     C* M#
     C                     CLEARAZS
     C                     Z-ADD*ZERO     Y
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           ARY,X     IFEQ ','
     C                     LEAVE
     C                     END
     C           ARY,X     IFEQ ' '
     C                     ITER
     C                     END
     C                     ADD  1         Y
     C                     MOVELARY,X     AZS,Y
     C                     ENDDO
     C                     MOVEAAZS       W@A015
     C                     MOVELW@A015    GDM#
     C* COIL#
     C                     Z-ADD*ZERO     Y
     C                     CLEARA31
     C                     MOVEA'000'     A32
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           ARY,X     IFEQ ','
     C           ARY,X     OREQ ' '
     C                     LEAVE
     C                     END
     C                     ADD  1         Y
     C                     MOVELARY,X     A31,Y
     C                     ENDDO
     C                     Z-ADD3         Y
     C                     Z-ADD3         Z
     C                     DO   *HIVAL
     C           A31,Y     IFGE '0'
     C           A31,Y     ANDLE'9'
     C                     MOVELA31,Y     A32,Z
     C                     SUB  1         Z
     C                     END
     C                     SUB  1         Y
     C           Y         IFEQ *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     MOVEAA32       W@@A03
     C                     MOVELW@@A03    GDCIL#
     C* -------------------
     C           @WRT      TAG
     C*
     C                     Z-ADDW@DY      GDKOYY
     C                     Z-ADDW@DM      GDKOMM
     C                     Z-ADDW@DD      GDKODD
     C                     Z-ADDW@THMS    GDKOTM
     C                     MOVEL#USER     GDKOME
     C**                   MOVE '4540'    GDKOME
     C**                   MOVE '4550'    GDKOME
JW   C                     MOVE '4560'    GDKOME
JW   C                     WRITEGDLWP5D1
     C*
     C           @END      TAG
      *-----------------------------------------------------
     C           *INZSR    BEGSR
     C*
     C                     TIME           W@TIME
     C*
     C                     ENDSR
