     H            Y/
     F***************************************************
     F*   ASJ MATERIAL ORDER INQUIRY/CHANGE
     F*                                                 *
     F*                                                 *
     F*   MAY/14/02                                     *
     F*   JUL/09/02  ADD BTBPL41(ADJUST FILE)           *
     F*   NOV/04/02  IF QTY OF NEXT DAY IS NEGATIVE     *
     F*              MAKE IT ZERO
     F*   JAN/31/03  ADD CHECK LIST                     *
TCHK1F*   NOV/22/05  CHG OMIT O&K                       *
TCHK2F*   FEB/16/06  CHG RMV S@INVD,S@CONF,S@ASTR,,,S@TDQT(OUT ONLY)*
TCHK3F*   JAN/01/08  CHG 0002 TO 8990
     F***************************************************
     FGDLPW44 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FAGDPL12 IF  E           K        DISK
     FGDLPL14 IF  E           K        DISK
     FIZAPL01 IF  E           K        DISK
TCHK2F*BTBPL06 UF  E           K        DISK                      A
TCHK2F*GDLPL04 UF  E           K        DISK
TCHK2FBTBPL06 IF  E           K        DISK
TCHK2FGDLPL04 IF  E           K        DISK
     FBTBPL41 IF  E           K        DISK
TCHK2F*QPRINT  O   F     132     OF     PRINTER
      *------------------------------------------------------------
     E                    CMD     1   2 78
     E                    MSG     1   4 78
     E                    DAY     7   7  3
     E                    #PH        31  3 0             BTAPP05 +
     E                    #MH        31  3 0             BTAPP05 -
     E                    #ZM        31  1                BTBPL05
     E                    QT          5  3 0             QTY
     E                    DT          5  2 0             DAY
     E                    DY          5  3               DAY OF THE WEK
     E                    DAT         5  8 0             DATE
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
      * BTAPP01
     I            DS
     I                                        1  93 #PH
     I                                        1   30BTPH01
     I                                        4   60BTPH02
     I                                        7   90BTPH03
     I                                       10  120BTPH04
     I                                       13  150BTPH05
     I                                       16  180BTPH06
     I                                       19  210BTPH07
     I                                       22  240BTPH08
     I                                       25  270BTPH09
     I                                       28  300BTPH10
     I                                       31  330BTPH11
     I                                       34  360BTPH12
     I                                       37  390BTPH13
     I                                       40  420BTPH14
     I                                       43  450BTPH15
     I                                       46  480BTPH16
     I                                       49  510BTPH17
     I                                       52  540BTPH18
     I                                       55  570BTPH19
     I                                       58  600BTPH20
     I                                       61  630BTPH21
     I                                       64  660BTPH22
     I                                       67  690BTPH23
     I                                       70  720BTPH24
     I                                       73  750BTPH25
     I                                       76  780BTPH26
     I                                       79  810BTPH27
     I                                       82  840BTPH28
     I                                       85  870BTPH29
     I                                       88  900BTPH30
     I                                       91  930BTPH31
     I            DS
     I                                        1  93 #MH
     I                                        1   30BTMH01
     I                                        4   60BTMH02
     I                                        7   90BTMH03
     I                                       10  120BTMH04
     I                                       13  150BTMH05
     I                                       16  180BTMH06
     I                                       19  210BTMH07
     I                                       22  240BTMH08
     I                                       25  270BTMH09
     I                                       28  300BTMH10
     I                                       31  330BTMH11
     I                                       34  360BTMH12
     I                                       37  390BTMH13
     I                                       40  420BTMH14
     I                                       43  450BTMH15
     I                                       46  480BTMH16
     I                                       49  510BTMH17
     I                                       52  540BTMH18
     I                                       55  570BTMH19
     I                                       58  600BTMH20
     I                                       61  630BTMH21
     I                                       64  660BTMH22
     I                                       67  690BTMH23
     I                                       70  720BTMH24
     I                                       73  750BTMH25
     I                                       76  780BTMH26
     I                                       79  810BTMH27
     I                                       82  840BTMH28
     I                                       85  870BTMH29
     I                                       88  900BTMH30
     I                                       91  930BTMH31
     I            DS
     I                                        1  31 #ZM
     I                                        1   1 BTZM01
     I                                        2   2 BTZM02
     I                                        3   3 BTZM03
     I                                        4   4 BTZM04
     I                                        5   5 BTZM05
     I                                        6   6 BTZM06
     I                                        7   7 BTZM07
     I                                        8   8 BTZM08
     I                                        9   9 BTZM09
     I                                       10  10 BTZM10
     I                                       11  11 BTZM11
     I                                       12  12 BTZM12
     I                                       13  13 BTZM13
     I                                       14  14 BTZM14
     I                                       15  15 BTZM15
     I                                       16  16 BTZM16
     I                                       17  17 BTZM17
     I                                       18  18 BTZM18
     I                                       19  19 BTZM19
     I                                       20  20 BTZM20
     I                                       21  21 BTZM21
     I                                       22  22 BTZM22
     I                                       23  23 BTZM23
     I                                       24  24 BTZM24
     I                                       25  25 BTZM25
     I                                       26  26 BTZM26
     I                                       27  27 BTZM27
     I                                       28  28 BTZM28
     I                                       29  29 BTZM29
     I                                       30  30 BTZM30
     I                                       31  31 BTZM31
     I* ORDERED FLAG
     I            DS
     I                                        1  15 QT
     I                                        1   30S@QTY1
     I                                        4   60S@QTY2
     I                                        7   90S@QTY3
     I                                       10  120S@QTY4
     I                                       13  150S@QTY5
     I            DS
     I                                        1  10 DT
     I                                        1   20D@DAT1
     I                                        3   40D@DAT2
     I                                        5   60D@DAT3
     I                                        7   80D@DAT4
     I                                        9  100D@DAT5
     I            DS
     I                                        1  15 DY
     I                                        1   3 D@DY1
     I                                        4   6 D@DY2
     I                                        7   9 D@DY3
     I                                       10  12 D@DY4
     I                                       13  15 D@DY5
     I            DS
     I                                        1   80F8KYMD
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80K@YMD
     I                                        1   60K@YM
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80LBYMD
     I                                        1   40LBODRY
     I                                        5   60LBODRM
     I                                        7   80LBODRD
     I            DS
     I                                        1   80ZCYMD
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
     I            DS
     I                                        1  140@@TIM
     I                                        1   20@@HH
     I                                        3   40@@MN
     I                                        5   60@@SS
     I                                        7  100@@YY
     I                                       11  120@@MM
     I                                       13  140@@DD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C           W@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#GL1     KLIST
     C                     KFLD           K@ZAIS 15
     C                     KFLD           K@ZAIK  52
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#GL      KLIST
     C                     KFLD           K@ZAIS 15
     C                     KFLD           K@ZAIK  52
     C           K#ABB     KLIST
TCHK1C                     KFLD           K@KAKE  40
     C                     KFLD           K@ZAIS
     C                     KFLD           K@ZAIK
     C                     KFLD           K@YM
      * PREVIOUS WORKING DAY
     C                     Z-ADD*ZERO     RRN1    40
     C                     MOVEL'01'      W@ID    2
     C                     Z-ADD*DATE     K@YMD
     C           K#AGD     SETLLAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READPAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     Z-ADDF8KYMD    D@TO
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVELCMD,1     D@CMD
      *
     C                     WRITEDSP99
     C                     EXFMTDSP01
     C                     SELEC
      * F3
     C           *INKC     WHEQ *ON
     C                     MOVEL'99'      W@ID
      *
     C                     OTHER
     C                     EXSR #CHK
     C           *IN99     IFEQ *OFF
     C                     EXSR #SET
     C           *IN99     IFEQ *OFF
     C           RRN1      IFGT 0
     C                     MOVE '02'      W@ID
     C                     ELSE
     C                     MOVE MSG,1     D@MSG
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CHECK
      *------------------------------------------------------
     C           #CHK      BEGSR
      * DATE CHECK
     C                     SETOF                     6199
     C                     MOVE *BLANK    D@MSG
     C                     Z-ADDD@TO      K@YMD
     C           K#AGD     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C                     SETON                     6199
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA FOR SUB FILE
      *------------------------------------------------------
     C           #SET      BEGSR
      * DATE SET
     C                     EXSR #DATE
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1
      *
     C           *LOVAL    SETLLGDLPL14
      *
     C           *IN80     DOUEQ*ON
     C                     READ GDLPL14                  80
     C           *IN80     IFEQ *OFF
     C           LBSKJY    ANDEQ*BLANK
TCHK3C*TCHK1     LBSIRE    ANDEQ0002
TCHK3C           LBSIRE    ANDEQ8990
     C                     MOVE LBZAIS    K@ZAIS
     C                     Z-ADDLBZAIK    K@ZAIK
TCHK1C                     Z-ADDLBSIRE    K@KAKE
     C                     Z-ADDDAT,5     K@YMD
     C                     EXSR #SET1
     C           *IN99     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C           K#GL      SETGTGDLPL14
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     Z-ADD1         #RCNO1
      *
     C                     ENDSR
      *------------------------------------------------------
      *   DATE SET
      *------------------------------------------------------
     C           #DATE     BEGSR
      *
     C                     Z-ADD*ZERO     DT
     C                     Z-ADD*ZERO     DAT
     C                     Z-ADD*ZERO     X       30
     C           K#AGD     SETGTAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READPAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     ADD  1         X
     C                     Z-ADDF8KYMD    DAT,X
     C                     Z-ADDF8KADD    DT,X
     C                     Z-ADDF8YOBI    W       10
     C                     MOVE DAY,W     DY,X
     C           X         IFEQ 5
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      * TODAY
     C                     Z-ADD*DATE     K@YMD
     C           K#AGD     CHAINAGDPL12              90
     C                     Z-ADDF8KYMD    D@DATT
     C                     Z-ADDF8KYMD    W@DATT  80
     C                     Z-ADDF8YOBI    W       10
     C                     MOVE DAY,W     D@DYT
      * NEXT WORKING DAY
     C           K#AGD     SETGTAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READ AGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     Z-ADDF8KYMD    D@DATN
     C                     Z-ADDF8KYMD    W@DATN  80
     C                     Z-ADDF8YOBI    W       10
     C                     MOVE DAY,W     D@DYN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA FOR SUB FILE
      *------------------------------------------------------
     C           #SET1     BEGSR
      *
     C                     CLEARSFL01
      *
     C           K#GL1     SETLLGDLPL14
     C           *IN81     DOUEQ*ON
     C           K#GL      READEGDLPL14                  81
     C           *IN81     IFEQ *OFF
     C           LBSKJY    ANDEQ*BLANK
     C           LBYMD     IFGT D@TO
     C                     LEAVE
     C                     ENDIF
TCHK3C*TCHK1     LBSIRE    IFNE 0002
TCHK3C           LBSIRE    IFNE 8990
TCHK1C                     ITER
TCHK1C                     END
      *
     C                     Z-ADD1         X
     C           LBYMD     LOKUPDAT,X                    10
     C   10                ADD  LBMAIS    QT,X
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     XFOOTQT        S@TOTL
      * TODAY'S ORDER
      *    PLANNED
     C                     Z-ADD*DATE     K@YMD
     C                     Z-ADD*DAY      X
     C           K#ABB     SETLLBTBPL06
     C           *IN90     DOUEQ*ON
     C           K#ABB     READEBTBPL06             N    90
     C           *IN90     IFEQ *OFF
     C           BTSKJY    ANDEQ*BLANK
     C           #ZM,X     IFNE *BLANK
     C*****                MOVE MSG,4     D@MSG
     C******               MOVE *ON       *IN99
     C******               LEAVE
     C                     ELSE
     C                     ADD  #PH,X     S@ORTT
     C                     SUB  #MH,X     S@ORTT
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *  SCANNED
     C           K#GL      SETLLGDLPL04
     C           *IN90     DOUEQ*ON
     C           K#GL      READEGDLPL04             N    90
     C           *IN90     IFEQ *OFF
     C           LASKJY    ANDEQ*BLANK
TCHK3C*TCHK1     LASIRE    ANDEQ0002
TCHK3C           LASIRE    ANDEQ8990
     C                     ADD  LAMAIS    S@ORTT
     C                     ENDIF
     C                     ENDDO
      *  ADJUSTED
     C           K#GL      SETLLBTBPL41
     C           *IN90     DOUEQ*ON
     C           K#GL      READEBTBPL41                  90
     C           *IN90     IFEQ *OFF
     C           B4SKJY    ANDEQ*BLANK
TCHK3C*TCHK1     B4SIRE    ANDEQ0002
TCHK3C           B4SIRE    ANDEQ8990
     C                     SUB  B4MAIS    S@ORTT
     C                     ENDIF
     C                     ENDDO
      *
     C           S@TOTL    IFGT *ZERO
     C           S@ORTT    ORGT *ZERO
      * VALUES IN THE MATERIAL MASTER FILE.
     C           K#GL      SETLLIZAPL01
     C           *IN90     DOUEQ*ON
     C           K#GL      READEIZAPL01                  90
     C           *IN90     IFEQ *OFF
     C           ZCSKJY    ANDEQ*BLANK
     C           ZCYMD     ANDEQ99999999
TCHK3C*TCHK1     ZCKAKE    ANDEQ0002
TCHK3C           ZCKAKE    ANDEQ8990
      *
     C           ZCMKJR    DIV  20        @@MKJR  92H
     C           ZCTKJR    IFNE *ZERO
     C           @@MKJR    DIV  ZCTKJR    S@SETW    H
     C                     ENDIF
     C                     Z-ADDZCLOTO    S@LOT
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      * INVENTORY DAYS
TCHK2C*          S@ORTT    DIV  S@SETW    S@INVD
TCHK2C*                    MVR            @@MVR   52
TCHK2C*          @@MVR     IFGT *ZERO
TCHK2C*                    ADD  1         S@INVD
TCHK2C*                    ENDIF
      *
TCHK2C*          S@INVD    IFGT 3
TCHK2C*                    MOVE *ON       *IN01
TCHK2C*                    MOVE '*'       S@ASTR
TCHK2C*                    ELSE
TCHK2C*                    MOVE *OFF      *IN01
TCHK2C*                    MOVE *BLANK    S@ASTR
TCHK2C*                    ENDIF
      *
     C           S@ORTT    IFGE S@LOT
     C                     MOVE '*'       S@AST2
     C           S@LOT     IFNE *ZERO
     C           S@ORTT    DIV  S@LOT     @@ANS   30
     C           @@ANS     MULT S@LOT     S@TDQT
     C           S@ORTT    SUB  S@TDQT    S@NXQT
     C           S@NXQT    IFLT *ZERO
     C                     Z-ADD*ZERO     S@NXQT
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     ADD  1         RRN1
     C                     MOVELK@ZAIS    S@ZAIS
     C                     Z-ADDK@ZAIK    S@ZAIK
     C                     MOVELK@ZAIS    H@ZAIS
     C                     Z-ADDK@ZAIK    H@ZAIK
     C                     Z-ADDS@TDQT    H@TDQT
     C                     WRITESFL01
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   2ND SCREEN
      *------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVELCMD,2     D@CMD
      *
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     Z-ADD@@REC     #RCNO1
      *
     C                     SELEC
      * F3
     C           *INKC     WHEQ *ON
     C                     MOVEL'99'      W@ID
      * GO BACK
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      W@ID
      *
TCHK2C*                    OTHER
TCHK2C*                    EXSR #CHK2
TCHK2C*          *IN99     IFEQ *OFF
TCHK2C*          *INKE     ANDEQ*ON
TCHK2C*                    EXSR #UPD
TCHK2C*                    MOVE '01'      W@ID
TCHK2C*                    ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
TCHK2 *------------------------------------------------------
TCHK2 *   CHECK
TCHK2 *------------------------------------------------------
TCHK2C*          #CHK2     BEGSR
TCHK2 *
TCHK2C*                    SETOF                     616299
TCHK2C*                    MOVE *BLANK    D@MSG
TCHK2C*                    Z-ADD*ZERO     WRRN    40
TCHK2C*          *IN90     DOUEQ*ON
TCHK2C*                    ADD  1         WRRN
TCHK2C*          WRRN      CHAINSFL01                90
TCHK2C*          *IN90     IFEQ *OFF
TCHK2C*                    MOVEA'00'      *IN,61
TCHK2C*                    Z-ADD*ZERO     S@NXQT
TCHK2C*          S@TDQT    IFNE H@TDQT
TCHK2C*          S@CONF    ANDNE'Y'
TCHK2C*                    MOVE *ON       *IN61
TCHK2C*                    MOVE *ON       *IN99
TCHK2C*                    MOVE MSG,3     D@MSG
TCHK2C*                    ENDIF
TCHK2 *
TCHK2C*          S@CONF    IFEQ 'Y'
TCHK2C*          S@ORTT    SUB  S@TDQT    S@NXQT
TCHK2C*          S@NXQT    IFLT *ZERO
TCHK2C*                    Z-ADD*ZERO     S@NXQT
TCHK2C*                    ENDIF
TCHK2C*          S@LOT     IFNE *ZERO
TCHK2C*          S@TDQT    DIV  S@LOT     @@ANS   30
TCHK2C*                    MVR            @@MVR   52
TCHK2C*          @@MVR     IFNE *ZERO
TCHK2C*                    MOVE *ON       *IN62
TCHK2C* N99                MOVE MSG,2     D@MSG
TCHK2C*                    MOVE *ON       *IN99
TCHK2C*                    ENDIF
TCHK2C*                    ENDIF
TCHK2C*                    ELSE
TCHK2C*                    MOVE *BLANK    S@CONF
TCHK2C*                    ENDIF
TCHK2 *
TCHK2C*          S@INVD    IFGT 3
TCHK2C*                    MOVE *ON       *IN01
TCHK2C*                    ELSE
TCHK2C*                    MOVE *OFF      *IN01
TCHK2C*                    ENDIF
TCHK2 *
TCHK2C*                    UPDATSFL01
TCHK2C*                    ENDIF
TCHK2C*                    ENDDO
TCHK2 *
TCHK2C*                    ENDSR
TCHK2 *------------------------------------------------------
TCHK2 *   UPDATE
TCHK2 *------------------------------------------------------
TCHK2C*          #UPD      BEGSR
TCHK2 *
TCHK2C*                    TIME           @@TIM
TCHK2C*                    MOVE *OFF      *IN98
TCHK2C*                    Z-ADD*ZERO     WRRN    40
TCHK2C*          *IN90     DOUEQ*ON
TCHK2C*                    ADD  1         WRRN
TCHK2C*          WRRN      CHAINSFL01                90
TCHK2C*          *IN90     IFEQ *OFF
TCHK2C*          S@CONF    ANDEQ'Y'
TCHK2C*          S@NXQT    IFGT *ZERO
TCHK2C*          S@TDQT    ORNE *ZERO
TCHK2 *
TCHK2C*          *IN98     IFEQ *OFF
TCHK2C*          *INOF     OREQ *ON
TCHK2C*                    EXCPT@HED
TCHK2C*                    ENDIF
TCHK2C* N98                MOVE *ON       *IN98
TCHK2 *
TCHK2C*                    EXCPT@DTL
TCHK2 *
TCHK2C*                    MOVELH@ZAIS    K@ZAIS
TCHK2C*                    Z-ADDH@ZAIK    K@ZAIK
TCHK2C*                    Z-ADDS@TDQT    @@TDAY  50
TCHK2C*          K#GL      SETLLGDLPL04
TCHK2C*          *IN95     DOUEQ*ON
TCHK2C*          K#GL      READEGDLPL04                  95
TCHK2C*          *IN95     IFEQ *OFF
TCHK2C*          LASKJY    ANDEQ*BLANK
TCHK2C*TCHK1     LASIRE    ANDEQ0002
TCHK2C*                    Z-ADDS@TDQT    LAMAIS
TCHK2C*                    Z-ADD*ZERO     @@TDAY
TCHK2C*                    MOVEL#USER     LAKOME
TCHK2C*                    Z-ADD@@YY      LAKOYY
TCHK2C*                    Z-ADD@@MM      LAKOMM
TCHK2C*                    Z-ADD@@DD      LAKODD
TCHK2C*                    Z-ADD@@HH      LAKOHH
TCHK2C*                    Z-ADD@@MN      LAKOSS
TCHK2C*                    UPDATGDLPP011
TCHK2C*                    LEAVE
TCHK2C*                    ENDIF
TCHK2C*                    ENDDO
TCHK2 *  TODAY
TCHK2C*                    Z-ADDD@DATT    P       20
TCHK2C*                    Z-ADDW@DATT    K@YMD
TCHK2C*                    EXSR #BTB1
TCHK2 * NEXT DAY
TCHK2C*          H@TDQT    IFNE S@TDQT
TCHK2C*          S@TDQT    SUB  H@TDQT    @@BAL   30
TCHK2C*          @@BAL     IFGT *ZERO
     C*****      S@NXQT    IFGT *ZERO
TCHK2C*                    Z-ADDD@DATN    P       20
TCHK2C*                    Z-ADDW@DATN    K@YMD
TCHK2C*                    EXSR #BTB2
TCHK2C*                    ENDIF
TCHK2C*                    ENDIF
TCHK2 *
TCHK2C*                    ENDIF
TCHK2C*                    ENDIF
TCHK2C*                    ENDDO
TCHK2 *
TCHK2C*                    ENDSR
TCHK2 *------------------------------------------------------
TCHK2C*          #BTB1     BEGSR
TCHK2 *------------------------------------------------------
TCHK2C*          K#ABB     SETLLBTBPL06
TCHK2C*          *IN95     DOUEQ*ON
TCHK2C*          K#ABB     READEBTBPL06                  95
TCHK2C*          *IN95     IFEQ *OFF
     C***********BTSKJY    ANDEQ*BLANK
TCHK2C*                    Z-ADD@@TDAY    #PH,P
TCHK2C*                    Z-ADD*ZERO     #MH,P
TCHK2C*                    MOVE *BLANK    BTSKJY
TCHK2 *
TCHK2C*                    MOVEL#USER     BTKOME
TCHK2C*                    Z-ADD@@YY      BTKOYY
TCHK2C*                    Z-ADD@@MM      BTKOMM
TCHK2C*                    Z-ADD@@DD      BTKODD
TCHK2C*                    Z-ADD@@HH      BTKOHH
TCHK2C*                    Z-ADD@@MN      BTKOSS
TCHK2C*                    UPDATBTBPP051
TCHK2C*                    LEAVE
TCHK2C*                    ENDIF
TCHK2C*                    ENDDO
TCHK2 *
TCHK2C*          *IN95     IFEQ *ON
TCHK2C*          @@TDAY    ANDNE*ZERO
TCHK2C*                    CLEARBTBPP051
TCHK2C*          @@TDAY    IFLT *ZERO
TCHK2C*                    Z-ADD@@TDAY    #MH,P
TCHK2C*                    ELSE
TCHK2C*                    Z-ADD@@TDAY    #PH,P
TCHK2C*                    ENDIF
TCHK2C*                    MOVE K@ZAIS    BTZAIS
TCHK2C*                    Z-ADDK@ZAIK    BTZAIK
TCHK2C*                    Z-ADD2         BTSIRE
TCHK2C*                    Z-ADD111       BTUKEI
TCHK2C*                    MOVE 'W'       BTPTCD
TCHK2C*                    Z-ADDK@YM      BTKEYM
TCHK2C*                    MOVEL#USER     BTKOME
TCHK2C*                    Z-ADD@@YY      BTKOYY
TCHK2C*                    Z-ADD@@MM      BTKOMM
TCHK2C*                    Z-ADD@@DD      BTKODD
TCHK2C*                    Z-ADD@@HH      BTKOHH
TCHK2C*                    Z-ADD@@MN      BTKOSS
TCHK2C*                    WRITEBTBPP051
TCHK2C*                    ENDIF
TCHK2 *
TCHK2C*                    ENDSR
TCHK2 *------------------------------------------------------
TCHK2C*          #BTB2     BEGSR
TCHK2 *------------------------------------------------------
TCHK2C*          K#ABB     SETLLBTBPL06
TCHK2C*          *IN95     DOUEQ*ON
TCHK2C*          K#ABB     READEBTBPL06                  95
TCHK2C*          *IN95     IFEQ *OFF
     C********   BTSKJY    ANDEQ*BLANK
TCHK2C*          S@NXQT    IFLT *ZERO
     C************         ADD  S@NXQT    #MH,P
TCHK2C*                    ELSE
TCHK2C*                    ADD  S@NXQT    #PH,P
TCHK2C*                    ENDIF
TCHK2 *
TCHK2C*                    MOVE *BLANK    BTSKJY
TCHK2C*                    MOVEL#USER     BTKOME
TCHK2C*                    Z-ADD@@YY      BTKOYY
TCHK2C*                    Z-ADD@@MM      BTKOMM
TCHK2C*                    Z-ADD@@DD      BTKODD
TCHK2C*                    Z-ADD@@HH      BTKOHH
TCHK2C*                    Z-ADD@@MN      BTKOSS
TCHK2C*                    UPDATBTBPP051
TCHK2C*                    LEAVE
TCHK2C*                    ENDIF
TCHK2C*                    ENDDO
TCHK2 *
TCHK2C*          *IN95     IFEQ *ON
TCHK2C*                    CLEARBTBPP051
TCHK2C*          S@NXQT    IFLT *ZERO
     C**********           Z-ADDS@NXQT    #MH,P
TCHK2C*                    ELSE
TCHK2C*                    Z-ADDS@NXQT    #PH,P
TCHK2C*                    ENDIF
TCHK2C*                    MOVE K@ZAIS    BTZAIS
TCHK2C*                    Z-ADDK@ZAIK    BTZAIK
TCHK2C*                    Z-ADD2         BTSIRE
TCHK2C*                    Z-ADD111       BTUKEI
TCHK2C*                    MOVE 'W'       BTPTCD
TCHK2C*                    Z-ADDK@YM      BTKEYM
TCHK2C*                    MOVEL#USER     BTKOME
TCHK2C*                    Z-ADD@@YY      BTKOYY
TCHK2C*                    Z-ADD@@MM      BTKOMM
TCHK2C*                    Z-ADD@@DD      BTKODD
TCHK2C*                    Z-ADD@@HH      BTKOHH
TCHK2C*                    Z-ADD@@MN      BTKOSS
TCHK2C*                    WRITEBTBPP051
TCHK2C*                    ENDIF
TCHK2 *
TCHK2C*                    ENDSR
      *------------------------------------------------------
TCHK2O*QPRINT  E   01           @HED
TCHK2O*                        #PGM       8
TCHK2O*                        UDATE Y   40
TCHK2O*                        @@HH      43
TCHK2O*                                  44 ':'
TCHK2O*                        @@MM      46
TCHK2O*                                  47 ':'
TCHK2O*                        @@SS      49
TCHK2O*                                  62 'P.'
TCHK2O*                        PAGE  Z   66
TCHK2O*       E   02           @HED
TCHK2O*                                  32 'MATERIAL ORDER CHANGE'
TCHK2O*                                  43 ' CHECK LIST'
TCHK2O*       E   04           @HED
TCHK2O*                                  13 'MATERIAL'
TCHK2O*                                  28 'DIAMETER'
TCHK2O*                                  43 'BEFORE'
TCHK2O*                                  53 'AFTER'
TCHK2O*       E 1              @DTL
TCHK2O*                        S@ZAIS    17
TCHK2O*                        S@ZAIK4   26
TCHK2O*                        H@TDQT1   40
TCHK2O*                        S@TDQT1   52
**  CMD
F3:END
F3:END     F12:GO BACK
**  MSG
    NO DATA
QTY SHOULD BE MULTIPLE OF LOT QTY.
TYPE "Y" TO CHANGE THE QTY.
ALREADY PROCESSED TODAY'S ORDER.
** DAY
MONTUEWEDTHUFRISATSUN
