     H            Y.                                    1
      ** GDLR86 *****************************
      *  PRINTING MATERIAL UNIT PRICE LIST  *
      *               K.YASUDA  2000.10.03  *
      ***************************** GDLR86 **
     FGDLWP86 IP  F     128            DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     IGDLWP86 AA  01
     I                                        1   40OSIRE L2
     I                                        5   5 OSIRK
     I                                        6  20 OZAIS L1
     I                                       21  252OZAIK L1
     I                                       26  26 OPTCD
     I                                       27  29 OUNIT
     I                                       30  393OTANK
     I                                       40  40 OTANC
     I                                       41  480OSTHZ
     I                                       49  560OEDHZ
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *
     C                     MOVE *BLANK    WUS     9
     C                     MOVE *BLANK    WUSME  15
     C                     CALL 'APLR00'
     C                     PARM           US
     C                     PARM           WUSME
     C                     MOVELWUSME     WUS
      *
     C           *IN05     IFEQ '0'
     C                     SETON                     05
     C                     TIME           WTIME   60
     C                     END
      *
     C           *INL2     IFEQ '1'
     C                     MOVE *BLANK    WSIRE  15
     C                     SETOF                     10
     C           OSIRE     CHAINFGBPL011             10
      *
     C           *IN10     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELB2SMEI    WSIRE
     C                     END
     C                     END
     C                     EXCPTHD
     C                     END
      *
     C                     MOVE *BLANK    OPART   4
     C           OPTCD     IFEQ 'W'
     C                     MOVEL'WIRE'    OPART
     C                     END
      *
     C           OPTCD     IFEQ 'R'
     C                     MOVEL'ROD'     OPART
     C                     END
     C                     EXCPTDT
     CL1                   EXCPTSP
     CL1         *INOF     IFEQ '1'
     CL1                   EXCPTHD
     CL1                   END
     OQPRINT  E  102           HD
     O                                  131 '+---------+---------+'
     O        E  1             HD
     O                                  131 '|         |         |'
     O        E  1             HD
     O                                   12 'GDLR85-1 '
     O                                   89 'TIME'
     O                         WTIME     98 '  .  .  '
     O                                  121 '|         |'
     O                         WUS      130
     O                                  131 '|'
     O        E  2             HD
     O                                   11 'SUPPLIER'
     O                         OSIRE     18
     O                         OSIRK     20
     O                                   22 '-'
     O                         WSIRE     38
     O                                   56 '* MATERIAL UNIT'
     O                                   76 'PRICE MASTERLIST *'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+---------+---------+'
     O        E  2             HD
     O                                   10 'PARTS'
     O                                   17 'WIRE'
     O                                   43 'WIRE DIAMETER'
     O                                   54 'CURRENCY'
     O                                   67 'UNIT PRICE'
     O                                   77 'UNIT'
     O                                   94 'BEGINNING DATE'
     O                                  107 'END DATE'
     O        E  1             DT
     O                         OPART      9
     O                         OZAIS     28
     O                         OZAIK     39 ' 0 .  '
     O                         OUNIT     51
     O                         OTANK     69 ' ,   , 0 .   '
     O                         OTANC     75
     O                         OSTHZ     92 '    .  .  '
     O                         OEDHZ    109 '    .  .  '
     O        E  1             SP
