     H            Y.                                    1
      ** GDLR11 ********************************
      *  MATERIAL ORDER SHEET PRINT SYSTEM     *
      *  ORDER DATA TEMPORARY FILE REFORMATION *
      *                  K.YASUDA  2000.07.06  *
      ******************************** GDLR11 **
     FGDLPL01 IP  E           K        DISK
     FGDLWP02 O   E                    DISK
      *
     I            DS
     I                                        1   80LASKHZ
     I                                        1   40LASKYY
     I                                        5   60LASKMM
     I                                        7   80LASKDD
      *
     C           LASKJY    IFEQ 'D'
     C           LASKHZ    ANDLE*DATE
     C                     GOTO END
     C                     END
      *
     C                     WRITEGDLWP021
     C           END       TAG
