     H            Y.
      ** GDMR030 *******************************************
      *  ASJ WASHER PROCESS COLOR MASTER UPDATE            *
      *                                                    *
      * TCHK1 11/03/10 CREATE                              *
      ******************************************************
     FGDMPW030CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL010
     F                                              KINFDS @INFDS
     FGDMPL30 UF  E           K        DISK                      A
      *---------------------------------------------------
     E                    ERR     1  15 60
      *---------------------------------------------------
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME(6) + DATE(6)
     I            DS
     I                                        1  140WWTIME
     I                                        1   60WTIME
     I                                        1   40WTIM4
     I                                        7  120WSDATE
     I                                        9  120@@YM4
     I                                        7  120@@YM6
     I                                        7  140@@YMD
     I                                        7  100@@YY
     I                                       11  120@@MM
     I                                       13  140@@DD
     I            DS
     I                                        1  14 W@SHIN
     I                                        1   5 W@SHN1
     I                                        6   6 W@SHNA
     I                                        7  11 W@SHN2
     I                                       12  12 W@SHNB
     I                                       13  14 W@SHN3
      * ----------------------------------------------------
     C                     TIME           WWTIME
      ******************************************************
      *  MAIN
      ******************************************************
     C*
     C                     EXSR @S1INT
     C                     EXSR @S1SET
      *
     C                     DO   *HIVAL
      *
     C                     WRITEFMT090
     C                     Z-ADDW#RCN1    #RCN01
     C                     EXFMTCTL010
     C   KA                LEAVE
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RCN1
     C                     END
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      W#P1ER  1
      * add new
     C           *INKH     IFEQ *ON
     C                     EXSR @S2ADD
     C   KA                LEAVE
     C                     EXSR @S1INT
     C                     EXSR @S1SET
     C                     ITER
     C                     END
      * change
     C                     EXSR @S2CHG
     C   KA                LEAVE
     C                     EXSR @S1INT
     C                     EXSR @S1SET
     C                     ITER
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C*----------------------------------------------------*
      *  1ST SCREEN INITIALIZE
     C*----------------------------------------------------*
     C           @S1INT    BEGSR
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL010
     C                     MOVEL*OFF      *IN41
      *
     C                     Z-ADD1         W#RCN1  40
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  SET BOX KIND
     C*----------------------------------------------------*
     C           @S1SET    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1    40
     C           *LOVAL    SETLLGDMPL30
      *
     C                     DO   *HIVAL
      *
     C                     READ GDMPL30             N    98
     C   98                LEAVE
     C           M3SKJY    IFNE *BLANK
     C                     ITER
     C                     END
      *
     C                     CLEARSFL010
     C*
     C                     MOVELM3PRCC    S1PRCC
     C                     MOVELM3PCNM    S1PCNM
     C*
     C                     ADD  1         RRN1
     C                     WRITESFL010
     C*
     C                     ENDDO
     C*
     C           RRN1      IFEQ *ZERO
     C                     CLEARSFL010
     C                     Z-ADD1         RRN1
     C                     MOVEL*ON       *IN31
     C                     WRITESFL010
     C                     MOVEL*ON       *IN69
     C                     MOVELERR,1     MSG
     C                     MOVEL*OFF      *IN31
     C                     END
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  ADD NEW RECORD
     C*----------------------------------------------------*
     C           @S2ADD    BEGSR
      *
     C                     EXSR @S2INT
     C                     MOVEL'    ADD' F2ACTN    P
      *
     C                     DO   *HIVAL
      *
     C                     EXFMTFMT020
     C   KA
     COR KL                LEAVE
      *
     C                     MOVEL*OFF      *IN69
     C                     EXSR @S2CHK
     C           *IN69     IFEQ *OFF
     C           *INKE     IFEQ *ON
     C                     EXSR @ADDF
     C           *IN69     IFEQ *OFF
     C                     LEAVE
     C                     END
     C                     END
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  INITIAL SET TO FMT020
     C*----------------------------------------------------*
     C           @S2INT    BEGSR
     C*
     C                     SETOF                     5152
     C                     SETOF                     616269
     C*
     C                     MOVEL*BLANK    F2PRCC
     C                     MOVEL*BLANK    F2PCNM
     C*
     C                     MOVEL*BLANK    MSG
     C*
     C                     ENDSR
     C*----------------------------------------------------*
     C*  CHECK FMT020
     C*----------------------------------------------------*
     C           @S2CHK    BEGSR
     C*
     C                     SETOF                     5152
     C                     MOVEL*BLANK    MSG
     C*
     C                     DO
     C*
     C           F2PRCC    IFEQ *BLANK
     C                     SETON                     5169
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     END
     C                     END
     C*
     C           F2PCNM    IFEQ *BLANK
     C                     SETON                     5269
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     END
     C                     END
     C*
     C   69                LEAVE
     C*
     C           F2PRCC    CHAINGDMPL30              98
     C           *IN98     IFEQ *OFF
     C           M3SKJY    ANDEQ*BLANK
     C                     SETON                     5169
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,4     MSG
     C                     END
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  WRITE NEW RECORD
     C*----------------------------------------------------*
     C           @ADDF     BEGSR
      *
     C                     DO
      *
     C           F2PRCC    CHAINGDMPL30              98
     C           *IN98     IFEQ *OFF
     C           M3SKJY    ANDEQ*BLANK
     C                     SETON                     515269
     C                     MOVELERR,04    MSG
     C                     LEAVE
     C                     END
     C*
     C                     CLEARGDMPP301
     C*
     C                     EXSR @EDTF
      *
     C           *IN98     IFEQ *OFF
     C                     UPDATGDMPP301
     C                     ELSE
     C                     WRITEGDMPP301
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  EDIT RECORD (NEW/CHANGE)
     C*----------------------------------------------------*
     C           @EDTF     BEGSR
     C*
     C                     TIME           WWTIME
     C                     Z-ADD@@YMD     M3KODT
     C                     Z-ADDWTIM4     M3KOTM
     C                     MOVEL#PGM      M3KOPG
     C                     MOVEL#WSID     M3KOWS
     C                     MOVEL#USER     M3KOID
     C*
     C                     MOVELF2PRCC    M3PRCC
     C                     MOVELF2PCNM    M3PCNM
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  CHANGE/DELETE MAIN
     C*----------------------------------------------------*
     C           @S2CHG    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN1
     C           RRN1      CHAINSFL010               98
     C   98                LEAVE
     C           S1SEL     IFEQ *BLANK
     C                     ITER
     C                     END
      *
     C                     EXSR @S2CDP
     C   KA                LEAVE
      *
     C                     MOVEL*BLANK    S1SEL
     C                     MOVEL*ON       *IN32
     C                     UPDATSFL010
     C                     MOVEL*OFF      *IN32
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  CHANGE/DELETE SET
     C*----------------------------------------------------*
     C           @S2CDP    BEGSR
      *
     C                     EXSR @S2INT
     C           S1SEL     IFEQ 'C'
     C                     MOVEL'  CHANGE'F2ACTN    P
     C                     MOVEL*ON       *IN61
     C                     MOVEL*OFF      *IN62
     C                     ELSE
     C                     MOVEL'  DELETE'F2ACTN    P
     C                     MOVEL*ON       *IN61
     C                     MOVEL*ON       *IN62
     C                     END
     C                     MOVELS1PRCC    F2PRCC
     C                     MOVELS1PCNM    F2PCNM
      *
     C                     DO   *HIVAL
      *
     C                     EXFMTFMT020
     C   KA
     COR KL                LEAVE
      *
     C           *INKE     IFEQ *ON
     C                     EXSR @CHGF
     C                     LEAVE
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  UPDAT
     C*----------------------------------------------------*
     C           @CHGF     BEGSR
      *
     C                     DO
      *
     C           F2PRCC    CHAINGDMPL30              98
     C           *IN98     IFEQ *ON
     C                     LEAVE
     C                     END
      *
     C           S1SEL     IFEQ 'D'
     C                     TIME           WWTIME
     C                     MOVEL'D'       M3SKJY
     C                     Z-ADD@@YMD     M3SKDT
     C                     Z-ADDWTIM4     M3SKTM
     C                     MOVEL#PGM      M3SKPG
     C                     MOVEL#WSID     M3SKWS
     C                     MOVEL#USER     M3SKID
     C                     ELSE
     C                     EXSR @EDTF
     C                     END
      *
     C                     UPDATGDMPP301
      *
     C                     ENDDO
      *
     C                     ENDSR
** ERR
NO DATA FOUND.
PROCESS COLOR(BLANK)
PROCESS COLOR NAME(BLANK).
SOMEBODY ELSE ALREADY CREATE. NEED CHECK(DUPLICATE).
05
06
07
08
09
10
11
12
13
14
15
