     H            Y.
      ** GDMR120 *******************************************
      *  ASJ WASHER ORDER KANBAN OFFLINE ISSUE UPDATE      *
      *                                                    *
      * TCHK1 11/30/10 CREATE                              *
      ******************************************************
     FGDMPW110CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL010
     F                                              KINFDS @INFDS
     FAKBPL07 IF  E           K        DISK
     FGDMPL10 IF  E           K        DISK
     FGDMPL20 IF  E           K        DISK
     FGDMPL30 IF  E           K        DISK
     FGDMPL40 UF  E           K        DISK                      A
     FGDMPL82 UF  E           K        DISK                      A
      *---------------------------------------------------
     E                    ERR     1  15 60
      *---------------------------------------------------
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME(6) + DATE(8)
     I            DS
     I                                        1  140WWTIME
     I                                        1   60WTIME
     I                                        1   40WTIM4
     I                                        7  120WSDATE
     I                                        9  120@@YM4
     I                                        7  120@@YM6
     I                                        7  140@@YMD
     I                                        7  100@@YY
     I                                       11  120@@MM
     I                                       13  140@@DD
     I                                        9  140@@YMD6
     I            DS
     I                                        1  14 W@SHIN
     I                                        1   5 W@SHN1
     I                                        6   6 W@SHNA
     I                                        7  11 W@SHN2
     I                                       12  12 W@SHNB
     I                                       13  14 W@SHN3
     I            DS
     I                                        1   4 W@LOT#
     I                                        1   1 W@LOT1
     I                                        2   4 W@LOT2
     I            DS
     I                                        1   6 W@LOC
     I                                        1   1 W@LOC1
     I                                        2   3 W@LOC2
     I                                        4   5 W@LOC3
     I                                        6   6 W@LOC4
     I*
     I            DS
     I                                        1  16 WWBARC
     I                                        1   1 WWMNGK
     I                                        2   5 WWZETI
     I                                        6  11 WWCRHZ
     I                                       12  12 WWPRDK
     I                                       13  13 WWLOT1
     I                                       14  16 WWLOT2
     I            DS
     I                                        1  25 W3BARC
     I                                        1   1 W3MNGK
     I                                        3   6 W3ZETI
     I                                        8  13 W3CRHZ
     I                                       15  15 W3PRDK
     I                                       17  17 W3LOT1
     I                                       18  20 W3LOT2
     I                                       22  22 W3CHKD
      * ----------------------------------------------------
     C                     TIME           WWTIME
     C           P#BRC     PLIST
     C                     PARM           PMAREA100
     C                     PARM           PMBYTE  3
     C                     PARM           PMCHK   1
     C                     PARM           PMRTCD  1
      ******************************************************
      *  MAIN
      ******************************************************
     C*
     C                     EXSR @S1INT
     C                     EXSR @S1SET
      *
     C                     DO   *HIVAL
      *
     C                     WRITEFMT090
     C                     Z-ADDW#RCN1    #RCN01
     C                     EXFMTCTL010
     C   KA                LEAVE
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RCN1
     C                     END
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      W#P1ER  1
      * add new
     C           *INKH     IFEQ *ON
     C                     EXSR @S2ADD
     C   KA                LEAVE
     C                     EXSR @S1INT
     C                     EXSR @S1SET
     C                     ITER
     C                     END
      * inquiry/delete
     C                     EXSR @S3PRC
     C   KA                LEAVE
     C                     EXSR @S1INT
     C                     EXSR @S1SET
     C                     ITER
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C*----------------------------------------------------*
      *  1ST SCREEN INITIALIZE
     C*----------------------------------------------------*
     C           @S1INT    BEGSR
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL010
     C                     MOVEL*OFF      *IN41
      *
     C                     Z-ADD1         W#RCN1  40
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  SET WASHER KANBAN ISSUE FILE
     C*----------------------------------------------------*
     C           @S1SET    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1    40
     C           *LOVAL    SETLLGDMPL82
      *
     C                     DO   *HIVAL
      *
     C                     READ GDMPL82             N    98
     C   98                LEAVE
     C           M8SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           M8ISFG    IFNE *BLANK
     C                     ITER
     C                     END
      *
     C                     CLEARSFL010
     C*
     C                     MOVEL*BLANK    W@SHIN
     C                     MOVELM8PRT1    W@SHN1
     C           W@SHN2    IFNE *BLANK
     C                     MOVEL'-'       W@SHNA
     C                     END
     C                     MOVELM8PRT2    W@SHN2
     C           W@SHN3    IFNE *BLANK
     C                     MOVEL'-'       W@SHNB
     C                     END
     C                     MOVELM8PRT3    W@SHN3
     C                     MOVELW@SHIN    S1SHIN
     C                     MOVELM8PRT1    H1SHN1
     C                     MOVELM8PRT2    H1SHN2
     C                     MOVELM8PRT3    H1SHN3
     C*
     C                     Z-ADDM8LOTS    S1LOTS
     C                     MOVELM8LOT1    W@LOT1
     C                     MOVELM8LOT2    W@LOT2
     C                     MOVELW@LOT#    S1LOT#
     C                     MOVELM8LOT1    H1LOT1
     C                     MOVELM8LOT2    H1LOT2
     C*
     C                     MOVELM8BOXK    S1BKCD
     C           M8BOXK    CHAINGDMPL20              93
     C           *IN93     IFEQ *OFF
     C           M2SKJY    ANDEQ*BLANK
     C                     MOVELM2BKNM    S1BKNM
     C                     END
     C                     MOVELM8PRCC    S1PCCD
     C           M8PRCC    CHAINGDMPL30              93
     C           *IN93     IFEQ *OFF
     C           M3SKJY    ANDEQ*BLANK
     C                     MOVELM3PCNM    S1PCNM
     C                     END
     C*
     C                     ADD  1         RRN1
     C                     WRITESFL010
     C*
     C                     ENDDO
     C*
     C           RRN1      IFEQ *ZERO
     C                     CLEARSFL010
     C                     Z-ADD1         RRN1
     C                     MOVEL*ON       *IN31
     C                     WRITESFL010
     C                     MOVEL*ON       *IN69
     C                     MOVELERR,1     MSG
     C                     MOVEL*OFF      *IN31
     C                     END
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  ADD NEW RECORD
     C*----------------------------------------------------*
     C           @S2ADD    BEGSR
      *
     C                     EXSR @S2INT
      *
     C                     DO   *HIVAL
      *
     C                     EXFMTFMT020
     C   KA
     COR KL                LEAVE
      *
     C                     MOVEL*OFF      *IN69
     C                     EXSR @S2CHK
     C           *IN69     IFEQ *OFF
     C           *INKE     IFEQ *ON
     C                     EXSR @ADDF
     C           *IN69     IFEQ *OFF
     C                     LEAVE
     C                     END
     C                     END
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  INITIAL SET TO FMT020
     C*----------------------------------------------------*
     C           @S2INT    BEGSR
      *
     C                     SETOF                     5152
     C                     SETOF                     69
      *
     C                     MOVEL*BLANK    F2SHN1
     C                     MOVEL*BLANK    F2SHN2
     C                     MOVEL*BLANK    F2SHN3
     C                     Z-ADD*ZERO     F2LOTS
     C                     Z-ADD*ZERO     F2MAIS
      *
     C                     MOVEL*BLANK    MSG
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  CHECK FMT020
     C*----------------------------------------------------*
     C           @S2CHK    BEGSR
      *
     C                     SETOF                     5152
     C                     MOVEL*BLANK    MSG
     C                     Z-ADD*ZERO     F2LOTS
      *
     C                     DO
      *
     C           F2SHN1    IFEQ *BLANK
     C                     SETON                     5169
     C                     MOVELERR,2     MSG
     C                     LEAVE
     C                     END
      *
     C           K#KEY     KLIST
     C                     KFLD           F2SHN1
     C                     KFLD           F2SHN2
     C                     KFLD           F2SHN3
     C           K#KEY     SETGTAKBPL07
     C                     DO   *HIVAL
     C           K#KEY     REDPEAKBPL07                  97
     C   97                LEAVE
     C           L1SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           L1UKHZ    IFGT @@YMD
     C                     ITER
     C                     END
     C           L1STHZ    IFLE @@YMD
     C                     ITER
     C                     END
     C           L1BMON    IFNE 8990
     C                     ITER
     C                     END
     C                     LEAVE
     C                     ENDDO
     C*
     C           *IN97     IFEQ *ON
     C                     SETON                     5169
     C                     MOVELERR,3     MSG
     C                     LEAVE
     C                     END
     C*
     C           K#KEY     CHAINGDMPL10              96
     C           *IN96     IFEQ *ON
     C           M1SKJY    ORNE *BLANK
     C                     SETON                     5169
     C                     MOVELERR,4     MSG
     C                     LEAVE
     C                     ELSE
     C           M1CHGD    IFLE @@YMD
     C                     Z-ADDM1LOTN    F2LOTS
     C                     ELSE
     C                     Z-ADDM1LOTO    F2LOTS
     C                     END
     C                     END
     C           F2LOTS    IFEQ *ZERO
     C                     SETON                     5169
     C                     MOVELERR,6     MSG
     C                     LEAVE
     C                     END
     C*
     C           *INKE     IFEQ *ON
     C           F2MAIS    IFLE *ZERO
     C                     SETON                     5269
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,5     MSG
     C                     END
     C                     END
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  WRITE NEW RECORD
     C*----------------------------------------------------*
     C           @ADDF     BEGSR
     C*
     C           K#KEY     CHAINGDMPL40              95
     C           *IN95     IFEQ *ON
     C                     MOVEL'Z'       W@LT#1  1
     C                     Z-ADD*ZERO     W@LT#2  30
     C                     ELSE
     C                     MOVELM4LOT1    W@LT#1
     C                     Z-ADDM4LOT2    W@LT#2
     C                     END
     C*
     C                     Z-ADD*ZERO     X       40
     C                     DO   *HIVAL
     C*
     C                     ADD  1         X
     C           X         IFGT F2MAIS
     C                     LEAVE
     C                     END
     C*
     C           W@LT#2    IFEQ 999
     C                     MOVEL'Z'       W@LT#1
     C                     Z-ADD*ZERO     W@LT#2
     C                     END
     C*
     C                     ADD  1         W@LT#2
     C*
     C                     CLEARGDMPP801
     C                     TIME           WWTIME
     C                     Z-ADD@@YMD     M8KODT
     C                     Z-ADDWTIM4     M8KOTM
     C                     MOVEL#USER     M8KOID
     C                     MOVEL#WSID     M8KOWS
     C                     MOVEL#PGM      M8KOPG
     C*
     C                     Z-ADD@@YMD     M8CRDT
     C                     Z-ADDWTIM4     M8CRTM
     C                     MOVELF2SHN1    M8PRT1
     C                     MOVELF2SHN2    M8PRT2
     C                     MOVELF2SHN3    M8PRT3
     C                     Z-ADDL1SYOS    M8SYOS
     C           M1CHGD    IFLE @@YMD
     C                     Z-ADDM1LOTN    M8LOTS
     C                     ELSE
     C                     Z-ADDM1LOTO    M8LOTS
     C                     END
     C           M8SYOS    MULT M8LOTS    M8SRYO
     C*
     C                     MOVELL1TKR1    W@LOC1
     C                     MOVELL1TKR2    W@LOC2
     C                     MOVELL1TKR3    W@LOC3
     C                     MOVELL1TKR4    W@LOC4
     C                     MOVELW@LOC     M8LOC
     C* CHECK DIGIT
     C                     MOVEL'I'       WWMNGK
     C                     MOVELL1ZETI    WWZETI
     C                     MOVEL@@YMD6    WWCRHZ
     C                     MOVEL'3'       WWPRDK
     C                     MOVELW@LT#1    WWLOT1
     C                     MOVELW@LT#2    WWLOT2
     C*
     C                     MOVELWWBARC    PMAREA    P
     C                     MOVE '016'     PMBYTE
     C                     MOVE *BLANK    PMCHK
     C                     MOVE *BLANK    PMRTCD
     C                     CALL 'ALBRCC'  P#BRC
     C*
     C                     MOVELWWMNGK    M8MNGK
     C                     MOVELWWZETI    M8ZETI
     C                     MOVELWWCRHZ    M8CRHZ
     C                     MOVELWWPRDK    M8PRDK
     C                     MOVELWWLOT1    M8LOT1
     C                     MOVELWWLOT2    M8LOT2
     C                     MOVELPMCHK     M8CHKD
     C*
     C           M1CHGD    IFLE @@YMD
     C                     MOVELM1BOXN    M8BOXK
     C                     MOVELM1PRCN    M8PRCC
     C                     ELSE
     C                     MOVELM1BOXO    M8BOXK
     C                     MOVELM1PRCO    M8PRCC
     C                     END
     C           M8BOXK    CHAINGDMPL20              93
     C           *IN93     IFEQ *OFF
     C           M2SKJY    ANDEQ*BLANK
     C                     MOVELM2BKNM    M8BKNM
     C                     END
     C           M8PRCC    CHAINGDMPL30              93
     C           *IN93     IFEQ *OFF
     C           M3SKJY    ANDEQ*BLANK
     C                     MOVELM3PCNM    M8PCNM
     C                     END
     C*
     C                     WRITEGDMPP801
     C*
     C                     ENDDO
     C*
     C           *IN95     IFEQ *ON
     C           M4SKJY    ORNE *BLANK
     C                     MOVEL*BLANK    M4SKJY
     C                     Z-ADD*ZERO     M4SKDT
     C                     Z-ADD*ZERO     M4SKTM
     C                     MOVEL*BLANK    M4SKID
     C                     MOVEL*BLANK    M4SKPG
     C                     END
     C                     TIME           WWTIME
     C                     Z-ADD@@YMD     M4KODT
     C                     Z-ADDWTIM4     M4KOTM
     C                     MOVEL#USER     M4KOID
     C                     MOVEL#WSID     M4KOWS
     C                     MOVEL#PGM      M4KOPG
     C                     MOVELF2SHN1    M4PRT1
     C                     MOVELF2SHN2    M4PRT2
     C                     MOVELF2SHN3    M4PRT3
     C                     MOVELW@LT#1    M4LOT1
     C                     Z-ADDW@LT#2    M4LOT2
     C                     Z-ADD@@YMD     M4CRDT
     C                     Z-ADDWTIM4     M4CRTM
     C   95                WRITEGDMPP401
     C  N95                UPDATGDMPP401
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  INQUIRY/DELETE MAIN
     C*----------------------------------------------------*
     C           @S3PRC    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN1
     C           RRN1      CHAINSFL010               98
     C   98                LEAVE
     C           S1SEL     IFEQ *BLANK
     C                     ITER
     C                     END
      *
     C                     EXSR @S3IDP
     C   KA                LEAVE
      *
     C                     MOVEL*BLANK    S1SEL
     C                     MOVEL*ON       *IN32
     C                     UPDATSFL010
     C                     MOVEL*OFF      *IN32
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  INQUIRY/DELETE SET
     C*----------------------------------------------------*
     C           @S3IDP    BEGSR
     C*
     C                     MOVEL*OFF      W@NOTF  1
     C                     EXSR @S3SET
     C*
     C                     DO   *HIVAL
     C*
     C           S1SEL     IFEQ 'I'
     C           W@NOTF    OREQ *ON
     C                     MOVEL*OFF      *IN88
     C                     ELSE
     C                     MOVEL*ON       *IN88
     C                     END
     C*
     C                     EXFMTFMT030
     C   KA
     COR KL                LEAVE
      *
     C           *INKE     IFEQ *ON
     C                     EXSR @DLTF
     C                     LEAVE
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  INQUIRY/DELETE SET
     C*----------------------------------------------------*
     C           @S3SET    BEGSR
     C*
     C                     DO
     C*
     C           S1SEL     IFEQ 'I'
     C                     MOVEL' INQUIRY'F3ACTN    P
     C                     ELSE
     C                     MOVEL'  DELETE'F3ACTN    P
     C                     END
     C*
     C           K#L82     KLIST
     C                     KFLD           H1SHN1
     C                     KFLD           H1SHN2
     C                     KFLD           H1SHN3
     C                     KFLD           H1LOT1
     C                     KFLD           H1LOT2
     C           K#L82     CHAINGDMPL82              92
     C                     MOVELH1SHN1    F3SHN1
     C                     MOVELH1SHN2    F3SHN2
     C                     MOVELH1SHN3    F3SHN3
     C                     MOVELH1LOT1    F3LOT
     C                     MOVE H1LOT2    F3LOT
     C           *IN92     IFEQ *ON
     C                     MOVEL*ON       W@NOTF
     C                     LEAVE
     C                     END
     C*
     C                     Z-ADDM8LOTS    F3LOTS
     C                     Z-ADDM8SYOS    F3SYOS
     C*
     C                     MOVELM8BOXK    F3BOXK
     C           M8BOXK    CHAINGDMPL20              93
     C           *IN93     IFEQ *OFF
     C           M2SKJY    ANDEQ*BLANK
     C                     MOVELM2BKNM    F3BKNM
     C                     END
     C                     MOVELM8PRCC    F3PRCC
     C           M8PRCC    CHAINGDMPL30              93
     C           *IN93     IFEQ *OFF
     C           M3SKJY    ANDEQ*BLANK
     C                     MOVELM3PCNM    F3PCNM
     C                     END
     C*
     C                     MOVELM8LOC     F3LOC
     C*
     C                     MOVELM8MNGK    W3MNGK
     C                     MOVELM8ZETI    W3ZETI
     C                     MOVELM8CRHZ    W3CRHZ
     C                     MOVELM8PRDK    W3PRDK
     C                     MOVELM8LOT1    W3LOT1
     C                     MOVELM8LOT2    W3LOT2
     C                     MOVELM8CHKD    W3CHKD
     C                     MOVELW3BARC    F3BARC
     C*
     C                     Z-ADDM8CRDT    F3CRDT
     C                     Z-ADDM8CRTM    F3CRTM
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  DELETE
     C*----------------------------------------------------*
     C           @DLTF     BEGSR
     C*
     C                     TIME           WWTIME
     C                     MOVEL'D'       M8SKJY
     C                     Z-ADD@@YMD     M8SKDT
     C                     Z-ADDWTIM4     M8SKTM
     C                     MOVEL#PGM      M8SKPG
     C                     MOVEL#WSID     M8SKWS
     C                     MOVEL#USER     M8SKID
     C*
     C                     MOVEL'9'       M8ISFG
     C*
     C                     UPDATGDMPP801
     C*
     C                     ENDSR
** ERR
NO DATA FOUND.
PART NO ERROR(BLANK).
PART NO ERROR(MASTER CHECK).
PART NO ERROR(LOT# MASTER NOT FOUND).
KANBAN #OF ISSUE ERROR.
KANBAN LOT-SIZE = ZERO.
07
08
09
10
11
12
13
14
15
