     H            Y/
     F***************************************************
     F*   WASHER - INQUIRY
     F*                                                 *
     F***************************************************
     FABHPL02 IP  E           K        DISK
     FGHCPL22 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFCEPL11 IF  E           K        DISK
     FMBDPL01 IF  E           K        DISK
     FGDWWP58 IF  E           K        DISK                      A
     FQPRINT  O   F     132     OF     PRINTER
      *------------------------------------------------------------
     E                    AB          5  3               MACHINE
     E                    AO          5  3               PROCESS
      *------------------------------------------------------------
     I            DS
     I                                        1  15 AB
     I                                        1   3 M6KBN1
     I                                        4   6 M6KBN2
     I                                        7   9 M6KBN3
     I                                       10  12 M6KBN4
     I                                       13  15 M6KBN5
     I            DS
     I                                        1  15 AO
     I                                        1   3 M6AKT1
     I                                        4   6 M6AKT2
     I                                        7   9 M6AKT3
     I                                       10  12 M6AKT4
     I                                       13  15 M6AKT5
     I            DS
     I                                        1  12 MCPRT
     I                                        1   5 MCSHN1
     I                                        6  10 MCSHN2
     I                                       11  12 MCSHN3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
     C           M6SKJY    CABNE*BLANK    @END
     C           M6STYY    CABNE9999      @END
      *
     C                     CLEARGDGWP581
     C                     Z-ADD1         X       20
     C           'RL '     LOKUPAO,X                     10
     C           *IN10     IFEQ *ON
      *
     C                     MOVE AB,X      WMCHN
     C           M6KH11    IFNE *BLANK
     C                     MOVE M6KH11    WPART1
     C                     MOVE M6KH12    WPART2
     C                     MOVE M6KH13    WPART3
     C                     EXSR #GHC
     C                     ENDIF
     C           M6KH21    IFNE *BLANK
     C                     MOVE M6KH21    WPART1
     C                     MOVE M6KH22    WPART2
     C                     MOVE M6KH23    WPART3
     C                     EXSR #GHC
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           @END      TAG
     CLR                   EXSR #PRT
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#AG      KLIST
     C                     KFLD           M6HIN1
     C                     KFLD           M6HIN2
     C                     KFLD           M6HIN3
     C                     KFLD           K@PRC   3
     C           K#FC      KLIST
     C                     KFLD           WSPRT1
     C                     KFLD           WSPRT2
     C                     KFLD           WSPRT3
      *
     C                     MOVEL'RL '     K@PRC
      *
     C                     ENDSR
      *------------------------------------------------------
      *   PART    NUMBER
      *------------------------------------------------------
     C           #GHC      BEGSR
      *
     C           K#AG      SETLLGHCPL22
     C           *IN91     DOUEQ*ON
     C           K#AG      READEGHCPL22                  91
     C           *IN91     IFEQ *OFF
      *
     C                     MOVE MMJHN1    WSPRT1
     C                     MOVE MMJHN2    WSPRT2
     C                     MOVE MMJHN3    WSPRT3
      *
     C           K#FC      CHAINFCEPL01              90
     C           *IN90     IFEQ *ON
     C           A2GSKD    ORNE *BLANK
     C                     ITER
     C                     ENDIF
      *
     C                     Z-ADDA2SSYS    WBQTY
     C           K#FC      CHAINFCEPL11              90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDFCGK01    WMQTY
     C                     ENDIF
      ** ACTUAL
     C                     EXSR #ACT
     C                     WRITEGDGWP581
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------
     C           #ACT      BEGSR
      *
     C                     Z-ADD*ZERO     W@QTY  110
     C           K#FC      SETLLMBDPL01
     C           *IN90     DOUEQ*ON
     C           K#FC      READEMBDPL01                  90
     C           *IN90     IFEQ *OFF
     C           F3SKJY    ANDEQ*BLANK
     C                     ADD  F3TNSU    W@QTY
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADDW@QTY     WAQTY
      *
     C                     ENDSR
      *-------------------------------------------
     C           #PRT      BEGSR
      *
     C                     TIME           @@TIME  60
     C                     MOVE *ALL'-'   @@LINE 75
     C                     CLOSEGDWWP58
     C                     OPEN GDWWP58
     C                     MOVE *OFF      *IN98
      *
     C           *LOVAL    SETLLGDWWP58
     C           *IN90     DOUEQ*ON
     C                     READ GDWWP58                  90
     C           *IN90     IFEQ *OFF
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
     C  N98                MOVE *ON       *IN98
     C           WPART2    COMP *BLANK               1010
     C           WPART3    COMP *BLANK               1111
     C           WSPRT2    COMP *BLANK               1212
     C           WSPRT3    COMP *BLANK               1313
     C                     EXCPT@DTL
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *---------------------------------------------
     OQPRINT  E   02           @HED
     O                         #PGM      10
     O                         UDATE Y   60
     O                         @@TIME    69 '  :  :  '
     O                                   72 'P.'
     O                         PAGE  Z   76
     O        E   03           @HED
     O                                   50 'WASHER LIST BY MACHINE#'
     O        E   04           @HED
     O                                   62 'MONTHLY'
     O                                   74 'ACTUAL'
     O        E   05           @HED
     O                                    8 'MCHN#'
     O                                   16 'WASHER'
     O                                   33 'PRODUCT'
     O                                   51 'QTY/CONT.'
     O                                   62 'SETTING'
     O                                   74 'SHIPMENT'
     O        E   06           @HED
     O                         @@LINE    78
     O        E 1              @DTL
     O                         WMCHN      7
     O                         WPART1    15
     O                       10          16 '-'
     O                         WPART2    21
     O                       11          22 '-'
     O                         WPART3    24
     O                         WSPRT1    31
     O                       12          32 '-'
     O                         WSPRT2    37
     O                       13          38 '-'
     O                         WSPRT3    40
     O                         WBQTY 1   50
     O                         WMQTY 1   62
     O                         WAQTY 1   74
