     H            Y/
     F***************************************************
     F*   WASHER - INQUIRY
     F*                                                 *
     F***************************************************
     FAAMPL11 IP  E           K        DISK
     FGDWWP60 O   E                    DISK
      *------------------------------------------------------------
     E                    KB         15  3               MACHINE
     E                    KO         15  3               PROCESS
     E                    KL         15  6               PROCESS
      *------------------------------------------------------------
     I            DS
     I                                        1  45 KB
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  45 KO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  90 KL
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  12 MCPRT
     I                                        1   5 MCSHN1
     I                                        6  10 MCSHN2
     I                                       11  12 MCSHN3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
     C           CKSKJY    CABNE*BLANK    @END
     C                     Z-ADD1         X       20
     C           'OQ '     LOKUPKO,X                     10
     C           *IN10     CABEQ*OFF      @END
      *
     C                     MOVE CKHIN1    WPART1
     C                     MOVE CKHIN2    WPART2
     C                     MOVE CKHIN3    WPART3
     C                     MOVE KB,X      WMCHN
     C                     MOVE KL,X      WLOC
     C                     WRITEGDGWP601
      *
     C           @END      TAG
