     H            Y.
     F******************************************************
     F* DETAIL M/F MAINTNANCE < MODULES 11 . MODULUS 10 > *
     F*           M-OKUDA           1981.09.16             *
     F******************************************************
     FGGBPW11 CF  E                    WORKSTN
     FFGBPL01 UF  E           K        DISK                      A
     E                    ERR     1  15 60               ERR-MSG
     I            DS
     I                                        1   60WTIME
     I                                        1   20B2KOJI
     I                                        3   40B2KOPN
     I            DS
     I                                        1   80WDATE
     I                                        1   40B2KOYY
     I                                        5   60B2KOMM
     I                                        7   80B2KODD
     I            DS
     I                                        1   80SDATE
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   4 CODE
     I                                        1   10C1
     I                                        2   20C2
     I                                        3   30C3
     I                                        4   40C4
     I            DS
     I                                        1   20CH1
     I                                        2   30CH2
     I                                        1   10CHA
     I                                        2   20CHB
     I                                        3   30CHC
     C           *ENTRY    PLIST
     C                     PARM           PUSER  10
     C                     MOVE *BLANK    CTYPE
     C                     MOVE *BLANK    CODE
     C           WOUT      TAG
     C                     WRITEGGBPW111
     C           WYOMU     TAG
     C                     EXFMTGGBPW112
     C   KA                GOTO END
     C                     MOVE *BLANK    CTYPE
     C                     SETOF                     99
     C                     SETOF                     101112
     C           KOSIN     COMP '0'                      10
     C  N10      KOSIN     COMP '1'                      11
     C  N10N11   KOSIN     COMP '2'                      12
     C  N10N11N12          SETON                     99
     C   99                MOVE ERR,1     MSG
     C   99                GOTO WYOMU
     C           CODE      COMP '0001'                 99
     C   99                MOVE ERR,2     MSG
     C   99                GOTO WYOMU
     C******************************************************
     C*     yﾆﾞﾏ[ﾇ 11 ﾉ ﾃ-nﾞ kdlh                          *
     C******************************************************
     C           C1        MULT 4         K1      20
     C           C2        MULT 3         K2      20
     C           C3        MULT 2         K3      20
     C           K2        ADD  K1        K4      20
     C           K4        ADD  K3        K4
     C           K4        DIV  11        K5      20
     C                     MVR            AMR     20
     C           AMR       CABEQ1         STEP10
     C           AMR       IFEQ 0
     C                     Z-ADD0         K6      10
     C                     ELSE
     C           11        SUB  AMR       K6
     C                     END
     C           K6        CABNEC4        STEP10
     C                     MOVEL'MODULES1'CTYPE   9
     C                     MOVE '1'       CTYPE
     C                     GOTO STEP01
     C******************************************************
     C*     yﾆﾞﾏ[ﾇ 10 ﾉ ﾃ-nﾞ kdlh                          *
     C******************************************************
     C           STEP10    TAG
     C                     Z-ADD0         CH1
     C                     Z-ADD0         CH2
     C           C1        MULT 2         CH1
     C           C3        MULT 2         CH2W    20
     C           CH2W      ADD  CH2       CH2
     C                     Z-ADD0         KT      20
     C           CHA       ADD  CHB       KT
     C           CHC       ADD  KT        KT
     C           C2        ADD  KT        KT
     C           KT        DIV  10        SYO     20
     C                     MVR            AMR10   10
     C           AMR10     CABEQ0         STEP02
     C           10        SUB  AMR10     K8      10
     C           C4        CABNEK8        STEP02
     C                     MOVEL'MODULES1'CTYPE
     C                     MOVE '0'       CTYPE
     C                     GOTO STEP01
     C           STEP02    TAG
     C                     MOVEL'GENRALCD'CTYPE
     C                     MOVE 'ﾞ'       CTYPE
     C*                    SETON                     99
     C*                    MOVELERR,11    MSG
     C*                    GOTO WYOMU
     C******************************************************
     C*     ﾅbyhuﾇj- ﾃcﾆ] ﾃ-nﾞ&uﾇj- ]ﾅﾞb f]ibkdlh         *
     C******************************************************
     C           STEP01    TAG
     C                     MOVE CODE      SCODE   40
     C                     SETOF                     131409
     C           SCODE     CHAINFGBPL01              13
     C  N13      B2SKJY    COMP 'D'                      09
     C  N13 09   SDATE     COMP *DATE                  1414
     C   10 13             SETON                     99
     C   99                MOVE ERR,3     MSG
     C   99                GOTO WYOMU
     C           *IN10     IFEQ '1'
     C           *IN14     IFEQ '1'
     C                     SETON                     99
     C                     MOVE ERR,4     MSG
     C                     GOTO WYOMU
     C                     END
     C                     END
     C           *IN11     IFEQ '1'
     C           *IN13     IFEQ '1'
     C                     SETON                     99
     C                     MOVE ERR,5     MSG
     C                     GOTO WYOMU
     C                     END
     C                     END
     C           *IN11     IFEQ '1'
     C           *IN14     IFEQ '1'
     C                     SETON                     99
     C                     MOVE ERR,6     MSG
     C                     GOTO WYOMU
     C                     END
     C                     END
     C  N09 12N13
     CANN14                SETON                     99
     C   99                MOVE ERR,7     MSG
     C   99                GOTO WYOMU
     C                     MOVE KOSIN     KUBN
     C   10                MOVE 'CALCEL'  COMENT
     C   11                MOVE 'CHANGE'  COMENT
     C   12                MOVE ' ADD  '  COMENT
     C  N13 10 09          MOVE SDATE     SHIZK
     C  N13 10N09          Z-ADD*DATE     SHIZK
     C           *IN12     IFEQ '0'
     C           *IN13     IFEQ '0'
     C                     MOVE B2SMEI    SMEI
     C                     MOVE B2ONCD    ON
     C                     MOVE B2TORI    TORI
     C                     MOVE B2GRUP    GRUP
     C                     MOVE B2TKEN    TIKU1
     C                     MOVE B2TIHO    TIKU2
     C*                    MOVE B2KEMI    KMEI
     C*                    MOVE B2ME18    ME18
     C                     MOVELB2GYOS    GIYO
     C                     ELSE
     C                     MOVE *BLANK    SMEI
     C                     MOVE *BLANK    ON
     C                     MOVE *BLANK    TORI
     C                     MOVE *BLANK    GRUP
     C                     MOVE *BLANK    TIKU1
     C                     MOVE *BLANK    TIKU2
     C*                    MOVE *BLANK    KMEI
     C*                    MOVE *BLANK    ME18
     C                     MOVE *BLANK    GIYO
     C                     END
     C                     ELSE
     C                     MOVE *BLANK    SMEI
     C                     MOVE *BLANK    ON
     C                     MOVE *BLANK    TORI
     C                     MOVE *BLANK    GRUP
     C                     MOVE *BLANK    TIKU1
     C                     MOVE *BLANK    TIKU2
     C*                    MOVE *BLANK    KMEI
     C*                    MOVE *BLANK    ME18
     C                     END
     C******************************************************
     C*     ﾅbyhuﾇj- ﾃcﾆ] NO-2 fﾞx] ﾉ ﾍﾑcﾆﾞ & kdlh         *
     C******************************************************
     C           WYOMU2    TAG
     C                     EXFMTGGBPW113
     C                     SETOF                     717273
     C                     SETOF                     747576
     C                     SETOF                     777879
     C                     SETOF                     99
     C           *INKC     IFEQ '1'
     C                     MOVE *BLANK    KOSIN
     C                     MOVE *BLANK    CODE
     C                     GOTO WYOMU
     C                     END
     C           SMEI      IFEQ *BLANK
     C                     SETON                     9971
     C                     MOVE ERR,8     MSG
     C                     GOTO WYOMU2
     C                     END
     C           ON        IFEQ *BLANK
     C                     SETON                     9972
     C                     MOVE ERR,9     MSG
     C                     GOTO WYOMU2
     C                     END
     C           TORI      IFEQ *BLANK
     C                     SETON                     9973
     C                     MOVE ERR,10    MSG
     C                     GOTO WYOMU2
     C                     END
     C           TORI      IFEQ '1'
     C           TORI      OREQ '4'
     C           TORI      OREQ '5'
     C           TORI      OREQ '7'
     C           TORI      OREQ '8'
     C           TIKU1     IFEQ *BLANK
     C                     SETON                     9976
     C                     MOVE ERR,12    MSG
     C                     GOTO WYOMU2
     C                     END
     C           TIKU1     IFLT 'A'
     C                     SETON                     9976
     C                     MOVE ERR,15    MSG
     C                     GOTO WYOMU2
     C                     ELSE
     C           TIKU1     IFGT 'Z'
     C                     SETON                     9976
     C                     MOVE ERR,15    MSG
     C                     GOTO WYOMU2
     C                     END
     C                     END
     C                     ELSE
     C           TIKU1     IFNE *BLANK
     C                     SETON                     9976
     C                     MOVE ERR,13    MSG
     C                     GOTO WYOMU2
     C                     END
     C                     END
     C           TIKU1     IFEQ *BLANK
     C           TIKU2     IFNE *BLANK
     C                     SETON                     9977
     C                     MOVE ERR,14    MSG
     C                     GOTO WYOMU2
     C                     END
     C                     END
     C  NKE                GOTO WYOMU2
     C                     MOVE COMENT    COMEB
     C                     MOVE CODE      CODEB
     C                     MOVE SMEI      SMEIB
     C                     MOVE ON        ONB
     C                     MOVE TORI      TORIB
     C                     MOVE GRUP      GRUPB
     C                     MOVE GIYO      GIYOB
     C                     MOVE TIKU1     TIKUB1
     C                     MOVE TIKU2     TIKUB2
     C*                    MOVE KMEI      SMEIK
     C*                    MOVE ME18      SME18
     C   10                MOVE SHIZK     SDATE
     C  N10                Z-ADD0         SDATE
     C                     MOVE CODE      B2CODE
     C                     MOVE SMEI      B2SMEI
     C                     MOVE ON        B2ONCD
     C                     MOVE TORI      B2TORI
     C                     MOVE GRUP      B2GRUP
     C                     MOVE GIYO      B2GYOS
     C                     MOVE TIKU1     B2TKEN
     C                     MOVE TIKU2     B2TIHO
     C*                    MOVE KMEI      B2KEMI
     C*                    MOVE ME18      B2ME18
     C   10                MOVE 'D'       B2SKJY
     C  N10                MOVE ' '       B2SKJY
     C                     MOVE PUSER     B2KOME
     C                     TIME           WTIME   60
     C                     MOVE *DATE     WDATE   80
     C   10
     COR 11
     COR 12N13 09
     COR 12 14N13          UPDATFGBPL011
     C   12 13             WRITEFGBPL011
     C                     SETON                     U1
     C                     MOVE *BLANK    CODE
     C                     MOVE *BLANK    SMEI
     C*                    MOVE *BLANK    KMEI
     C*                    MOVE *BLANK    ME18
     C                     MOVE *BLANK    ON
     C                     MOVE *BLANK    TORI
     C                     MOVE *BLANK    GRUP
     C                     MOVE *BLANK    GIYO
     C                     MOVE *BLANK    TIKU1
     C                     MOVE *BLANK    TIKU2
     C                     MOVE *BLANK    COMENT
     C                     MOVE *BLANK    KOSIN
     C                     Z-ADD0         SHIZK
     C                     GOTO WOUT
     C           END       TAG
     C                     SETON                     LR
**  ERR-MSG
E-01 SELECT UPDATE INSTRUCTION (0=CANCEL. 1= CHANGE. 2= ADD)
E-02 INPUT DETAILS CODE THAT MORE THAN 0001
E-03 CANCEL WAS APPOINTED, BUT M/F NOT EXIST
E-04 CANCEL WAS APPOINTED, BUT M/F IS CANCELLED ALREADY
E-05 CHANGE WAS APPOINTED, BUT M/F NOT EXIST
E-06 CHANGE WAS APPOINTED, BUT M/F IS DELETED
E-07 ADD WAS APPOINTED, BUT M/F IS INPUT
E-08 DETAILS NAME ISN'T INPUT
E-09 INQUIRY INSTRUCTION ISN'T INPUT
E-10 BUSINESS CONTENTS ISN'T INPUT
E-11 NO CODE OF MODULES 11 OR MODULES 10
E-12 IN CASE OF CUSTOMER,NEEDS CLASSIFICATION INSTRUCTION 1
E-13 BESIDES CUSTOMER CAN NOT INPUT CLASSIFICATION INST 1
E-14 IF CLASSIFICATION 1 IS BLANK, 2 CAN'T INPUT
E-15 CLASSIFICATION 1 CAN USE ONLY ENGLISH LETTER
