     H            Y.
     F** GHCR22 ************************************
     F* * PROCESS M/F UPDATE WITH GHCR21 UPDATE INFORMATION
     F*          M-OKUDA             1986.12.16    *
     F*--------------------------------------------*
     F*  PROCESS M/F UPDATE FROM THE FIRST PROCESS
     F* KEY CHANGE HANDLING IS DONE FROM NEXT PROCESS SUCCESSIVELY
     F**********************************************
     FGHCWP21 IF  F     500            DISK
     FAAMPL11 UF  E           K        DISK         KCOMIT
     F*AJPL11 IF E            K        DISK
     F*HCPL21 IF E            K        DISK
     FGHCNP21 UF  E           K        DISK         KCOMIT
     FGHCPL21 UF  E           K        DISK         KCOMIT
     FGHCPL22 UF  E           K        DISK         KCOMIT       A
     FGHCTP22 UF  E           K        DISK                      A
     E                    KO         15  3               ﾃcmb
     E                    BM         15  4 0             ﾎﾞy]
     E                    BN         15  6               ﾌﾞ]k
     E                    KI         15  3               gﾌﾞ]
     E                    DH         15 12               jﾞbﾍﾑcﾍ]ﾌﾞ]
     E                    HZ         15 10 0             f]ﾌﾞ]gﾒfdﾍﾞ
     E                    TP         15  1               f]ﾌﾞ]ﾆｬﾓb
     E                    CH         15  1               CHGhﾎﾞ]
     E                    CZ         15  8 0             ﾃcmbﾃcﾆ]ﾍﾞ
     E                    SU         15  9 0             ﾃcmbﾈｮmbﾇc
     E                    QKO        15  3               gﾏcﾃcmb
     E                    QBM        15  4 0             gﾏcﾎﾞy]
     E                    QBN        15  6               gﾏcﾌﾞ]k
     E                    QKI        15  3               gﾏcgﾌﾞ]
     E                    QDH        15 12               gﾏ-jﾞbﾍﾑcﾍ]ﾌﾞ]
     E                    QTP        15  1               Qf]ﾌﾞ]ﾆｬﾓb
     E                    WKO        15  3               ﾃcmb
     E                    WBM        15  4 0             ﾎﾞy]
     E                    WBN        15  6               ﾌﾞ]k
     E                    WKI        15  3               gﾌﾞ]
     E                    WDH        15 12               jﾞbﾍﾑcﾍ]ﾌﾞ]
     E                    WHZ        15 10 0             f]ﾌﾞ]gﾒfdﾍﾞ
     E                    WTP        15  1               f]ﾌﾞ]ﾆｬﾓb
     E                    WCH        15  1               CHGhﾎﾞ]
     E                    SE         15  2 0             NSEQ-NO
     E                    QS         15  2 0             QSEQ-NO
     E                    C@SU       15  9 0             ﾈｮmbﾇc
     IGHCWP21 AA  05
     I                                        4  15 WHBAN
     I                                        4   8 WHIN1
     I                                        9  13 WHIN2
     I                                       14  15 WHIN3
     I                                       16  16 WDIHY
     I                                       17  61 WKO
     I                                       62 121 WBM
     I                                      122 166 WKI
     I                                      167 346 WDH
     I                                      347 436 WBN
     I                                      437 4450WSETI
     I            DS
     I******************************************************
     I*   （　新　）  工程コード                       *
     I******************************************************
     I                                        1  45 KO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I******************************************************
     I*   （　新　）  工程内所番地　　　　             *
     I******************************************************
     I            DS
     I                                        1  90 BN
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I******************************************************
     I*   （　新　）  部門コード                       *
     I******************************************************
     I            DS
     I                                        1  60 BM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I******************************************************
     I*   （　新　）  機械番号　　（機番）             *
     I******************************************************
     I            DS
     I                                        1  45 KI
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I******************************************************
     I*   （　新　）  工程代表品番　　　　             *
     I******************************************************
     I            DS
     I                                        1 180 DH
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I******************************************************
     I*   （　新　）  かんばん種類コード               *
     I******************************************************
     I            DS
     I                                        1  15 TP
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I******************************************************
     I*   　　　　　  かんばん切替日                   *
     I******************************************************
     I            DS
     I                                        1 150 HZ
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I******************************************************
     I*   （　旧　）  工程コード                       *
     I******************************************************
     I            DS
     I                                        1  45 QKO
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I******************************************************
     I*   （　旧　）  部門コード                       *
     I******************************************************
     I            DS
     I                                        1  60 QBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I******************************************************
     I*   （　旧　）  機械番号　　（機番）             *
     I******************************************************
     I            DS
     I                                        1  45 QKI
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN10
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I******************************************************
     I*   （　旧　）  工程代表品番　　　　             *
     I******************************************************
     I            DS
     I                                        1 180 QDH
     I                                        1  12 CKQH01
     I                                       13  24 CKQH02
     I                                       25  36 CKQH03
     I                                       37  48 CKQH04
     I                                       49  60 CKQH05
     I                                       61  72 CKQH06
     I                                       73  84 CKQH07
     I                                       85  96 CKQH08
     I                                       97 108 CKQH09
     I                                      109 120 CKQH10
     I                                      121 132 CKQH11
     I                                      133 144 CKQH12
     I                                      145 156 CKQH13
     I                                      157 168 CKQH14
     I                                      169 180 CKQH15
     I******************************************************
     I*   （　旧　）  工程内所番地　　　　             *
     I******************************************************
     I            DS
     I                                        1  90 QBN
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I******************************************************
     I*   （　旧　）  かんばん種類コード               *
     I******************************************************
     I            DS
     I                                        1  15 QTP
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I******************************************************
     I*                 更新日（工程単位）               *
     I******************************************************
     I            DS
     I                                        1 120 CZ
     I                                        1   80CKMN01
     I                                        9  160CKMN02
     I                                       17  240CKMN03
     I                                       25  320CKMN04
     I                                       33  400CKMN05
     I                                       41  480CKMN06
     I                                       49  560CKMN07
     I                                       57  640CKMN08
     I                                       65  720CKMN09
     I                                       73  800CKMN10
     I                                       81  880CKMN11
     I                                       89  960CKMN12
     I                                       97 1040CKMN13
     I                                      105 1120CKMN14
     I                                      113 1200CKMN15
     I******************************************************
     I*             工程代表品番　設定数                 *
     I******************************************************
     I            DS
     I                                        1 135 SU
     I                                        1   90CKSU01
     I                                       10  180CKSU02
     I                                       19  270CKSU03
     I                                       28  360CKSU04
     I                                       37  450CKSU05
     I                                       46  540CKSU06
     I                                       55  630CKSU07
     I                                       64  720CKSU08
     I                                       73  810CKSU09
     I                                       82  900CKSU10
     I                                       91  990CKSU11
     I                                      100 1080CKSU12
     I                                      109 1170CKSU13
     I                                      118 1260CKSU14
     I                                      127 1350CKSU15
     I******************************************************
     I*                 入力ミス　データ修正マーク（＊） *
     I******************************************************
     I            DS
     I                                        1  15 CH
     I                                        1   1 CKCG01
     I                                        2   2 CKCG02
     I                                        3   3 CKCG03
     I                                        4   4 CKCG04
     I                                        5   5 CKCG05
     I                                        6   6 CKCG06
     I                                        7   7 CKCG07
     I                                        8   8 CKCG08
     I                                        9   9 CKCG09
     I                                       10  10 CKCG10
     I                                       11  11 CKCG11
     I                                       12  12 CKCG12
     I                                       13  13 CKCG13
     I                                       14  14 CKCG14
     I                                       15  15 CKCG15
     I            DS
     I                                        1 1350C@SU
     I                                        1   90C@SU01
     I                                       10  180C@SU02
     I                                       19  270C@SU03
     I                                       28  360C@SU04
     I                                       37  450C@SU05
     I                                       46  540C@SU06
     I                                       55  630C@SU07
     I                                       64  720C@SU08
     I                                       73  810C@SU09
     I                                       82  900C@SU10
     I                                       91  990C@SU11
     I                                      100 1080C@SU12
     I                                      109 1170C@SU13
     I                                      118 1260C@SU14
     I                                      127 1350C@SU15
     I            DS
     I                                        1  12 UHBAN
     I                                        1   5 UHIN1
     I                                        6  10 UHIN2
     I                                       11  12 UHIN3
     I            DS
     I                                        1  12 KHBAN
     I                                        1   5 KHIN1
     I                                        6  10 KHIN2
     I                                       11  12 KHIN3
     I            DS
     I                                        1   6 KBANC
     I                                        1   1 KBAN1
     I                                        2   3 KBAN2
     I                                        4   5 KBAN3
     I                                        6   6 KBAN4
     I            DS
     I                                        1  12 NHBAN
     I                                        1   5 NHIN1
     I                                        6  10 NHIN2
     I                                       11  12 NHIN3
     I            DS
     I                                        1   6 NBANC
     I                                        1   1 NBAN1
     I                                        2   3 NBAN2
     I                                        4   5 NBAN3
     I                                        6   6 NBAN4
     I            DS
     I                                        1  12 KHBANM
     I                                        1   5 MMMHN1
     I                                        6  10 MMMHN2
     I                                       11  12 MMMHN3
     I            DS
     I                                        1  12 KHBANJ
     I                                        1   5 MMJHN1
     I                                        6  10 MMJHN2
     I                                       11  12 MMJHN3
     I                                        1   2 HCHK
     I            DS
     I                                        1   6 MBAND
     I                                        1   1 MMMBN1
     I                                        2   3 MMMBN2
     I                                        4   5 MMMBN3
     I                                        6   6 MMMBN4
     I            DS
     I                                        1  12 YHBAN
     I                                        1   5 YHIN1
     I                                        6  10 YHIN2
     I                                       11  12 YHIN3
     I            DS
     I                                        1   6 MTKR
     I                                        1   1 MBN1
     I                                        2   3 MBN2
     I                                        4   5 MBN3
     I                                        6   6 MBN4
     I            DS
     I                                        1  12 OCHBAN
     I                                        1   5 OCHIN1
     I                                        6  10 OCHIN2
     I                                       11  12 OCHIN3
     I            DS
     I                                        1   6 OCBANH
     I                                        1   1 OCBAN1
     I                                        2   3 OCBAN2
     I                                        4   5 OCBAN3
     I                                        6   6 OCBAN4
      *
     C           KEY1      KLIST
     C                     KFLD           MMJHN1
     C                     KFLD           MMJHN2
     C                     KFLD           MMJHN3
     C                     KFLD           MMKSEQ
     C                     KFLD           MMHKBN
      *
     C           AMKEY     KLIST
     C                     KFLD           UHIN1
     C                     KFLD           UHIN2
     C                     KFLD           UHIN3
      *
     C           KKEY      KLIST
     C                     KFLD           KHIN1
     C                     KFLD           KHIN2
     C                     KFLD           KHIN3
     C                     KFLD           KKOTE
     C                     KFLD           KBMON
     C                     KFLD           KBAN1
     C                     KFLD           KBAN2
     C                     KFLD           KBAN3
     C                     KFLD           KBAN4
      *
     C           OYKEY     KLIST
     C                     KFLD           OCHIN1
     C                     KFLD           OCHIN2
     C                     KFLD           OCHIN3
     C                     KFLD           OCKOTE
     C                     KFLD           OCBMON
     C                     KFLD           OCBAN1
     C                     KFLD           OCBAN2
     C                     KFLD           OCBAN3
     C                     KFLD           OCBAN4
      *
     C           CHGH      KLIST
     C                     KFLD           MMJHN1
     C                     KFLD           MMJHN2
     C                     KFLD           MMJHN3
      *
     C******************************************************
     C*   ﾃcmbuﾇj- ﾃcﾆ]mﾞ-j  GHCWP21 ･ ﾑvnﾓ                *
     C*      udﾃcmbuﾇj- . ﾃcmbobuﾇj- ･ ﾃcﾆ]ﾇﾓ              *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           PMENT   1
     C                     PARM           PUSER  10
     C                     PARM           PHBAN  12
     C                     PARM           POSRY   9
     C                     PARM           PNSRY   9
     C                     PARM           PU7IN   1
      *
     C                     MOVE POSRY     WSRYOO  90
     C                     MOVE PNSRY     WSRYON  90
     C                     MOVE *DATE     KTHIZ   80
     C                     MOVE PHBAN     UHBAN
     C           WSRYON    SUB  WSRYOO    WSRYO   90
     C                     MOVE UHIN1     CKHIN1  5
     C                     MOVE UHIN2     CKHIN2  5
     C                     MOVE UHIN3     CKHIN3  2
     C                     Z-ADD1         SSEQ    20
     C                     MOVE *BLANK    SHKBN   1
     C                     MOVE *BLANK    PSKJY   1
     C                     Z-ADD1         CQ      20
      *
     C                     SETOF                     01
     C           AMKEY     CHAINAAMPL111             01
     C           *IN01     IFEQ '1'
     C                     MOVE *BLANK    KO               ﾃcmb
     C                     Z-ADD0         BM               ﾎﾞy]
     C                     MOVE *BLANK    BN               ﾌﾞ]k
     C                     MOVE *BLANK    KI               gﾌﾞ]
     C                     MOVE *BLANK    DH               ﾍ]ﾌﾞ]
     C                     MOVE *BLANK    TP               ﾆｬﾓb
     C                     MOVE *BLANK    CH               CHG
     C                     Z-ADD0         HZ               gﾒfdﾍﾞ
     C                     Z-ADD0         SU               ﾇcﾒｭc
     C                     Z-ADD0         CZ               ﾃcﾆ]ﾍﾞ
     C                     MOVE *BLANK    QKO              Qﾃcmb
     C                     Z-ADD0         QBM              Qﾎﾞy]
     C                     MOVE *BLANK    QBN              Qﾌﾞ]k
     C                     MOVE *BLANK    QKI              Qgﾌﾞ]
     C                     MOVE *BLANK    QDH              Qﾍ]ﾌﾞ]
     C                     MOVE *BLANK    QTP              Qﾆｬﾓb
     C                     GOTO STEP83
     C                     END
      *
     C           PU7IN     CABEQ'1'       STEP80
      *
     C******************************************************
     C*  取消指定の時子品番をＷＯＲＫファイルへ書き込む  *
     C******************************************************
     C           PMENT     CABNE'0'       STEPX5
      *
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           DH,A      IFEQ UHBAN
     C                     GOTO STEPX1
     C                     END
     C                     END
     C                     GOTO STEPX2
     C           STEPX1    TAG
      *
     C                     MOVE DH,A      OCHBAN
     C                     MOVE BM,A      OCBMON  40
     C                     MOVE KO,A      OCKOTE  3
     C                     MOVE BN,A      OCBANH  6
      *
     C           OYKEY     SETLLGHCPL221
     C           STEPX3    TAG
     C                     READ GHCPL22                  17
      *
     C           *IN17     CABEQ'1'       STEPX2
     C           OCHBAN    CABNEKHBANM    STEPX2
     C           OCBMON    CABNEMMMBMN    STEPX2
     C           OCKOTE    CABNEMMMKTE    STEPX2
     C           OCBANH    CABNEMBAND     STEPX2
     C           UHBAN     CABEQKHBANJ    STEPX3
      *
     C                     SETOF                     15
     C           CHGH      CHAINGHCTP221             15
     C  N15                GOTO STEPX3
      *
     C                     MOVE MMJHN1    N8SHN1
     C                     MOVE MMJHN2    N8SHN2
     C                     MOVE MMJHN3    N8SHN3
     C                     MOVE '*'       N8KKBN
     C                     WRITEGHCTP221
     C                     GOTO STEPX3
     C           STEPX2    TAG
      *
     C           POSRY     IFNE PNSRY
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           KO,A      IFNE *BLANK
     C                     GOTO STEPX4
     C                     END
     C                     END
     C                     GOTO STEPX5
     C           STEPX4    TAG
      *
     C                     MOVE DH,A      OCHBAN
     C                     MOVE BM,A      OCBMON  40
     C                     MOVE KO,A      OCKOTE  3
     C                     MOVE BN,A      OCBANH  6
      *
     C           OYKEY     SETLLGHCPL221
     C           STEPX6    TAG
     C                     READ GHCPL22                  17
      *
     C           *IN17     CABEQ'1'       STEPX5
     C           OCHBAN    CABNEKHBANM    STEPX5
     C           OCBMON    CABNEMMMBMN    STEPX5
     C           OCKOTE    CABNEMMMKTE    STEPX5
     C           OCBANH    CABNEMBAND     STEPX5
     C           UHBAN     CABEQKHBANJ    STEPX6
      *
     C                     SETOF                     15
     C           CHGH      CHAINGHCTP221             15
     C  N15                GOTO STEPX6
      *
     C                     MOVE MMJHN1    N8SHN1
     C                     MOVE MMJHN2    N8SHN2
     C                     MOVE MMJHN3    N8SHN3
     C                     MOVE 'S'       N8KKBN
     C                     WRITEGHCTP221
     C                     GOTO STEPX6
     C                     END
     C           STEPX5    TAG
      *
     C                     MOVE *BLANK    MMENT   1
     C                     SETOF                     101112
     C           PMENT     IFEQ '0'
     C                     SETON                     10
     C                     MOVE '1'       MMENT   1
     C                     ELSE
      *
     C           PMENT     IFEQ '1'
     C                     SETON                     11    s]ﾃc
     C                     Z-ADD1         A       20
     C           1         DO   15        A
     C           CZ,A      IFGT 0
     C                     MOVE '1'       MMENT
     C                     GOTO STEP19
     C                     END
     C                     END
      *
     C           POSRY     IFNE PNSRY
     C                     MOVE '1'       MMENT
     C                     GOTO STEP19
     C                     END
     C                     ELSE
      *
     C           PMENT     IFEQ '2'
     C                     SETON                     12    lbf
     C                     MOVE '1'       MMENT
     C                     END
     C                     END
     C                     END
     C           STEP19    TAG
      *
     C   01                GOTO STEP01
     C   10                GOTO STEP87
      *
     C******************************************************
     C*   更新品番の　親子品番グループを　追加する       *
     C******************************************************
     C           STEP89    TAG
     C                     Z-ADD1         X       20
     C                     Z-ADD1         I
      *
     C                     SETOF                     25
     C                     READ GHCWP21                  25
     C   25                GOTO STEP87
      *
     C           MMENT     CABEQ*BLANK    STEP87
     C           STEP88    TAG
     C           I         CABGE15        STEP89
     C           WKO,I     CABNE*BLANK    STEP90
     C           I         ADD  1         I
     C                     GOTO STEP88
     C           STEP90    TAG
      *
     C                     Z-ADDWSETI     NMSRYO  90
     C                     MOVE WDH,I     KHBAN
     C                     MOVE WBM,I     KBMON
     C                     MOVE WKO,I     KKOTE
     C                     MOVE WBN,I     KBANC
      *
     C           KKEY      SETLLGHCPL221
     C           STEP93    TAG
     C                     SETOF                     16
     C                     READ GHCPL221                 16
     C   16                GOTO STEP92
      *
     C           KHBAN     CABNEKHBANM    STEP92
     C           KKOTE     CABNEMMMKTE    STEP92
     C           KBMON     CABNEMMMBMN    STEP92
     C           KBANC     CABNEMBAND     STEP92
     C           MMSRYO    ADD  WSETI     NMSRYO
     C                     Z-ADDNMSRYO    MMSRYO
     C                     UPDATGHCPL221
     C                     GOTO STEP93
     C           STEP92    TAG
      *
     C                     MOVE WHBAN     KHBANJ
     C                     Z-ADDX         MMKSEQ
     C                     MOVE *BLANK    MMHKBN
     C                     EXSR SUBDLT
      *
     C                     MOVE WHBAN     KHBANJ
     C                     Z-ADDX         MMKSEQ
     C                     Z-ADDWSETI     MMSETI
     C                     MOVE *BLANK    MMHKBN
     C                     MOVE WDH,I     KHBANM
     C                     MOVE WKO,I     MMMKTE
     C                     MOVE WBM,I     MMMBMN
     C                     MOVE WBN,I     MBAND
     C                     MOVE WKI,I     MMMSNO
     C                     Z-ADD1         MMKOSU
     C                     Z-ADDNMSRYO    MMSRYO
     C                     WRITEGHCPL221
      *
     C           I         ADD  1         I
     C           X         ADD  1         X
     C                     GOTO STEP88
     C           STEP87    TAG
      *
     C                     Z-ADD1         I       20
     C   12                GOTO STEP02                     lbf
     C           MMENT     CABEQ*BLANK    STEP01
     C   11                GOTO STEP03                     s]ﾃc
      *
     C******************************************************
     C*  完成品番が取消の時工程マスターを　削除する    *
     C******************************************************
     C                     SETOF                     5152
     C                     MOVE *BLANK    WHKEY  12
     C                     Z-ADD0         SETSU   90
     C                     Z-ADD0         CQ               ﾃcmbSEQ
     C           STEP05    TAG
      *
     C           I         CABGE15        STEP01
     C           KO,I      CABNE*BLANK    STEP09
     C           STEP35    TAG
     C           I         ADD  1         I
     C                     GOTO STEP05
     C           STEP09    TAG
      *
     C                     SETOF                     14
     C                     MOVE *BLANK    WHKEY
     C                     Z-ADD0         SETSU   90
     C                     MOVE DH,I      KHBAN
     C                     MOVE KO,I      KKOTE   3
     C                     MOVE BM,I      KBMON   40
     C                     MOVE BN,I      KBANC
     C           UHBAN     CABNEDH,I      STEP04
      *
     C           KKEY      SETLLGHCPL221
     C           STEP06    TAG
     C                     SETOF                     13
     C                     READ GHCPL221                 13
     C   13                GOTO STEP04
      *
     C           KHBAN     CABNEKHBANM    STEP04
     C           KKOTE     CABNEMMMKTE    STEP04
     C           KBMON     CABNEMMMBMN    STEP04
     C           KBANC     CABNEMBAND     STEP04
     C           UHBAN     CABEQKHBANJ    STEP06
      *
     C******************************************************
     C*  次期工程代表品番を設定する  WHKEY fﾞ NOT BLANK  *
     C******************************************************
     C           HCHK      CABEQ'91'      STEP07
     C           HCHK      CABEQ'92'      STEP07
     C           HCHK      CABEQ'93'      STEP07
     C           HCHK      CABEQ'94'      STEP07
     C           HCHK      CABEQ'95'      STEP07
     C*          WHKEY     CABNE*BLANK    STEP06
     C*                    MOVE KHBANJ    WHKEY
      *
     C           *IN14     IFEQ '0'
     C           MMSETI    IFGT SETSU
     C                     Z-ADDMMSETI    SETSU
     C                     MOVE KHBANJ    WHKEY
     C                     GOTO STEP23
     C                     END
     C                     END
     C                     GOTO STEP06
     C           STEP23    TAG
      *
     C******************************************************
     C*  次期工程代表品番の設定された工程をＷＯＲＫに移す*
     C******************************************************
     C                     MOVE WHKEY     CHHBAN 12
     C                     MOVE MMMKTE    CHKOTE  3
     C                     Z-ADDMMMBMN    CHBMON  40
     C                     MOVE MBAND     CHBANC  6
     C                     Z-ADDI         P       20
     C                     GOTO STEP06
     C           STEP07    TAG
      *
     C*  14      KHBANJ    CABGTWHKEY     STEP06
     C*                    MOVE KHBANJ    WHKEY
     C*                    SETON                     14
      *
     C           *IN14     IFEQ '0'
     C                     Z-ADDMMSETI    SETSU
     C                     MOVE KHBANJ    WHKEY
     C                     SETON                     14
     C                     GOTO STEP24
     C                     ELSE
      *
     C           MMSETI    IFGT SETSU
     C                     Z-ADDMMSETI    SETSU
     C                     MOVE KHBANJ    WHKEY
     C                     GOTO STEP24
     C                     END
     C                     END
     C                     GOTO STEP06
     C           STEP24    TAG
      *
     C******************************************************
     C*  次期工程代表品番の設定された工程をＷＯＲＫに移す*
     C******************************************************
     C                     MOVE WHKEY     CHHBAN 12
     C                     MOVE MMMKTE    CHKOTE  3
     C                     Z-ADDMMMBMN    CHBMON  40
     C                     MOVE MBAND     CHBANC  6
     C                     Z-ADDI         P       20
     C                     GOTO STEP06
     C           STEP04    TAG
      *
     C           KKEY      SETLLGHCPL221
     C           STEP08    TAG
     C                     SETOF                     13
     C                     READ GHCPL221                 13
     C   13                GOTO STEP35
      *
     C           KHBAN     CABNEKHBANM    STEP35
     C           KKOTE     CABNEMMMKTE    STEP35
     C           KBMON     CABNEMMMBMN    STEP35
     C           KBANC     CABNEMBAND     STEP35
     C           UHBAN     CABEQKHBANJ    STEP10
     C           MMSRYO    SUB  WSRYOO    MMSRYO
     C           UHBAN     CABNEDH,I      STEP33
     C           WHKEY     CABEQ*BLANK    STEP33
     C                     MOVE WHKEY     KHBANM
     C           STEP33    TAG
      *
     C                     UPDATGHCPL221
     C                     GOTO STEP08
     C           STEP10    TAG
      *
     C                     DELETGHCPL221
     C                     GOTO STEP08
      *
     C******************************************************
     C*  新完成品番　追加の時　工程マスターを作成する    *
     C*  専用工程は追加　；　共通工程は設定数の変更する  *
     C******************************************************
     C           STEP02    TAG
     C                     Z-ADD1         C       20
     C           STEP17    TAG
      *
     C           I         CABGE15        STEP01
     C           KO,I      CABNE*BLANK    STEP11
     C           I         ADD  1         I
     C                     GOTO STEP17
     C           STEP11    TAG
      *
     C                     Z-ADDWSRYON    NMSRYO  90
     C                     MOVE DH,I      KHBAN
     C                     MOVE BM,I      KBMON
     C                     MOVE KO,I      KKOTE
     C                     MOVE BN,I      KBANC
      *
     C           KKEY      SETLLGHCPL221
     C           STEP12    TAG
     C                     SETOF                     16
     C                     READ GHCPL221                 16
     C   16                GOTO STEP13
      *
     C           KHBAN     CABNEKHBANM    STEP13
     C           KKOTE     CABNEMMMKTE    STEP13
     C           KBMON     CABNEMMMBMN    STEP13
     C           KBANC     CABNEMBAND     STEP13
     C           MMSRYO    ADD  WSRYON    NMSRYO
     C                     Z-ADDNMSRYO    MMSRYO
     C                     UPDATGHCPL221
     C                     GOTO STEP12
     C           STEP13    TAG
      *
     C                     MOVE UHBAN     KHBANJ
     C                     Z-ADDC         MMKSEQ
     C                     MOVE *BLANK    MMHKBN
     C                     EXSR SUBDLT
      *
     C                     MOVE UHBAN     KHBANJ
     C                     Z-ADDC         MMKSEQ
     C                     Z-ADDWSRYON    MMSETI
     C                     MOVE *BLANK    MMHKBN
     C                     MOVE DH,I      KHBANM
     C                     MOVE KO,I      MMMKTE
     C                     MOVE BM,I      MMMBMN
     C                     MOVE BN,I      MBAND
     C                     MOVE KI,I      MMMSNO
     C                     Z-ADD1         MMKOSU
     C                     Z-ADDNMSRYO    MMSRYO
     C                     WRITEGHCPL221
      *
     C           C         ADD  1         C
     C           I         ADD  1         I
     C                     GOTO STEP17
      *
     C******************************************************
     C*  完成品番変更の時　工程マスターを変更する        *
     C******************************************************
     C           STEP03    TAG
     C                     Z-ADD1         C
     C           STEP18    TAG
      *
     C           I         CABGE15        STEP01
     C           KO,I      CABNE*BLANK    STEP14
     C           I         ADD  1         I
     C                     GOTO STEP18
     C           STEP14    TAG
      *
     C                     Z-ADDWSRYON    NMSRYO  90
     C                     MOVE DH,I      KHBAN
     C                     MOVE BM,I      KBMON
     C                     MOVE KO,I      KKOTE
     C                     MOVE BN,I      KBANC
      *
     C           KKEY      SETLLGHCPL221
     C           STEP15    TAG
     C                     SETOF                     16
     C                     READ GHCPL221                 16
     C   16                GOTO STEP16
      *
     C           KHBAN     CABNEKHBANM    STEP16
     C           KKOTE     CABNEMMMKTE    STEP16
     C           KBMON     CABNEMMMBMN    STEP16
     C           KBANC     CABNEMBAND     STEP16
     C           MMSRYO    ADD  WSRYON    NMSRYO
     C                     Z-ADDNMSRYO    MMSRYO
     C                     UPDATGHCPL221
     C                     GOTO STEP15
     C           STEP16    TAG
      *
     C                     MOVE UHBAN     KHBANJ
     C                     Z-ADDC         MMKSEQ
     C                     MOVE *BLANK    MMHKBN
     C                     EXSR SUBDLT
      *
     C                     MOVE UHBAN     KHBANJ
     C                     Z-ADDC         MMKSEQ
     C                     Z-ADDWSRYON    MMSETI
     C                     MOVE *BLANK    MMHKBN
     C                     MOVE DH,I      KHBANM
     C                     MOVE KO,I      MMMKTE
     C                     MOVE BM,I      MMMBMN
     C                     MOVE BN,I      MBAND
     C                     MOVE KI,I      MMMSNO
     C                     Z-ADD1         MMKOSU
     C                     Z-ADDNMSRYO    MMSRYO
     C                     WRITEGHCPL221
      *
     C           C         ADD  1         C
     C           I         ADD  1         I
     C                     GOTO STEP18
      *
     C******************************************************
     C*  工程マスター全更新後変更される工程の内で一番若い*
     C*  工程順位の工程に関連する子品番又は親品番を      *
     C*  ＧＨＣＴＬ２２へ書き出す。                      *
     C******************************************************
     C           STEP01    TAG
     C           PMENT     CABEQ'0'       STEP83
      *
     C******************************************************
     C*  更新が必要な子品番をＷＯＲＫファイルへ書き込む  *
     C******************************************************
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           PMENT     IFEQ '0'
     C           DH,A      IFEQ UHBAN
     C                     GOTO STEP82
     C                     END
     C                     ELSE
      *
     C           CZ,A      IFGT 0
     C           KO,A      IFNE *BLANK
     C                     GOTO STEP82
     C                     END
     C                     END
     C                     END
     C                     END
     C                     GOTO STEP20
     C           STEP82    TAG
      *
     C                     MOVE DH,A      OCHBAN
     C                     MOVE BM,A      OCBMON  40
     C                     MOVE KO,A      OCKOTE  3
     C                     MOVE BN,A      OCBANH  6
      *
     C           OYKEY     SETLLGHCPL221
     C                     SETOF                     17
     C           STEP81    TAG
     C                     READ GHCPL22                  17
     C           *IN17     CABEQ'1'       STEP20
      *
     C           OCHBAN    CABNEKHBANM    STEP20
     C           OCBMON    CABNEMMMBMN    STEP20
     C           OCKOTE    CABNEMMMKTE    STEP20
     C           OCBANH    CABNEMBAND     STEP20
     C           UHBAN     CABEQKHBANJ    STEP81
      *
     C                     SETOF                     15
     C           CHGH      CHAINGHCTP221             15
     C  N15                GOTO STEP81
      *
     C                     MOVE MMJHN1    N8SHN1
     C                     MOVE MMJHN2    N8SHN2
     C                     MOVE MMJHN3    N8SHN3
     C                     MOVE '*'       N8KKBN
     C                     WRITEGHCTP221
     C                     GOTO STEP81
     C           STEP20    TAG
      *
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           PMENT     IFEQ '0'
     C           QDH,A     IFEQ UHBAN
     C                     GOTO STEP51
     C                     END
     C                     ELSE
      *
     C           CZ,A      IFGT 0
     C           QKO,A     IFNE *BLANK
     C                     GOTO STEP51
     C                     END
     C                     END
     C                     END
     C                     END
     C                     GOTO STEP52
     C           STEP51    TAG
      *
     C                     MOVE QDH,A     OCHBAN
     C                     MOVE QBM,A     OCBMON
     C                     MOVE QKO,A     OCKOTE
     C                     MOVE QBN,A     OCBANH
      *
     C           OYKEY     SETLLGHCPL221
     C                     SETOF                     17
     C           STEP53    TAG
     C                     READ GHCPL22                  17
     C           *IN17     CABEQ'1'       STEP52
      *
     C           OCHBAN    CABNEKHBANM    STEP52
     C           OCBMON    CABNEMMMBMN    STEP52
     C           OCKOTE    CABNEMMMKTE    STEP52
     C           OCBANH    CABNEMBAND     STEP52
     C           UHBAN     CABEQKHBANJ    STEP53
      *
     C                     SETOF                     15
     C           CHGH      CHAINGHCTP221             15
     C  N15                GOTO STEP53
      *
     C                     MOVE MMJHN1    N8SHN1
     C                     MOVE MMJHN2    N8SHN2
     C                     MOVE MMJHN3    N8SHN3
     C                     MOVE 'S'       N8KKBN
     C                     WRITEGHCTP221
     C                     GOTO STEP53
     C           STEP52    TAG
      *
     C           POSRY     IFNE PNSRY
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           KO,A      IFNE *BLANK
     C                     GOTO STEP21
     C                     END
     C                     END
     C                     GOTO STEP80
     C           STEP21    TAG
      *
     C                     MOVE DH,A      OCHBAN
     C                     MOVE BM,A      OCBMON  40
     C                     MOVE KO,A      OCKOTE  3
     C                     MOVE BN,A      OCBANH  6
      *
     C           OYKEY     SETLLGHCPL221
     C                     SETOF                     17
     C           STEP22    TAG
     C                     READ GHCPL22                  17
     C           *IN17     CABEQ'1'       STEP80
      *
     C           OCHBAN    CABNEKHBANM    STEP80
     C           OCBMON    CABNEMMMBMN    STEP80
     C           OCKOTE    CABNEMMMKTE    STEP80
     C           OCBANH    CABNEMBAND     STEP80
     C           UHBAN     CABEQKHBANJ    STEP22
      *
     C                     SETOF                     15
     C           CHGH      CHAINGHCTP221             15
     C  N15                GOTO STEP22
      *
     C                     MOVE MMJHN1    N8SHN1
     C                     MOVE MMJHN2    N8SHN2
     C                     MOVE MMJHN3    N8SHN3
     C                     MOVE 'S'       N8KKBN
     C                     WRITEGHCTP221
     C                     GOTO STEP22
     C                     END
     C           STEP80    TAG
      *
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           KO,A      IFNE *BLANK
     C           DH,A      IFNE QDH,A
     C                     GOTO STEP54
     C                     END
     C                     END
     C                     GOTO STEP55
     C           STEP54    TAG
      *
     C                     MOVE QDH,A     OCHBAN
     C                     MOVE QBM,A     OCBMON
     C                     MOVE QKO,A     OCKOTE
     C                     MOVE QBN,A     OCBANH
     C           OYKEY     SETLLGHCPL221
     C                     SETOF                     17
     C           STEP56    TAG
     C                     READ GHCPL22                  17
     C           *IN17     CABEQ'1'       STEP55
      *
     C           OCHBAN    CABNEKHBANM    STEP55
     C           OCBMON    CABNEMMMBMN    STEP55
     C           OCKOTE    CABNEMMMKTE    STEP55
     C           OCBANH    CABNEMBAND     STEP55
     C           UHBAN     CABEQKHBANJ    STEP56
      *
     C                     SETOF                     15
     C           CHGH      CHAINGHCTP221             15
     C  N15                GOTO STEP56
      *
     C                     MOVE MMJHN1    N8SHN1
     C                     MOVE MMJHN2    N8SHN2
     C                     MOVE MMJHN3    N8SHN3
     C                     MOVE 'S'       N8KKBN
     C                     WRITEGHCTP221
     C                     GOTO STEP56
     C                     END
     C           STEP55    TAG
      *
     C                     Z-ADD0         SU
     C                     Z-ADD1         I
     C           1         DO   15        I
     C           KO,I      IFNE *BLANK
     C                     MOVE DH,I      KHBAN
     C                     MOVE BM,I      KBMON
     C                     MOVE KO,I      KKOTE
     C                     MOVE BN,I      KBANC
      *
     C           KKEY      SETLLGHCPL221
     C                     SETOF                     16
     C                     READ GHCPL221                 16
     C   16                GOTO STEP84
      *
     C           KHBAN     CABNEKHBANM    STEP84
     C           KKOTE     CABNEMMMKTE    STEP84
     C           KBMON     CABNEMMMBMN    STEP84
     C           KBANC     CABNEMBAND     STEP84
     C                     Z-ADDMMSRYO    SU,I
     C           STEP84    TAG
     C                     END
     C                     END
      *
     C                     UPDATAAMPL111
      *
     C*--------------------------------------------------*
     C*  ..社内かんばん切替マスター　キー変更データ..  *
     C*--------------------------------------------------*
     C                     SETOF                     30
     C           AMKEY     CHAINGHCNP211             30
     C           *IN30     IFEQ '0'
     C                     Z-ADDSU        C@SU
     C                     UPDATGHCNP211
     C                     END
      *
     C           STEP83    TAG
     C                     SETON                     LR
      *
      *
     C*-----------------------*
     C*      ..ﾅﾎﾞﾓｰk]..      *
     C*  .. GHCPL22 DELET ..  *
     C*-----------------------*
     C           SUBDLT    BEGSR
      *
     C                     SETOF                     20
     C           KEY1      CHAINGHCPL211             20
     C           *IN20     IFEQ '0'
     C                     DELETGHCPL211
     C                     END
      *
     C                     ENDSR
