     H            Y.
     F** GIGR96 ************************
     F*  RESTOR OF TRANSFER DATA <RPG> *
     F*            .. DIE ..           *
     F*          K.YASUDA   2000.04.04 *
     F************************ GIGR96 **
     FGIGWP5F IP  F     200            DISK
     FGDIPL50 UF  E           K        DISK                      A
     IGIGWP5F AA
     I                                        1   2 IVOS1
     I                                        3   60IVOS2
     I                                        7  120IODER
     I                                       13  170IITEM L1
     I                                       18  190IIKBN L1
     I                                       20  21 IKAT1
     I                                       22  25 IKAT2
     I                                       26  26 IKAT3
     I                                       27  27 IKAT4
     I                                       28  28 IHANY
     I                                       29  350IKSYS
     I                                       36  420INOSU
     I                                       43  460INOHK
     I                                       47  500ISKOY
     I                                       51  520ISKOM
     I                                       53  540ISKOD
     I                                       36  420IMINO
     I                                       43  460IMIHK
     I            DS
     I                                        1   80IMSKHZ
     I                                        1   40IMSKYY
     I                                        5   60IMSKMM
     I                                        7   80IMSKDD
     I            DS
     I                                        1   80IMKOHZ
     I                                        1   40IMKOYY
     I                                        5   60IMKOMM
     I                                        7   80IMKODD
      *
     C           KEY1      KLIST
     C                     KFLD           IODER
     C                     KFLD           IITEM
     C*                    KFLD           IIKBN
     C                     KFLD           IVOS1
     C                     KFLD           IVOS2
      *
     C                     SETOF                     10
     C           KEY1      CHAINGDIPL501             10
      *
     C                     MOVE *BLANK    IMSKJY
     C                     Z-ADD0         IMSKHZ
     C                     Z-ADD*DATE     IMKOHZ
     C                     MOVEL'ASJ'     IMKOME
     C                     Z-ADDIODER     IMODER
     C                     Z-ADDIITEM     IMITEM
     C                     Z-ADDIIKBN     IMIKBN
     C                     MOVELIVOS1     IMINV1
     C                     Z-ADDIVOS2     IMINV2
     C                     MOVELIKAT1     IMKAT1
     C                     MOVELIKAT2     IMKAT2
     C                     MOVELIKAT3     IMKAT3
     C                     MOVELIKAT4     IMKAT4
     C                     Z-ADDISKOY     IMSPYY
     C                     Z-ADDISKOM     IMSPMM
     C                     Z-ADDISKOD     IMSPDD
     C                     Z-ADDINOSU     IMNOSU
     C                     Z-ADDINOHK     IMNOHK
     C                     MOVELIHANY     IMHANY
     C                     Z-ADDIMINO     IMMINO
     C                     Z-ADDIMIHK     IMMIHK
      *
     C           *IN10     IFEQ '0'
     C                     UPDATGDIPL501
     C                     ELSE
     C                     WRITEGDIPL501
     C                     END
      *
