     H            Y.
     F*** GKBR16 *************************************
     F* MATERIAL ACTUAL INCOMING  ACCUMULATION FILE INQUIRY & UPDATE *
     F*         H.ITO              88.11.07          *
     F************************************* GKBR16 ***
     FGKBPW16 CF  E                    WORKSTN
     F                                              KNUM        1
     F                                              KINFDS FEEDBK
     FFGBPL01 IF  E           K        DISK
     FGK#PL11 UF  E           K        DISK
     FGK#PL13 IF  E           K        DISK
     FGK#PL21 UF  E           K        DISK
     FGK#PL22 IF  E           K        DISK
     E                    TBL1    1   9  4 0 TBL2   10   cibﾛﾃcﾆﾞｭc
     E                    TBL3    1   2  1   TBL4   10   ﾅﾞbﾒｭchﾎﾞ]
     E                    TBL5    1   3  1   TBL6    9   ﾃcﾆ]hﾎﾞ]
     E                    TBL7    1   4  2 0 TBL8   12   mﾌbhﾎﾞ]
     E                    TBL9    1   4  1   TBLA    8   ﾃcﾆｬhﾎﾞ]
     E                    @SKJ        5  3               ﾌbﾆ mﾞｰj
     E                    @KSN        5  6               ﾃcﾆ]
     E                    @NO         5  1               SEQ-NO
     E                    @ZNM        5 15               ﾅﾞbﾆl
     E                    @ZIK        5  5 2             ﾅﾞbib
     E                    @SIR        5  4 0             ﾆbﾛﾅg
     E                    @SNM        5 16               ﾆbﾛﾅgxb
     E                    @KEY        5 34               KEYﾈｮn
     E                    ER      1  25 60               d[ｰxｮﾈｰﾆﾞ
     I            DS
     I                                        1  15 @SKJ
     I                                        1   3 @SKJ1
     I                                        4   6 @SKJ2
     I                                        7   9 @SKJ3
     I                                       10  12 @SKJ4
     I                                       13  15 @SKJ5
     I            DS
     I                                        1  30 @KSN
     I                                        1   6 @KSN1
     I                                        7  12 @KSN2
     I                                       13  18 @KSN3
     I                                       19  24 @KSN4
     I                                       25  30 @KSN5
     I            DS
     I                                        1   5 @NO
     I                                        1   1 @NO1
     I                                        2   2 @NO2
     I                                        3   3 @NO3
     I                                        4   4 @NO4
     I                                        5   5 @NO5
     I            DS
     I                                        1  75 @ZNM
     I                                        1  15 @ZNM1
     I                                       16  30 @ZNM2
     I                                       31  45 @ZNM3
     I                                       46  60 @ZNM4
     I                                       61  75 @ZNM5
     I            DS
     I                                        1  252@ZIK
     I                                        1   52@ZIK1
     I                                        6  102@ZIK2
     I                                       11  152@ZIK3
     I                                       16  202@ZIK4
     I                                       21  252@ZIK5
     I            DS
     I                                        1  200@SIR
     I                                        1   40@SIR1
     I                                        5   80@SIR2
     I                                        9  120@SIR3
     I                                       13  160@SIR4
     I                                       17  200@SIR5
     I            DS
     I                                        1  80 @SNM
     I                                        1  16 @SNM1
     I                                       17  32 @SNM2
     I                                       33  48 @SNM3
     I                                       49  64 @SNM4
     I                                       65  80 @SNM5
     I            DS
     I                                        1   60@YM
     I                                        1   40@YY
     I                                        5   60@MM
     I            DS
     I                                        1  34 #KEY1
     I                                        1   60X4NUYM
     I                                        1   40X4NUYY
     I                                        5   60X4NUMM
     I                                        7  100X4UKER
     I                                       11  25 X4KAZN
     I                                       26  302X4KAZI
     I                                       31  340X4SIRE
     I            DS
     I                                        1  34 #KEY2
     I                                        1   60X6NUYM
     I                                        1   40X6NUYY
     I                                        5   60X6NUMM
     I                                        7  100X6UKER
     I                                       11  25 X6BOZN
     I                                       26  302X6BOZI
     I                                       31  340X6SIRE
     I            DS
     I                                        1   80X4SKHZ
     I                                        1   40X4SKYY
     I                                        5   60X4SKMM
     I                                        7   80X4SKDD
     I            DS
     I                                        1   80X6SKHZ
     I                                        1   40X6SKYY
     I                                        5   60X6SKMM
     I                                        7   80X6SKDD
     I            DS
     I                                        1   80X4KOHZ
     I                                        1   40X4KOYY
     I                                        5   60X4KOMM
     I                                        7   80X4KODD
     I            DS
     I                                        1   80X6KOHZ
     I                                        1   40X6KOYY
     I                                        5   60X6KOMM
     I                                        7   80X6KODD
     I            DS
     I                                        1   60@TIME
     I                                        1   20X4KOHH
     I                                        3   40X4KOSS
     I            DS
     I                                        1   60#TIME
     I                                        1   20X6KOHH
     I                                        3   40X6KOSS
     I            DS
     I                                        1  10 WUSER
     I                                        1   2 US
     IFEEDBK      DS
     I                                     *STATUS  @STTS
     C/SPACE 1
     C*****************************************************
     C* MO-NO1   ﾌﾟ[xｰjｰ & ﾆｭgﾆｭﾒ
     C*****************************************************
     C           *ENTRY    PLIST
     C                     PARM           USER   10        ﾏｰﾅﾞｰ
     C                     MOVELUSER      WUSER
     C                     EXSR #CLR1
     C/SPACE 1
     C*****************************************************
     C* MO-NO2   fﾞx]-1
     C*****************************************************
     C           @SCR1     TAG
     C                     WRITEGKBPW161
     C                     READ GKBPW16                9797<TIME eｰﾌﾞｰ>
     C                     MOVEA'0000'    *IN,02
     C                     MOVEA'0'       *IN,99
     C*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C           *IN97     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     99
     C                     MOVELER,01     MSG
     C                     GOTO @SCR1
     C                     END
     C*
     C* pｬcﾃﾍﾞ <r]>
     C*
     C           @YY       IFEQ 0
     C                     SETON                     0299
     C                     MOVELER,02     MSG
     C                     GOTO @SCR1
     C                     END
     C           @YY       IFLT 1987
     C                     SETON                     0299
     C                     MOVELER,03     MSG
     C                     GOTO @SCR1
     C                     END
     C*
     C* pｬcﾃﾍﾞ <lg>
     C*
     C           @MM       IFEQ 0
     C                     SETON                     0399
     C                     MOVELER,04     MSG
     C                     GOTO @SCR1
     C                     END
     C           @MM       IFLT 01
     C           @MM       ORGT 12
     C                     SETON                     0399
     C                     MOVELER,05     MSG
     C                     GOTO @SCR1
     C                     END
     C*
     C* cibﾛﾃcﾆﾞｭc
     C*
     C           @UKER     IFEQ 0
     C                     SETON                     0499
     C                     MOVELER,06     MSG
     C                     GOTO @SCR1
     C                     END
     C                     Z-ADD1         B       10
     C                     MOVE *BLANK    @UMEI
     C                     SETOF                     20
     C           @UKER     LOKUPTBL1,B                   20
     C           *IN20     IFEQ '0'
     C                     SETOF                     30
     C           @UKER     CHAINFGBPL011             30
     C           *IN30     IFEQ '1'
     C                     SETON                     0499
     C                     MOVELER,07     MSG
     C                     GOTO @SCR1
     C                     END
     C                     END
     C   20                MOVELTBL2,B    @UMEI
     C  N20                MOVELB2SMEI    @UMEI
     C*
     C* ﾅﾞbﾒｭchﾎﾞ]
     C*
     C           @KUBN     IFEQ *BLANK
     C                     SETON                     0599
     C                     MOVELER,08     MSG
     C                     GOTO @SCR1
     C                     END
     C                     Z-ADD1         B
     C                     MOVE *BLANK    @KMEI
     C                     SETOF                     20
     C           @KUBN     LOKUPTBL3,B                   20
     C           *IN20     IFEQ '0'
     C                     SETON                     0599
     C                     MOVELER,09     MSG
     C                     GOTO @SCR1
     C                     END
     C                     MOVELTBL4,B    @KMEI
     C/SPACE 1
     C*****************************************************
     C* MO-NO3   mﾞｰj ﾈﾛhn
     C*****************************************************
     C           KEY1      KLIST
     C                     KFLD           @YY
     C                     KFLD           @MM
     C                     KFLD           @UKER
     C           KEY2      KLIST
     C                     KFLD           @YY
     C                     KFLD           @MM
     C                     KFLD           @UKER
     C                     KFLD           WSIR
     C                     KFLD           WZNM
     C                     KFLD           WZIK
     C           KEYA      KLIST
     C                     KFLD           X4NUYY
     C                     KFLD           X4NUMM
     C                     KFLD           X4UKER
     C                     KFLD           X4KAZN
     C                     KFLD           X4KAZI
     C                     KFLD           X4SIRE
     C           KEYB      KLIST
     C                     KFLD           X6NUYY
     C                     KFLD           X6NUMM
     C                     KFLD           X6UKER
     C                     KFLD           X6BOZN
     C                     KFLD           X6BOZI
     C                     KFLD           X6SIRE
     C*
     C                     EXSR #CLR2
     C                     Z-ADD0         A       50
     C           @KUBN     IFEQ 'A'
     C           KEY1      SETLLGK#PL131
     C                     ELSE
     C           KEY1      SETLLGK#PL221
     C                     END
     C                     DO   *HIVAL
     C                     SETOF                     30
     C           @KUBN     IFEQ 'A'
     C           KEY1      READEGK#PL131                 30
     C   30                GOTO STP1
     C                     ELSE
     C           KEY1      READEGK#PL221                 30
     C   30                GOTO STP1
     C                     END
     C                     ADD  1         A
     C           A         CABGT5         STP1
     C                     EXSR #SUB1
     C           STP1      TAG
     C  N30                END
     C*
     C* mﾞｰj oﾆ
     C*
     C           A         IFEQ 0
     C                     SETON                     99
     C                     MOVELER,10     MSG
     C                     GOTO @SCR1
     C                     END
     C/SPACE 1
     C*****************************************************
     C* MO-NO4   fﾞx]-2
     C*****************************************************
     C           @SCR2     TAG
     C                     WRITEGKBPW162
     C                     READ GKBPW16                9797<TIME eｰﾌﾞｰ>
     C                     MOVEA'00000'   *IN,11
     C                     MOVEA'0'       *IN,99
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C   KC                EXSR #CLR1
     C   KC                GOTO @SCR1
     C           *IN97     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     99
     C                     MOVELER,01     MSG
     C                     GOTO @SCR2
     C                     END
     C* ROLL-UP
     C           *IN81     IFEQ '1'
     C                     EXSR #RLUP
     C           *IN99     IFEQ '1'
     C                     MOVELER,11     MSG
     C                     END
     C                     GOTO @SCR2
     C                     END
     C* ROLL-DOWN
     C           *IN82     IFEQ '1'
     C                     EXSR #RLDN
     C           *IN99     IFEQ '1'
     C                     MOVELER,12     MSG
     C                     END
     C                     GOTO @SCR2
     C                     END
     C*
     C                     Z-ADD1         C       10
     C           1         DO   5         C
     C           C         ADD  10        D       20
     C           @NO,C     IFNE '0'
     C           @NO,C     ANDNE'1'
     C           @NO,C     ANDNE'M'
     C           @NO,C     ANDNE*BLANK
     C                     MOVE '1'       *IN,D
     C                     MOVE '1'       *IN99
     C                     MOVELER,13     MSG
     C                     GOTO @SCR2
     C                     END
     C                     END
     C*
     C                     MOVEL*BLANK    WNO     1
     C                     MOVEL*BLANK    WZNM   15
     C                     Z-ADD0         WZIK    52
     C                     Z-ADD0         WSIR    40
     C                     Z-ADD1         E       10
     C                     SETOF                     30
     C           1         DO   5         E
     C           E         ADD  10        F       20
     C           @NO,E     IFNE *BLANK
     C                     MOVE @NO,E     WNO
     C                     SETOF                     20
     C                     Z-ADD1         G       10
     C           WNO       LOKUPTBL5,G                   20
     C   20                MOVELTBL6,G    @KOSN
     C                     MOVEL@ZNM,E    WZNM
     C                     Z-ADD@ZIK,E    WZIK
     C                     Z-ADD@SIR,E    WSIR
     C                     SETOF                     31
     C           WNO       IFEQ '0'
     C           WNO       OREQ 'M'
     C           US        OREQ 'A2'
     C                     SETON                     31
     C                     END
     C                     SETON                     30
     C                     END
     C  N30                END
     C           WNO       COMP *BLANK                   32
     C/SPACE 1
     C*****************************************************
     C* MO-NO4.5 mﾞｰj ﾈｮn
     C*****************************************************
     C           @KUBN     IFEQ 'A'
     C           *IN32     IFEQ '0'
     C                     SETOF                     30
     C           KEY2      CHAINGK#PL111             30
     C           *IN30     IFEQ '0'
     C           X4SKJY    IFEQ 'D'
     C           X4SKHZ    ANDLE*DATE
     C                     MOVE '1'       *IN,F
     C                     MOVE '1'       *IN99
     C                     MOVELER,14     MSG
     C                     GOTO @SCR2
     C                     END
     C                     Z-ADD1         B
     C                     SETOF                     20
     C                     MOVE *BLANK    X4TMEI
     C           X4TEHI    LOKUPTBL7,B                   20
     C   20                MOVELTBL8,B    X4TMEI
     C                     Z-ADD1         B
     C                     SETOF                     20
     C                     MOVE *BLANK    X4KMEI
     C           X4KUBN    LOKUPTBL9,B                   20
     C   20                MOVELTBLA,B    X4KMEI
     C                     GOTO @SCR3
     C                     END
     C                     ELSE
     C                     GOTO @SCR2
     C                     END
     C                     ELSE
     C           *IN32     IFEQ '0'
     C                     SETOF                     30
     C           KEY2      CHAINGK#PL211             30
     C           *IN30     IFEQ '0'
     C           X6SKJY    IFEQ 'D'
     C           X6SKHZ    ANDLE*DATE
     C                     MOVE '1'       *IN,F
     C                     MOVE '1'       *IN99
     C                     MOVELER,14     MSG
     C                     GOTO @SCR2
     C                     END
     C                     Z-ADD1         B
     C                     SETOF                     20
     C                     MOVE *BLANK    X6TMEI
     C           X6TEHI    LOKUPTBL7,B                   20
     C   20                MOVELTBL8,B    X6TMEI
     C                     Z-ADD1         B
     C                     SETOF                     20
     C                     MOVE *BLANK    X6KMEI
     C           X6KUBN    LOKUPTBL9,B                   20
     C   20                MOVELTBLA,B    X6KMEI
     C                     GOTO @SCR4
     C                     END
     C                     ELSE
     C                     GOTO @SCR2
     C                     END
     C                     END
     C/SPACE 1
     C*****************************************************
     C* MO-NO5   fﾞx]-3    f]ﾈbﾅﾞb
     C*****************************************************
     C           @SCR3     TAG
     C                     WRITEGKBPW163
     C                     READ GKBPW16                9797<TIME eｰﾌﾞｰ>
     C                     MOVEA'0'       *IN,21
     C                     MOVEA'0'       *IN,99
     C   KC                MOVE *BLANK    @NO
     C   KC                GOTO @SCR2
     C           *IN97     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     99
     C                     MOVELER,01     MSG
     C                     GOTO @SCR3
     C                     END
     C*
     C*          X4JRYO    IFEQ 0
     C*                    SETON                     2199
     C*                    MOVELER,15     MSG
     C*                    GOTO @SCR3
     C*                    END
     C*
     C  NKE                GOTO @SCR3
     C/SPACE 1
     C*****************************************************
     C* MO-NO6   GK#PL111  f]ﾈbﾅﾞb ﾎｦbﾓﾃcﾆ]
     C*****************************************************
     C           WNO       IFNE 'M'
     C           WNO       IFEQ '0'
     C                     MOVE 'D'       X4SKJY
     C                     Z-ADD*DATE     X4SKHZ
     C                     END
     C                     Z-ADD*DATE     X4KOHZ
     C                     TIME           @TIME
     C                     MOVELUSER      X4KOME
     C                     UPDATGK#PL111
     C           WNO       IFEQ '0'
     C                     MOVEL'CANCEL'  @KSN,E
     C                     ELSE
     C           WNO       IFEQ '1'
     C                     MOVEL'CHANGE'  @KSN,E
     C                     END
     C                     END
     C                     MOVE *BLANK    @NO
     C                     END
     C                     MOVE *BLANK    @NO
     C                     GOTO @SCR2
     C/SPACE 1
     C*****************************************************
     C* MO-NO7   fﾞx]-4    tﾞﾅﾞb
     C*****************************************************
     C           @SCR4     TAG
     C                     WRITEGKBPW164
     C                     READ GKBPW16                9797<TIME eｰﾌﾞｰ>
     C                     MOVEA'0'       *IN,21
     C                     MOVEA'0'       *IN,99
     C   KC                MOVE *BLANK    @NO
     C   KC                GOTO @SCR2
     C           *IN97     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     99
     C                     MOVELER,01     MSG
     C                     GOTO @SCR4
     C                     END
     C*
     C           X6JRYO    IFEQ 0
     C                     SETON                     2199
     C                     MOVELER,15     MSG
     C                     GOTO @SCR4
     C                     END
     C*
     C  NKE                GOTO @SCR4
     C/SPACE 1
     C*****************************************************
     C* MO-NO8   GK#PL211  tﾞﾅﾞb ﾎｦbﾓﾃcﾆ]
     C*****************************************************
     C           WNO       IFNE 'M'
     C           WNO       IFEQ '0'
     C                     MOVE 'D'       X6SKJY
     C                     Z-ADD*DATE     X6SKHZ
     C                     END
     C                     Z-ADD*DATE     X6KOHZ
     C                     TIME           #TIME
     C                     MOVELUSER      X6KOME
     C                     UPDATGK#PL211
     C           WNO       IFEQ '0'
     C                     MOVEL'CANCEL'  @KSN,E
     C                     ELSE
     C           WNO       IFEQ '1'
     C                     MOVEL'CHANGE'  @KSN,E
     C                     END
     C                     END
     C                     MOVE *BLANK    @NO
     C                     END
     C                     MOVE *BLANK    @NO
     C                     GOTO @SCR2
     C/SPACE 1
     C*****************************************************
     C* MO-NO9   SUBRUTN   fﾞx]-1 ﾉ hﾒaｰ
     C*****************************************************
     C           #CLR1     BEGSR
     C                     Z-ADD0         @YY
     C                     Z-ADD0         @MM
     C                     Z-ADD0         @UKER
     C                     MOVE *BLANK    @KUBN
     C                     ENDSR
     C/SPACE 1
     C*****************************************************
     C* MO-NO10  SUBRUTN   ﾌbﾛl ﾉ hﾒaｰ
     C*****************************************************
     C           #CLR2     BEGSR
     C                     MOVE *BLANK    @SKJ
     C                     MOVE *BLANK    @KSN
     C                     MOVE *BLANK    @NO
     C                     MOVE *BLANK    @ZNM
     C                     Z-ADD0         @ZIK
     C                     Z-ADD0         @SIR
     C                     MOVE *BLANK    @SNM
     C                     MOVE *BLANK    @KEY
     C                     ENDSR
     C/SPACE 1
     C*****************************************************
     C* MO-NO11  SUBRUTN   mﾞｰj ﾉ ﾈｮn
     C*****************************************************
     C           #SUB1     BEGSR
     C           @KUBN     IFEQ 'A'
     C           X4SKJY    IFEQ 'D'
     C                     MOVE 'END '  @SKJ,A
     C                     END
     C                     MOVE X4KAZN    @ZNM,A
     C                     Z-ADDX4KAZI    @ZIK,A
     C                     Z-ADDX4SIRE    @SIR,A
     C                     SETOF                     30
     C           X4SIRE    CHAINFGBPL011             30
     C  N30                MOVELB2SMEI    @SNM,A
     C                     MOVE #KEY1     @KEY,A
     C                     ELSE
     C           X6SKJY    IFEQ 'D'
     C                     MOVE 'END '  @SKJ,A
     C                     END
     C                     MOVE X6BOZN    @ZNM,A
     C                     Z-ADDX6BOZI    @ZIK,A
     C                     Z-ADDX6SIRE    @SIR,A
     C                     SETOF                     30
     C           X6SIRE    CHAINFGBPL011             30
     C  N30                MOVELB2SMEI    @SNM,A
     C                     MOVE #KEY2     @KEY,A
     C                     END
     C                     ENDSR
     C/SPACE 1
     C*****************************************************
     C* MO-NO12  SUBRUTN   ROLL-UP
     C*****************************************************
     C           #RLUP     BEGSR
     C           @KEY,5    CABEQ*BLANK    $RLUP          99
     C           @KUBN     IFEQ 'A'
     C                     MOVEL@KEY,5    #KEY1
     C                     ELSE
     C                     MOVEL@KEY,5    #KEY2
     C                     END
     C                     Z-ADD0         A
     C           @KUBN     IFEQ 'A'
     C           KEYA      SETGTGK#PL131
     C                     ELSE
     C           KEYB      SETGTGK#PL221
     C                     END
     C                     DO   *HIVAL
     C           @KUBN     IFEQ 'A'
     C           KEY1      READEGK#PL131                 99
     C   99                GOTO $RLUP
     C                     ELSE
     C           KEY1      READEGK#PL221                 99
     C   99                GOTO $RLUP
     C                     END
     C                     ADD  1         A
     C           A         IFEQ 1
     C                     EXSR #CLR2
     C                     END
     C                     EXSR #SUB1
     C           A         CABGE5         $RLUP
     C           @001      TAG
     C                     END
     C           $RLUP     ENDSR
     C/SPACE 1
     C*****************************************************
     C* MO-NO13  SUBRUTN   ROLL-DOWN
     C*****************************************************
     C           #RLDN     BEGSR
     C           @KEY,1    CABEQ*BLANK    $RLDN          99
     C                     Z-ADD6         A
     C           @KUBN     IFEQ 'A'
     C                     MOVE @KEY,1    #KEY1
     C                     ELSE
     C                     MOVE @KEY,1    #KEY2
     C                     END
     C           @KUBN     IFEQ 'A'
     C           KEYA      SETLLGK#PL131
     C                     ELSE
     C           KEYB      SETLLGK#PL221
     C                     END
     C                     DO   *HIVAL
     C           @KUBN     IFEQ 'A'
     C                     READPGK#PL131                 99
     C   99                GOTO $RLDN
     C           X4NUYY    CABNE@YY       @002       9999
     C           X4NUMM    CABNE@MM       @002       9999
     C           X4UKER    CABNE@UKER     @002       9999
     C                     ELSE
     C                     READPGK#PL221                 99
     C   99                GOTO $RLDN
     C           X6NUYY    CABNE@YY       @002       9999
     C           X6NUMM    CABNE@MM       @002       9999
     C           X6UKER    CABNE@UKER     @002       9999
     C                     END
     C                     SUB  1         A
     C           A         IFEQ 5
     C                     EXSR #CLR2
     C                     END
     C                     EXSR #SUB1
     C           A         CABLE1         $RLDN
     C           @002      TAG
     C                     END
     C           $RLDN     ENDSR
**  TBL1/TBL2 (RECEIVING /NAME)
0111 IAF
8907 SUPPLIER
**  TBL3/TBL4 (RESULT INSTRUCTION /NAME)
A COMPLT MAT
B MATERIAL
**  TBL5/TBL6 (UPDATE /NAME)
00 -CANCEL
11 -CHANGE
MM -DETAILS
**  TBL7/TBL8 (SHIPPING ORDER INSTRUCTION /NAME)
01 IN_C W_DRAW
02 OUT W_DRAW
03 CPLT M_PCHAS
04 TOYOTA MAT
**  TBL9/TBLA ( STEEL SEED INSTRUCTION /NAME)
1 N STEEL
2 C STEEL
3 A STEEL
4 ETC.
**  ER (ERROR-MESSAGE)
E-01 DO NOT USE IT LONG TIME SIGN OFF IT
E-02 INPUT INCOMING DATE(YEAR)
E-03 INCOMING DATE (YEAR) IS WRONG
E-04 INPUT INCOMING DATE (MONTH)
E-05 INCOMING DATE (MONTH) IS WRONG
E-06 INPUT RECEIVING FACTORY
E-07 RECEIVING FACTORY IS WRONG
E-08 INPUT MATERIAL INSTRUCTION
E-09 MATERIAL INSTRUCTION IS WRONG
E-10 THERE IS NOT INCOMING ACCUMULATION DATA
E-11 THERE IS NOT NEXT DATA
E-12 THERE IS NOT THE DATA WHICH GOES AHEAD OF
E-13 UPDATE INSTRUCTION IS WRONG
E-14 BECAUSE IT IS CANCELLED ALREADY CANNOT INQUIRE & UPDATE
E-15 INPUT WEIGHT
