     H            Y.
     F*** GKBR29 **************************
     F* MATERIAL ACTUAL USED INQUIRY
     F* H.ITO 88.11.10                    *
     F*
     F* TCHK1 10/19/06 CHG SCREEN
     F************************** GKBR29 ***
     FGKBPW29 CF  E                    WORKSTN
     FGKBNP21 IF  E           K        DISK
     E                    @NO        12  4 0             SEQ-NO
     E                    @HIN       12 14               ﾍ]ﾌﾞ]
     E                    @SIK       12  2               ﾆgｬcﾃｰnﾞ
     E                    @JRY       12  7 0             ﾆﾞｬcﾒｭc
     E                    @SRY       12  9 0             ﾇcﾒｭc
     E                    @KTN       12  7 2             ﾅﾞbj]ﾆﾞｬc
     E                    @KEY       12 45               KEYﾈｮn
     E                    ER      1  10 60               d[ｰxｮﾈｰﾆﾞ
     I            DS
     I                                        1  480@NO
     I                                        1   40@NO1
     I                                        5   80@NO2
     I                                        9  120@NO3
     I                                       13  160@NO4
     I                                       17  200@NO5
     I                                       21  240@NO6
     I                                       25  280@NO7
     I                                       29  320@NO8
     I                                       33  360@NO9
     I                                       37  400@NOA
     I                                       41  440@NOB
     I                                       45  480@NOC
     I            DS
     I                                        1 168 @HIN
     I                                        1  14 @HIN1
     I                                       15  28 @HIN2
     I                                       29  42 @HIN3
     I                                       43  56 @HIN4
     I                                       57  70 @HIN5
     I                                       71  84 @HIN6
     I                                       85  98 @HIN7
     I                                       99 112 @HIN8
     I                                      113 126 @HIN9
     I                                      127 140 @HINA
     I                                      141 154 @HINB
     I                                      155 168 @HINC
     I            DS
     I                                        1  24 @SIK
     I                                        1   2 @SIK1
     I                                        3   4 @SIK2
     I                                        5   6 @SIK3
     I                                        7   8 @SIK4
     I                                        9  10 @SIK5
     I                                       11  12 @SIK6
     I                                       13  14 @SIK7
     I                                       15  16 @SIK8
     I                                       17  18 @SIK9
     I                                       19  20 @SIKA
     I                                       21  22 @SIKB
     I                                       23  24 @SIKC
     I            DS
     I                                        1  840@JRY
     I                                        1   70@JRY1
     I                                        8  140@JRY2
     I                                       15  210@JRY3
     I                                       22  280@JRY4
     I                                       29  350@JRY5
     I                                       36  420@JRY6
     I                                       43  490@JRY7
     I                                       50  560@JRY8
     I                                       57  630@JRY9
     I                                       64  700@JRYA
     I                                       71  770@JRYB
     I                                       78  840@JRYC
     I            DS
     I                                        1 1080@SRY
     I                                        1   90@SRY1
     I                                       10  180@SRY2
     I                                       19  270@SRY3
     I                                       28  360@SRY4
     I                                       37  450@SRY5
     I                                       46  540@SRY6
     I                                       55  630@SRY7
     I                                       64  720@SRY8
     I                                       73  810@SRY9
     I                                       82  900@SRYA
     I                                       91  990@SRYB
     I                                      100 1080@SRYC
     I            DS
     I                                        1  842@KTN
     I                                        1   72@KTN1
     I                                        8  142@KTN2
     I                                       15  212@KTN3
     I                                       22  282@KTN4
     I                                       29  352@KTN5
     I                                       36  422@KTN6
     I                                       43  492@KTN7
     I                                       50  562@KTN8
     I                                       57  632@KTN9
     I                                       64  702@KTNA
     I                                       71  772@KTNB
     I                                       78  842@KTNC
     I            DS
     I                                        1  45 #KEY
     I                                        1   3 W1ZAIC
     I                                        4   82W1ZAIK
     I                                        9  20 W1HIN
     I                                        9  13 W1HIN1
     I                                       14  18 W1HIN2
     I                                       19  20 W1HIN3
     I                                       21  22 W1SKYU
     I                                       23  290W1JRYO
     I                                       30  380W1SRYO
     I                                       39  452W1STAN
     I            DS
     I                                        1  14 WHIN
     I                                        1   5 WHIN1
     I                                        6   6 A1
     I                                        7  11 WHIN2
     I                                       12  12 A2
     I                                       13  14 WHIN3
     I            DS
     I                                        1   60W1DTHZ
     I                                        1   40W1DTYY
     I                                        5   60W1DTMM
     C/SPACE 1
     C*****************************************************
     C* MO-NO1   ﾆｭgﾆｭﾒ
     C*****************************************************
     C           @ENTRY    PLIST
     C                     PARM           PERR    1        d[ｰ
     C                     EXSR #CLR1
     C/SPACE 1
     C*****************************************************
     C* MO-NO2   fﾞx]-1
     C*****************************************************
     C           @SCR1     TAG
     C                     EXFMTGKBPW291
     C                     MOVEA'00'      *IN,02
     C                     MOVEA'00'      *IN,10
     C                     MOVEA'0'       *IN,99
     C   KA                SETON                     LR
     C   KA                RETRN
     C*
     C* HELP ﾅﾞbﾒｭcﾃｰnﾞ ﾆｭcfb
     C*
TCHK1C*          *IN80     IFEQ '1'
TCHK1C           *INKK     IFEQ '1'
     C                     CALL 'GKBR30'  @ENTRY
     C           PERR      IFEQ '*'
     C                     SETON                     99
     C                     MOVELER,03     MSG
     C                     GOTO @SCR1
     C                     END
     C                     GOTO @SCR1
     C                     END
     C*
     C           @ZAIC     IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVELER,01     MSG
     C                     GOTO @SCR1
     C                     END
     C*
     C           @ZAIK     IFEQ 0
     C                     SETON                     0399
     C                     MOVELER,02     MSG
     C                     GOTO @SCR1
     C                     END
     C/SPACE 1
     C*****************************************************
     C* MO-NO3   mﾞｰj ﾈﾛhn
     C*****************************************************
     C           KEY       KLIST
     C                     KFLD           @ZAIC
     C                     KFLD           @ZAIK
     C                     EXSR #CLR2
     C                     Z-ADD0         A       50
     C           KEY       SETLLGKBNP211
     C                     DO   *HIVAL
     C                     SETOF                     30
     C           KEY       READEGKBNP211                 30
     C   30                GOTO STP1
     C                     ADD  1         A
     C           A         CABGT12        STP1
     C                     Z-ADDA         @NO,A
     C                     EXSR #SUB1
     C           STP1      TAG
     C  N30                END
     C                     XFOOT@JRY      #JRYO
     C                     XFOOT@SRY      #SRYO
     C           @NO,12    COMP 0                        70
     C*
     C           A         IFEQ 0
     C                     SETON                     99
     C                     MOVELER,03     MSG
     C                     GOTO @SCR1
     C                     END
     C/SPACE 1
     C*****************************************************
     C* MO-NO4   fﾞx]-2
     C*****************************************************
     C           @SCR2     TAG
     C                     EXFMTGKBPW292
     C                     MOVEA'0'       *IN,70
     C                     MOVEA'0'       *IN,99
     C   KA                SETON                     LR
     C   KA                RETRN
     C   KC                EXSR #CLR1
     C   KC                GOTO @SCR1
     C* ROLL-UP
     C           *IN,81    IFEQ '1'
     C                     EXSR #RLUP
     C           *IN,99    IFEQ '1'
     C  N11      #JRYO     ADD  WJRY      #JRYO
     C  N11      #SRYO     ADD  WSRY      #SRYO
     C  N11                SETON                     11
     C                     MOVE '1'       *IN70
     C                     MOVE *ALL'-'   @LIN
     C                     MOVELER,04     MSG
     C                     END
     C                     GOTO @SCR2
     C                     END
     C* ROLL-DOWN
     C           *IN,82    IFEQ '1'
     C                     EXSR #RLDN
     C           *IN,99    IFEQ '1'
     C                     MOVELER,05     MSG
     C                     END
     C                     GOTO @SCR2
     C                     END
     C           @NO,12    COMP 0                        70
     C                     GOTO @SCR2
     C/SPACE 1
     C*****************************************************
     C* MO-NO5   SUBRUTN   fﾞx]-1 ﾉ hﾒaｰ
     C*****************************************************
     C           #CLR1     BEGSR
     C                     MOVE *BLANK    @ZAIC
     C                     Z-ADD0         @ZAIK
     C                     Z-ADD0         #JRYO
     C                     Z-ADD0         #SRYO
     C                     Z-ADD0         WJRY    80
     C                     Z-ADD0         WSRY   100
     C                     ENDSR
     C/SPACE 1
     C*****************************************************
     C* MO-NO6   SUBRUTN   ﾌbﾛl ﾉ hﾒaｰ
     C*****************************************************
     C           #CLR2     BEGSR
     C                     Z-ADD0         @NO
     C                     MOVE *BLANK    @HIN
     C                     MOVE *BLANK    @SIK
     C                     Z-ADD0         @JRY
     C                     Z-ADD0         @SRY
     C                     Z-ADD0         @KTN
     C                     MOVE *BLANK    @KEY
     C                     ENDSR
     C/SPACE 1
     C*****************************************************
     C* MO-NO7   SUBRUTN   mﾞｰj ﾉ ﾈｮn
     C*****************************************************
     C           #SUB1     BEGSR
     C  N10                MOVELW1ZANM    @ZANM
     C  N10                SETON                     10
     C                     MOVE W1HIN1    WHIN1
     C                     MOVE '-'       A1
     C                     MOVE W1HIN2    WHIN2
     C                     MOVE '-'       A2
     C                     MOVE W1HIN3    WHIN3
     C                     MOVE WHIN      @HIN,A
     C                     MOVE W1SKYU    @SIK,A
     C                     Z-ADDW1JRYO    @JRY,A
     C                     Z-ADDW1SRYO    @SRY,A
     C                     Z-ADDW1STAN    @KTN,A
     C                     MOVE #KEY      @KEY,A
     C                     ENDSR
     C/SPACE 1
     C*****************************************************
     C* MO-NO8   SUBRUTN   ROLL-UP
     C*****************************************************
     C           #RLUP     BEGSR
     C           @KEY,12   CABEQ*BLANK    $RLUP          99
     C                     Z-ADD@NO,12    XXNO    50
     C                     MOVEL@KEY,12   #KEY
     C                     Z-ADD0         A
     C           SETKEY    KLIST
     C                     KFLD           W1ZAIC
     C                     KFLD           W1ZAIK
     C                     KFLD           W1HIN1
     C                     KFLD           W1HIN2
     C                     KFLD           W1HIN3
     C                     KFLD           W1SKYU
     C                     KFLD           W1JRYO
     C                     KFLD           W1SRYO
     C                     KFLD           W1STAN
     C           SETKEY    SETGTGKBNP211
     C                     DO   *HIVAL
     C           KEY       READEGKBNP211                 99
     C   99                GOTO $RLUP
     C                     ADD  1         A
     C           A         IFEQ 1
     C                     EXSR #CLR2
     C                     END
     C           XXNO      ADD  A         @NO,A
     C                     EXSR #SUB1
     C                     ADD  @JRY,A    WJRY
     C                     ADD  @SRY,A    WSRY
     C           A         CABGE12        $RLUP
     C                     END
     C           $RLUP     ENDSR
     C/SPACE 1
     C*****************************************************
     C* MO-NO9   SUBRUTN   ROLL-DOWN
     C*****************************************************
     C           #RLDN     BEGSR
     C           @KEY,1    CABEQ*BLANK    $RLDN          99
     C                     Z-ADD13        A
     C                     Z-ADD@NO,1     XXNO
     C                     MOVE @KEY,1    #KEY
     C           SETKEY    SETLLGKBNP211
     C                     DO   *HIVAL
     C                     READPGKBNP211                 99
     C   99                GOTO $RLDN
     C           W1ZAIC    CABNE@ZAIC     $RLDN      9999
     C           W1ZAIK    CABNE@ZAIK     $RLDN      9999
     C                     SUB  1         A
     C           A         IFEQ 12
     C                     EXSR #CLR2
     C                     END
     C           XXNO      SUB  1         @NO,A
     C                     Z-ADD@NO,A     XXNO
     C                     EXSR #SUB1
     C           WJRY      SUB  @JRY,A    WJRY
     C           WSRY      SUB  @SRY,A    WSRY
     C           A         CABLE1         $RLDN
     C                     END
     C           $RLDN     ENDSR
**  ER (ERROR-MESSAGE)
E-01 INPUT MATERIAL CODE
E-02 INPUT COMPLETION WIRE DIAMETER
E-03 THERE IS NOT INQUIRY DATA
E-04 THERE IS NOT NEXT DATA
E-05 THERE IS NOT THE DATA WHICH GOES AHEAD OF
