     H            Y.
     F** GKBR15 **************************
     F* MATERIAL PLAN M/F UPDATE
     F* A-IDOTA 1988.09.02 *
     F************************** GKBR15 **
     FGKBPW15 CF  E                    WORKSTN
     FGKBPL11 UF  E           K        DISK                      A
     FGKBPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     E                    NO          7  3 0             ﾃcﾆ] mﾞｰjNO
     E                    HIZ         7  6 0             Nfﾞlﾍﾇﾞi
     E                    UKE         7  4               cibﾛ ﾃcﾆﾞｭc
     E                    SIR         7  4               ﾆbﾛﾅg
     E                    ZIS         7 15               f]ﾈbﾅﾞbﾆl
     E                    ZIK         7  5 2             f]ﾈbﾅﾞbib
     E                    ER      1  13 60               d[ｰ xｮﾈｰﾆﾞ
     I* 日付 *
     I            DS
     I                                        1   60NHIZ
     I                                        1   40NY
     I                                        5   60NM
     I            DS
     I                                        1   60NUYM
     I                                        1   40X5NUYY
     I                                        5   60X5NUMM
     I* 時間 *
     I            DS
     I                                        1   60WTIME
     I                                        1   20HH
     I                                        3   40SS
     I* № *
     I            DS
     I                                        1  210NO
     I                                        1   30NO1
     I                                        4   60NO2
     I                                        7   90NO3
     I                                       10  120NO4
     I                                       13  150NO5
     I                                       16  180NO6
     I                                       19  210NO7
     I* Ｎ月日付 *
     I            DS
     I                                        1  420HIZ
     I                                        1   60HIZ1
     I                                        7  120HIZ2
     I                                       13  180HIZ3
     I                                       19  240HIZ4
     I                                       25  300HIZ5
     I                                       31  360HIZ6
     I                                       37  420HIZ7
     I* 受入工場 *
     I            DS
     I                                        1  28 UKE
     I                                        1   4 UKE1
     I                                        5   8 UKE2
     I                                        9  12 UKE3
     I                                       13  16 UKE4
     I                                       17  20 UKE5
     I                                       21  24 UKE6
     I                                       25  28 UKE7
     I* 仕入先 *
     I            DS
     I                                        1  28 SIR
     I                                        1   4 SIR1
     I                                        5   8 SIR2
     I                                        9  12 SIR3
     I                                       13  16 SIR4
     I                                       17  20 SIR5
     I                                       21  24 SIR6
     I                                       25  28 SIR7
     I* 完成材質 *
     I            DS
     I                                        1 105 ZIS
     I                                        1  15 ZIS1
     I                                       16  30 ZIS2
     I                                       31  45 ZIS3
     I                                       46  60 ZIS4
     I                                       61  75 ZIS5
     I                                       76  90 ZIS6
     I                                       91 105 ZIS7
     I* 完成材径 *
     I            DS
     I                                        1  352ZIK
     I                                        1   52ZIK1
     I                                        6  102ZIK2
     I                                       11  152ZIK3
     I                                       16  202ZIK4
     I                                       21  252ZIK5
     I                                       26  302ZIK6
     I                                       31  352ZIK7
     C************
     C* 画面１ *
     C************
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C/SPACE 1
     C           KEY1      KLIST
     C                     KFLD           NY
     C                     KFLD           NM
     C                     KFLD           KUKE
     C           KEY2      KLIST
     C                     KFLD           NY
     C                     KFLD           NM
     C                     KFLD           KUKE
     C                     KFLD           KSIR
     C           KEY3      KLIST
     C                     KFLD           NY
     C                     KFLD           NM
     C                     KFLD           KUKE
     C                     KFLD           KSIR
     C                     KFLD           NZIS
     C           KEY4      KLIST
     C                     KFLD           NY
     C                     KFLD           NM
     C                     KFLD           KUKE
     C                     KFLD           KSIR
     C                     KFLD           NZIS
     C                     KFLD           NZIK
     C           KEY5      KLIST
     C                     KFLD           NZIS
     C                     KFLD           NZIK
     C                     KFLD           KUKE
     C                     KFLD           KSIR
     C           KEY6      KLIST
     C                     KFLD           NY
     C                     KFLD           NM
     C/SPACE 1
     C                     Z-ADD0         OHIZ
     C                     MOVE *BLANK    OUKE
     C                     MOVE *BLANK    OSIR
     C                     MOVE *BLANK    OZIS
     C                     MOVE *BLANK    OZIK
     C/SPACE 1
     C           LOP10     TAG
     C                     MOVEA'00000'   *IN,01
     C                     Z-ADD0         NHIZ
     C                     MOVE *BLANK    NUKE
     C                     MOVE *BLANK    NSIR
     C                     MOVE *BLANK    NZIS
     C                     MOVE *BLANK    NZIK
     C/SPACE 1
     C           LOP11     TAG
     C                     EXFMTGKBPW151
     C                     MOVE *BLANK    WU      1
     C                     MOVEA'00000'   *IN,01
     C                     SETOF                     99
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C* Nfﾞlﾍﾇﾞi kｩｮh *
     C                     MOVE *BLANK    KYS     1
     C           NHIZ      IFEQ 0
     C                     SETON                     9901
     C                     MOVE ER,1      MSG
     C                     GOTO LOP11
     C                     END
     C           NY        IFLT 1987
     C                     SETON                     9901
     C                     MOVE ER,2      MSG
     C                     GOTO LOP11
     C                     END
     C           NM        IFLT 01
     C           NM        ORGT 12
     C                     SETON                     9901
     C                     MOVE ER,3      MSG
     C                     GOTO LOP11
     C                     END
     C* cibﾛﾃcﾆﾞｭc kｩｮh *
     C           NUKE      IFEQ *BLANK
     C                     SETON                     9902
     C                     MOVE ER,4      MSG
     C                     GOTO LOP11
     C                     END
     C                     MOVE NUKE      KUKE    40
     C                     SETOF                     20
     C           KUKE      CHAINFGBPL011             20
     C           *IN,20    IFEQ '1'
     C                     SETON                     9902
     C                     MOVE ER,5      MSG
     C                     GOTO LOP11
     C                     END
     C                     MOVE '1'       KYS
     C* ﾆbﾛﾅg kｩｮh *
     C                     SETOF                     21
     C           NSIR      IFEQ *BLANK
     C                     SETON                     21
     C                     ELSE
     C                     MOVE NSIR      KSIR    40
     C                     SETOF                     20
     C           KSIR      CHAINFGBPL011             20
     C           *IN,20    IFEQ '1'
     C                     SETON                     9903
     C                     MOVE ER,6      MSG
     C                     GOTO LOP11
     C                     END
     C                     MOVE '2'       KYS
     C                     END
     C* f]ﾈbﾅﾞbﾆl kｩｮh *
     C           NZIS      IFEQ *BLANK
     C                     SETON                     21
     C                     ELSE
     C           *IN,21    IFEQ '1'
     C                     SETON                     9904
     C                     MOVE ER,7      MSG
     C                     GOTO LOP11
     C                     END
     C                     MOVE '3'       KYS
     C                     END
     C* f]ﾈbﾅﾞbib kｩｮh *
     C           NZIK      IFNE 0
     C           *IN,21    IFEQ '1'
     C                     SETON                     9905
     C                     MOVE ER,7      MSG
     C                     GOTO LOP11
     C                     END
     C                     MOVE '4'       KYS
     C                     END
     C* ﾅﾞbﾒｭc3fiﾞl ibfhﾎｦbﾓ kｩｮh *
     C                     SETOF                     20
     C           KYS       IFEQ '1'
     C           KEY1      CHAINGKBPL111             20
     C                     ELSE
     C           KYS       IFEQ '2'
     C           KEY2      CHAINGKBPL111             20
     C                     ELSE
     C           KYS       IFEQ '3'
     C           KEY3      CHAINGKBPL111             20
     C                     ELSE
     C           KYS       IFEQ '4'
     C           KEY4      CHAINGKBPL111             20
     C                     END
     C                     END
     C                     END
     C                     END
     C           *IN,20    IFEQ '1'
     C           KYS       IFNE '4'
     C                     SETON                     99
     C                     MOVE ER,8      MSG
     C                     GOTO LOP11
     C                     END
     C                     END
     C                     MOVE 'U'       WU
     C* ﾅﾞbﾒｭcmﾌb kｩｮhuﾇjｰ kｩｮh *
     C                     SETOF                     21
     C           *IN,20    IFEQ '1'
     C           KYS       IFEQ '4'
     C           KEY5      CHAINGKBPL011             21
     C           *IN,21    IFEQ '1'
     C           X3SKJY    OREQ 'D'
     C           X3SKHZ    ANDLE*DATE
     C                     SETON                     99
     C                     MOVE ER,8      MSG
     C                     GOTO LOP11
     C                     ELSE
     C                     SETOF                     22
     C           KEY6      CHAINGKBPL111             22
     C           *IN22     IFEQ '1'
     C                     SETON                     99
     C                     MOVELER,13     MSG
     C                     GOTO LOP11
     C                     END
     C                     MOVE 'W'       WU
     C                     Z-ADDNHIZ      NHIZK
     C                     GOTO LOP30
     C                     END
     C                     END
     C                     END
     C* fﾞx]2 ﾉ ﾆｭgﾈｮmb *
     C                     EXSR CLSUB
     C                     MOVE *BLANK    EPAG    1
     C                     Z-ADD1         PAG     30
     C/SPACE 1
     C                     MOVEA'0000000' *IN,31
     C                     EXSR STSUB
     C/SPACE 1
     C                     Z-ADD1         A       10
     C                     SETOF                     20
     C           1         DO   7         A
     C/SPACE 1
     C                     EXSR RDSUB
     C/SPACE 1
     C           *IN,20    IFEQ '0'
     C                     Z-ADDNUYM      HIZ,A
     C                     MOVE X5KAUK    UKE,A
     C                     MOVE X5KASI    SIR,A
     C                     MOVE X5KAZN    ZIS,A
     C                     Z-ADDX5KAZI    ZIK,A
     C                     Z-ADDA         NO,A
     C                     END
     C  N20                END
     C/SPACE 1
     C           8         IFGT A
     C                     MOVE '1'       EPAG
     C                     END
     C************
     C* 画面２ *
     C************
     C           LOP20     TAG
     C                     SETOF                     995055
     C                     SETOF                     KC01
     C/SPACE 1
     C           LOP21     TAG
     C                     SETOF                     5055
     C                     EXFMTGKBPW152
     C                     SETOF                     9901
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C           *INKC     IFEQ '1'
     C                     GOTO LOP10
     C                     END
     C* ROLL-DOWN *
     C           *IN,50    IFEQ '1'
     C           PAG       IFEQ 1
     C                     SETON                     99
     C                     MOVE ER,11     MSG
     C                     GOTO LOP21
     C                     END
     C/SPACE 1
     C                     SETOF                     20
     C                     Z-ADD1         A
     C                     Z-ADD0         B       40
     C                     Z-ADD0         C       40
     C           PAG       SUB  2         B
     C                     MULT 7         B
     C                     Z-ADD0         E       30
     C           NO,1      SUB  7         E
     C                     MOVEA'0000000' *IN,31
     C                     EXSR CLSUB
     C                     EXSR STSUB
     C           LOP22     TAG
     C/SPACE 1
     C                     EXSR RDSUB
     C/SPACE 1
     C                     ADD  1         C
     C           B         IFGE C
     C                     GOTO LOP22
     C                     END
     C           A         IFLT 8
     C                     Z-ADDNUYM      HIZ,A
     C                     MOVE X5KAUK    UKE,A
     C                     MOVE X5KASI    SIR,A
     C                     MOVE X5KAZN    ZIS,A
     C                     Z-ADDX5KAZI    ZIK,A
     C                     Z-ADDE         NO,A
     C                     ADD  1         A
     C                     ADD  1         E
     C                     GOTO LOP22
     C                     END
     C                     MOVE *BLANK    EPAG
     C                     SUB  1         PAG
     C                     GOTO LOP21
     C                     END
     C* ROLL-UP *
     C           *IN,55    IFEQ '1'
     C           INPT      OREQ 0
     C           EPAG      IFEQ '1'
     C                     SETON                     99
     C                     MOVE ER,12     MSG
     C                     GOTO LOP21
     C                     END
     C/SPACE 1
     C                     Z-ADD1         A
     C                     Z-ADD0         B
     C                     Z-ADD0         C
     C                     Z-ADD0         E
     C                     Z-ADDNO,7      E
     C           PAG       MULT 7         B
     C                     SETOF                     20
     C                     MOVEA'0000000' *IN,31
     C                     EXSR STSUB
     C           LOP23     TAG
     C/SPACE 1
     C                     EXSR RDSUB
     C/SPACE 1
     C           *IN,20    IFEQ '0'
     C                     ADD  1         C
     C           B         IFGE C
     C                     GOTO LOP23
     C                     END
     C           A         IFEQ 1
     C                     EXSR CLSUB
     C                     END
     C           A         IFLT 8
     C                     Z-ADDNUYM      HIZ,A
     C                     MOVE X5KAUK    UKE,A
     C                     MOVE X5KASI    SIR,A
     C                     MOVE X5KAZN    ZIS,A
     C                     Z-ADDX5KAZI    ZIK,A
     C                     ADD  1         E
     C                     Z-ADDE         NO,A
     C                     ADD  1         A
     C                     GOTO LOP23
     C                     END
     C                     ELSE
     C           A         IFEQ 1
     C                     MOVE '1'       EPAG
     C                     SETON                     99
     C                     MOVE ER,12     MSG
     C                     GOTO LOP21
     C                     END
     C                     END
     C/SPACE 1
     C           8         IFGT A
     C                     MOVE '1'       EPAG
     C                     END
     C                     ADD  1         PAG
     C                     GOTO LOP21
     C                     END
     C* mﾞｰj ﾈ]jh hﾎﾞ] ﾉ kｩｮh *
     C                     SETOF                     20
     C                     Z-ADD1         A
     C           INPT      LOKUPNO,A                     20
     C           *IN,20    IFEQ '0'
     C                     SETON                     9901
     C                     MOVE ER,9      MSG
     C                     GOTO LOP21
     C                     END
     C************
     C* 画面３ *
     C************
     C* fﾞx]3 ﾉ ﾆｭgﾈｮmb *
     C           LOP30     TAG
     C           WU        IFEQ 'W'
     C                     SETOF                     20
     C           KEY5      CHAINGKBPL011             20
     C           *IN,20    IFEQ '0'
     C                     Z-ADDNY        X5NUYY
     C                     Z-ADDNM        X5NUMM
     C                     Z-ADDX3KAUK    X5KAUK
     C                     Z-ADDX3KASI    X5KASI
     C                     MOVE X3KAZN    X5KAZN
     C                     Z-ADDX3KAZI    X5KAZI
     C                     Z-ADDX3BOUK    X5BOUK
     C                     Z-ADDX3BOSI    X5BOSI
     C                     MOVE X3BOZN    X5BOZN
     C                     Z-ADDX3BOZI    X5BOZI
     C                     Z-ADD0         X5KONU
     C                     Z-ADDX3TEHI    X5TEHI
     C                     MOVE X3KUBN    X5KUBN
     C                     Z-ADD0         X5JRO1
     C                     Z-ADD0         X5JRA2
     C                     Z-ADD0         X5JRB2
     C                     Z-ADD0         X5JRC2
     C                     END
     C/SPACE 1
     C                     ELSE
     C                     Z-ADD0         E
     C                     Z-ADDNO,A      E
     C                     EXSR STSUB
     C           1         DO   E
     C                     EXSR RDSUB
     C                     END
     C                     Z-ADDNUYM      NHIZK
     C                     Z-ADDX5JRB1    Z5JRB1
     C                     Z-ADDX5JRC1    Z5JRC1
     C                     END
     C                     SETOF                     KCKE99
     C* fﾞx]3 ﾉ ﾍｭcﾆﾞ *
     C           LOP31     TAG
     C                     EXFMTGKBPW153
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C           *INKC     IFEQ '1'
     C           WU        IFEQ 'W'
     C                     GOTO LOP10
     C                     ELSE
     C                     Z-ADD0         INPT
     C                     GOTO LOP20
     C                     END
     C                     END
     C* ﾎｦbﾓ ﾉ ﾃcﾆ] *
     C           *INKE     IFEQ '1'
     C                     MOVE US        X5KOME
     C                     Z-ADD*YEAR     X5KOYY
     C                     Z-ADDUMONTH    X5KOMM
     C                     Z-ADDUDAY      X5KODD
     C                     TIME           WTIME
     C                     Z-ADDHH        X5KOHH
     C                     Z-ADDSS        X5KOSS
     C                     MOVEL'*'       X5AKI1
     C           WU        IFEQ 'W'
     C                     WRITEGKBPL111
     C                     ELSE
     C                     UPDATGKBPL111
     C                     END
     C/SPACE 1
     C                     Z-ADD0         OHIZ
     C                     MOVE *BLANK    OUKE
     C                     MOVE *BLANK    OSIR
     C                     MOVE *BLANK    OZIS
     C                     MOVE *BLANK    OZIK
     C                     Z-ADDNHIZ      OHIZ
     C                     MOVE NUKE      OUKE
     C                     MOVE NSIR      OSIR
     C                     MOVE NZIS      OZIS
     C                     MOVE NZIK      OZIK
     C                     Z-ADD0         INPT
     C/SPACE 1
     C           WU        IFEQ 'W'
     C                     GOTO LOP10
     C                     ELSE
     C           A         ADD  30        C1      20
     C                     MOVE '1'       *IN,C1
     C                     GOTO LOP20
     C                     END
     C                     END
     C/SPACE 1
     C                     GOTO LOP31
     C************
     C* ＳＵＢ *
     C************
     C           STSUB     BEGSR
     C           KYS       IFEQ '1'
     C           KEY1      SETLLGKBPL111
     C                     ELSE
     C           KYS       IFEQ '2'
     C           KEY2      SETLLGKBPL111
     C                     ELSE
     C           KYS       IFEQ '3'
     C           KEY3      SETLLGKBPL111
     C                     ELSE
     C           KYS       IFEQ '4'
     C           KEY4      SETLLGKBPL111
     C                     END
     C                     END
     C                     END
     C                     END
     C                     ENDSR
     C/SPACE 2
     C           RDSUB     BEGSR
     C           KYS       IFEQ '1'
     C           KEY1      READEGKBPL111                 20
     C                     ELSE
     C           KYS       IFEQ '2'
     C           KEY2      READEGKBPL111                 20
     C                     ELSE
     C           KYS       IFEQ '3'
     C           KEY3      READEGKBPL111                 20
     C                     ELSE
     C           KYS       IFEQ '4'
     C           KEY4      READEGKBPL111                 20
     C                     END
     C                     END
     C                     END
     C                     END
     C                     ENDSR
     C/SPACE 2
     C           CLSUB     BEGSR
     C                     Z-ADD0         NO
     C                     Z-ADD0         HIZ
     C                     MOVE *BLANK    UKE
     C                     MOVE *BLANK    SIR
     C                     MOVE *BLANK    ZIS
     C                     Z-ADD0         ZIK
     C                     Z-ADD0         INPT
     C                     ENDSR
** ERR / MSG
E-01 INPUT N DATE.
E-02 N DATE(YEAR) IS NOT RIGHT.
E-03 N DATE (MONTH) IS NOT RIGHT.
E-04 INPUT RECEIVING FACTORY .
E-05 THIS FACTORY CODE DOES NOT EXIST.
E-06 THIS SUPPLIER CODE DOES NOT EXIST.
E-07 INPUT ITEM BEFORE .
E-08 WITH THIS CONDITION UPDATE OF M/F IS IMPOSSIBLE.
E-09 THE NO INPUT IS NOT RIGHT
E-10 SELECT DATA.
E-11 CAN NOT GO BACK ANY MORE
E-12 ALL OF DATA ARE DISPLAYED
E-13 IT IS NOT POSSIBLE TO INPUT DATA GOES AHEAD.
