     H            Y.
     F** GKBR34 **********************************
     F* MATERIAL PRODUCTION ORDER CHECK M/F INQUIRY *
     F* PROGRAM ID. : GKBR34. <RPG> *
     F* CREATE DATE. : MAR.04,'88.               *
     F* AUTHOR.         : E.KAWASHIMA <G.B.C> *
     F********************************** GKBR34 **
     FGKBPW34 CF  E                    WORKSTN
     FGKBPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     E                    MSG     1   4 60               d[ｰxｮﾈｰﾆﾞ
     E                    NAM     1   8 10               ﾃcﾆﾞｭc xb
     E                    TAB1    1   4  2 0 TAB2   12   mﾌb hﾎﾞ]
     E                    TAB3    1   4  1   TAB4    8   ﾃcﾆｬ hﾎﾞ]
     I            DS
     I                                        1   80X3SKHZ
     I                                        1   40X3SKYY
     I                                        5   60X3SKMM
     I                                        7   80X3SKDD
     C******************************************************
     C*  START  PROGRAM <GKBR34>                           *
     C******************************************************
     C           STP0      TAG
     C                     MOVE *BLANK    @KNZI
     C                     Z-ADD0         @ZIST
     C                     Z-ADD0         @UKE
     C******************************************************
     C*  EXFMT  <fﾞx] 1>                                   *
     C******************************************************
     C           STP1      TAG
     C                     EXFMTGKBPW341
     C                     MOVEA'000'     *IN,01
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
     C*
     C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
E001 C                     END
     C*
     C******************************************************
     C*  <fﾞx] 1 ﾉ kｩｮh>                                   *
     C******************************************************
     C*
     C*  f]ﾈb ﾅﾞbﾆl
     C*
B001 C           @KNZI     IFEQ *BLANK
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,1     ERR
     C                     GOTO STP1
E001 C                     END
     C*
     C*  ﾅﾞbib
     C*
B001 C           @ZIST     IFEQ 0
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,2     ERR
     C                     GOTO STP1
E001 C                     END
     C*
     C*  cibﾛ
     C*
B001 C           @UKE      IFEQ 0
     C                     MOVEA'1'       *IN,03
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,3     ERR
     C                     GOTO STP1
E001 C                     END
     C*
     C           KEY1      KLIST
     C                     KFLD           @KNZI
     C                     KFLD           @ZIST
     C                     KFLD           @UKE
     C*
     C                     MOVE *BLANK    UKNM
     C                     Z-ADD0         @SRE1
     C                     Z-ADD0         @SRE2
     C                     MOVE *BLANK    @SNM1
     C                     MOVE *BLANK    @SNM2
     C                     MOVE *BLANK    BZAI1
     C                     MOVE *BLANK    BZAI2
     C                     Z-ADD0         ZAI1
     C                     Z-ADD0         ZAI2
     C                     Z-ADD0         UKE1
     C                     Z-ADD0         UKE2
     C                     Z-ADD0         SRE1
     C                     Z-ADD0         SRE2
     C                     MOVE *BLANK    SNM1
     C                     MOVE *BLANK    SNM2
     C                     Z-ADD0         TKB1
     C                     Z-ADD0         TKB2
     C                     MOVE *BLANK    KS1
     C                     MOVE *BLANK    KS2
     C                     MOVE *BLANK    KSNM1
     C                     MOVE *BLANK    KSNM2
     C                     MOVE *BLANK    HIHN1
     C                     MOVE *BLANK    HIHN2
     C*
     C                     EXSR #SET
     C*
     C           ERR       IFNE *BLANK
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C*
     C******************************************************
     C*  EXFMT  (fﾞx] 2)                                   *
     C******************************************************
     C                     MOVE *BLANK    UKNM
B001 C           @UKE      IFEQ 0111
     C                     MOVELNAM,1     UKNM
X001 C                     ELSE
     C                     MOVELNAM,2     UKNM
E001 C                     END
     C*
     C           STP2      TAG
     C                     EXFMTGKBPW342
     C*
     C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
E001 C                     END
     C*
     C           *INKC     IFEQ '1'
     C                     GOTO STP0
E001 C                     END
     C*
     C                     GOTO STP2
     C*
     C******************************************************
     C           #SET      BEGSR                           *
     C******************************************************
     C*
     C                     Z-ADD0         I       50
     C                     MOVEA'1'       *IN,60
     C                     MOVEA'1'       *IN,70
     C           KEY1      SETLLGKBPL011
B001 C                     DO   *HIVAL
     C           KEY1      READEGKBPL011                 50
     C           *IN,50    IFEQ '0'
     C           X3SKJY    IFEQ 'D'
     C           X3SKHZ    ANDLE*DATE
     C                     GOTO @END
E003 C                     END
     C*
     C                     ADD  1         I
     C*
     C           I         CABEQ3         @EXIT
     C*
B003 C           I         IFEQ 1
     C                     MOVEA'0'       *IN,60
     C                     MOVEL*ALL'-'   HIHN1
     C                     Z-ADDX3KASI    @SRE1
     C           @SRE1     CHAINFGBPL011             15
     C  N15                MOVELB2SMEI    @SNM1
     C*
     C                     MOVELX3BOZN    BZAI1
     C                     Z-ADDX3BOZI    ZAI1
     C                     Z-ADDX3BOUK    UKE1
     C                     Z-ADDX3BOSI    SRE1
     C           SRE1      CHAINFGBPL011             15
     C  N15                MOVELB2SMEI    SNM1
     C*
     C                     Z-ADDX3TEHI    TKB1
     C           TKB1      LOKUPTAB1      TAB2           25
     C   25                MOVELTAB2      TNM1
     C*
     C                     MOVELX3KUBN    KS1
     C           KS1       LOKUPTAB3      TAB4           35
     C   35                MOVELTAB4      KSNM1
E003 C                     END
     C*
B003 C           I         IFEQ 2
     C                     MOVEA'0'       *IN,70
     C                     MOVEL*ALL'-'   HIHN2
     C                     Z-ADDX3KASI    @SRE2
     C           @SRE2     CHAINFGBPL011             15
     C  N15                MOVELB2SMEI    @SNM2
     C*
     C                     MOVELX3BOZN    BZAI2
     C                     Z-ADDX3BOZI    ZAI2
     C                     Z-ADDX3BOUK    UKE2
     C                     Z-ADDX3BOSI    SRE2
     C           SRE2      CHAINFGBPL011             15
     C  N15                MOVELB2SMEI    SNM2
     C*
     C                     Z-ADDX3TEHI    TKB2
     C           TKB2      LOKUPTAB1      TAB2           25
     C   25                MOVELTAB2      TNM2
     C*
     C                     MOVELX3KUBN    KS2
     C           KS2       LOKUPTAB3      TAB4           35
     C   35                MOVELTAB4      KSNM2
E003 C                     END
     C*
E002 C                     END
     C           @END      TAG
E001 C  N50                END
     C*
     C           @EXIT     TAG
     C*
B001 C           I         IFEQ 0
     C                     MOVEA'111'     *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,4     ERR
E001 C                     END
     C*
     C                     ENDSR
     C*
     C*
     C*
**  MSG (ERROR MESSAGE )
E-01 INPUT COMPLETION MATERIAL
E-02 INPUT WIRE DIAMETER
E-03 INPUT RECEIVING
E-04 THERE IS NOT APPLICABLE DATA
**  NAM
IAF
????
**  TAB1/TAB2
01 IN_C W_DRAW
02 OUT W_DRAW
03 CPLT M_PCHAS
04 TOYOTA MAT
**  TAB3/TAB4
1 N STEEL
2 C STEEL
3 A STEEL
4 ETC.
