     H            Y.
     F** GKTRB5 ********************************
     F* RECEIVE DIE ORDER DATA(FROM ASJ)       *
     F*  MAEDA.            2017.11.15          *
     F******************************************
     FGKTWPB0 IF  E                    DISK
     FGKTPPB0 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140SDATE
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C                     TIME           WTIME
     C                     READ GKTWPB0                  81
     C           *IN81     DOWEQ'0'
     C                     EXSR #SB500
     C                     READ GKTWPB0                  81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------*
      *
      *----------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARGKTPPB01
     C                     Z-ADDSDATE     GVKOHZ
     C                     Z-ADDSTIME     GVKOTI
     C                     MOVELW#USER    GVKOME
     C                     MOVELW#PGM     GVKPGM
     C                     Z-ADDSDATE     GVRCDT
     C                     Z-ADDSTIME     GVRCTM
     C                     MOVELW0JYNO    GVJYNO
     C                     MOVELW0ODKG    GVODKG
     C                     Z-ADDW0ODR1    GVODR1
     C                     Z-ADDW0ODR2    GVODR2
     C                     Z-ADDW0ODR3    GVODR3
     C                     Z-ADDW0ITEM    GVITEM
     C                     Z-ADDW0ITEE    GVITEE
     C                     MOVELW0IKT1    GVIKT1
     C                     MOVELW0IKT2    GVIKT2
     C                     MOVELW0IKT3    GVIKT3
     C                     MOVELW0IKT4    GVIKT4
     C                     Z-ADDW0JCHU    GVJCHU
     C                     MOVELW0HANY    GVHANY
     C                     MOVELW0CTNO    GVCTNO
     C                     MOVELW0INV1    GVINV1
     C                     Z-ADDW0INV2    GVINV2
     C                     Z-ADDW0CAHK    GVCAHK
     C                     Z-ADDW0CANY    GVCANY
     C                     MOVELW0CAYB    GVCAYB
     C                     Z-ADDW0CASE    GVCASE
     C                     MOVELW0CACK    GVCACK
     C                     Z-ADDW0BOXN    GVBOXN
     C                     Z-ADDW0BONY    GVBONY
     C                     MOVELW0BOKJ    GVBOKJ
     C                     MOVELW0BOUK    GVBOUK
     C                     MOVELW0BOSA    GVBOSA
     C                     Z-ADDW0BOCO    GVBOCO
     C                     MOVELW0BOCK    GVBOCK
     C                     Z-ADDW0KKNR    GVKKNR
     C                     MOVELW0KTME    GVKTME
     C                     MOVELW0SKT1    GVSKT1
     C                     MOVELW0SKT2    GVSKT2
     C                     MOVELW0SKT3    GVSKT3
     C                     MOVELW0SKT4    GVSKT4
     C                     Z-ADDW0NOKY    GVNOKY
     C                     Z-ADDW0NOKM    GVNOKM
     C                     Z-ADDW0NOKD    GVNOKD
     C                     Z-ADDW0TCHY    GVTCHY
     C                     Z-ADDW0TCHM    GVTCHM
     C                     Z-ADDW0TCHD    GVTCHD
     C                     Z-ADDW0CRDT    GVCRDT
     C                     Z-ADDW0CRTM    GVCRTM
     C                     WRITEGKTPPB01
      *
     CSR         ESB500    ENDSR
