     H            Y/                                    1
     H** GTAR30 ********************************************
     H*  SCAN FOR PACKING MODULE
     H*
     H* TCHK  08/23/12 CREATE
     F******************************************************
     FGTAPW30 CF  E                    WORKSTN
     FGTAPL10 UF  E           K        DISK
     FGTAPP20 UF  E           K        DISK
     E******************************************************
     E                    ERR     1  20 17
     I******************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I            DS
     I                                        1  17 W1BARC
     I                                        1   4 W1CASE
     I                                        5   8 W1CANY
     I                                        9  16 W1CAHK
     I                                       17  17 W1CACD
     C******************************************************
     C*MAIN
     C******************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'20'      #FMT20
     C                     ENDCS
     C                     ENDDO
     C*
     C*
     C                     SETON                     LR
     C                     RETRN
     C******************************************************
     C* INITIAL
     C******************************************************
     C           *INZSR    BEGSR
     C*
     C           *ENTRY    PLIST
     C                     PARM           P@TMID  6
      * FOR KANBAN CHECK DEGIT
     C           P#BRC     PLIST
     C                     PARM           PMAREA100
     C                     PARM           PMBYTE  3
     C                     PARM           PMCHK   1
     C                     PARM           PMRTCD  1
     C*
     C                     TIME           WSDT
     C                     MOVEL'10'      @@ID    2
     C                     Z-ADD*ZERO     W@CNT   20
     C                     MOVEL*OFF      W@COMP  1
     C*
     C                     ENDSR
     C******************************************************
     C*     1ST SCREEN(CASE LABEL)
     C******************************************************
     C           #FMT10    BEGSR
      *
     C                     EXFMTFMT100
     C                     MOVEL*BLANK    F1ERR
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     EXSR #UNLCK
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN99     IFEQ *OFF
     C                     Z-ADDWSSYYY    G2KOYY
     C                     Z-ADDWSSMMM    G2KOMM
     C                     Z-ADDWSSDDD    G2KODD
     C                     Z-ADDWSSHHH    G2KOHH
     C                     Z-ADDWSSNNN    G2KOSS
     C                     MOVEL#USER     G2KOME
     C                     MOVEL#PGM      G2KPGM
     C                     MOVELP@TMID    G2KOTM
     C                     Z-ADDWSSDAT    G2LTSC
     C                     MOVELP@TMID    G2LTTM
     C                     MOVEL'1'       G2LOCK
     C                     MOVELW1CASE    F2CASE
     C                     Z-ADDG2LTS#    F2CNT
     C                     UPDATGTAPP201
     C                     MOVE '20'      @@ID
     C                     ELSE
     C                     END
     C                     ENDSL
      *
     C                     ENDSR
     C**************************************************************************
     C*     1ST SCREEN CHECK
     C**************************************************************************
     C           #CHK10    BEGSR
     C*
     C                     MOVELF1CASE    W1BARC
     C                     SETOF                     9961
     C*
     C                     DO
     C*
     C           F1CASE    IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,1     F2ERR
     C                     MOVELERR,1     F99ER1
     C                     MOVELERR,2     F99ER2
     C                     LEAVE
     C                     END
     C* CHECK DIGIT
TEST C           #USER     IFEQ 'TEST'
TEST C           #USER     OREQ 'I0777'
TEST C                     ELSE
     C                     MOVELF1CASE    PMAREA    P
     C                     MOVE '016'     PMBYTE
     C                     MOVE *BLANK    PMCHK
     C                     MOVE *BLANK    PMRTCD
     C                     CALL 'ALBRCC'  P#BRC
     C           PMRTCD    IFNE *BLANK
     C                     SETON                     9961
     C                     MOVELERR,1     F1ERR
     C                     MOVELERR,1     F99ER1
     C                     MOVELERR,3     F99ER2
     C                     LEAVE
     C                     END
     C           PMCHK     IFNE W1CACD
     C                     SETON                     9961
     C                     MOVELERR,1     F1ERR
     C                     MOVELERR,1     F99ER1
     C                     MOVELERR,3     F99ER2
     C                     LEAVE
     C                     END
TEST C                     END
      *
     C           W1CASE    CHAINGTAPP20              98
     C           *IN98     IFEQ *ON
     C                     SETON                     9961
     C                     MOVELERR,1     F1ERR
     C                     MOVELERR,1     F99ER1
     C                     MOVELERR,4     F99ER2
     C                     LEAVE
     C                     END
     C           G2SKJY    IFNE *BLANK
     C                     SETON                     9961
     C                     MOVELERR,1     F1ERR
     C                     MOVELERR,1     F99ER1
     C                     MOVELERR,5     F99ER2
     C                     LEAVE
     C                     END
     C           G2CMPL    IFNE *BLANK
     C                     SETON                     9961
     C                     MOVELERR,1     F1ERR
     C                     MOVELERR,1     F99ER1
     C                     MOVELERR,6     F99ER2
     C                     LEAVE
     C                     END
     C           G2LOCK    IFNE *BLANK
     C                     SETON                     9961
     C                     MOVELERR,1     F1ERR
     C                     MOVELERR,1     F99ER1
     C                     MOVELERR,7     F99ER2
     C                     LEAVE
     C                     END
     C           G2SIHZ    IFNE *ZERO
     C                     SETON                     9961
     C                     MOVELERR,1     F1ERR
     C                     MOVELERR,1     F99ER1
     C                     MOVELERR,8     F99ER2
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C           *IN99     IFEQ *ON
     C                     EXFMTFMT999
     C                     END
     C*
     C                     ENDSR
     C*************************************************************************
     C*     2ND SCREEN(SHIPPING KANBAN)
     C**************************************************************************
     C           #FMT20    BEGSR
     C*
     C                     EXFMTFMT200
     C                     MOVEL*BLANK    F2ERR
     C*
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C                     EXSR #UNLCK
     C                     OTHER
     C                     EXSR #CHK20
     C           *IN99     IFEQ *OFF
     C                     EXSR #UPD
     C                     MOVEL*BLANK    F2SERL
     C           F2CNT     IFGE 72
     C                     EXFMTFMT900
     C                     EXSR #UNLCK
     C                     MOVEL*BLANK    F1CASE
     C                     MOVEL*BLANK    W1BARC
     C                     MOVEL'10'      @@ID
     C                     END
     C                     END
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*     2ND SCREEN CHECK
     C**************************************************************************
     C           #CHK20    BEGSR
     C*
     C                     SETOF                     9961
     C*
     C                     DO
     C*
     C           F2SERL    IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,9     F2ERR
     C                     MOVELERR,9     F99ER1
     C                     MOVELERR,2     F99ER2
     C                     LEAVE
     C                     END
     C*
     C           F2SERL    CHAINGTAPL10              97
     C           *IN97     IFEQ *ON
     C                     SETON                     9961
     C                     MOVELERR,9     F2ERR
     C                     MOVELERR,9     F99ER1
     C                     MOVELERR,4     F99ER2
     C                     LEAVE
     C                     END
     C           G1SKJY    IFNE *BLANK
     C                     SETON                     9961
     C                     MOVELERR,9     F2ERR
     C                     MOVELERR,9     F99ER1
     C                     MOVELERR,5     F99ER2
     C                     LEAVE
     C                     END
     C           G1CASE    IFNE *BLANK
     C                     SETON                     9961
     C                     MOVELERR,9     F2ERR
     C                     MOVELERR,9     F99ER1
     C                     MOVELERR,10    F99ER2
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C           *IN99     IFEQ *ON
     C                     EXFMTFMT999
     C                     END
     C*
     C                     ENDSR
     C******************************************************
     C* UPDATE
     C******************************************************
     C           #UPD      BEGSR
     C*
     C                     TIME           WSDT
     C*
     C                     Z-ADDWSSYYY    G1KOYY
     C                     Z-ADDWSSMMM    G1KOMM
     C                     Z-ADDWSSDDD    G1KODD
     C                     Z-ADDWSSHHH    G1KOHH
     C                     Z-ADDWSSNNN    G1KOSS
     C                     MOVEL#USER     G1KOME
     C                     MOVEL#PGM      G1KPGM
     C*
     C                     Z-ADDWSSDAT    G1KNHZ
     C                     Z-ADDWSSTM6    G1KNTM
     C                     MOVELP@TMID    G1KNTN
     C*
     C                     MOVELG2CASE    G1CASE
     C                     MOVELG2CANY    G1CANY
     C                     MOVELG2CAHK    G1CAHK
     C                     MOVELG2CACK    G1CACK
     C*
     C                     ADD  1         F2CNT
     C                     Z-ADDF2CNT     G1CASQ
     C*
     C                     UPDATGTAPP101
     C*
     C           W1CASE    CHAINGTAPP20              98
     C           *IN98     IFEQ *OFF
     C                     Z-ADDWSSYYY    G2KOYY
     C                     Z-ADDWSSMMM    G2KOMM
     C                     Z-ADDWSSDDD    G2KODD
     C                     Z-ADDWSSHHH    G2KOHH
     C                     Z-ADDWSSNNN    G2KOSS
     C                     MOVEL#USER     G2KOME
     C                     MOVEL#PGM      G2KPGM
     C                     MOVELP@TMID    G2KOTM
     C                     Z-ADDWSSDAT    G2LTSC
     C                     MOVELP@TMID    G2LTTM
     C           F2CNT     IFGE 72
     C                     MOVEL'1'       G2CMPL
     C                     MOVEL*BLANK    G2LOCK
     C                     END
     C                     Z-ADDF2CNT     G2LTS#
     C                     UPDATGTAPP201
     C                     END
     C*
     C                     ENDSR
     C******************************************************
     C* UNLOCK
     C******************************************************
     C           #UNLCK    BEGSR
     C*
     C                     DO
     C*
     C           W1BARC    IFEQ *BLANK
     C                     LEAVE
     C                     END
     C*
     C                     TIME           WSDT
     C*
     C           W1CASE    CHAINGTAPP20              98
     C           *IN98     IFEQ *OFF
     C                     Z-ADDWSSYYY    G2KOYY
     C                     Z-ADDWSSMMM    G2KOMM
     C                     Z-ADDWSSDDD    G2KODD
     C                     Z-ADDWSSHHH    G2KOHH
     C                     Z-ADDWSSNNN    G2KOSS
     C                     MOVEL#USER     G2KOME
     C                     MOVEL#PGM      G2KPGM
     C                     MOVELP@TMID    G2KOTM
     C                     Z-ADDWSSDAT    G2LTSC
     C                     MOVELP@TMID    G2LTTM
     C                     MOVEL*BLANK    G2LOCK
     C           F2CNT     IFNE *ZERO
     C                     Z-ADDF2CNT     G2LTS#
     C                     END
     C                     UPDATGTAPP201
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C******************************************************
** ERR
CASE LABEL ERROR                 #01
BLANK                            #02
CHECK DIGIT ERROR                #03
NOT FOUND                        #04
ALREADY DELETED                  #05
SCAN COMPLETED                   #06
USE OTHER TM                     #07
ALREADY CLOSED                   #08
SERIAL BARCODE ERROR             #09
SCAN DUPLICATE                   #10
                                 #11
                                 #12
                                 #13
                                 #14
                                 #15
                                 #16
                                 #17
                                 #18
                                 #19
                                 #20
