     H            Y.
      ** GTBR75 ********************************************
      *  ACZ PT ORDER UPPER LIMIT DATE MULTI RATE          *
      *                                                    *
      * TCHK  10/05/12 CREATE(COPY FROM GDGR75)            *
      ******************************************************
     FGTBPW75 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL010
     F                                              KINFDS @INFDS
     FAGDPL12 IF  E           K        DISK
     FGTBPP75 UF  E           K        DISK                      A
      *---------------------------------------------------
     E                    ERR     1  15 60
      *---------------------------------------------------
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME(6) + DATE(6)
     I            DS
     I                                        1  140WWTIME
     I                                        1   60WTIME
     I                                        1   40WTIM4
     I                                        1   20WTIMH
     I                                        3   40WTIMM
     I                                        7  120WSDATE
     I                                        9  120@@YM4
     I                                        7  120@@YM6
     I                                        7  140@@YMD
     I                                        7  100@@YY
     I                                       11  120@@MM
     I                                       13  140@@DD
     I            DS
     I                                        1   80GNPTDT
     I                                        1   40GNPTYY
     I                                        5   60GNPTMM
     I                                        7   80GNPTDD
     I            DS
     I                                        1   80S1PTDT
     I                                        1   40S1PTYY
     I                                        5   60S1PTMM
     I                                        7   80S1PTDD
     I            DS
     I                                        1   80F2PTDT
     I                                        1   40F2PTYY
     I                                        5   60F2PTMM
     I                                        7   80F2PTDD
      * ----------------------------------------------------
     C                     TIME           WWTIME
      ******************************************************
      *  MAIN
      ******************************************************
     C*
     C                     EXSR @S1INT
     C                     EXSR @S1SET
      *
     C                     DO   *HIVAL
      *
     C                     WRITEFMT090
     C                     Z-ADDW#RCN1    #RCN01
     C                     EXFMTCTL010
     C   KA                LEAVE
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RCN1
     C                     END
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      W#P1ER  1
      * add new
     C           *INKH     IFEQ *ON
     C                     EXSR @S2ADD
     C   KA                LEAVE
     C                     EXSR @S1INT
     C                     EXSR @S1SET
     C                     ITER
     C                     END
      * change
     C                     EXSR @S2CHG
     C   KA                LEAVE
     C                     EXSR @S1INT
     C                     EXSR @S1SET
     C                     ITER
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C*----------------------------------------------------*
      *  1ST SCREEN INITIALIZE
     C*----------------------------------------------------*
     C           @S1INT    BEGSR
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL010
     C                     MOVEL*OFF      *IN41
      *
     C                     Z-ADD1         W#RCN1  40
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  SET
     C*----------------------------------------------------*
     C           @S1SET    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1    40
     C           *LOVAL    SETLLGTBPP75
      *
     C                     DO   *HIVAL
      *
     C                     READ GTBPP75             N    98
     C   98                LEAVE
     C           GNSKJY    IFNE *BLANK
     C                     ITER
     C                     END
      *
     C                     CLEARSFL010
     C*
     C                     Z-ADDGNPTDT    S1PTDT
     C                     Z-ADDGNRATE    S1RATE
     C*
     C                     ADD  1         RRN1
     C                     WRITESFL010
     C*
     C                     ENDDO
     C*
     C           RRN1      IFEQ *ZERO
     C                     CLEARSFL010
     C                     Z-ADD1         RRN1
     C                     MOVEL*ON       *IN31
     C                     WRITESFL010
     C                     MOVEL*ON       *IN69
     C                     MOVELERR,1     MSG
     C                     MOVEL*OFF      *IN31
     C                     END
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  ADD NEW RECORD
     C*----------------------------------------------------*
     C           @S2ADD    BEGSR
      *
     C                     EXSR @S2INT
     C                     MOVEL'ADD    ' F2ACTN    P
      *
     C                     DO   *HIVAL
      *
     C                     EXFMTFMT020
     C   KA
     COR KL                LEAVE
      *
     C                     MOVEL*OFF      *IN69
     C                     EXSR @S2CHK
     C           *IN69     IFEQ *OFF
     C           *INKE     IFEQ *ON
     C                     EXSR @ADDF
     C           *IN69     IFEQ *OFF
     C                     LEAVE
     C                     END
     C                     END
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  INITIAL SET TO FMT020
     C*----------------------------------------------------*
     C           @S2INT    BEGSR
     C*
     C                     SETOF                     5152
     C                     SETOF                     616269
     C*
     C                     Z-ADD*ZERO     F2PTYY
     C                     Z-ADD*ZERO     F2PTMM
     C                     Z-ADD*ZERO     F2PTDD
     C                     Z-ADD*ZERO     F2RATE
     C*
     C                     MOVEL*BLANK    MSG
     C*
     C                     ENDSR
     C*----------------------------------------------------*
     C*  CHECK FMT020
     C*----------------------------------------------------*
     C           @S2CHK    BEGSR
     C*
     C                     SETOF                     5152
     C                     MOVEL*BLANK    MSG
     C*
     C                     DO
     C*
     C           K#PTD     KLIST
     C                     KFLD           F2PTYY
     C                     KFLD           F2PTMM
     C                     KFLD           F2PTDD
     C           K#PTD     CHAINAGDPL12              91
     C           *IN91     IFEQ *ON
     C                     SETON                     5169
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     END
     C                     END
     C*
     C           F2RATE    IFEQ *ZERO
     C                     SETON                     5269
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     END
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  WRITE NEW RECORD
     C*----------------------------------------------------*
     C           @ADDF     BEGSR
      *
     C                     DO
      *
     C           K#PTD     CHAINGTBPP75              98
     C           *IN98     IFEQ *OFF
     C           GNSKJY    ANDEQ*BLANK
     C                     SETON                     515269
     C                     MOVELERR,04    MSG
     C                     LEAVE
     C                     END
     C*
     C                     CLEARGTBPP75R
     C*
     C                     EXSR @EDTF
      *
     C           *IN98     IFEQ *OFF
     C                     UPDATGTBPP75R
     C                     ELSE
     C                     WRITEGTBPP75R
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  EDIT RECORD (NEW/CHANGE)
     C*----------------------------------------------------*
     C           @EDTF     BEGSR
     C*
     C                     TIME           WWTIME
     C                     Z-ADD@@YY      GNKOYY
     C                     Z-ADD@@MM      GNKOMM
     C                     Z-ADD@@DD      GNKODD
     C                     Z-ADDWTIMH     GNKOHH
     C                     Z-ADDWTIMM     GNKOSS
     C                     MOVEL#PGM      GNPGMN
     C                     MOVEL#USER     GNKOME
     C*
     C                     Z-ADDF2PTYY    GNPTYY
     C                     Z-ADDF2PTMM    GNPTMM
     C                     Z-ADDF2PTDD    GNPTDD
     C                     Z-ADDF2RATE    GNRATE
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  CHANGE/DELETE MAIN
     C*----------------------------------------------------*
     C           @S2CHG    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN1
     C           RRN1      CHAINSFL010               98
     C   98                LEAVE
     C           S1SEL     IFEQ *BLANK
     C                     ITER
     C                     END
      *
     C                     EXSR @S2CDP
     C   KA                LEAVE
      *
     C                     MOVEL*BLANK    S1SEL
     C                     MOVEL*ON       *IN32
     C                     UPDATSFL010
     C                     MOVEL*OFF      *IN32
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  CHANGE/DELETE SET
     C*----------------------------------------------------*
     C           @S2CDP    BEGSR
      *
     C                     EXSR @S2INT
     C           S1SEL     IFEQ 'C'
     C                     MOVEL'CHANGE  'F2ACTN    P
     C                     MOVEL*ON       *IN61
     C                     MOVEL*OFF      *IN62
     C                     ELSE
     C                     MOVEL'DELETE  'F2ACTN    P
     C                     MOVEL*ON       *IN61
     C                     MOVEL*ON       *IN62
     C                     END
     C                     Z-ADDS1PTDT    F2PTDT
     C                     Z-ADDS1RATE    F2RATE
      *
     C                     DO   *HIVAL
      *
     C                     EXFMTFMT020
     C   KA
     COR KL                LEAVE
      *
     C           *INKE     IFEQ *ON
     C                     EXSR @CHGF
     C                     LEAVE
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  UPDAT
     C*----------------------------------------------------*
     C           @CHGF     BEGSR
      *
     C                     DO
      *
     C           K#PTD     CHAINGTBPP75              98
     C           *IN98     IFEQ *ON
     C                     LEAVE
     C                     END
      *
     C           S1SEL     IFEQ 'D'
     C                     TIME           WWTIME
     C                     MOVEL'D'       GNSKJY
     C                     Z-ADD@@YY      GNKOYY
     C                     Z-ADD@@MM      GNKOMM
     C                     Z-ADD@@DD      GNKODD
     C                     Z-ADDWTIMH     GNKOHH
     C                     Z-ADDWTIMM     GNKOSS
     C                     MOVEL#PGM      GNPGMN
     C                     MOVEL#USER     GNKOME
     C                     ELSE
     C                     EXSR @EDTF
     C                     END
      *
     C                     UPDATGTBPP75R
      *
     C                     ENDDO
      *
     C                     ENDSR
** ERR
NO DATA FOUND.
RATE ERROR.
DATE ERROR.
SOMEBODY ELSE ALREADY CREATE. NEED CHECK(DUPLICATE).
05
06
07
08
09
10
11
12
13
14
15
