      *** GTBR15 *****************************************************
      *    PRINT OF ORDER TOTAL LIST (PRODUCTS)
      *  C:N.HAYAKAWA                     97/10/24
      *    A.MAMIYA  ADDIN %9999        2000/10/07
      *    H.AMANO                      2002/02/15
      *    H.AMANO                      2003/03/26
      *    H.AMANO                      2003/05/07
      *    H.AMANO                      2003/10/16
      *    H.AMANO                      2004/10/27
      *
      * TCHK  10/05/12 CREATE(COPY FROM GDGR15)
      ****************************************************************
     H            Y/                                    1
     FGTBPL10 IP  E           K        DISK
     FAZAPP51 IF  E           K        DISK
     FAANPL06 IF  E           K        DISK
     FAAPTL01 IF  E           K        DISK
     FAKBPL04 IF  E           K        DISK
     FAB#PL18 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FMCENP13 IF  E           K        DISK
     FFCEPL41 IF  E           K        DISK
     FGTBPL19 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFCEPL11 IF  E           K        DISK
     FGTBWP15 IF  E           K        DISK                      A
     FGTCPL05 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER                        U2
     FQPRINT2 O   F     132     OV     PRINTER
     I****************************************************************
     E                    HTP        31  3 0             +箱数BTAPP05
     E                    HTM        31  3 0             -箱数BTAPP05
     E                    HTZ        31  1               割振BTAPP05
     I            DS
     I                                        1  93 HTP
     I                                        1   30GTPH01
     I                                        4   60GTPH02
     I                                        7   90GTPH03
     I                                       10  120GTPH04
     I                                       13  150GTPH05
     I                                       16  180GTPH06
     I                                       19  210GTPH07
     I                                       22  240GTPH08
     I                                       25  270GTPH09
     I                                       28  300GTPH10
     I                                       31  330GTPH11
     I                                       34  360GTPH12
     I                                       37  390GTPH13
     I                                       40  420GTPH14
     I                                       43  450GTPH15
     I                                       46  480GTPH16
     I                                       49  510GTPH17
     I                                       52  540GTPH18
     I                                       55  570GTPH19
     I                                       58  600GTPH20
     I                                       61  630GTPH21
     I                                       64  660GTPH22
     I                                       67  690GTPH23
     I                                       70  720GTPH24
     I                                       73  750GTPH25
     I                                       76  780GTPH26
     I                                       79  810GTPH27
     I                                       82  840GTPH28
     I                                       85  870GTPH29
     I                                       88  900GTPH30
     I                                       91  930GTPH31
     I            DS
     I                                        1  93 HTM
     I                                        1   30GTMH01
     I                                        4   60GTMH02
     I                                        7   90GTMH03
     I                                       10  120GTMH04
     I                                       13  150GTMH05
     I                                       16  180GTMH06
     I                                       19  210GTMH07
     I                                       22  240GTMH08
     I                                       25  270GTMH09
     I                                       28  300GTMH10
     I                                       31  330GTMH11
     I                                       34  360GTMH12
     I                                       37  390GTMH13
     I                                       40  420GTMH14
     I                                       43  450GTMH15
     I                                       46  480GTMH16
     I                                       49  510GTMH17
     I                                       52  540GTMH18
     I                                       55  570GTMH19
     I                                       58  600GTMH20
     I                                       61  630GTMH21
     I                                       64  660GTMH22
     I                                       67  690GTMH23
     I                                       70  720GTMH24
     I                                       73  750GTMH25
     I                                       76  780GTMH26
     I                                       79  810GTMH27
     I                                       82  840GTMH28
     I                                       85  870GTMH29
     I                                       88  900GTMH30
     I                                       91  930GTMH31
     I            DS
     I                                        1  31 HTZ
     I                                        1   1 GTZM01
     I                                        2   2 GTZM02
     I                                        3   3 GTZM03
     I                                        4   4 GTZM04
     I                                        5   5 GTZM05
     I                                        6   6 GTZM06
     I                                        7   7 GTZM07
     I                                        8   8 GTZM08
     I                                        9   9 GTZM09
     I                                       10  10 GTZM10
     I                                       11  11 GTZM11
     I                                       12  12 GTZM12
     I                                       13  13 GTZM13
     I                                       14  14 GTZM14
     I                                       15  15 GTZM15
     I                                       16  16 GTZM16
     I                                       17  17 GTZM17
     I                                       18  18 GTZM18
     I                                       19  19 GTZM19
     I                                       20  20 GTZM20
     I                                       21  21 GTZM21
     I                                       22  22 GTZM22
     I                                       23  23 GTZM23
     I                                       24  24 GTZM24
     I                                       25  25 GTZM25
     I                                       26  26 GTZM26
     I                                       27  27 GTZM27
     I                                       28  28 GTZM28
     I                                       29  29 GTZM29
     I                                       30  30 GTZM30
     I                                       31  31 GTZM31
     I            DS
     I                                        1   80WPODDT
     I                                        1   40WPODRY
     I                                        5   60WPODRM
     I                                        7   80WPODRD
     I                                        1   60WPODYM
     I                                        1   20WPODCY
     I                                        3   80WPODXX
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     I                                        7  120WSSYM
     I* ----------------------------------------------------
     I            DS
     I                                        1   60@@TIME
     I                                        1   40@TIME
     I            DS
     I                                        1   80L7STHZ
     I                                        1   40L7STYY
     I                                        5   60L7STMM
     I                                        7   80L7STDD
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80ABYMD
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      *-------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           PMDATE  6
     C                     MOVELPMDATE    WPODXX
     C                     MOVEL'20'      WPODCY
     C*
     C           K#KEY     KLIST
     C                     KFLD           IBHIN1
     C                     KFLD           IBHIN2
     C                     KFLD           IBHIN3
     C           K#AB      KLIST
     C                     KFLD           K@HIN1  5
     C                     KFLD           K@HIN2  5
     C                     KFLD           K@HIN3  2
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#ABX     KLIST
     C                     KFLD           K@HIN1  5
     C                     KFLD           K@HIN2  5
     C                     KFLD           K@HIN3  2
      *-------------------------------------------------------
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C                     TIME           @@TIME
     C                     TIME           WSDT
     C                     EXCPTHD
     C                     END
     C*
     C           IBSKJY    IFEQ 'D'
     C           IBSKHZ    ANDLE*DATE
     C                     GOTO @END
     C                     END
     C*
     C                     MOVE *BLANK    @LOC1   1
     C                     MOVE *BLANK    @LOC2   2
     C                     MOVE *BLANK    @LOC3   2
     C                     MOVE *BLANK    @LOC4   1
     C                     Z-ADD*ZERO     @BOX5
     C                     Z-ADD*ZERO     @ABOX5  72
     C                     Z-ADD*ZERO     @SHQY  110
     C*
B0   C                     SELEC
     C           IBSEIH    WHEQ '0'
     C           K#KEY     SETLLAAPTL01
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEAAPTL01                  90
     C           *IN90     IFEQ *OFF
     C           L5SKJY    ANDEQ*BLANK
     C           L5STHZ    ANDEQ*ALL'9'
     C                     MOVE L5TKR1    @LOC1   1
     C                     MOVE L5TKR2    @LOC2   2
     C                     MOVE L5TKR3    @LOC3   2
     C                     MOVE L5TKR4    @LOC4   1
     C*
     C                     EXSR #SETT
     C           W@SYS     IFNE *ZERO
     C           W@W#01    MULT 5         @@BOX  110
     C           @@BOX     DIV  W@SYS     @BOX5   72
     C           W@W#01    DIV  W@SYS     @DBOX   50H
     C                     ELSE
     C           L5SYOS    IFNE *ZERO
     C           L5KTSU    MULT 5         @@BOX
     C           @@BOX     DIV  L5SYOS    @BOX5
     C           L5KSSU    DIV  L5SYOS    @DBOX   50H
     C                     ENDIF
     C                     END
     C*
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE IBHIN1    K@HIN1
     C                     MOVE IBHIN2    K@HIN2
     C                     MOVE IBHIN3    K@HIN3
     C                     EXSR #ACT
      *
     C           IBSEIH    WHEQ '3'
     C           K#KEY     SETLLAKBPL04
     C           *IN90     DOUEQ*ON
      *
     C           K#KEY     READEAKBPL04                  90
     C           *IN90     IFEQ *OFF
     C           L1SKJY    ANDEQ*BLANK
     C           L1STHZ    ANDEQ*ALL'9'
     C                     MOVE L1TKR1    @LOC1   1
     C                     MOVE L1TKR2    @LOC2   2
     C                     MOVE L1TKR3    @LOC3   2
     C                     MOVE L1TKR4    @LOC4   1
     C           L1SYOS    IFNE *ZERO
     C           L1KTSU    MULT 5         @@BOX
     C           @@BOX     DIV  L1SYOS    @BOX5
     C           L1KSSU    DIV  L1SYOS    @DBOX   50H
     C                     ENDIF
     C*
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     EXSR #WASH
      *
     C           IBSEIH    WHEQ '6'
     C           K#KEY     SETLLAANPL06
     C           *IN90     DOUEQ*ON
      *
     C           K#KEY     READEAANPL06                  90
     C           *IN90     IFEQ *OFF
     C           L7SKJY    ANDEQ*BLANK
     C           L7STHZ    ANDEQ*ALL'9'
     C                     MOVE L7TKR1    @LOC1   1
     C                     MOVE L7TKR2    @LOC2   2
     C                     MOVE L7TKR3    @LOC3   2
     C                     MOVE L7TKR4    @LOC4   1
     C*
     C                     EXSR #SETT
     C           W@SYS     IFNE *ZERO
     C           W@W#01    MULT 5         @@BOX  110
     C           @@BOX     DIV  W@SYS     @BOX5   72
     C           W@W#01    DIV  W@SYS     @DBOX   50H
     C                     ELSE
     C           L7SYOS    IFNE *ZERO
     C           L7KTSU    MULT 5         @@BOX  110
     C           @@BOX     DIV  L7SYOS    @BOX5   72
     C           L7KSSU    DIV  L7SYOS    @DBOX   50H
     C                     ENDIF
     C                     END
     C*
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     EXSR #HALF
      *
     C                     ENDSL
      *
      *
     C           K#KEY     CHAINAZAPP51              91
     C* TOTAL LIST PRINTING
     C                     ADD  IBMAIS    BOXALL  70
      *
     C           IBSYOS    IFNE *ZERO
     C           @SHQY     DIV  IBSYOS    @ABOX5    H
     C                     ENDIF
      *
     C                     Z-ADD@BOX5     W@BOX5  50
     C                     MOVE @BOX5     W@2     20
     C           W@2       IFNE *ZERO
     C                     ADD  1         W@BOX5
     C                     ENDIF
      *
     C                     Z-ADD@ABOX5    W@ABX5  50
     C                     MOVE @ABOX5    W@2     20
     C           W@2       IFNE *ZERO
     C                     ADD  1         W@ABX5
     C                     ENDIF
      * LAST ORDER
     C                     Z-ADD*ZERO     @MAIS
     C                     MOVEL*BLANK    @ORDR   6
     C           K#KEY     SETGTGTBPL19
     C           *IN91     DOUEQ*ON
     C           K#KEY     REDPEGTBPL19                  91
     C           *IN91     IFEQ *OFF
     C           ICSKJY    ANDEQ*BLANK
     C                     Z-ADDICMAIS    @MAIS   50
     C                     MOVELICODER    @ORDR
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C*
     C                     Z-ADD*ZERO     @PMAIS
     C                     EXSR #PUBL
      *
     C                     EXCPTME
     C           @DBOX     IFEQ 0
     C           IBMAIS    DIV  1         PERCEN    H
     C                     ELSE
     C           IBMAIS    DIV  @DBOX     PERCEN    H
     C                     ENDIF
     C                     WRITEGTBWP151
      *
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
     C*
     C           @END      TAG
     C*
     C*
     CLR                   Z-ADD0         BOXALL
     CLR                   TIME           @@TIME
     CLR                   EXCPTHY
B1   CLR         *IN56     DOWEQ'0'
     CLR                   READ GTBWP151                 56
B2   CLR         *IN56     IFEQ '0'
     CLR                   ADD  IBMAIS    BOXALL
     CLR                   EXCPTMY
     CLR         *INOV     IFEQ '1'
     CLR                   EXCPTHY
     CLR                   SETOF                     OV
     CLR                   END
E2   CLR                   ENDIF
E1   CLR                   ENDDO
     CLR                   EXCPTTY
     C*
     CLR                   EXCPTTO
      *-----------------------------------------------------------
      *  ACTUAL
      *-----------------------------------------------------------
     C           #ACT      BEGSR
      *
     C           K#AB      SETLLAB#PL18
     C           *IN91     DOUEQ*ON
     C           K#ABX     READEAB#PL18                  91
     C           *IN91     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           ABYMD     IFGE *DATE
     C                     LEAVE
     C                     ENDIF
      *
     C                     ADD  BASRYO    @SHQY
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------------
      *  WASHER
      *-----------------------------------------------------------
     C           #WASH     BEGSR
      *
     C           K#KEY     SETLLMCENP13
     C           *IN92     DOUEQ*ON
     C           K#KEY     READEMCENP13                  92
     C           *IN92     IFEQ *OFF
     C                     MOVE MCSHN1    K@HIN1
     C                     MOVE MCSHN2    K@HIN2
     C                     MOVE MCSHN3    K@HIN3
     C                     EXSR #ACT
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------------
      *  HALF PRODUCT
      *-----------------------------------------------------------
     C           #HALF     BEGSR
      *
     C           K#KEY     SETLLFCEPL41
     C           *IN92     DOUEQ*ON
     C           K#KEY     READEFCEPL41                  92
     C           *IN92     IFEQ *OFF
     C           F4GSKD    ANDEQ*BLANK
     C                     MOVE F4PRT1    K@HIN1
     C                     MOVE F4PRT2    K@HIN2
     C                     MOVE F4PRT3    K@HIN3
     C                     EXSR #ACT
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------------
      *  GET SETTING
      *-----------------------------------------------------------
     C           #SETT     BEGSR
     C*
     C                     Z-ADD*ZERO     W@SYS   50
     C                     Z-ADD*ZERO     W@W#01  92
     C                     Z-ADD*ZERO     W@GEKN  90
     C*
     C                     DO
     C*
     C           K#FCEP    KLIST
     C                     KFLD           IBHIN1
     C                     KFLD           IBHIN2
     C                     KFLD           IBHIN3
     C           K#FCEP    CHAINFCEPL01              91
     C           *IN91     IFEQ *ON
     C                     LEAVE
     C                     END
     C*
     C           A2SYHZ    IFGT *DATE
     C                     Z-ADDA2KSYS    W@SYS   50
     C                     ELSE
     C                     Z-ADDA2SSYS    W@SYS
     C                     END
     C*
     C                     Z-ADDA2GEKN    W@GEKN  90
     C           K#FCEP    CHAINFCEPL11              94
     C           *IN94     IFEQ *OFF
     C           FCCD01    ANDNE*ZERO
     C           FCGK01    DIV  FCCD01    @@QTY   90
     C           @@QTY     MULT 20        W@GEKN
     C                     END
     C*
     C           W@GEKN    DIV  20        W@W#01  92
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *-----------------------------------------------------------
      *  SUM PUBLICATION
      *-----------------------------------------------------------
     C           #PUBL     BEGSR
     C*
     C           K#GT5A    KLIST
     C                     KFLD           ICHIN1
     C                     KFLD           ICHIN2
     C                     KFLD           ICHIN3
     C                     KFLD           WPODYM
     C           K#GT5A    SETLLGTCPL05
     C*
     C                     DO   *HIVAL
     C*
     C           K#GT5B    KLIST
     C                     KFLD           ICHIN1
     C                     KFLD           ICHIN2
     C                     KFLD           ICHIN3
     C           K#GT5B    READEGTCPL05                  89
     C   89                LEAVE
     C           GTSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C*
     C           GTKEYM    IFEQ WPODYM
     C           WPODRD    ADD  1         X       20
     C           X         IFLE 31
     C           X         DO   31        Y       20
     C           HTZ,Y     IFNE *BLANK
     C                     ADD  HTP,Y     @PMAIS
     C                     END
     C                     ENDDO
     C                     END
     C                     ITER
     C                     END
     C*
     C           GTKEYM    IFLT WSSYM
     C           1         DO   31        Y
     C           HTZ,Y     IFNE *BLANK
     C                     ADD  HTP,Y     @PMAIS
     C                     END
     C                     ENDDO
     C                     ITER
     C                     END
     C*
     C           GTKEYM    IFEQ WSSYM
     C           1         DO   WSSDDD    Y
     C           HTZ,Y     IFNE *BLANK
     C                     ADD  HTP,Y     @PMAIS
     C                     END
     C                     ENDDO
     C                     ITER
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *-----------------------------------------------------------
      *  INITIALIZE
      *-----------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *
     C                     Z-ADD*DATE     K@YMD
     C           K#AGD     SETLLAGDPL12
     C                     Z-ADD*ZERO     M       30
     C           *IN90     DOUEQ*ON
     C                     READPAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     Z-ADDF8KAYY    K@YY
     C                     Z-ADDF8KAMM    K@MM
     C                     Z-ADDF8KADD    K@DD
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------------
     OQPRINT  E  102           HD
     O                                  131 '+-------------------+'
     O        E  1             HD
     O                                  131 '|         |         |'
     O        E  1             HD
     O                                   89 'TIME'
     O                         @@TIME    98 '  .  .  '
     O                                  131 '|         |         |'
     O        E  2             HD
     O                                   12 'GTBR15-1 '
     O                                   54 '** ACZ KANBAN INPUT DATA'
     O                                   68 'TOTAL LIST **'
     O                                   80 '(PRODUCTS)'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        E  1             HD
     O                                   68 'DAY BEFORE'
     O                                   83 'LAST ORDER'
     O        E  2             HD
     O                                    8 'LOCATION'
     O                                   21 'PART CODE'
     O                                   35 'PART NO.'
     O                                   48 'SETTING'
     O                                   56 'BOX'
     O                                   67 'ACTUAL'
     O                                   77 'ORDER#'
     O                                   86 'BOXES'
     O        E  1             ME
     O                      N90@LOC1      1
     O                      N90           2 '-'
     O                      N90@LOC2      4
     O                      N90           5 '-'
     O                      N90@LOC3      7
     O                      N90           8 '-'
     O                      N90@LOC4      9
     O                         IBSEIH    17
     O                         IBHIN1    29
     O                                   30 '-'
     O                         IBHIN2    35
     O                                   36 '-'
     O                         IBHIN3    38
     O                         @DBOX 2   45
     O                         IBMAIS2   56
     O                         W@ABX54   67
     O                         @ORDR     77
     O                         @MAIS 4   86
     O        E 11             TO
     O                                   40 '*** TOTAL BOXES'
     O                         BOXALL1   56
     OQPRINT2 E  102           HY
     O                                  131 '+-------------------+'
     O        E  1             HY
     O                                  131 '|         |         |'
     O        E  1             HY
     O                                   89 'TIME'
     O                         @@TIME    98 '  .  .  '
     O                                  131 '|         |         |'
     O        E  2             HY
     O                                   12 'GTBR15-1 '
     O                                   54 '**  KANBAN INPUT DATA'
     O                                   68 'TOTAL LIST **'
     O                                   80 '(PRODUCTS)'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE1 Z  108
     O                                  131 '+-------------------+'
     O        E  1             HY
     O                                   59 'PLAN'
     O                                   80 'DAY BEFORE'
     O                                   95 'LAST ORDER'
     O        E  2             HY
     O                                    8 'LOCATION'
     O                                   21 'PART CODE'
     O                                   35 'PART NO.'
     O                                   48 'SETTING'
     O                                   61 'PLUS BOX'
     O                                   68 'BOX'
     O                                   79 'ACTUAL'
     O                                   89 'ORDER#'
     O                                   98 'BOXES'
     O        E  1             MY
     O                         @LOC1      1
     O                                    2 '-'
     O                         @LOC2      4
     O                                    5 '-'
     O                         @LOC3      7
     O                                    8 '-'
     O                         @LOC4      9
     O                         IBSEIH    17
     O                         IBHIN1    29
     O                                   30 '-'
     O                         IBHIN2    35
     O                                   36 '-'
     O                         IBHIN3    38
     O                         @DBOX 2   45
     O                         @PMAIS4   60
     O                         IBMAIS2   68
     O                         W@ABX54   79
     O                         @ORDR     89
     O                         @MAIS 4   98
     O        E 11             TY
     O                                   40 '*** TOTAL BOXES'
     O                         BOXALL1   56
