     H            Y/
     F***************************************************
     F* ACZ PART/WASHER WITHOUT ORDER SUMMARY RECORDS   *
     F*        08/02/01 (TCH)                           *
     F*                                                 *
     F* TCHK  10/05/12 CREATE(COPY FROM GDGR17)         *
     F***************************************************
     FFCEPL01 IF  E           K        DISK
     FFCEPL11 IF  E           K        DISK
     FGDKPL02 IF  E           K        DISK
     FGTBPL10 IF  E           K        DISK
     FAKBPL04 IF  E           K        DISK
     FMCENP13 IF  E           K        DISK
     FAZAPP51 IF  E           K        DISK
     FAB#PL18 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FGTBPL19 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *------------------------------------------------------------
     E                    TTL     1   2 23
      *------------------------------------------------------------
     I            DS
     I                                        1  140W@TIME
     I                                        1   60W@HMS
     I                                        7  140W@YMD
     I                                        7  100W@YY
     I                                       11  120W@MM
     I                                       13  140W@DD
     I            DS
     I                                        1   60@@MDY
     I                                        1   20@@MM
     I                                        3   40@@DD
     I                                        5   60@@YY
     I            DS
     I                                        1  20 A2KEY
     I                                        1   5 A2BHB1
     I                                        6  10 A2BHB2
     I                                       11  12 A2BHB3
     I                                       13  20 BLANK
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80ABYMD
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
      * PART
     C                     EXSR #OUT1
      * WASHER
TCHK C*                    EXSR #OUT2
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#GL1     KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C           K#GL2     KLIST
     C                     KFLD           L1SHN1
     C                     KFLD           L1SHN2
     C                     KFLD           L1SHN3
     C           K#MC      KLIST
     C                     KFLD           K@SHN1
     C                     KFLD           K@SHN2
     C                     KFLD           K@SHN3
     C           K#AB      KLIST
     C                     KFLD           K@SHN1
     C                     KFLD           K@SHN2
     C                     KFLD           K@SHN3
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#ABX     KLIST
     C                     KFLD           K@SHN1
     C                     KFLD           K@SHN2
     C                     KFLD           K@SHN3
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *
     C                     TIME           W@TIME
     C                     Z-ADDW@YY      @@YY
     C                     Z-ADDW@MM      @@MM
     C                     Z-ADDW@DD      @@DD
     C                     MOVE *BLANK    A2KEY
     C                     MOVE *ALL'-'   @@LIN1100
     C                     MOVE *ALL'-'   @@LIN2 66
     C           *LIKE     DEFN MCSHN1    K@SHN1
     C           *LIKE     DEFN MCSHN2    K@SHN2
     C           *LIKE     DEFN MCSHN3    K@SHN3
      *
     C                     Z-ADD*DATE     K@YMD
     C           K#AGD     SETLLAGDPL12
     C                     Z-ADD*ZERO     M       30
     C           *IN90     DOUEQ*ON
     C                     READPAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     Z-ADDF8KAYY    K@YY
     C                     Z-ADDF8KAMM    K@MM
     C                     Z-ADDF8KADD    K@DD
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   PART
      *------------------------------------------------------
     C           #OUT1     BEGSR
      *
     C                     MOVE *OFF      *IN98
     C                     MOVELTTL,1     HEDR   23
     C                     MOVE *ON       *IN50
      *
     C           *IN80     DOUEQ*ON
     C                     READ FCEPL01                  80
     C           *IN80     IFEQ *OFF
     C           A2GSKD    ANDEQ*BLANK
      * IMPORT?
      * SUPPLIER IS '0170'?
     C           A2KEY     CHAINGDKPL02              91
     C           *IN91     IFEQ *ON
TCHK C           ISVEND    ORNE '0170'
     C                     ITER
     C                     ENDIF
      *
      * ALREADY READ?
     C           K#GL1     CHAINGTBPL10              91
     C           *IN91     IFEQ *OFF
     C                     ITER
     C                     ENDIF
      * THEN OUTPUT
     C                     Z-ADD*ZERO     @MAIS
     C                     MOVEL*BLANK    @ORDR   6
     C           K#GL1     SETGTGTBPL19
     C           *IN91     DOUEQ*ON
     C           K#GL1     REDPEGTBPL19                  91
     C           *IN91     IFEQ *OFF
     C           ICSKJY    ANDEQ*BLANK
     C                     Z-ADDICMAIS    @MAIS   50
     C                     MOVELICODER    @ORDR
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     EXSR #PRT1
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   OUTPUT THE LIST
      *------------------------------------------------------
     C           #PRT1     BEGSR
      *
     C  N98
     COR OF                EXCPT@HED1
     C  N98                MOVE *ON       *IN98
      *
     C           A2BHB2    COMP *BLANK               0101
     C           A2BHB3    COMP *BLANK               0202
      *
      * DAILY USAGE X 5 = WEEKLY USAGE
     C           K#GL1     CHAINFCEPL11              90
     C           *IN90     IFEQ *OFF
     C           FCCD01    ANDNE*ZERO
     C           FCGK01    DIV  FCCD01    @@WQY   70
     C           @@WQY     DIV  A2SSYS    @@BOX   72
      *
     C           K#GL1     CHAINAZAPP51              95
      *
     C                     MOVE A2BHB1    K@SHN1
     C                     MOVE A2BHB2    K@SHN2
     C                     MOVE A2BHB3    K@SHN3
     C                     Z-ADD*ZERO     @SHQY
     C                     EXSR #ACT
     C           A2SSYS    IFNE *ZERO
     C           @SHQY     DIV  A2SSYS    @@ABOX  72
     C                     ENDIF
      *
     C                     EXCPT@DTL1
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   WASHER
      *------------------------------------------------------
     C           #OUT2     BEGSR
      *
     C                     MOVE *OFF      *IN98
     C                     MOVELTTL,2     HEDR   23
     C                     MOVE *OFF      *IN50
      *
     C           *IN80     DOUEQ*ON
     C                     READ AKBPL04                  80
     C           *IN80     IFEQ *OFF
     C           L1SKJY    ANDEQ*BLANK
     C           L1STYY    ANDEQ9999
     C           L1BMON    ANDEQ8990
      *
      * ALREADY READ?
     C           K#GL2     CHAINGTBPL10              91
     C           *IN91     IFEQ *OFF
     C                     ITER
     C                     ENDIF
      * THEN OUTPUT
      * THEN OUTPUT
     C                     Z-ADD*ZERO     @MAIS
     C                     MOVEL*BLANK    @ORDR
     C           K#GL2     SETGTGTBPL19
     C           *IN91     DOUEQ*ON
     C           K#GL2     REDPEGTBPL19                  91
     C           *IN91     IFEQ *OFF
     C           ICSKJY    ANDEQ*BLANK
     C                     Z-ADDICMAIS    @MAIS   50
     C                     MOVELICODER    @ORDR
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     EXSR #PRT2
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   OUTPUT THE LIST
      *------------------------------------------------------
     C           #PRT2     BEGSR
      *
     C  N98
     COR OF                EXCPT@HED1
     C  N98                MOVE *ON       *IN98
      *
     C           L1SHN2    COMP *BLANK               0101
     C           L1SHN3    COMP *BLANK               0202
      *
      * DAILY USAGE X 5 = WEEKLY USAGE
     C                     Z-ADD*ZERO     W@QTY   90
     C                     Z-ADD*ZERO     @SHQY   90
     C           K#GL2     SETLLMCENP13
     C           *IN98     DOUEQ*ON
     C           K#GL2     READEMCENP13                  98
B01  C           *IN98     IFEQ *OFF
     C                     MOVE MCSHN1    K@SHN1
     C                     MOVE MCSHN2    K@SHN2
     C                     MOVE MCSHN3    K@SHN3
     C                     EXSR #USG
     C                     EXSR #ACT
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADDW@QTY     @@WQY   70
     C           @@WQY     DIV  L1SYOS    @@BOX   72
     C           L1SYOS    IFNE *ZERO
     C           @SHQY     DIV  L1SYOS    @@ABOX  72
     C                     ENDIF
      *
     C                     EXCPT@DTL2
      *
     C                     ENDSR
      *------------------------------------------------------
      *   DAILY USAGE
      *------------------------------------------------------
     C           #USG      BEGSR
      *
     C           K#MC      CHAINFCEPL11              90
     C           *IN90     IFEQ *OFF
     C           FCCD01    ANDNE*ZERO
     C           FCGK01    DIV  FCCD01    @@QTY   70
     C                     ADD  @@QTY     W@QTY
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------------
      *  ACTUAL
      *-----------------------------------------------------------
     C           #ACT      BEGSR
      *
     C           K#AB      SETLLAB#PL18
     C           *IN91     DOUEQ*ON
     C           K#ABX     READEAB#PL18                  91
     C           *IN91     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           ABYMD     IFGE *DATE
     C                     LEAVE
     C                     ENDIF
      *
     C                     ADD  BASRYO    @SHQY
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
     OQPRINT  E   01           @HED1
     O                         #PGM       8
     O                         @@MDY Y   59
     O                                   62 'P.'
     O                         PAGE  Z   66
     O        E   02           @HED1
     O                         HEDR      43
     O                         W@HMS     59 '  :  :  '
     O        E   04           @HED1
     O                                   44 'DAYLY'
     O                                   60 'DAYLY'
     O        E   05           @HED1
     O                                   32 'UNIT'
     O                                   46 'NECESSARY'
     O                                   62 'NECESSARY'
     O                                   78 'ACTUAL'
     O                                   96 'LATEST ORDER'
     O        E   06           @HED1
     O                                    6 'PART#:'
     O                                   18 'LOC'
     O                                   32 'QTY'
     O                                   46 'QTY(PCS)'
     O                                   62 'QTY(BOXES)'
     O                                   78 'QTY(BOXES)'
     O                                   89 'ORDER#'
     O                                   99 'BOXES'
     O        E   07           @HED1
     O                         @@LIN1   100
     O        E 1              @DTL1
     O                         A2BHB1     5
     O                       01           6 '-'
     O                         A2BHB2    11
     O                       02          12 '-'
     O                         A2BHB3    14
     O                         A2STRK    16
     O                                   17 '-'
     O                         A2STRT    19
     O                                   20 '-'
     O                         A2STRR    22
     O                                   23 '-'
     O                         A2STRD    24
     O                         A2SSYS1   32
     O                         @@WQY 1   46
     O                         @@BOX 1   62
     O                         @@ABOX1   78
     O                         @ORDR     89
     O                         @MAIS 1   98
     O        E 1              @DTL2
     O                         L1SHN1     5
     O                       01           6 '-'
     O                         L1SHN2    11
     O                       02          12 '-'
     O                         L1SHN3    14
     O                         L1TKR1    16
     O                                   17 '-'
     O                         L1TKR2    19
     O                                   20 '-'
     O                         L1TKR3    22
     O                                   23 '-'
     O                         L1TKR4    24
     O                         L1SYOS1   32
     O                         @@WQY 1   46
     O                         @@BOX 1   62
     O                         @@ABOX1   78
     O                         @ORDR     89
     O                         @MAIS 1   98
** TTL
 ACZ PARTS NOT SCANNED
ACZ WASHERS NOT SCANNED
