      ***** GTBR12 ***************************************************
      * ACZ ORDER FIXED HANDING / GET OF ORDER NUMBER
      *     G.B.C                        97/02/21
      *
      * TCHK  10/05/12 CREATE(COPY FROM GDGR12)
      ****************************************************************
     H            Y/                                    1
     FGTBPW12 CF  E                    WORKSTN
     FGTBPL30 UF  E           K        DISK                      A
     FGTBPL10 UF  E           K        DISK                      A
     FGTCPP05 UF  E                    DISK
     FFCEPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
      *----------------------------------------------------------------
     E                    HTP        31  3 0             +箱数BTAPP05
     E                    HTM        31  3 0             -箱数BTAPP05
     E                    HTZ        31  1               割振BTAPP05
%0001E                    MSG     1   8 59               d[ｰ xｮﾈｰﾆﾞ
      *----------------------------------------------------------------
     I            DS
     I                                        1  93 HTP
     I                                        1   30GTPH01
     I                                        4   60GTPH02
     I                                        7   90GTPH03
     I                                       10  120GTPH04
     I                                       13  150GTPH05
     I                                       16  180GTPH06
     I                                       19  210GTPH07
     I                                       22  240GTPH08
     I                                       25  270GTPH09
     I                                       28  300GTPH10
     I                                       31  330GTPH11
     I                                       34  360GTPH12
     I                                       37  390GTPH13
     I                                       40  420GTPH14
     I                                       43  450GTPH15
     I                                       46  480GTPH16
     I                                       49  510GTPH17
     I                                       52  540GTPH18
     I                                       55  570GTPH19
     I                                       58  600GTPH20
     I                                       61  630GTPH21
     I                                       64  660GTPH22
     I                                       67  690GTPH23
     I                                       70  720GTPH24
     I                                       73  750GTPH25
     I                                       76  780GTPH26
     I                                       79  810GTPH27
     I                                       82  840GTPH28
     I                                       85  870GTPH29
     I                                       88  900GTPH30
     I                                       91  930GTPH31
     I            DS
     I                                        1  93 HTM
     I                                        1   30GTMH01
     I                                        4   60GTMH02
     I                                        7   90GTMH03
     I                                       10  120GTMH04
     I                                       13  150GTMH05
     I                                       16  180GTMH06
     I                                       19  210GTMH07
     I                                       22  240GTMH08
     I                                       25  270GTMH09
     I                                       28  300GTMH10
     I                                       31  330GTMH11
     I                                       34  360GTMH12
     I                                       37  390GTMH13
     I                                       40  420GTMH14
     I                                       43  450GTMH15
     I                                       46  480GTMH16
     I                                       49  510GTMH17
     I                                       52  540GTMH18
     I                                       55  570GTMH19
     I                                       58  600GTMH20
     I                                       61  630GTMH21
     I                                       64  660GTMH22
     I                                       67  690GTMH23
     I                                       70  720GTMH24
     I                                       73  750GTMH25
     I                                       76  780GTMH26
     I                                       79  810GTMH27
     I                                       82  840GTMH28
     I                                       85  870GTMH29
     I                                       88  900GTMH30
     I                                       91  930GTMH31
     I            DS
     I                                        1  31 H
     I                                        1   1 GTZM01
     I                                        2   2 GTZM02
     I                                        3   3 GTZM03
     I                                        4   4 GTZM04
     I                                        5   5 GTZM05
     I                                        6   6 GTZM06
     I                                        7   7 GTZM07
     I                                        8   8 GTZM08
     I                                        9   9 GTZM09
     I                                       10  10 GTZM10
     I                                       11  11 GTZM11
     I                                       12  12 GTZM12
     I                                       13  13 GTZM13
     I                                       14  14 GTZM14
     I                                       15  15 GTZM15
     I                                       16  16 GTZM16
     I                                       17  17 GTZM17
     I                                       18  18 GTZM18
     I                                       19  19 GTZM19
     I                                       20  20 GTZM20
     I                                       21  21 GTZM21
     I                                       22  22 GTZM22
     I                                       23  23 GTZM23
     I                                       24  24 GTZM24
     I                                       25  25 GTZM25
     I                                       26  26 GTZM26
     I                                       27  27 GTZM27
     I                                       28  28 GTZM28
     I                                       29  29 GTZM29
     I                                       30  30 GTZM30
     I                                       31  31 GTZM31
     I            DS
     I                                        1   6 D1ODER
     I                                        1   20D1ODR1
     I                                        3   40D1ODR2
     I                                        5   6 D1ODR3
     I            DS
     I                                        1   80W1DATE
     I                                        1   40W1YEAR
     I                                        5   60W1MONT
     I                                        7   80W1DAY
     I            DS
     I                                        1   60@@TIME
     I                                        1   40@TIME
     I            DS
     I                                        1   80IFKOHZ
     I                                        1   40IFKOYY
     I                                        5   60IFKOMM
     I                                        7   80IFKODD
     I            DS
     I                                        1   40IFKOTM
     I                                        1   20IFKOHH
     I                                        3   40IFKOSS
     I            DS
     I                                        1   80$WYMD
     I                                        1   60$WYM
     I                                        7   80$WDD
     I            DS
     I                                        1   80@WYMD
     I                                        1   60@WYM
     I                                        1   40@WYY
     I                                        5   60@WMM
     I            DS
     I                                        1   80IBSKHZ
     I                                        1   40IBSKYY
     I                                        5   60IBSKMM
     I                                        7   80IBSKDD
     I            DS
     I                                        1   80IBKOHZ
     I                                        1   40IBKOYY
     I                                        5   60IBKOMM
     I                                        7   80IBKODD
     I            DS
     I                                        1   60IBKOTM
     I                                        1   20IBKOHH
     I                                        3   40IBKOSS
     I            DS
     I                                        1   80GTSKHZ
     I                                        1   40GTSKYY
     I                                        5   60GTSKMM
     I                                        7   80GTSKDD
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     C****************************************************************
     C*   MAIN
     C****************************************************************
     C           KEY1      KLIST
     C                     KFLD           GTSHN1
     C                     KFLD           GTSHN2
     C                     KFLD           GTSHN3
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *
     C                     Z-ADD*DATE     K@YMD
     C           K#AGD     CHAINAGDPL12              90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDF8YOBI    @YOBI   10
     C                     ENDIF
      *
     C           *ENTRY    PLIST
     C                     PARM           PPUSER 10
     C                     PARM           PPGO    2
     C                     PARM           PPRNTR  8
     C*
     C                     EXSR #INIT
%0001C* ORDER DATA CHECK
  I  C                     MOVE *BLANK    DATAS1  1        PARTS
  I  C                     EXSR #DATA
  I  C* PARTS NOTHING
  I  C           DATAS1    IFEQ *BLANK
  I  C                     MOVELMSG,7     D#MSG
  I  C                     EXFMTDSP02
  I  C                     GOTO @END
  I  C                     END
  I  C* PARTS NOTHING
  I  C           DATAS1    IFEQ *BLANK
  I  C                     MOVELMSG,2     D#MSG
  I  C           @LOOP1    TAG
  I  C                     EXFMTDSP02
  I  C           *INKA     IFEQ '1'
  I  C                     GOTO @END
  I  C                     END
  I  C           *INKL     IFEQ '1'
  I  C                     GOTO @EXIT1
  I  C                     END
  I  C                     GOTO @LOOP1
  I  C           @EXIT1    TAG
%0001C                     END
     C*
     C           @EXIT3    TAG
     C*
     C           @DSP01    TAG
     C                     EXFMTDSP01
     C                     MOVEA'0000'    *IN,11
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    D#MSG
     C* < F1=ON >
     C           *INKA     CABEQ'1'       @END
     C*
     C                     EXSR #CHK01
     C           *IN99     CABEQ'1'       @DSP01
     C* < F5=OFF >
     C           *INKE     CABEQ'0'       @DSP01
     C*
     C* eｰjﾞｰNO ﾈｮn
     C                     TIME           @@TIME
     C           'ORDER '  CHAINGTBPL301             10
     C           *IN10     IFEQ '0'
     C                     Z-ADD*DATE     IFKOHZ
     C                     Z-ADD@TIME     IFKOTM
     C                     MOVELPPUSER    IFKOME
     C                     MOVE D1ODR3    IFNO
     C                     Z-ADDUMONTH    IFMONT
     C                     Z-ADDW1YEAR    IFYEAR
     C                     UPDATGTBPL301
     C                     END
     C                     MOVE 'GO'      PPGO
      *
     C* <END>
     C           @END      TAG
     C                     SETON                     LR
     C                     RETRN
     C****************************************************************
     C           #INIT     BEGSR                                     *
     C****************************************************************
     C**INIT
     C                     MOVE 'NG'      PPGO
     C                     Z-ADD*DATE     W1DATE
     C*
     C                     MOVEA'000'     *IN,11
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    D#MSG
     C                     Z-ADDUYEAR     D1ODR1
     C                     Z-ADDUMONTH    D1ODR2
     C*
     C                     TIME           @@TIME
     C           'ORDER '  CHAINGTBPL301             10
     C           *IN10     IFEQ '1'
     C                     MOVE *BLANK    IFSKJY
     C                     Z-ADD0         IFSKYY
     C                     Z-ADD0         IFSKMM
     C                     Z-ADD0         IFSKDD
     C                     Z-ADD*DATE     IFKOHZ
     C                     Z-ADD@TIME     IFKOTM
     C                     MOVELPPUSER    IFKOME
     C                     MOVEL'ORDER '  IFKEY
     C                     Z-ADD*ZERO     IFNO
     C                     Z-ADD0         IFMONT
     C                     Z-ADDW1YEAR    IFYEAR
     C                     END
     C           IFMONT    IFNE UMONTH
     C                     Z-ADD*ZERO     IFNO
     C                     Z-ADDUMONTH    IFMONT
     C                     Z-ADDW1YEAR    IFYEAR
     C                     END
     C   10                WRITEGTBPL301
     C           IFNO      IFEQ 9
     C                     Z-ADD1         IFNO
     C                     ELSE
     C                     ADD  1         IFNO
     C                     END
     C                     MOVEL'Z'       D1ODR3
     C                     MOVE IFNO      D1ODR3
      *
     C                     MOVE '1'       D@PRT
     C*
     C                     ENDSR
     C****************************************************************
     C           #CHK01    BEGSR                                     *
     C****************************************************************
     C**DSP1 CHECK
      *
     C           D1ODR1    IFEQ 0
     C                     MOVEA'111'     *IN,11
     C  N99                MOVELMSG,1     D#MSG
     C  N99                MOVEA'1'       *IN,99
     C                     GOTO @CHK1E
     C                     END
      *
     C           D1ODR2    IFLT 1
     C           D1ODR2    ORGT 12
     C                     MOVEA'1'       *IN,12
     C  N99                MOVELMSG,1     D#MSG
     C  N99                MOVEA'1'       *IN,99
     C                     GOTO @CHK1E
     C                     END
      *
     C           D1ODR3    IFEQ *BLANK
     C                     MOVEA'1'       *IN,13
     C  N99                MOVELMSG,1     D#MSG
     C  N99                MOVEA'1'       *IN,99
     C                     GOTO @CHK1E
     C                     END
      *
     C           D@PRT     IFLT '1'
     C           D@PRT     ORGT '3'
     C                     MOVE *ON       *IN14
     C  N99                MOVELMSG,8     D#MSG
     C  N99                MOVE *ON       *IN99
     C                     ELSE
     C                     SELEC
     C           D@PRT     WHEQ '1'
     C                     MOVEL'LANPRT03'PPRNTR
     C           D@PRT     WHEQ '2'
     C                     MOVEL'LANPRT02'PPRNTR
     C           D@PRT     WHEQ '3'
     C                     MOVEL'LANPRT07'PPRNTR
     C                     ENDSL
     C                     ENDIF
      *
     C           @CHK1E    ENDSR
      *
     C****************************************************************
     C           #SUB0     BEGSR                                     *
     C****************************************************************
     C                     Z-ADD*DATE     $WYMD
     C                     Z-ADD*DATE     @WYMD
     C           @WMM      IFEQ 01
     C                     SUB  1         @WYY
     C                     Z-ADD12        @WMM
     C                     ELSE
     C                     SUB  1         @WMM
     C                     END
      *
     C                     DO   *HIVAL
     C                     SETOF                     1052
     C                     READ GTCPP051                 10
     C           *IN10     IFEQ '0'
      *
     C           GTSKJY    IFEQ 'D'
     C           GTSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETOF                     50
     C                     Z-ADD0         WWMAIS  50
     C           KEY1      CHAINGTBPL101             50
     C           *IN50     IFEQ '0'
     C           IBSKJY    ANDEQ'D'
     C           IBSKHZ    ANDLE*DATE
     C                     SETON                     50
     C                     END
     C           *IN50     IFEQ '0'
     C                     Z-ADDIBMAIS    WWMAIS
     C                     END
      *
     C           @WYM      IFEQ GTKEYM
      *
     C                     Z-ADD1         U
     C                     Z-ADD0         WPSU    50
     C           1         DO   31        U
     C           HTZ,U     IFEQ *BLANK
     C           HTP,U     IFNE 0
     C                     SETON                     52
     C                     ADD  HTP,U     WWMAIS
     C                     ADD  HTP,U     WPSU
     C                     MOVE '*'       HTZ,U
     C                     END
     C                     END
     C                     END
      *
     C                     Z-ADD1         U       20
     C                     Z-ADD0         WMSU    50
     C                     Z-ADD0         WMSU1   50
     C           1         DO   31        U
     C           HTZ,U     IFEQ *BLANK
     C           HTM,U     IFNE 0
     C                     Z-ADDHTM,U     WMSU2   50
     C                     Z-SUBHTM,U     WMSU3   50
     C           WWMAIS    IFGE WMSU2
     C                     SETON                     52
     C                     ADD  WMSU3     WWMAIS
     C                     ADD  HTM,U     WMSU1
     C                     Z-SUBWMSU1     WMSU
     C                     MOVE '*'       HTZ,U
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           *IN52     IFEQ '1'
     C                     UPDATGTCPP051
     C                     EXSR #SUB1
     C                     END
      *
     C                     END
      *
     C           $WYM      IFEQ GTKEYM
      *
     C                     Z-ADD1         U
     C                     Z-ADD0         WPSU
     C           1         DO   $WDD      U
     C           HTZ,U     IFEQ *BLANK
     C           HTP,U     IFNE 0
     C                     SETON                     52
     C                     ADD  HTP,U     WWMAIS
     C                     ADD  HTP,U     WPSU
     C                     MOVE '*'       HTZ,U
     C                     END
     C                     END
     C                     END
      *
     C                     Z-ADD1         U
     C                     Z-ADD0         WMSU
     C                     Z-ADD0         WMSU1
     C           1         DO   $WDD      U
     C           HTZ,U     IFEQ *BLANK
     C           HTM,U     IFNE 0
     C                     Z-ADDHTM,U     WMSU2
     C                     Z-SUBHTM,U     WMSU3
     C           WWMAIS    IFGE WMSU2
     C                     SETON                     52
     C                     ADD  WMSU3     WWMAIS
     C                     ADD  HTM,U     WMSU1
     C                     Z-SUBWMSU1     WMSU
     C                     MOVE '*'       HTZ,U
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           *IN52     IFEQ '1'
     C                     UPDATGTCPP051
     C                     EXSR #SUB1
     C                     END
      *
     C                     END
      *
     C                     END
     C                     END
     C  N10                END
      *
     C                     ENDSR
      *
     C****************************************************************
     C           #SUB1     BEGSR                                     *
     C****************************************************************
     C                     SETOF                     50
     C           KEY1      CHAINGTBPL101             50
      *
     C                     MOVE *BLANK    IBSKJY
     C                     Z-ADD0         IBSKHZ
     C                     Z-ADD*DATE     IBKOHZ
     C                     TIME           IBKOTM
     C                     MOVELPPUSER    IBKOME
      *
     C           WPSU      ADD  WMSU      $WMAIS  50
      *
     C           *IN50     IFEQ '0'
     C                     ADD  $WMAIS    IBMAIS
     C           IBSYOS    MULT IBMAIS    IBSURY
     C                     UPDATGTBPL101
     C                     ELSE
      *
     C                     MOVE *BLANK    IBSEIH
     C                     MOVE GTSHN1    IBHIN1
     C                     MOVE GTSHN2    IBHIN2
     C                     MOVE GTSHN3    IBHIN3
      *
     C                     SETOF                     51
     C                     Z-ADD0         IBSYOS
     C           KEY1      CHAINFCEPL011             51
     C           *IN51     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     51
     C                     END
     C           *IN51     IFEQ '0'
     C           A2SYHZ    IFGT *DATE
     C                     Z-ADDA2KSYS    IBSYOS
     C                     ELSE
     C                     Z-ADDA2SSYS    IBSYOS
     C                     END
     C                     END
      *
     C                     Z-ADD$WMAIS    IBMAIS
     C           IBSYOS    MULT IBMAIS    IBSURY
     C                     WRITEGTBPL101
      *
     C                     END
     C                     ENDSR
      *
     C****************************************************************
     C           #DATA     BEGSR                                     *
     C****************************************************************
      *
     C           #DATA0    TAG
     C                     READ GTBPL101                 10
     C   10                GOTO #DATA1
     C           IBSKJY    IFEQ 'D'
     C           IBSKHZ    ANDLE*DATE                                  )
     C                     GOTO #DATA0
     C                     ENDIF
%0001C                     MOVE '*'       DATAS1
     C*
     C           #DATA1    TAG
     C           #DATA9    ENDSR
**  MSG
 INCORRECT ORDER NUMBER.
 THERE IS NOT DATA.(PARTS) (EXEC.= F12)
 ECECUTE PARTS&DIE ORDER DATA SAMMARY PROC.(CANCEL ONLY)
 ECECUTE PARTS ORDER DATA SAMMARY PROCESS (EXEC.= F12)
 ECECUTE DIE ORDER DATA SAMMARY PROCESS (EXEC.= F12)
 THERE IS NOT DATA.(DIE) (EXEC.= F12)
 THERE IS NOT DATA.(PARTS & DIE)(CANCEL ONLY)
 SELECT A PRINTER.
