     H            Y.
     F** GTCR41 ********************************************
     F* ACZ INQUIRY OF ACZ IMPORT ADJUSTMENT FILE          *
     F*      A.MAMIYA        2000.10.13                    *
     F*                                                    *
     F* TCHK  10/04/12 CREATE(COPY FROM BTAR41)            *
     F******************************************************
     FGTCPW41 CF  E                    WORKSTN
     FGTCPP41 UF  E           K        DISK                      A
     FFCEPL01 IF  E           K        DISK
     FAKCPL01 IF  E           K        DISK
     E                    ER      1  10 60
     E                    #KOKB   1   3  1   #KONM  10
     I            DS
     I                                        1   80G4SKHZ
     I                                        1   40G4SKYY
     I                                        5   60G4SKMM
     I                                        7   80G4SKDD
     I            DS
     I                                        1   80G4KOHZ
     I                                        1   40G4KOYY
     I                                        5   60G4KOMM
     I                                        7   80G4KODD
     I            DS
     I                                        1   60G4KOTI
     I                                        1   20G4KOHH
     I                                        3   40G4KOSS
     I            DS
     I                                        1  12 @HIN
     I                                        1   5 @HIN1
     I                                        6  10 @HIN2
     I                                       11  12 @HIN3
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
      ****************
      *    PARM      *
      ****************
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *--------*
      *初期化*
      *--------*
     C           @STP0     TAG
     C                     MOVE *BLANK    @KOKB
     C                     MOVE *BLANK    @HIN
     C                     Z-ADD0         @MAIS
     C                     MOVE *BLANK    MSG
      *--------*
      *画面１*
      *--------*
     C           @STP1     TAG
     C                     EXFMTGTCPW411
     C                     SETOF                     010203
     C                     SETOF                     3399
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      ****************
      *   d[ｰkｩｮh    *
      ****************
     C           @KOKB     IFEQ *BLANK
     C                     MOVELER,1      MSG
     C                     SETON                     0199
     C                     GOTO @STP1
     C                     END
      *
     C           @KOKB     IFNE '0'
     C           @KOKB     ANDNE'1'
     C           @KOKB     ANDNE'2'
     C                     MOVELER,2      MSG
     C                     SETON                     0199
     C                     GOTO @STP1
     C                     END
      *
     C           @HIN      IFEQ *BLANK
     C                     MOVELER,5      MSG
     C                     SETON                     0299
     C                     GOTO @STP1
     C                     END
      *
     C           KEY1      KLIST
     C                     KFLD           @HIN1
     C                     KFLD           @HIN2
     C                     KFLD           @HIN3
      *
     C           KEY1      CHAINGTCPP411             10
     C           @KOKB     IFEQ '0'
     C           @KOKB     OREQ '1'
     C           *IN10     IFEQ '1'
     C                     MOVELER,3      MSG
     C                     SETON                     0299
     C                     GOTO @STP1
     C                     END
     C                     END
      *
     C           @KOKB     IFEQ '0'
     C           @KOKB     OREQ '1'
     C           *IN10     IFEQ '0'
     C           G4SKJY    IFEQ 'D'
     C           G4SKHZ    ANDLE*DATE
     C                     MOVELER,3      MSG
     C                     SETON                     0299
     C                     GOTO @STP1
     C                     END
     C                     END
     C                     END
      *
     C           @KOKB     IFEQ '2'
      *
     C           *IN10     IFEQ '0'
     C           G4SKJY    IFEQ 'D'
     C           G4SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELER,4      MSG
     C                     SETON                     0299
     C                     GOTO @STP1
     C                     END
     C                     END
      *
     C                     SETOF                     20
     C           KEY1      CHAINFCEPL011             20
     C           *IN20     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     20
     C                     END
      * AKCPL01
     C                     SETOF                     29
     C           KEY1      CHAINAKCPL011             29
     C           *IN29     IFEQ '0'
     C           M1SKJY    ANDEQ'D'
     C           M1SKHZ    ANDLE*DATE
     C                     SETON                     29
     C                     END
      *
     C           *IN20     IFEQ '1'
     C           *IN29     ANDEQ'1'
     C                     SETON                     0299
     C                     MOVELER,7      MSG
     C                     GOTO @STP1
     C                     END
      *
     C                     END
      *--------*
      *画面２*
      *--------*
     C           @KOKB     IFEQ '0'
     C                     SETON                     33
     C                     END
     C           @KOKB     IFEQ '0'
     C           @KOKB     OREQ '1'
     C                     Z-ADDG4MAIS    @MAIS
     C                     END
      *
     C                     SETOF                     11
     C                     Z-ADD1         A       20
     C           @KOKB     LOKUP#KOKB,A                  11
     C           *IN11     IFEQ '1'
     C                     MOVE #KONM,A   @KONM
     C                     END
      *
     C           @STP2     TAG
     C                     EXFMTGTCPW412
     C                     SETOF                     010203
     C                     SETOF                     99
      *-------*
      * CMD-3 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO @STP0
     C                     END
      *
     C           @MAIS     IFEQ 0
     C                     MOVELER,6      MSG
     C                     SETON                     0399
     C                     GOTO @STP2
     C                     END
      *-------*
      * CMD-5 *
      *-------*
     C           *INKE     IFEQ '0'
     C                     GOTO @STP2
     C                     END
      *------*
      *取消*
      *------*
     C           @KOKB     IFEQ '0'
     C                     DELETGTCPP411
     C                     END
      *------------*
      *変更・追加*
      *------------*
     C           @KOKB     IFEQ '1'
     C           @KOKB     OREQ '2'
     C                     MOVE *BLANK    G4SKJY
     C                     Z-ADD0         G4SKHZ
     C                     Z-ADD*DATE     G4KOHZ
     C                     TIME           G4KOTI
     C                     MOVELUS        G4KOME
     C                     MOVEL@MAIS     G4MAIS
     C                     END
      *------*
      *更新*
      *------*
     C           @KOKB     IFNE '0'
     C           *IN10     IFEQ '1'
     C                     MOVEL@HIN1     G4SHN1
     C                     MOVEL@HIN2     G4SHN2
     C                     MOVEL@HIN3     G4SHN3
     C                     WRITEGTCPP411
     C                     ELSE
     C                     UPDATGTCPP411
     C                     END
     C                     END
      *
     C                     GOTO @STP0
      *
**
E-01 INPUT UPDATE INSTRUCTION
E-02 UPDATE INSTRUCTION IS WRONG
E-03 THERE IS NOT PART NO INPUT INTO IN ADJUSTMENT M/F
E-04 THERE IS DATA
E-05 INPUT PART NO
E-06 INPUT KANBAN OF MINUS ADJUSTMEN
E-07 THERE ISN'T IT IN PART NO MANAGEMENT M/F
**  #KOKB/#KONM
00-CANCEL
11-CHANGE
22-ADD
