     H            Y/
     F***************************************************
     F*   UPDATE IMPORT ORDER SCHEDULE                    *
     F*                                                 *
     F* TCHK0 03/05/07 CHG ORA & DT1 25 --> 30          *
     F* TCHK1 01/01/08 CHG 0002 TO 8990                 *
     F* TCHK2 06/05/09 CHG ORA & DT1 30 --> 90          *
     F* TCHK3 02/20/14 CHG ORS & DT2 25 --> 45          *
     F***************************************************
     FGWCALP3 IF  E                    DISK
     FGWSCDP3 IF  E                    DISK
     FBTBPL05 UF  E           K        DISK                      A
      *------------------------------------------------------------
     E                    #PH        31  3 0             BTBPP05 +
     E                    #MH        31  3 0             BTBPP05 -
     E                    #ZM        31  1                BTBPL05
TCHK2E                    DT1        90  8 0
TCHK3E                    DT2        90  8 0
TCHK2E                    ORA        90  3 0
TCHK3E                    ORS        90  3 0
      *------------------------------------------------------------
     I            DS
TCHK2I                                        1 270 ORA
     I                                        1   30ORA01
     I                                        4   60ORA02
     I                                        7   90ORA03
     I                                       10  120ORA04
     I                                       13  150ORA05
     I                                       16  180ORA06
     I                                       19  210ORA07
     I                                       22  240ORA08
     I                                       25  270ORA09
     I                                       28  300ORA10
     I                                       31  330ORA11
     I                                       34  360ORA12
     I                                       37  390ORA13
     I                                       40  420ORA14
     I                                       43  450ORA15
     I                                       46  480ORA16
     I                                       49  510ORA17
     I                                       52  540ORA18
     I                                       55  570ORA19
     I                                       58  600ORA20
     I                                       61  630ORA21
     I                                       64  660ORA22
     I                                       67  690ORA23
     I                                       70  720ORA24
     I                                       73  750ORA25
TCHK0I                                       76  780ORA26
TCHK0I                                       79  810ORA27
TCHK0I                                       82  840ORA28
TCHK0I                                       85  870ORA29
TCHK0I                                       88  900ORA30
TCHK2I                                       91  930ORA31
TCHK2I                                       94  960ORA32
TCHK2I                                       97  990ORA33
TCHK2I                                      100 1020ORA34
TCHK2I                                      103 1050ORA35
TCHK2I                                      106 1080ORA36
TCHK2I                                      109 1110ORA37
TCHK2I                                      112 1140ORA38
TCHK2I                                      115 1170ORA39
TCHK2I                                      118 1200ORA40
TCHK2I                                      121 1230ORA41
TCHK2I                                      124 1260ORA42
TCHK2I                                      127 1290ORA43
TCHK2I                                      130 1320ORA44
TCHK2I                                      133 1350ORA45
TCHK2I                                      136 1380ORA46
TCHK2I                                      139 1410ORA47
TCHK2I                                      142 1440ORA48
TCHK2I                                      145 1470ORA49
TCHK2I                                      148 1500ORA50
TCHK2I                                      151 1530ORA51
TCHK2I                                      154 1560ORA52
TCHK2I                                      157 1590ORA53
TCHK2I                                      160 1620ORA54
TCHK2I                                      163 1650ORA55
TCHK2I                                      166 1680ORA56
TCHK2I                                      169 1710ORA57
TCHK2I                                      172 1740ORA58
TCHK2I                                      175 1770ORA59
TCHK2I                                      178 1800ORA60
TCHK2I                                      181 1830ORA61
TCHK2I                                      184 1860ORA62
TCHK2I                                      187 1890ORA63
TCHK2I                                      190 1920ORA64
TCHK2I                                      193 1950ORA65
TCHK2I                                      196 1980ORA66
TCHK2I                                      199 2010ORA67
TCHK2I                                      202 2040ORA68
TCHK2I                                      205 2070ORA69
TCHK2I                                      208 2100ORA70
TCHK2I                                      211 2130ORA71
TCHK2I                                      214 2160ORA72
TCHK2I                                      217 2190ORA73
TCHK2I                                      220 2220ORA74
TCHK2I                                      223 2250ORA75
TCHK2I                                      226 2280ORA76
TCHK2I                                      229 2310ORA77
TCHK2I                                      232 2340ORA78
TCHK2I                                      235 2370ORA79
TCHK2I                                      238 2400ORA80
TCHK2I                                      241 2430ORA81
TCHK2I                                      244 2460ORA82
TCHK2I                                      247 2490ORA83
TCHK2I                                      250 2520ORA84
TCHK2I                                      253 2550ORA85
TCHK2I                                      256 2580ORA86
TCHK2I                                      259 2610ORA87
TCHK2I                                      262 2640ORA88
TCHK2I                                      265 2670ORA89
TCHK2I                                      268 2700ORA90
     I            DS
     I                                        1 270 ORS
     I                                        1   30ORS01
     I                                        4   60ORS02
     I                                        7   90ORS03
     I                                       10  120ORS04
     I                                       13  150ORS05
     I                                       16  180ORS06
     I                                       19  210ORS07
     I                                       22  240ORS08
     I                                       25  270ORS09
     I                                       28  300ORS10
     I                                       31  330ORS11
     I                                       34  360ORS12
     I                                       37  390ORS13
     I                                       40  420ORS14
     I                                       43  450ORS15
     I                                       46  480ORS16
     I                                       49  510ORS17
     I                                       52  540ORS18
     I                                       55  570ORS19
     I                                       58  600ORS20
     I                                       61  630ORS21
     I                                       64  660ORS22
     I                                       67  690ORS23
     I                                       70  720ORS24
     I                                       73  750ORS25
TCHK3I                                       76  780ORS26
TCHK3I                                       79  810ORS27
TCHK3I                                       82  840ORS28
TCHK3I                                       85  870ORS29
TCHK3I                                       88  900ORS30
TCHK3I                                       91  930ORS31
TCHK3I                                       94  960ORS32
TCHK3I                                       97  990ORS33
TCHK3I                                      100 1020ORS34
TCHK3I                                      103 1050ORS35
TCHK3I                                      106 1080ORS36
TCHK3I                                      109 1110ORS37
TCHK3I                                      112 1140ORS38
TCHK3I                                      115 1170ORS39
TCHK3I                                      118 1200ORS40
TCHK3I                                      121 1230ORS41
TCHK3I                                      124 1260ORS42
TCHK3I                                      127 1290ORS43
TCHK3I                                      130 1320ORS44
TCHK3I                                      133 1350ORS45
TCHK2I                                      136 1380ORS46
TCHK2I                                      139 1410ORS47
TCHK2I                                      142 1440ORS48
TCHK2I                                      145 1470ORS49
TCHK2I                                      148 1500ORS50
TCHK2I                                      151 1530ORS51
TCHK2I                                      154 1560ORS52
TCHK2I                                      157 1590ORS53
TCHK2I                                      160 1620ORS54
TCHK2I                                      163 1650ORS55
TCHK2I                                      166 1680ORS56
TCHK2I                                      169 1710ORS57
TCHK2I                                      172 1740ORS58
TCHK2I                                      175 1770ORS59
TCHK2I                                      178 1800ORS60
TCHK2I                                      181 1830ORS61
TCHK2I                                      184 1860ORS62
TCHK2I                                      187 1890ORS63
TCHK2I                                      190 1920ORS64
TCHK2I                                      193 1950ORS65
TCHK2I                                      196 1980ORS66
TCHK2I                                      199 2010ORS67
TCHK2I                                      202 2040ORS68
TCHK2I                                      205 2070ORS69
TCHK2I                                      208 2100ORS70
TCHK2I                                      211 2130ORS71
TCHK2I                                      214 2160ORS72
TCHK2I                                      217 2190ORS73
TCHK2I                                      220 2220ORS74
TCHK2I                                      223 2250ORS75
TCHK2I                                      226 2280ORS76
TCHK2I                                      229 2310ORS77
TCHK2I                                      232 2340ORS78
TCHK2I                                      235 2370ORS79
TCHK2I                                      238 2400ORS80
TCHK2I                                      241 2430ORS81
TCHK2I                                      244 2460ORS82
TCHK2I                                      247 2490ORS83
TCHK2I                                      250 2520ORS84
TCHK2I                                      253 2550ORS85
TCHK2I                                      256 2580ORS86
TCHK2I                                      259 2610ORS87
TCHK2I                                      262 2640ORS88
TCHK2I                                      265 2670ORS89
TCHK2I                                      268 2700ORS90
     I            DS
TCHK2I                                        1 720 DT1
     I                                        1   80DTA01
     I                                        9  160DTA02
     I                                       17  240DTA03
     I                                       25  320DTA04
     I                                       33  400DTA05
     I                                       41  480DTA06
     I                                       49  560DTA07
     I                                       57  640DTA08
     I                                       65  720DTA09
     I                                       73  800DTA10
     I                                       81  880DTA11
     I                                       89  960DTA12
     I                                       97 1040DTA13
     I                                      105 1120DTA14
     I                                      113 1200DTA15
     I                                      121 1280DTA16
     I                                      129 1360DTA17
     I                                      137 1440DTA18
     I                                      145 1520DTA19
     I                                      153 1600DTA20
     I                                      161 1680DTA21
     I                                      169 1760DTA22
     I                                      177 1840DTA23
     I                                      185 1920DTA24
     I                                      193 2000DTA25
TCHK1I                                      201 2080DTA26
TCHK1I                                      209 2160DTA27
TCHK1I                                      217 2240DTA28
TCHK1I                                      225 2320DTA29
TCHK1I                                      233 2400DTA30
TCHK2I                                      241 2480DTA31
TCHK2I                                      249 2560DTA32
TCHK2I                                      257 2640DTA33
TCHK2I                                      265 2720DTA34
TCHK2I                                      273 2800DTA35
TCHK2I                                      281 2880DTA36
TCHK2I                                      289 2960DTA37
TCHK2I                                      297 3040DTA38
TCHK2I                                      305 3120DTA39
TCHK2I                                      313 3200DTA40
TCHK2I                                      321 3280DTA41
TCHK2I                                      329 3360DTA42
TCHK2I                                      337 3440DTA43
TCHK2I                                      345 3520DTA44
TCHK2I                                      353 3600DTA45
TCHK2I                                      361 3680DTA46
TCHK2I                                      369 3760DTA47
TCHK2I                                      377 3840DTA48
TCHK2I                                      385 3920DTA49
TCHK2I                                      393 4000DTA50
TCHK2I                                      401 4080DTA51
TCHK2I                                      409 4160DTA52
TCHK2I                                      417 4240DTA53
TCHK2I                                      425 4320DTA54
TCHK2I                                      433 4400DTA55
TCHK2I                                      441 4480DTA56
TCHK2I                                      449 4560DTA57
TCHK2I                                      457 4640DTA58
TCHK2I                                      465 4720DTA59
TCHK2I                                      473 4800DTA60
TCHK2I                                      481 4880DTA61
TCHK2I                                      489 4960DTA62
TCHK2I                                      497 5040DTA63
TCHK2I                                      505 5120DTA64
TCHK2I                                      513 5200DTA65
TCHK2I                                      521 5280DTA66
TCHK2I                                      529 5360DTA67
TCHK2I                                      537 5440DTA68
TCHK2I                                      545 5520DTA69
TCHK2I                                      553 5600DTA70
TCHK2I                                      561 5680DTA71
TCHK2I                                      569 5760DTA72
TCHK2I                                      577 5840DTA73
TCHK2I                                      585 5920DTA74
TCHK2I                                      593 6000DTA75
TCHK2I                                      601 6080DTA76
TCHK2I                                      609 6160DTA77
TCHK2I                                      617 6240DTA78
TCHK2I                                      625 6320DTA79
TCHK2I                                      633 6400DTA80
TCHK2I                                      641 6480DTA81
TCHK2I                                      649 6560DTA82
TCHK2I                                      657 6640DTA83
TCHK2I                                      665 6720DTA84
TCHK2I                                      673 6800DTA85
TCHK2I                                      681 6880DTA86
TCHK2I                                      689 6960DTA87
TCHK2I                                      697 7040DTA88
TCHK2I                                      705 7120DTA89
TCHK2I                                      713 7200DTA90
     I            DS
     I                                        1 720 DT2
     I                                        1   80DTS01
     I                                        9  160DTS02
     I                                       17  240DTS03
     I                                       25  320DTS04
     I                                       33  400DTS05
     I                                       41  480DTS06
     I                                       49  560DTS07
     I                                       57  640DTS08
     I                                       65  720DTS09
     I                                       73  800DTS10
     I                                       81  880DTS11
     I                                       89  960DTS12
     I                                       97 1040DTS13
     I                                      105 1120DTS14
     I                                      113 1200DTS15
     I                                      121 1280DTS16
     I                                      129 1360DTS17
     I                                      137 1440DTS18
     I                                      145 1520DTS19
     I                                      153 1600DTS20
     I                                      161 1680DTS21
     I                                      169 1760DTS22
     I                                      177 1840DTS23
     I                                      185 1920DTS24
     I                                      193 2000DTS25
TCHK3I                                      201 2080DTS26
TCHK3I                                      209 2160DTS27
TCHK3I                                      217 2240DTS28
TCHK3I                                      225 2320DTS29
TCHK3I                                      233 2400DTS30
TCHK3I                                      241 2480DTS31
TCHK3I                                      249 2560DTS32
TCHK3I                                      257 2640DTS33
TCHK3I                                      265 2720DTS34
TCHK3I                                      273 2800DTS35
TCHK3I                                      281 2880DTS36
TCHK3I                                      289 2960DTS37
TCHK3I                                      297 3040DTS38
TCHK3I                                      305 3120DTS39
TCHK3I                                      313 3200DTS40
TCHK3I                                      321 3280DTS41
TCHK3I                                      329 3360DTS42
TCHK3I                                      337 3440DTS43
TCHK3I                                      345 3520DTS44
TCHK3I                                      353 3600DTS45
TCHK2I                                      361 3680DTS46
TCHK2I                                      369 3760DTS47
TCHK2I                                      377 3840DTS48
TCHK2I                                      385 3920DTS49
TCHK2I                                      393 4000DTS50
TCHK2I                                      401 4080DTS51
TCHK2I                                      409 4160DTS52
TCHK2I                                      417 4240DTS53
TCHK2I                                      425 4320DTS54
TCHK2I                                      433 4400DTS55
TCHK2I                                      441 4480DTS56
TCHK2I                                      449 4560DTS57
TCHK2I                                      457 4640DTS58
TCHK2I                                      465 4720DTS59
TCHK2I                                      473 4800DTS60
TCHK2I                                      481 4880DTS61
TCHK2I                                      489 4960DTS62
TCHK2I                                      497 5040DTS63
TCHK2I                                      505 5120DTS64
TCHK2I                                      513 5200DTS65
TCHK2I                                      521 5280DTS66
TCHK2I                                      529 5360DTS67
TCHK2I                                      537 5440DTS68
TCHK2I                                      545 5520DTS69
TCHK2I                                      553 5600DTS70
TCHK2I                                      561 5680DTS71
TCHK2I                                      569 5760DTS72
TCHK2I                                      577 5840DTS73
TCHK2I                                      585 5920DTS74
TCHK2I                                      593 6000DTS75
TCHK2I                                      601 6080DTS76
TCHK2I                                      609 6160DTS77
TCHK2I                                      617 6240DTS78
TCHK2I                                      625 6320DTS79
TCHK2I                                      633 6400DTS80
TCHK2I                                      641 6480DTS81
TCHK2I                                      649 6560DTS82
TCHK2I                                      657 6640DTS83
TCHK2I                                      665 6720DTS84
TCHK2I                                      673 6800DTS85
TCHK2I                                      681 6880DTS86
TCHK2I                                      689 6960DTS87
TCHK2I                                      697 7040DTS88
TCHK2I                                      705 7120DTS89
TCHK2I                                      713 7200DTS90
      * BTBPP01
     I            DS
     I                                        1  93 #PH
     I                                        1   30BTPH01
     I                                        4   60BTPH02
     I                                        7   90BTPH03
     I                                       10  120BTPH04
     I                                       13  150BTPH05
     I                                       16  180BTPH06
     I                                       19  210BTPH07
     I                                       22  240BTPH08
     I                                       25  270BTPH09
     I                                       28  300BTPH10
     I                                       31  330BTPH11
     I                                       34  360BTPH12
     I                                       37  390BTPH13
     I                                       40  420BTPH14
     I                                       43  450BTPH15
     I                                       46  480BTPH16
     I                                       49  510BTPH17
     I                                       52  540BTPH18
     I                                       55  570BTPH19
     I                                       58  600BTPH20
     I                                       61  630BTPH21
     I                                       64  660BTPH22
     I                                       67  690BTPH23
     I                                       70  720BTPH24
     I                                       73  750BTPH25
     I                                       76  780BTPH26
     I                                       79  810BTPH27
     I                                       82  840BTPH28
     I                                       85  870BTPH29
     I                                       88  900BTPH30
     I                                       91  930BTPH31
     I            DS
     I                                        1  93 #MH
     I                                        1   30BTMH01
     I                                        4   60BTMH02
     I                                        7   90BTMH03
     I                                       10  120BTMH04
     I                                       13  150BTMH05
     I                                       16  180BTMH06
     I                                       19  210BTMH07
     I                                       22  240BTMH08
     I                                       25  270BTMH09
     I                                       28  300BTMH10
     I                                       31  330BTMH11
     I                                       34  360BTMH12
     I                                       37  390BTMH13
     I                                       40  420BTMH14
     I                                       43  450BTMH15
     I                                       46  480BTMH16
     I                                       49  510BTMH17
     I                                       52  540BTMH18
     I                                       55  570BTMH19
     I                                       58  600BTMH20
     I                                       61  630BTMH21
     I                                       64  660BTMH22
     I                                       67  690BTMH23
     I                                       70  720BTMH24
     I                                       73  750BTMH25
     I                                       76  780BTMH26
     I                                       79  810BTMH27
     I                                       82  840BTMH28
     I                                       85  870BTMH29
     I                                       88  900BTMH30
     I                                       91  930BTMH31
     I            DS
     I                                        1  31 #ZM
     I                                        1   1 BTZM01
     I                                        2   2 BTZM02
     I                                        3   3 BTZM03
     I                                        4   4 BTZM04
     I                                        5   5 BTZM05
     I                                        6   6 BTZM06
     I                                        7   7 BTZM07
     I                                        8   8 BTZM08
     I                                        9   9 BTZM09
     I                                       10  10 BTZM10
     I                                       11  11 BTZM11
     I                                       12  12 BTZM12
     I                                       13  13 BTZM13
     I                                       14  14 BTZM14
     I                                       15  15 BTZM15
     I                                       16  16 BTZM16
     I                                       17  17 BTZM17
     I                                       18  18 BTZM18
     I                                       19  19 BTZM19
     I                                       20  20 BTZM20
     I                                       21  21 BTZM21
     I                                       22  22 BTZM22
     I                                       23  23 BTZM23
     I                                       24  24 BTZM24
     I                                       25  25 BTZM25
     I                                       26  26 BTZM26
     I                                       27  27 BTZM27
     I                                       28  28 BTZM28
     I                                       29  29 BTZM29
     I                                       30  30 BTZM30
     I                                       31  31 BTZM31
     I            DS
     I                                        1  140@@TIME
     I                                        1   20@@HH
     I                                        3   40@@MN
     I                                        1   60@TIM6
     I                                        9  140@YMD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C                     READ GWCALP3                  81
     C           *IN80     DOUEQ*ON
     C                     READ GWSCDP3                  80
     C           *IN80     IFEQ *OFF
TCHK2C           1         DO   90        X       30
     C           ORA,X     IFNE *ZERO
     C           DT1,X     ANDNE99999999
     C           DT1,X     ANDNE0
     C                     EXSR #PLS
     C                     ENDIF
     C                     ENDDO
      *
TCHK3C           1         DO   90        X       30
     C           ORS,X     IFNE *ZERO
     C           DT2,X     ANDNE99999999
     C           DT2,X     ANDNE0
     C                     EXSR #MNS
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           KEY       KLIST
     C                     KFLD           @SIRE   40
     C                     KFLD           @UKEI   40
     C                     KFLD           @PTCD   1
     C                     KFLD           ZAIS
     C                     KFLD           ZAIK
     C                     KFLD           WKYM    60
      *
     C                     Z-ADD0111      @UKEI
TCHK1C*                    Z-ADD0002      @SIRE
TCHK1C                     Z-ADD8990      @SIRE
     C                     MOVE 'W'       @PTCD
      *
     C                     ENDSR
      *------------------------------------------------------
      *   UPDATE
      *------------------------------------------------------
     C           #PLS      BEGSR
      * PLUS
     C                     MOVELDT1,X     WKYM
     C                     Z-ADDDT1,X     Z       20
     C           KEY       CHAINBTBPL05              90
     C           *IN90     IFEQ *OFF
     C           BTSKJY    IFNE *BLANK
     C                     Z-ADD*ZERO     #MH
     C                     Z-ADD*ZERO     #PH
     C                     ENDIF
      *
     C                     ADD  ORA,X     #PH,Z
     C                     MOVE *BLANK    BTSKJY
     C                     Z-ADD*YEAR     BTKOYY
     C                     Z-ADD*MONTH    BTKOMM
     C                     Z-ADD*DAY      BTKODD
     C                     TIME           @@TIME
     C                     Z-ADD@@HH      BTKOHH
     C                     Z-ADD@@MN      BTKOSS
     C                     MOVE #USER     BTKOME
     C                     UPDATBTBPL051
     C                     ELSE
     C                     CLEARBTBPL051
      *
     C                     ADD  ORA,X     #PH,Z
     C                     MOVE *BLANK    BTSKJY
     C                     Z-ADD*YEAR     BTKOYY
     C                     Z-ADD*MONTH    BTKOMM
     C                     Z-ADD*DAY      BTKODD
     C                     TIME           @@TIME
     C                     Z-ADD@@HH      BTKOHH
     C                     Z-ADD@@MN      BTKOSS
     C                     MOVE #USER     BTKOME
     C                     Z-ADDWKYM      BTKEYM
     C                     MOVELZAIS      BTZAIS
     C                     Z-ADDZAIK      BTZAIK
     C                     MOVEL@SIRE     BTSIRE
     C                     MOVEL@UKEI     BTUKEI
     C                     MOVEL@PTCD     BTPTCD
     C                     WRITEBTBPL051
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   UPDATE
      *------------------------------------------------------
     C           #MNS      BEGSR
      *
     C                     MOVELDT2,X     WKYM
     C                     Z-ADDDT2,X     Z       20
     C           KEY       CHAINBTBPL05              90
      * DEDUCT
     C           *IN90     IFEQ *OFF
     C           BTSKJY    IFNE *BLANK
     C                     Z-ADD*ZERO     #MH
     C                     Z-ADD*ZERO     #PH
     C                     ENDIF
      *
     C                     ADD  ORS,X     #MH,Z
     C                     MOVE *BLANK    BTSKJY
     C                     Z-ADD*YEAR     BTKOYY
     C                     Z-ADD*MONTH    BTKOMM
     C                     Z-ADD*DAY      BTKODD
     C                     TIME           @@TIME
     C                     Z-ADD@@HH      BTKOHH
     C                     Z-ADD@@MN      BTKOSS
     C                     MOVE #USER     BTKOME
     C                     UPDATBTBPL051
     C                     ELSE
     C                     CLEARBTBPL051
      *
     C                     ADD  ORS,X     #MH,Z
     C                     MOVE *BLANK    BTSKJY
     C                     Z-ADD*YEAR     BTKOYY
     C                     Z-ADD*MONTH    BTKOMM
     C                     Z-ADD*DAY      BTKODD
     C                     TIME           @@TIME
     C                     Z-ADD@@HH      BTKOHH
     C                     Z-ADD@@MN      BTKOSS
     C                     MOVE #USER     BTKOME
     C                     Z-ADDWKYM      BTKEYM
     C                     MOVELZAIS      BTZAIS
     C                     Z-ADDZAIK      BTZAIK
     C                     MOVEL@SIRE     BTSIRE
     C                     MOVEL@UKEI     BTUKEI
     C                     MOVEL@PTCD     BTPTCD
     C                     WRITEBTBPL051
     C                     ENDIF
      *
     C                     ENDSR
