     H            Y/
     F***************************************************
     F* Holiday schedule order data check with price master
     F*                                                 *
     F* TCHK1  : 12/21/05 create
     F***************************************************
     FGWSCDP1 IF  E                    DISK
TCHK1FGDKPL02 IF  E           K        DISK
     FGWPTP80 O   E                    DISK
      *------------------------------------------------------------
     I            DS
     I                                        1   80A2TYMD
     I                                        1   40A2TAYY
     I                                        5   60A2TAMM
     I                                        7   80A2TADD
     I            DS
     I                                        1   6 L7LOC
     I                                        1   1 L7TKR1
     I                                        2   3 L7TKR2
     I                                        4   5 L7TKR3
     I                                        6   6 L7TKR4
     I            DS
     I                                        1   80BADATE
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
TCHK1I*
TCHK1I            DS
TCHK1I                                        1  20 W@PT
TCHK1I                                        1   5 W@PT1
TCHK1I                                        6  10 W@PT2
TCHK1I                                       11  12 W@PT3
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C                     EXSR #OUT
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#MC      KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
     C           K#AB      KLIST
     C                     KFLD           K@SHN1
     C                     KFLD           K@SHN2
     C                     KFLD           K@SHN3
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
     C                     KFLD           K@DD    20
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
      *
     C           K#AGDX    KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD    20
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA FOR SUB FILE
      *------------------------------------------------------
     C           #OUT      BEGSR
      *
     C                     DO   *HIVAL
     C                     READ GWSCDP1                  80
     C   80                LEAVE
      *
     C                     CLEARWRKR
      *
TCHK1C                     MOVEL*BLANK    W@PT
TCHK1C                     MOVELPRT1      W@PT1
TCHK1C                     MOVELPRT2      W@PT2
TCHK1C                     MOVELPRT3      W@PT3
TCHK1C           W@PT      SETLLGDKPL021
TCHK1C                     DO   *HIVAL
TCHK1C           W@PT      READEGDKPL021                 91
TCHK1C   91                LEAVE
TCHK1C           ISSKJY    IFEQ 'D'
TCHK1C           ISSKHZ    ANDLT*DATE
TCHK1C                     ITER
TCHK1C                     END
TCHK1C           ISENHZ    IFLT *DATE
TCHK1C                     ITER
TCHK1C                     END
TCHK1C           ISTYPE    IFEQ '0'
TCHK1C           ISTYPE    OREQ '6'
TCHK1C                     ELSE
TCHK1C                     ITER
TCHK1C                     END
TCHK1C                     LEAVE
TCHK1C                     ENDDO
TCHK1C           *IN91     IFEQ *ON
TCHK1C                     MOVEL'D'       PDLFLG
TCHK1C                     END
TCHK1 *
TCHK1C                     MOVELPRT1      PART1
TCHK1C                     MOVELPRT2      PART2
TCHK1C                     MOVELPRT3      PART3
TCHK1 *
     C                     WRITEWRKR
     C                     ENDDO
      *
     C                     ENDSR
