     H            Y/
     F***************************************************
     F*   MATERIAL
     F*                                                 *
     F* TCHK1  : 11/10/05 CHANGED
     F* TCHK2  : 01/01/08 CHG 0002 TO 8990
     F***************************************************
     FIZAPL01 IF  E           K        DISK
     FIZAPL10 IF  E           K        DISK
     FAB#PL18 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FABBPL02 IF  E           K        DISK
     FGWMAT01 O   E                    DISK
      *------------------------------------------------------------
     E                    CUST       10  4 0
      *------------------------------------------------------------
     I            DS
     I                                        1  40 CUST
     I                                        1   40CUST1
     I                                        5   80CUST2
     I                                        9  120CUST3
     I                                       13  160CUST4
     I                                       17  200CUST5
     I                                       21  240CUST6
     I                                       25  280CUST7
     I                                       29  320CUST8
     I                                       33  360CUST9
     I                                       37  400CUST10
     I            DS
     I                                        1   6 ZCLOC
     I                                        1   1 ZCADR1
     I                                        2   3 ZCADR2
     I                                        4   5 ZCADR3
     I                                        6   6 ZCADR4
     I            DS
     I                                        1   80BADATE
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C                     EXSR #OUT
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#MC      KLIST
     C                     KFLD           K@ZAIS 15
     C                     KFLD           K@ZAIK  52
     C           K#AB      KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
     C                     KFLD           K@DD    20
     C           K#ABX     KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
      *
      *
     C           K#AGDX    KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD    20
      *
     C                     Z-ADD*YEAR     K@YY
     C           *MONTH    ADD  1         K@MM
     C           K@MM      IFGT 12
     C                     ADD  1         K@YY
     C                     SUB  12        K@MM
     C                     ENDIF
      *
     C                     Z-ADD*ZERO     W@2     20
     C                     EXSR #AGD
     C                     Z-ADD@@D       W@2
      *
     C                     ADD  1         K@MM
     C           K@MM      IFGT 12
     C                     ADD  1         K@YY
     C                     SUB  12        K@MM
     C                     ENDIF
     C                     EXSR #AGD
     C                     Z-ADD@@D       W@3     20
      *
     C                     ENDSR
      *------------------------------------------------------
      *  WORKING DAYS
      *------------------------------------------------------
     C           #AGD      BEGSR
      *
     C                     Z-ADD*ZERO     @@D     20
     C           K#AGD     SETLLAGDPL12
     C           *IN90     DOUEQ*ON
     C           K#AGD     READEAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     ADD  1         @@D
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA FOR SUB FILE
      *------------------------------------------------------
     C           #OUT      BEGSR
      *
     C           *LOVAL    SETLLIZAPL01
      *
     C           *IN80     DOUEQ*ON
     C                     READ IZAPL01                  80
      *
     C           *IN80     IFEQ *OFF
     C           ZCSKJY    ANDNE'D'
     C           ZCSTYY    ANDEQ9999
TCHK2C*          ZCKAKE    ANDEQ0002
TCHK2C           ZCKAKE    ANDEQ8990
TCHK1 *
     C                     CLEARWRKR
      *
     C                     MOVE ZCZAIS    ZAIS
     C                     Z-ADDZCZAIK    ZAIK
     C                     MOVE ZCZAIS    K@ZAIS
     C                     Z-ADDZCZAIK    K@ZAIK
     C                     MOVE ZCLOC     LOC
TCHK1C*          ZCMSJR    DIV  20        @@QTY  110H
TCHK1C           ZCMKJR    DIV  20        @@QTY  110H
     C           ZCTKJR    IFEQ *ZERO
     C                     Z-ADD1         ZCTKJR
     C                     ENDIF
     C           @@QTY     DIV  ZCTKJR    SETB      H
      *
     C                     Z-ADD*ZERO     @WHT2  150
     C                     Z-ADD*ZERO     @WHT3  150
     C                     Z-ADD*ZERO     @WHT4  150
     C           K#MC      SETLLIZAPL10
     C           *IN95     DOUEQ*ON
     C           K#MC      READEIZAPL10                  95
     C           *IN95     IFEQ *OFF
     C           ZBSKJY    ANDEQ*BLANK
TCHK2C*TCHK1     ZBKAKE    ANDEQ0002
TCHK2C           ZBKAKE    ANDEQ8990
     C                     MOVE ZBSHN1    K@SHN1
     C                     MOVE ZBSHN2    K@SHN2
     C                     MOVE ZBSHN3    K@SHN3
      *
     C                     Z-ADD*ZERO     @QTY2  110
     C                     Z-ADD*ZERO     @QTY3  110
     C                     Z-ADD*ZERO     @QTY4  110
      *
     C                     EXSR #RSLT
      *
     C           @QTY2     MULT ZBSOZI    WHT    150
     C                     ADD  WHT       @WHT2
     C                     EXSR #FRC
     C           @QTY3     MULT ZBSOZI    WHT    150
     C                     ADD  WHT       @WHT3
     C           @QTY4     MULT ZBSOZI    WHT    150
     C                     ADD  WHT       @WHT4
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           @WHT2     DIV  1000      @WHT2
     C           @WHT2     DIV  10        @@QTY  110H
     C           @@QTY     DIV  ZCTKJR    DAYQ      H
      *
     C           @WHT3     DIV  1000      @WHT3
     C           @WHT3     DIV  W@2       @@QTY     H
     C           @@QTY     DIV  ZCTKJR    JUL       H
      *
     C           @WHT4     DIV  1000      @WHT4
     C           @WHT4     DIV  W@3       @@QTY     H
     C           @@QTY     DIV  ZCTKJR    AUG       H
     C                     WRITEWRKR
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   RESULT
      *------------------------------------------------------
     C           #RSLT     BEGSR
      *
     C                     Z-ADD*ZERO     Y       20
      *
     C                     Z-ADD*YEAR     K@YY
     C                     Z-ADD*MONTH    K@MM
     C                     Z-ADD*DAY      K@DD
     C                     Z-ADD*ZERO     @CNT    20
     C           K#AGDX    SETGTAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READPAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     ADD  1         @CNT
     C           @CNT      IFEQ 10
     C                     Z-ADDF8KAYY    K@YY
     C                     Z-ADDF8KAMM    K@MM
     C                     Z-ADDF8KADD    K@DD
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           K#AB      SETLLAB#PL18
     C           *IN90     DOUEQ*ON
     C           K#ABX     READEAB#PL18                  90
     C           *IN90     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BADATE    IFGT *DATE
     C                     LEAVE
     C                     ENDIF
      *
     C                     ADD  BASRYO    @QTY2
     C           BATOKU    LOKUPCUST                     10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         Y
     C           Y         IFLE 10
     C                     MOVE BATOKU    CUST,Y
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   FORECAST
      *------------------------------------------------------
     C           #FRC      BEGSR
      *
     C           K#ABX     SETLLABBPL02
     C           *IN90     DOUEQ*ON
     C           K#ABX     READEABBPL02                  90
     C           *IN90     IFEQ *OFF
     C                     ADD  Q51NNM    @QTY3
     C                     ADD  Q52NNM    @QTY4
     C           Q5TOKU    LOKUPCUST                     10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         Y
     C           Y         IFLE 10
     C                     MOVE Q5TOKU    CUST,Y
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
