     H            Y/
     F***************************************************
     F* TEMPOLARY UPDATE GIGWP52                        *
     F*                                                 *
     F* T.SAKAKI  15.10.20
     F***************************************************
     FGIGWP52 IF  F     256            DISK
     FGIGWP5X O   E                    DISK
      *
     IGIGWP52 AA  01
     I                                        1 256 IDATA
     I                                        1   6 IINVNM
     I            DS
     I                                        1 256 XDATA
     I                                        1   6 XINVNM
      *
      *
     C           1         SETLLGIGWP52
     C                     READ GIGWP52                  80
     C           *IN80     DOWEQ'0'
     C           IINVNM    IFEQ 'CA1554'
     C                     MOVELIDATA     XDATA
     C                     MOVEL'US1556'  XINVNM
     C                     ELSE
     C                     MOVELIDATA     XDATA
     C                     ENDIF
     C                     WRITEGIGWP5X1
     C                     READ GIGWP52                  80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
