     H            Y.
     F** IBKR07 ************************************
     F*  マッチングリストデータ ( AOYAMA-->IAF ) *
     F*      A.IDOTA                2006.07.31     *
     F************************************ IBKR07 **
     FFOAWP02 IP  E                    DISK
     FFOAPP02 UF  E           K        DISK                      A
      *
     C           KEY       KLIST
     C                     KFLD           IMTYPE
      *
     C                     SETOF                     01
     C           KEY       CHAINFOAPP021             01
      *
     C                     MOVELIMSKJY    OMSKJY
     C                     Z-ADDIMSKYY    OMSKYY
     C                     Z-ADDIMSKMM    OMSKMM
     C                     Z-ADDIMSKDD    OMSKDD
     C                     Z-ADDIMKOYY    OMKOYY
     C                     Z-ADDIMKOMM    OMKOMM
     C                     Z-ADDIMKODD    OMKODD
     C                     Z-ADDIMKOHH    OMKOHH
     C                     Z-ADDIMKOSS    OMKOSS
     C                     MOVELIMKOME    OMKOME
     C                     MOVELIMPGMN    OMPGMN
     C                     MOVELIMTYPE    OMTYPE
     C                     MOVELIMKT01    OMKT01
     C                     MOVELIMKT02    OMKT02
     C                     MOVELIMKT03    OMKT03
     C                     MOVELIMKT04    OMKT04
     C                     MOVELIMKT05    OMKT05
     C                     MOVELIMKT06    OMKT06
     C                     MOVELIMKT07    OMKT07
     C                     MOVELIMKT08    OMKT08
     C                     MOVELIMKT09    OMKT09
     C                     MOVELIMKT10    OMKT10
     C                     MOVELIMKT11    OMKT11
     C                     MOVELIMKT12    OMKT12
     C                     MOVELIMKT13    OMKT13
     C                     MOVELIMKT14    OMKT14
     C                     MOVELIMKT15    OMKT15
     C                     MOVELIMKT16    OMKT16
     C                     MOVELIMKT17    OMKT17
     C                     MOVELIMKT18    OMKT18
     C                     MOVELIMKT19    OMKT19
     C                     MOVELIMKT20    OMKT20
     C                     MOVELIMKT21    OMKT21
     C                     MOVELIMKT22    OMKT22
     C                     MOVELIMKT23    OMKT23
     C                     MOVELIMKT24    OMKT24
     C                     MOVELIMKT25    OMKT25
     C                     MOVELIMKT26    OMKT26
     C                     MOVELIMKT27    OMKT27
     C                     MOVELIMKT28    OMKT28
     C                     MOVELIMKT29    OMKT29
     C                     MOVELIMKT30    OMKT30
     C                     MOVELIMKT31    OMKT31
     C                     MOVELIMKT32    OMKT32
     C                     MOVELIMKT33    OMKT33
     C                     MOVELIMKT34    OMKT34
     C                     MOVELIMKT35    OMKT35
     C                     MOVELIMKT36    OMKT36
     C                     MOVELIMKT37    OMKT37
     C                     MOVELIMKT38    OMKT38
     C                     MOVELIMKT39    OMKT39
     C                     MOVELIMKT40    OMKT40
     C                     MOVELIMKT41    OMKT41
     C                     MOVELIMKT42    OMKT42
     C                     MOVELIMKT43    OMKT43
     C                     MOVELIMKT44    OMKT44
     C                     MOVELIMKT45    OMKT45
     C                     MOVELIMKT46    OMKT46
     C                     MOVELIMKT47    OMKT47
     C                     MOVELIMKT48    OMKT48
     C                     MOVELIMKT49    OMKT49
     C                     MOVELIMKT50    OMKT50
     C                     MOVELIMKT51    OMKT51
     C                     MOVELIMKT52    OMKT52
     C                     MOVELIMKT53    OMKT53
     C                     MOVELIMKT54    OMKT54
     C                     MOVELIMKT55    OMKT55
     C                     MOVELIMKT56    OMKT56
     C                     MOVELIMKT57    OMKT57
     C                     MOVELIMKT58    OMKT58
     C                     MOVELIMKT59    OMKT59
     C                     MOVELIMKT60    OMKT60
     C                     MOVELIMKT61    OMKT61
     C                     MOVELIMKT62    OMKT62
     C                     MOVELIMKT63    OMKT63
      *
     C           *IN01     IFEQ '0'
     C                     UPDATFOAPP021
     C                     ELSE
     C                     WRITEFOAPP021
     C                     END
