     H            Y.
     F** IBKR03 **********************************
     F*  ..DIE ALLOTMENT M/F ( AOYAMA-->IAF )..  *
     F*     I-HASADA                97.02.22     *
     F********************************** IBKR03 **
     FGCQWP31 IP  E                    DISK
     FGCQPL31 UF  E           K        DISK                      A
      *
     C           KEY       KLIST
     C                     KFLD           IASHN1
     C                     KFLD           IASHN2
     C                     KFLD           IASHN3
     C                     KFLD           IAKOTI
     C                     KFLD           IAKSEI
     C                     KFLD           IAKATA
      *
     C                     SETOF                     01
     C           KEY       CHAINGCQPL311             01
      *
     C                     MOVE IASKJY    DFSKJY
     C                     MOVE IASKYY    DFSKYY
     C                     MOVE IASKMM    DFSKMM
     C                     MOVE IASKDD    DFSKDD
     C                     MOVE IAKOYY    DFKOYY
     C                     MOVE IAKOMM    DFKOMM
     C                     MOVE IAKODD    DFKODD
     C                     MOVE IAKOHH    DFKOHH
     C                     MOVE IAKOSS    DFKOSS
     C                     MOVE IAKOME    DFKOME
     C                     MOVE IASHN1    DFSHN1
     C                     MOVE IASHN2    DFSHN2
     C                     MOVE IASHN3    DFSHN3
     C                     MOVE IAKOTI    DFKOTI
     C                     MOVE IAKSEI    DFKSEI
     C                     MOVE IAKATA    DFKATA
     C                     MOVE IAKOSU    DFKOSU
     C                     MOVE IAKUBN    DFKUBN
     C                     MOVE IAKSKB    DFKSKB
     C                     MOVE IAKTBN    DFKTBN
      *
     C           *IN01     IFEQ '0'
     C                     UPDATGCQPL311
     C                     ELSE
     C                     WRITEGCQPL311
     C                     END
