     H            Y.
     F** IBKR08 ************************************
     F*  型メーカ行き型番リスト ( AOYAMA-->IAF ) *
     F*      A.IDOTA                2006.07.31     *
     F************************************ IBKR08 **
     FFOAWP03 IP  E                    DISK
     FFOAPP03 UF  E           K        DISK                      A
      *
     C           KEY       KLIST
     C                     KFLD           IKTYPE
      *
     C                     SETOF                     01
     C           KEY       CHAINFOAPP031             01
      *
     C                     MOVELIKSKJY    OKSKJY
     C                     Z-ADDIKSKYY    OKSKYY
     C                     Z-ADDIKSKMM    OKSKMM
     C                     Z-ADDIKSKDD    OKSKDD
     C                     Z-ADDIKKOYY    OKKOYY
     C                     Z-ADDIKKOMM    OKKOMM
     C                     Z-ADDIKKODD    OKKODD
     C                     Z-ADDIKKOHH    OKKOHH
     C                     Z-ADDIKKOSS    OKKOSS
     C                     MOVELIKKOME    OKKOME
     C                     MOVELIKPGMN    OKPGMN
     C                     MOVELIKTYPE    OKTYPE
     C                     MOVELIKKT01    OKKT01
     C                     MOVELIKKT02    OKKT02
     C                     MOVELIKKT03    OKKT03
     C                     MOVELIKKT04    OKKT04
     C                     MOVELIKKT05    OKKT05
     C                     MOVELIKKT06    OKKT06
     C                     MOVELIKKT07    OKKT07
     C                     MOVELIKKT08    OKKT08
     C                     MOVELIKKT09    OKKT09
     C                     MOVELIKKT10    OKKT10
     C                     MOVELIKKT11    OKKT11
     C                     MOVELIKKT12    OKKT12
     C                     MOVELIKKT13    OKKT13
     C                     MOVELIKKT14    OKKT14
     C                     MOVELIKKT15    OKKT15
     C                     MOVELIKKT16    OKKT16
     C                     MOVELIKKT17    OKKT17
     C                     MOVELIKKT18    OKKT18
     C                     MOVELIKKT19    OKKT19
     C                     MOVELIKKT20    OKKT20
     C                     MOVELIKKT21    OKKT21
     C                     MOVELIKKT22    OKKT22
     C                     MOVELIKKT23    OKKT23
     C                     MOVELIKKT24    OKKT24
     C                     MOVELIKKT25    OKKT25
     C                     MOVELIKKT26    OKKT26
     C                     MOVELIKKT27    OKKT27
     C                     MOVELIKKT28    OKKT28
     C                     MOVELIKKT29    OKKT29
     C                     MOVELIKKT30    OKKT30
     C                     MOVELIKKT31    OKKT31
     C                     MOVELIKKT32    OKKT32
     C                     MOVELIKKT33    OKKT33
     C                     MOVELIKKT34    OKKT34
     C                     MOVELIKKT35    OKKT35
     C                     MOVELIKKT36    OKKT36
     C                     MOVELIKKT37    OKKT37
     C                     MOVELIKKT38    OKKT38
     C                     MOVELIKKT39    OKKT39
     C                     MOVELIKKT40    OKKT40
     C                     MOVELIKKT41    OKKT41
     C                     MOVELIKKT42    OKKT42
     C                     MOVELIKKT43    OKKT43
     C                     MOVELIKKT44    OKKT44
     C                     MOVELIKKT45    OKKT45
     C                     MOVELIKKT46    OKKT46
     C                     MOVELIKKT47    OKKT47
     C                     MOVELIKKT48    OKKT48
     C                     MOVELIKKT49    OKKT49
     C                     MOVELIKKT50    OKKT50
     C                     MOVELIKKT51    OKKT51
     C                     MOVELIKKT52    OKKT52
     C                     MOVELIKKT53    OKKT53
     C                     MOVELIKKT54    OKKT54
     C                     MOVELIKKT55    OKKT55
     C                     MOVELIKKT56    OKKT56
     C                     MOVELIKKT57    OKKT57
     C                     MOVELIKKT58    OKKT58
     C                     MOVELIKKT59    OKKT59
     C                     MOVELIKKT60    OKKT60
     C                     MOVELIKKT61    OKKT61
     C                     MOVELIKKT62    OKKT62
     C                     MOVELIKKT63    OKKT63
      *
     C           *IN01     IFEQ '0'
     C                     UPDATFOAPP031
     C                     ELSE
     C                     WRITEFOAPP031
     C                     END
