     H            Y.
     F** IBKR02 *********************************************
     F*  ..UPDATE OF DIE SPEC INPUT CODE M/F (AYM-->IAF)..  *
     F*         I-HASADA                   97.02.22         *
     F********************************************* IBKR02 **
     FFCQWP21 IP  E                    DISK
     FFCQPL21 UF  E           K        DISK                      A
     C                     SETOF                     01
     C           IAKACD    CHAINFCQPL211             01
      *
     C                     MOVE IASKJY    O9SKJY
     C                     MOVE IASKYY    O9SKYY
     C                     MOVE IASKMM    O9SKMM
     C                     MOVE IASKDD    O9SKDD
     C                     MOVE IAKOYY    O9KOYY
     C                     MOVE IAKOMM    O9KOMM
     C                     MOVE IAKODD    O9KODD
     C                     MOVE IAKOJI    O9KOJI
     C                     MOVE IAKOPN    O9KOPN
     C                     MOVE IAKSNM    O9KSNM
     C                     MOVE IAKACD    O9KACD
     C                     MOVE IAKANE    O9KANM
     C                     MOVE IACO01    O9CO01
     C                     MOVE IACO02    O9CO02
     C                     MOVE IACO03    O9CO03
     C                     MOVE IACO04    O9CO04
     C                     MOVE IACO05    O9CO05
     C                     MOVE IACO06    O9CO06
     C                     MOVE IACO07    O9CO07
     C                     MOVE IACO08    O9CO08
     C                     MOVE IACO09    O9CO09
     C                     MOVE IACO10    O9CO10
     C                     MOVE IACO11    O9CO11
     C                     MOVE IACO12    O9CO12
      *
     C           *IN01     IFEQ '0'
     C                     UPDATFCQPL211
     C                     ELSE
     C                     WRITEFCQPL211
     C                     END
