     H            Y.
     F******************************************************
     F*文字の入力                                        *
     F*             T.SAKASHITA         2018.07.18         *
     F******************************************************
     FINPPW03 CF  E                    WORKSTN
     E                    ER1     1   1 65
      *
     I            DS
     I                                        1  60 MSG
     I                                        7   8 M@KETA
      *
     C           *ENTRY    PLIST
     C                     PARM           P@TEXT 20
     C                     PARM           P@MOJI 20
     C                     PARM           P@KETA  2
     C                     PARM           P@RTN   2
      *
     C                     MOVE *BLANK    P@RTN
      *
     C                     Z-ADD0         P#KETA
     C           P@KETA    IFNE *BLANK
     C                     MOVE P@KETA    P#KETA  20
     C                     END
      *
     C                     MOVELP@TEXT    TEXT
     C                     MOVELP@MOJI    MOJI
      *
     C           @DSP01    TAG
      *
     C                     EXFMTINPPW031
     C                     SETOF                     99
     C                     MOVE *BLANK    MSG
      *
     C           *IN01     IFEQ '1'
     C                     MOVE '01'      P@RTN
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           MOJI      IFEQ *BLANK
     C                     MOVELER1,01    MSG
     C                     MOVELP@KETA    M@KETA
     C                     SETON                     99
     C                     GOTO @DSP01
     C                     END
      *
     C           P#KETA    IFNE 0
      *
     C                     MOVELMOJI      P#MOJI
     C* * *                MOVELP@KETA    P#KETA
     C                     CALL 'CHKRSM'
     C                     PARM           P#MOJI 50
     C                     PARM           P#KETA  20
     C                     PARM           P#ERR   2
     C           P#ERR     IFEQ 'NG'
     C                     MOVELER1,01    MSG
     C                     MOVELP@KETA    M@KETA
     C                     SETON                     99
     C                     GOTO @DSP01
     C                     END
      *
     C                     MOVELMOJI      Q@MOJI128
     C                     Z-ADD0         Q@LEN   30
     C                     CALL 'APLR07'
     C                     PARM           Q@MOJI128
     C                     PARM           Q@LEN   30
      *
     C           P#KETA    IFNE Q@LEN
     C                     MOVELER1,01    MSG
     C                     MOVELP@KETA    M@KETA
     C                     SETON                     99
     C                     GOTO @DSP01
     C                     END
      *
     C                     END
      *
     C                     MOVELMOJI      P@MOJI
      *
     C                     MOVE 'IN'      P@RTN
      *
     C                     SETON                     LR
     C                     RETRN
      *
** ER1
ER-01 XX文字で入力してください。
