     H            Y.
     FINPUT   IP  F    2048            DISK
     FOUTPUT  O   F    3072            DISK
     IINPUT   AA  01
     I                                        12048 I@DATA
     C                     ADD  1         @CNT    40
     C                     EXCPTODAT
     C           @CNT      IFEQ 20
     C                     SETON                     LR
     C                     RETRN
     C                     END
     OOUTPUT  E                ODAT
     O                                      '",'
     O                         I@DATA
