     H            Y.                                    1
     H***INVR1A*****************************************************************
     H*  R5 LOCATION INVENTORY ENTRY                                           *
     H*
     H* TCHK  01/29/13 CREATE
     H* TCHK1 04/24/13 ADD TM-CODE CHECK
     H**************************************************************************
     FINVPW1A CF  E                    WORKSTN
TCHK1FALBPL30 IF  E           K        DISK
     FFCEPL07 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FINVPP10 UF  E           K        DISK                      A
      **************************************************************************
TCHK1E*                   ERR     1   5 15
TCHK1E                    ERR     1  10 15
     E* NEW
     E                    PRC        15  3               N PROCESS
     E                    LOC        15  6               N LOCATION
     E                    KK         15  1               N KANBAN
     E                    MCN        15  3               N MACHINE
     E                    PRT        15 12               N PART NUMBER
     E                    DEP        15  4 0             N DEPARTMENT
     E* OLD
     E                    PRO        15  3               O PROCESS
     E                    LOX        15  6               O LOCATION
     E                    KX         15  1               O KANBAN
     E                    MCX        15  3               O MACHINE
     E                    PRX        15 12               O PART NUMBER
     E                    DEX        15  4 0             O DEPARTMENT
      **************************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM DATE & TIME
     I            DS
     I                                        1  140@TIME
     I                                        1   60ALTIME
     I                                        7  140ALDATE
     I            DS
     I                                        1  140@@DTTM
     I                                        1   60@@TIME
     I                                        7  140@@DATE
     I* BARCODE/LOCATION
     I            DS
     I                                        1  10 D@LOC
     I                                        1   4 LOCID
     I                                        5  10 D@LOC1
     I                                        5   5 LOC1
     I                                        6   7 LOC2
     I                                        8   9 LOC3
     I                                       10  10 LOC4
     I            DS
     I                                        1  10 D@P#LC
     I                                        1   4 PLOCID
     I                                        5  10 D@P#L1
     I                                        5   5 PLOC1
     I                                        6   7 PLOC2
     I                                        8   9 PLOC3
     I                                       10  10 PLOC4
     I*
     I            DS
     I                                        1  45 PRO
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  45 PRC
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  90 LOC
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  90 LOX
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1  15 KK
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  15 KX
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I            DS
     I                                        1  45 MCN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  45 MCX
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN10
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I            DS
     I                                        1 180 PRT
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1 180 PRX
     I                                        1  12 CKQH01
     I                                       13  24 CKQH02
     I                                       25  36 CKQH03
     I                                       37  48 CKQH04
     I                                       49  60 CKQH05
     I                                       61  72 CKQH06
     I                                       73  84 CKQH07
     I                                       85  96 CKQH08
     I                                       97 108 CKQH09
     I                                      109 120 CKQH10
     I                                      121 132 CKQH11
     I                                      133 144 CKQH12
     I                                      145 156 CKQH13
     I                                      157 168 CKQH14
     I                                      169 180 CKQH15
     I            DS
     I                                        1  60 DEP
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  60 DEX
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I*
     I            DS
     I                                        1   6 W1@LOC
     I                                        2   3 W1@L23
     I            DS
     I                                        1   6 W2@LOC
     I                                        2   3 W2@L23
     I*
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'00'      #SCRN0           USER ID
     C           @@ID      CASEQ'01'      #SCRN1           LOCATION
     C           @@ID      CASEQ'03'      #SCRN3           # OF KAN
     C                     ENDCS
     C                     ENDDO
     C*
     C                     MOVE *ON       *INLR
     C                     RETRN
     C**************************************************************************
     C           *INZSR    BEGSR
     C**************************************************************************
     C                     TIME           @TIME
     C                     TIME           @@DTTM
     C                     Z-ADD@@DATE    K@DATE
     C*
     C                     MOVE '00'      @@ID    2
     C*
     C                     ENDSR
     C*************************************************************************
     C           #SCRN0    BEGSR
     C*************************************************************************
     C*
     C           MSG       IFEQ *BLANKS
     C                     CLEARD@USER
     C                     ENDIF
     C*
     C                     EXFMTDSP00
TCHK1C                     MOVEL*BLANK    MSG
     C*
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
TCHK1C*          D@USER    IFNE 0
TCHK1C*                    MOVE '01'      @@ID
TCHK1C*                    END
TCHK1C                     EXSR #CHK00
TCHK1C           *IN99     IFEQ *OFF
TCHK1C                     MOVEL'01'      @@ID
TCHK1C                     END
     C                     ENDSL
     C*
     C                     ENDSR
TCHK1C*************************************************************************
TCHK1C* TM-CODE CHECK
TCHK1C**************************************************************************
TCHK1C           #CHK00    BEGSR
TCHK1C*
TCHK1C                     SETOF                     6199
TCHK1C*
TCHK1C                     DO
TCHK1C*
TCHK1C           D@USER    IFEQ 111111
TCHK1C           D@USER    OREQ 222222
TCHK1C                     LEAVE
TCHK1C                     END
TCHK1C*
TCHK1C           D@USER    CHAINALBPL301             90
TCHK1C           *IN90     IFEQ *OFF
TCHK1C           ALSKJY    ANDEQ*BLANK
TCHK1C                     ELSE
TCHK1C                     SETON                     6199
TCHK1C           MSG       IFEQ *BLANK
TCHK1C                     MOVELERR,5     MSG
TCHK1C                     END
TCHK1C                     END
TCHK1C*
TCHK1C                     ENDDO
TCHK1C*
TCHK1C                     ENDSR
     C**************************************************************************
     C           #SCRN1    BEGSR
     C**************************************************************************
     C                     EXFMTDSP01
     C*
     C                     SELEC
     C*
     C           *INKC     WHEQ *ON
     C                     MOVE *OFF      *IN99                        F5
     C                     MOVE *OFF      *IN61                        F5
     C                     MOVE *BLANK    D@ERR                        F5
     C                     MOVE '00'      @@ID
      *
     C           *INKB     WHEQ *ON
     C                     MOVELW@LOC     K@PREV    P
     C           K#INV1    KLIST
     C                     KFLD           K@DATE  80
     C                     KFLD           K@PREV 17
     C           K#INV1    CHAININVPP10              96
     C           *IN96     IFEQ '0'
     C                     MOVE IVBARC    D@P#LC
     C                     Z-ADDIVKANS    D@KANV
     C                     MOVEL'0'       *INKC
     C                     MOVEL'0'       *INKD
     C           *INKC     DOWNE'1'
     C           *INKD     ANDNE'1'
     C                     EXFMTDSP07
     C           *INKC     IFEQ '1'
     C                     LEAVE
     C                     ENDIF
     C           *INKD     IFEQ '1'
     C                     DELETINVPP10
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
     C                     MOVEL'01'      @@ID
     C*
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     MOVE '03'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
     C**************************************************************************
     C*     CHECK LOC#
     C           #CHK1     BEGSR
     C**************************************************************************
     C                     MOVE *OFF      *IN99                        F5
     C                     MOVE *OFF      *IN61                        F5
     C                     MOVE *BLANK    D@ERR                        F5
      *
     C                     DO
      *
     C           D@LOC     IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,1     D@ERR
     C                     LEAVE
     C                     ENDIF
     C*
     C           LOCID     CHAINFCEPL07              98
     C           *IN98     IFEQ *ON
     C                     SETON                     9961
     C                     MOVELERR,1     D@ERR
     C                     LEAVE
     C                     END
     C*
     C           K#AAM     KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C           K#AAM     CHAINAAMPL11              98
     C           *IN98     IFEQ *ON
     C                     SETON                     9961
     C                     MOVELERR,4     D@ERR
     C                     LEAVE
     C                     END
     C*
     C                     MOVELLOC,1     W1@LOC
     C                     MOVELLOX,1     W2@LOC
     C           W1@L23    IFEQ 'R5'
     C           W2@L23    OREQ 'R5'
     C                     ELSE
     C                     SETON                     9961
     C                     MOVELERR,4     D@ERR
     C                     LEAVE
     C                     END
     C*
     C                     MOVELD@LOC     K@PREV    P
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C**************************************************************************
     C           #SCRN3    BEGSR
     C**************************************************************************
     C                     EXFMTDSP03
     C*
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '01'      @@ID
     C                     OTHER
     C                     EXSR #CHK3
     C           *IN99     IFEQ *OFF
     C                     EXSR #WRT1
     C                     MOVEL'01'      @@ID
     C                     MOVELD@LOC     W@LOC  20 P
     C                     MOVE *BLANK    D@LOC
     C                     Z-ADD*ZERO     D@KANS
     C                     END
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C           #CHK3     BEGSR
     C**************************************************************************
     C                     MOVE *OFF      *IN99                        F5
     C                     MOVE *OFF      *IN61                        F5
     C                     MOVE *BLANK    D@ERR                        F5
     C*
     C                     ENDSR
     C**************************************************************************
     C*     WRITE FROM LOCATION
     C           #WRT1     BEGSR
     C**************************************************************************
     C                     CLEARINVPP101
     C*
     C                     TIME           @@DTTM
     C                     Z-ADD@@DATE    IVDATE
     C                     Z-ADD@@TIME    IVTIME
     C                     MOVELD@USER    IVUSER
     C                     MOVELD@LOC     IVBARC
     C           *INKB     IFEQ '1'
     C           -1        MULT D@KANS    IVKANS
     C                     ELSE
     C                     Z-ADDD@KANS    IVKANS
     C                     END
     C*
     C                     MOVELLOC1      IVLOC1
     C                     MOVELLOC2      IVLOC2
     C                     MOVELLOC3      IVLOC3
     C                     MOVELLOC4      IVLOC4
     C*
     C                     MOVELA2BHB1    IVSHN1
     C                     MOVELA2BHB2    IVSHN2
     C                     MOVELA2BHB3    IVSHN3
     C*
     C                     WRITEINVPP101
     C*
     C                     ENDSR
** ERR
PART#  ERROR
ALREADY SCANNED
NOT SCANNED YET
LOCATION ERROR
USER ID ERROR





