     H            Y.                                    1
     H***INVR60*****************************************************************
     H*  OUTSOURCE INVENTORY ENTRY                                             *
     H*
     H* TCHK1 09/22/06 CREATE(COPY FROM INVR50)
     H* TCHK2 09/29/06 RMV LOCK-FILE
     H* TCHK3 11/08/06 CHG GET LOCATION
     H* TCHK4 08/08/07 BUG FIX
     H* TCHK5 04/24/13 ADD TM-CODE CHECK
      *  LEC  04/20/18 ADD LOGIC TO GET PART NUMBER FROM IN-PROCESS KANBANS
     H**************************************************************************
     FINVPW60 CF  E                    WORKSTN
     FINVPP60 UF  E           K        DISK                      A
TCHK3FAAMPL11 IF  E           K        DISK
TCHK5FALBPL30 IF  E           K        DISK
TCHK2F* ALDPP62 UF  E           K        DISK                      A
TCHK2F* ALBPL30 IF  E           K        DISK
TCHK2F* FCEPL01 IF  E           K        DISK
     FFCEPL07 IF  E           K        DISK
      **************************************************************************
TCHK5E*                   ERR     1   5 15
TCHK5E                    ERR     1  10 15
     E                    WKO        15  3               工程
     E                    WBM        15  4               部門
     E                    WBN        15  6               番地
     E                    SKO        15  3               新工程
     E                    SBM        15  4 0             新部門
     E                    SBN        15  6               新番地
     E                    QKO        15  3               旧工程
     E                    QBM        15  4 0             旧部門
     E                    QBN        15  6               旧番地
     E                    CGD        15 10 0             旧番地
      **************************************************************************
     I            DS
     I                                        1  45 SKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600SBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  90 SBN
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  45 QKO
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600QBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  90 QBN
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1 150 CGD
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1   6 W@TKRO
     I                                        1   1 W@TKR1
     I                                        2   3 W@TKR2
     I                                        4   5 W@TKR3
     I                                        6   6 W@TKR4
     I            DS
     I                                        1  100W@CGD
     I                                        1   80W@CGDT
     I                                        9  100W@CGDB
      **************************************************************************
     I* BARCODE
     I            DS
     I                                        1  20 D@PART
     I                                        1  14 BCD
     I                                        1   1 BEG1
     I                                        2   5 ZETI
     I                                        1   2 KEYCD
     I                                        3   7 PART1
     I                                        8   8 DASH#1
     I                                        9  13 PART2
     I                                        9  11 MPCODE
     I                                       14  14 DASH#2
     I                                       15  16 PART3
     I* SYSTEM DATE & TIME
     I            DS
     I                                        1  140@TIME
     I                                        1   60ALTIME
     I                                        7  140ALDATE
     I            DS
     I                                        1  140@@DTTM
     I                                        1   60@@TIME
     I                                        7  140@@DATE
     I*
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* LOC CHANGE DATE
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'00'      #SCRN0           USER ID
     C           @@ID      CASEQ'01'      #SCRN1           PPART
     C           @@ID      CASEQ'03'      #SCRN3           # OF KAN
     C                     ENDCS
     C                     ENDDO
     C*
     C                     MOVE *ON       *INLR
     C                     RETRN
     C**************************************************************************
     C           *INZSR    BEGSR
     C**************************************************************************
     C                     TIME           @TIME
     C                     TIME           @@DTTM
     C                     Z-ADD@@DATE    K@DATE
     C*
     C           K#INVV    KLIST
     C                     KFLD           K@DATE  80
     C                     KFLD           K@PREV 20
     C*
     C                     MOVE '00'      @@ID    2
     C*
     C                     ENDSR
     C*************************************************************************
     C           #SCRN0    BEGSR
     C*************************************************************************
TCHK2C*          WFLG      IFEQ '1'
TCHK2C*                    MOVE '2'       WFLG    1
TCHK2C*                    EXSR @LOG
TCHK2C*                    ENDIF
     C*
     C           MSG       IFEQ *BLANKS
     C                     CLEARD@USER
     C                     ENDIF
     C*
     C                     EXFMTDSP00
     C*
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
TCHK5C*          D@USER    IFNE 0
TCHK5C*                    MOVE '01'      @@ID
TCHK5C*                    ENDIF
TCHK2C*                    MOVE '1'       WFLG    1
TCHK2C*                    EXSR @LOG
TCHK5C                     EXSR #CHK00
TCHK5C           *IN99     IFEQ *OFF
TCHK5C                     MOVEL'01'      @@ID
TCHK5C                     END
     C                     ENDSL
     C*
     C                     ENDSR
TCHK5C*************************************************************************
TCHK5C* TM-CODE CHECK
TCHK5C**************************************************************************
TCHK5C           #CHK00    BEGSR
TCHK5C*
TCHK5C                     SETOF                     6199
TCHK5C*
TCHK5C                     DO
TCHK5C*
TCHK5C           D@USER    IFEQ 111111
TCHK5C           D@USER    OREQ 222222
TCHK5C                     LEAVE
TCHK5C                     END
TCHK5C*
TCHK5C           D@USER    CHAINALBPL301             90
TCHK5C           *IN90     IFEQ *OFF
TCHK5C           ALSKJY    ANDEQ*BLANK
TCHK5C                     ELSE
TCHK5C                     SETON                     6199
TCHK5C           MSG       IFEQ *BLANK
TCHK5C                     MOVELERR,6     MSG
TCHK5C                     END
TCHK5C                     END
TCHK5C*
TCHK5C                     ENDDO
TCHK5C*
TCHK5C                     ENDSR
     C**************************************************************************
     C           #SCRN1    BEGSR
     C**************************************************************************
     C                     EXFMTDSP01
     C*
     C                     SELEC
     C*
     C           *INKC     WHEQ *ON
     C                     MOVE *OFF      *IN99                        F5
     C                     MOVE *OFF      *IN61                        F5
     C                     MOVE *BLANK    D@ERR                        F5
     C                     MOVE '00'      @@ID
      *
     C           *INKB     WHEQ *ON
     C                     MOVELW@PART    K@PREV
     C           K#INVV    CHAININVPP60              96
     C           *IN96     IFEQ '0'
     C                     MOVE IVBARC    D@P#PN
     C                     Z-ADDIVKANS    D@KANV
     C                     MOVEL'0'       *INKC
     C                     MOVEL'0'       *INKD
     C           *INKC     DOWNE'1'
     C           *INKD     ANDNE'1'
     C                     EXFMTDSP07
     C           *INKC     IFEQ '1'
     C                     LEAVE
     C                     ENDIF
     C           *INKD     IFEQ '1'
     C                     DELETINVPP60
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
     C                     MOVEL'01'      @@ID
     C*
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
      *    if barcode starts with a zero, get the part number (not in barcode)
     C           BEG1      IFEQ '0'
     C                     EXSR GETPRT
     C                     ENDIF
     C                     MOVE '03'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
     C**************************************************************************
     C*     CHECK PART#
     C           #CHK1     BEGSR
     C**************************************************************************
     C                     MOVE *OFF      *IN99                        F5
     C                     MOVE *OFF      *IN61                        F5
     C                     MOVE *BLANK    D@ERR                        F5
      *
     C           D@PART    IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,1     D@ERR
     C                     ENDIF
     C*
     C                     MOVELD@PART    K@PREV
     C**         K#INVV    CHAININVPP60             N96
     C**         *IN96     IFEQ '0'
     C**                   SETON                     9961
     C**                   MOVELERR,2     D@ERR
     C**                   END
     C**
     C                     ENDSR
     C**************************************************************************
     C           #SCRN3    BEGSR
     C**************************************************************************
     C                     EXFMTDSP03
     C*
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '01'      @@ID
     C                     OTHER
     C                     EXSR #CHK3
     C           *IN99     IFEQ *OFF
     C                     EXSR #WRT1
     C                     MOVEL'01'      @@ID
     C                     MOVE D@PART    W@PART 20
     C                     MOVE *BLANK    D@PART
     C                     Z-ADD*ZERO     D@KANS
     C                     ENDIF
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C           #CHK3     BEGSR
     C**************************************************************************
     C                     MOVE *OFF      *IN99                        F5
     C                     MOVE *OFF      *IN61                        F5
     C                     MOVE *BLANK    D@ERR                        F5
     C*
     C                     ENDSR
     C**************************************************************************
     C*     USE ABSOLUTE ID TO GET PART NUMBER FROM PART MASTER
     C           GETPRT    BEGSR
     C**************************************************************************
      *
     C           ZETI      IFNE *BLANK
      *
     C           ZETI      CHAINFCEPL07              50
     C           *IN50     IFEQ *OFF
     C                     MOVELA2BHB1    @PART1  5
     C                     MOVELA2BHB2    @PART2  5
     C                     MOVELA2BHB3    @PART3  2
     C                     ELSE
     C                     MOVE *BLANKS   @PART1
     C                     MOVE *BLANKS   @PART2
     C                     MOVE *BLANKS   @PART3
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
     C*     WRITE FROM KANBAN
     C           #WRT1     BEGSR
     C**************************************************************************
     C                     CLEARINVPP601
     C*
     C                     TIME           @@DTTM
     C                     Z-ADD@@DATE    IVDATE
     C                     Z-ADD@@TIME    IVTIME
     C                     MOVELD@USER    IVUSER
     C                     MOVELD@PART    IVBARC
     C                     MOVELKEYCD     IVCODE
     C                     MOVELPART1     IVSHN1
     C                     MOVELPART2     IVSHN2
     C                     MOVELPART3     IVSHN3
     C           *INKB     IFEQ '1'
     C           -1        MULT D@KANS    IVKANS
     C                     ELSE
     C                     Z-ADDD@KANS    IVKANS
     C                     ENDIF
     C*
      *  if in-process kanban and part number was found in part m/f....
     C           BEG1      IFEQ '0'
     C           @PART1    ANDNE*BLANK
     C           @PART2    ANDNE*BLANK
     C                     MOVEL@PART1    IVSHN1
     C                     MOVEL@PART2    IVSHN2
     C                     MOVEL@PART3    IVSHN3
     C                     ENDIF
      *
TCHK3C           K#AAMP    KLIST
TCHK3C                     KFLD           IVSHN1
TCHK3C                     KFLD           IVSHN2
TCHK3C                     KFLD           IVSHN3
TCHK3C           K#AAMP    CHAINAAMPL111             98
TCHK3C           *IN98     IFEQ *OFF
TCHK3C           CKSKJY    ANDEQ'D'
TCHK3C           CKSKHZ    ANDLE*DATE
TCHK3C                     SETON                     98
TCHK3C                     END
TCHK3C*
TCHK3C           *IN98     IFEQ *OFF
     C           BEG1      IFEQ '0'
     C                     EXSR SUBRT2
     C                     ELSE
TCHK3C                     EXSR SUBRTN
     C                     ENDIF
TCHK3C                     ELSE
TCHK3C                     MOVEL*BLANK    W@TKRO
TCHK3C                     END
TCHK3C*
TCHK3C                     MOVELW@TKR1    IVLOC1
TCHK3C                     MOVELW@TKR2    IVLOC2
TCHK3C                     MOVELW@TKR3    IVLOC3
CCHK3C                     MOVELW@TKR4    IVLOC4
TCHK3C*
     C                     WRITEINVPP601
     C*
     C                     ENDSR
TCHK3C*
TCHK3C* -------------------------------------------------- *
TCHK3C*                                                    *
TCHK3C* -------------------------------------------------- *
TCHK3C           SUBRTN    BEGSR
TCHK3C*
TCHK3C                     MOVEL*BLANK    WKO
TCHK3C                     MOVEL*BLANK    WBM
TCHK3C                     MOVEL*BLANK    WBN
TCHK3C                     Z-ADD*ZERO     I       20
TCHK3C*
TCHK3C                     DO   *HIVAL
TCHK3C                     ADD  1         I
TCHK3C           I         IFGT 15
TCHK3C                     LEAVE
TCHK3C                     END
TCHK3C                     Z-ADDCGD,I     W@CGD
TCHK3C           W@CGDT    IFGT *DATE
TCHK3C                     MOVELQKO,I     WKO,I
TCHK3C                     MOVELQBM,I     WBM,I
TCHK3C                     MOVELQBN,I     WBN,I
TCHK3C                     ELSE
TCHK3C                     MOVELSKO,I     WKO,I
TCHK3C                     MOVELSBM,I     WBM,I
TCHK3C                     MOVELSBN,I     WBN,I
TCHK3C                     END
TCHK3C                     ENDDO
TCHK3C*
TCHK3C                     MOVEL*BLANK    W@TKRO
TCHK3C*
TCHK3C                     DO
TCHK3C* CASE#1(SEARCH 'SD ','NP ')
TCHK3C                     Z-ADD1         I
TCHK3C           'SD '     LOKUPWKO,I                    91
TCHK3C           *IN91     IFEQ *OFF
TCHK3C                     Z-ADD1         I
TCHK3C           'NP '     LOKUPWKO,I                    91
TCHK3C                     END
TCHK3C           *IN91     IFEQ *ON
TCHK3C           I         IFGT 1
TCHK3C           I         SUB  1         J       20
TCHK3C                     EXSR SUB#1
TCHK3C           W@TKRO    IFNE *BLANK
TCHK3C                     LEAVE
TCHK3C                     END
TCHK3C                     END
TCHK3C                     END
TCHK3C* CASE#2(SEARCH 'TC ','JC ')
TCHK3C                     Z-ADD1         I
TCHK3C           'TC '     LOKUPWKO,I                    91
TCHK3C           *IN91     IFEQ *OFF
TCHK3C                     Z-ADD1         I
TCHK3C           'JC '     LOKUPWKO,I                    91
TCHK3C                     END
TCHK3C           *IN91     IFEQ *ON
TCHK3C           WBM,I     ANDEQ'0111'
TCHK3C           I         IFGT 1
TCHK3C           I         SUB  1         J       20
TCHK3C                     EXSR SUB#1
TCHK3C           W@TKRO    IFNE *BLANK
TCHK3C                     LEAVE
TCHK3C                     END
TCHK3C                     END
TCHK3C                     END
TCHK3C* CASE#3(SEARCH 'DS ')
TCHK3C                     Z-ADD1         I
TCHK3C           'DS '     LOKUPWKO,I                    91
TCHK3C           *IN91     IFEQ *ON
TCHK3C           I         IFGT 1
TCHK3C           I         SUB  1         J       20
TCHK3C                     EXSR SUB#1
TCHK3C           W@TKRO    IFNE *BLANK
TCHK3C                     MOVELW@TKR2    W@@A01  1
TCHK3C           W@@A01    IFEQ 'G'
TCHK3C                     LEAVE
TCHK3C                     ELSE
TCHK3C                     MOVELWBN,I     W@TKRO
TCHK3C                     LEAVE
TCHK3C                     END
TCHK3C                     END
TCHK3C                     END
TCHK3C                     END
TCHK3C* CASE#4(SEARCH LAST LOC)
TCHK3C                     Z-ADD1         I
TCHK3C           '   '     LOKUPWKO,I                    91
TCHK3C           *IN91     IFEQ *ON
TCHK3C           I         IFGT 1
TCHK3C           I         SUB  1         J       20
TCHK3C                     EXSR SUB#1
TCHK3C           W@TKRO    IFNE *BLANK
TCHK3C                     LEAVE
TCHK3C                     END
TCHK3C                     END
TCHK3C                     END
TCHK3C*
TCHK3C                     ENDDO
TCHK3C*
TCHK3C                     ENDSR
TCHK3C* -------------------------------------------------- *
      *  for in-process kanbans....                        *
      * -------------------------------------------------- *
     C           SUBRT2    BEGSR
      *
     C                     MOVEL*BLANK    WKO
     C                     MOVEL*BLANK    WBM
     C                     MOVEL*BLANK    WBN
     C                     Z-ADD*ZERO     I       20
      *
     C                     DO   *HIVAL
     C                     ADD  1         I
     C           I         IFGT 15
     C                     LEAVE
     C                     ENDIF
     C                     Z-ADDCGD,I     W@CGD
     C           W@CGDT    IFGT *DATE
     C                     MOVELQKO,I     WKO,I
     C                     MOVELQBM,I     WBM,I
     C                     MOVELQBN,I     WBN,I
     C                     ELSE
     C                     MOVELSKO,I     WKO,I
     C                     MOVELSBM,I     WBM,I
     C                     MOVELSBN,I     WBN,I
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEL*BLANK    W@TKRO
      *
     C                     DO
      * check for manufacturing process code....
     C                     Z-ADD1         I
     C           MPCODE    LOKUPWKO,I                    91
     C           *IN91     IFEQ *ON
     C           I         IFGT 1
     C                     Z-ADDI         J
     C                     EXSR SUB#1
     C           W@TKRO    IFNE *BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *  search last location...
     C                     Z-ADD1         I
     C           '   '     LOKUPWKO,I                    91
     C           *IN91     IFEQ *ON
     C           I         IFGT 1
     C           I         SUB  1         J       20
     C                     EXSR SUB#1
     C           W@TKRO    IFNE *BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      * -------------------------------------------------- *
TCHK3C*                                                    *
TCHK3C* -------------------------------------------------- *
TCHK3C           SUB#1     BEGSR
TCHK3C*
TCHK3C                     DO   *HIVAL
TCHK3C*
TCHK3C           WBN,J     IFEQ '------'
TCHK4C*TCHK3     WBN,J     ANDEQ'++++++'
TCHK4C           WBN,J     OREQ '++++++'
TCHK3C                     SUB  1         J
TCHK3C           J         IFLT 1
TCHK4C                     MOVEL*BLANK    W@TKRO
TCHK3C                     LEAVE
TCHK3C                     ELSE
TCHK3C                     ITER
TCHK3C                     END
TCHK3C                     END
TCHK3C*
TCHK3C                     MOVELWBN,J     W@TKRO
TCHK3C                     LEAVE
TCHK3C*
TCHK3C                     ENDDO
TCHK3C*
TCHK3C                     ENDSR
TCHK3C*
     C**************************************************************************
     C*                    @LOG  LOCK/UNLOCK LOCK FILE
     C**************************************************************************
TCHK2C*          @LOG      BEGSR
     C*
     C*  TRY TO LOCK
     C*
TCHK2C*          WFLG      IFEQ '1'
TCHK2C*          D@USER    CHAINALDPP621            N97
TCHK2C*          *IN97     IFEQ '0'
TCHK2C*                    SETON                     3031
TCHK2C*                    MOVE '2'       WFLG
TCHK2C*                    MOVEAERR,5     MSG
TCHK2C*                    MOVE '00'      @@ID
TCHK2C*                    ELSE
TCHK2C*                    MOVE #WSID     ALWKID
TCHK2C*                    Z-ADDD@USER    ALWKCD
TCHK2C*          D@USER    CHAINALBPL301             45
TCHK2C*                    WRITEALDPP621
TCHK2C*                    ENDIF
     C*
TCHK2C*                    ELSE
     C*
     C*  TRY TO UNLOCK
     C*
TCHK2C*          WFLG      IFEQ '2'
TCHK2C*          D@USER    CHAINALDPP621            N97
TCHK2C*          *IN97     IFEQ '0'
TCHK2C*          D@USER    CHAINALDPP621             97
TCHK2C*          *IN97     IFEQ '0'
TCHK2C*                    DELETALDPP621
TCHK2C*                    ENDIF
TCHK2C*                    ENDIF
TCHK2C*                    ENDIF
     C*
TCHK2C*                    ENDIF
TCHK2C*          EXIT1     TAG
TCHK2C*                    ENDSR
** ERR
PART#  ERROR
ALREADY SCANNED
NOT SCANNED YET
LOCATION ERROR
USER IS USING
USER ID ERROR




