     H            Y.                                    1
     H***INVR50*****************************************************************
     H*  WASHER INVENTORY ENTRY                                                *
     H*
     H* TCHK1 04/26/06 CREATE(COPY FROM INVR10)
     H* TCHK2 02/07/11 RE-MAKE
     H* TCHK3 04/24/13 CHG TM-CODE CHECK
%0001H* T.SAKAKI 03/24/17 WASHER RETRIEVAL
     H**************************************************************************
     FINVPW50 CF  E                    WORKSTN
     FALBPL30 IF  E           K        DISK
     FAKBPL06 IF  E           K        DISK
%0001FAKBPL07 IF  E           K        DISK
     FFCEPL07 IF  E           K        DISK
     FGDMPL80 IF  E           K        DISK
     FGDGPL18 IF  E           K        DISK
     FINVPP50 UF  E           K        DISK                      A
      **************************************************************************
     E                    ERR     1   5 15
     E                    TYP     1   8 17
      **************************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I* BARCODE(ASJ KANBAN,ASJ ORDER KANBAN,FREEWAY KANBAN)
     I*(UPDATE CODE + ABSOLUTE # + PURCHASE CODE + KANBAN TYPE + HAKKO #
     I            DS
     I                                        1  17 D@KNBN
     I                                        1  16 D@KNB2
     I                                        1   1 BCOCD
     I                                        2   5 BZETI
     I                                        6   9 BSIRE
     I                                       10  13 BETC
     I                                       14  17 BBLANK
     I                                        6  11 A1ORDR
     I                                       12  12 A1SEHI
     I                                       13  16 A1LOTN
     I                                        6  11 A2CRDT
     I                                       12  12 A2SEHI
     I                                       13  13 A2LOT1
     I                                       14  16 A2LOT2
     I                                       17  17 A2CHKD
     I                                       11  17 D@FIL1
%0001I                                        1   5 K@SHN1
%0001I                                        7  11 K@SHN2
%0001I                                       13  14 K@SHN3
     I            DS
     I                                        1   80UKDATE
     I                                        1   40L1UKYY
     I                                        5   60L1UKMM
     I                                        7   80L1UKDD
     I            DS
     I                                        1   80STDATE
     I                                        1   40L1STYY
     I                                        5   60L1STMM
     I                                        7   80L1STDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   9 W@LOCT
     I                                        1   1 W@LOC1
     I I            '-'                       2   2 W@LOCA
     I                                        3   4 W@LOC2
     I I            '-'                       5   5 W@LOCB
     I                                        6   7 W@LOC3
     I I            '-'                       8   8 W@LOCC
     I                                        9   9 W@LOC4
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'00'      #SCRN0           USER ID
     C           @@ID      CASEQ'01'      #SCRN1           KANBAN
     C           @@ID      CASEQ'03'      #SCRN3           # OF KAN
     C                     ENDCS
     C                     ENDDO
     C*
     C                     MOVE *ON       *INLR
     C                     RETRN
     C**************************************************************************
     C           *INZSR    BEGSR
     C**************************************************************************
     C           K#INVV    KLIST
     C                     KFLD           K@DATE  80
     C                     KFLD           K@PREV 17
     C* %0001
     C           K#KEY1    KLIST
     C                     KFLD           K@SHN1
     C                     KFLD           K@SHN2
     C                     KFLD           K@SHN3
     C*
     C                     MOVE '00'      @@ID    2
     C                     MOVEL*OFF      *IN51
     C                     MOVEL*BLANK    MSG
     C*
     C                     TIME           WSDT   140
     C                     Z-ADDWSSDAT    K@DATE
     C*
     C                     ENDSR
     C*************************************************************************
     C           #SCRN0    BEGSR
     C*************************************************************************
     C           MSG       IFEQ *BLANKS
     C                     CLEARD@USER
     C                     ENDIF
     C*
     C                     EXFMTDSP00
     C                     MOVEL*OFF      *IN51
     C                     MOVEL*BLANK    MSG
     C*
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
TCHK3C           D@USER    IFEQ 111111
TCHK3C           D@USER    OREQ 222222
TCHK3C                     MOVEL'01'      @@ID
TCHK3C                     ELSE
     C           D@USER    CHAINALBPL301             90
     C           *IN90     IFEQ *OFF
     C           ALSKJY    ANDEQ*BLANK
     C                     MOVE '01'      @@ID
     C                     ELSE
     C                     SETON                     51
     C                     MOVELERR,5     MSG
     C                     END
TCHK3C                     END
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C           #SCRN1    BEGSR
     C**************************************************************************
     C                     EXFMTDSP01
     C*
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE *OFF      *IN99                        F5
     C                     MOVE *OFF      *IN61                        F5
     C                     MOVE *BLANK    D@ERR                        F5
     C                     MOVE '00'      @@ID
      *
     C           *INKB     WHEQ *ON
     C                     MOVELD@KNBV    K@PREV
     C           K#INVV    CHAININVPP50              96
     C           *IN96     IFEQ '0'
     C                     MOVELIVBARC    D@BARV
     C                     Z-ADDIVKANS    D@KANV
     C                     MOVE '0'       *INKD
     C           *INKC     DOWNE'1'
     C           *INKD     ANDNE'1'
     C                     EXFMTDSP07
     C           *INKC     IFEQ '1'
     C                     LEAVE
     C                     ENDIF
     C           *INKD     IFEQ '1'
     C                     DELETINVPP50
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     EXSR #SET3
     C                     MOVE '03'      @@ID
     C                     END
     C                     ENDSL
      *
     C                     ENDSR
     C**************************************************************************
     C*     CHECK KANBAN
     C           #CHK1     BEGSR
     C**************************************************************************
     C                     MOVE *OFF      *IN99                        F5
     C                     MOVE *OFF      *IN61                        F5
     C                     MOVE *BLANK    D@ERR                        F5
      *
     C           D@KNBN    IFEQ *BLANK
     C           D@FIL1    OREQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,1     D@ERR
     C                     ENDIF
     C*
     C* CHECK PART #?  RETRIEVAL KANBAN
     C                     SETOF                     20
     C           '-'       SCAN D@KNB2                   20
     C   20                SETOF                     9961
     C   20                MOVEL*BLANK    D@ERR
     C*
     C                     MOVEL*BLANK    W@MST   1
     C                     MOVEL*OFF      *IN90
     C* BY ABSOLUTE # ON WASHER KANBAN
     C           *IN20     IFEQ *OFF
     C           BZETI     SETGTAKBPL06
     C                     DO   *HIVAL
     C           BZETI     REDPEAKBPL06                  90
     C   90                LEAVE
     C           L1SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           K@DATE    IFGE UKDATE
     C           K@DATE    ANDLESTDATE
     C                     MOVEL'1'       W@MST
     C                     LEAVE
     C                     END
     C                     ENDDO
%0001C* BY PART # ON WASHER RETRIEVAL KANBAN
     C                     ELSE
     C           K#KEY1    SETGTAKBPL07
     C                     DO   *HIVAL
     C           K#KEY1    REDPEAKBPL07                  90
     C   90                LEAVE
     C           L1SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           K@DATE    IFGE UKDATE
     C           K@DATE    ANDLESTDATE
     C                     MOVEL'1'       W@MST
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     ENDIF
     C*
     C           *IN90     IFEQ *ON
     C           BZETI     CHAINFCEPL07              90
     C           *IN90     IFEQ *OFF
     C           A2GSKD    IFNE *BLANK
     C                     MOVEL*ON       *IN90
     C                     ELSE
     C                     MOVEL'2'       W@MST
     C                     END
     C                     END
     C                     END
     C*
     C           *IN90     IFEQ *ON
     C  N99                MOVELERR,1     D@ERR
     C                     SETON                     9961
     C                     END
     C*
     C                     MOVELD@KNBN    D@BAR  17 P
     C                     MOVE @@ID      ZZID    2
     C*
     C                     ENDSR
     C**************************************************************************
     C*     SET DSP03
     C           #SET3     BEGSR
     C**************************************************************************
     C                     MOVEL*BLANK    D@BART                       F5
     C                     MOVEL*BLANK    D@LOCT                       F5
     C                     Z-ADD*ZERO     D@QPCT                       F5
     C                     MOVEL*BLANK    W@SHN1  5
     C                     MOVEL*BLANK    W@SHN2  5
     C                     MOVEL*BLANK    W@SHN3  2
     C*
     C                     SELEC
     C           W@MST     WHEQ '1'
     C                     MOVELL1TKR1    W@LOC1
     C                     MOVELL1TKR2    W@LOC2
     C                     MOVELL1TKR3    W@LOC3
     C                     MOVELL1TKR4    W@LOC4
     C                     MOVELW@LOCT    D@LOCT
     C                     Z-ADDL1SYOS    D@QPCT
     C                     MOVELL1SHN1    W@SHN1
     C                     MOVELL1SHN2    W@SHN2
     C                     MOVELL1SHN3    W@SHN3
     C           W@MST     WHEQ '2'
     C           K@DATE    IFGE A2TRHZ
     C                     MOVELA2STRK    W@LOC1
     C                     MOVELA2STRT    W@LOC2
     C                     MOVELA2STRR    W@LOC3
     C                     MOVELA2STRD    W@LOC4
     C                     ELSE
     C                     MOVELA2KTRK    W@LOC1
     C                     MOVELA2KTRT    W@LOC2
     C                     MOVELA2KTRR    W@LOC3
     C                     MOVELA2KTRD    W@LOC4
     C                     END
     C                     MOVELW@LOCT    D@LOCT
     C           K@DATE    IFGE A2SYHZ
     C                     Z-ADDA2SSYS    D@QPCT
     C                     ELSE
     C                     Z-ADDA2KSYS    D@QPCT
     C                     END
     C                     MOVELA2BHB1    W@SHN1
     C                     MOVELA2BHB2    W@SHN2
     C                     MOVELA2BHB3    W@SHN3
     C                     ENDSL
     C*
     C           K#GDG     KLIST
     C                     KFLD           K@ORDR  60
     C                     KFLD           W@SHN1
     C                     KFLD           W@SHN2
     C                     KFLD           W@SHN3
     C                     MOVELA1ORDR    K@ORDR
     C           K#GDG     CHAINGDGPL18              91
     C           *IN91     IFEQ *OFF
     C                     Z-ADDICSYOS    D@QPCT
     C                     END
     C*
     C           *IN91     IFEQ *ON
     C           K#GDM     KLIST
     C                     KFLD           BCOCD
     C                     KFLD           BZETI
     C                     KFLD           A2CRDT
     C                     KFLD           A2SEHI
     C                     KFLD           A2LOT1
     C                     KFLD           A2LOT2
     C                     KFLD           A2CHKD
     C           K#GDM     CHAINGDMPL80              91
     C           *IN91     IFEQ *OFF
     C           M8LOTS    MULT M8SYOS    D@QPCT
     C                     END
     C                     END
     C*
     C                     SELEC
     C           L1BMON    WHEQ 2323
%0001C* FREEWAY RETRIEVAL    13-17 BLANK
     C           *IN20     IFEQ *ON
     C                     MOVELTYP,5     D@BART
     C                     ELSE
     C* FREEWAY
     C                     MOVELTYP,4     D@BART
     C                     ENDIF
     C* RK METAL RETRIEVAL
     C           L1BMON    WHEQ 2525
     C           *IN20     IFEQ *ON
     C                     MOVELTYP,7     D@BART
     C                     ELSE
     C* RK METAL
     C                     MOVELTYP,6     D@BART
     C                     ENDIF
     C* ASJ WASHER RETRIEVAL
     C           L1BMON    WHEQ 8990
     C           *IN20     ANDEQ*ON
     C                     MOVELTYP,8     D@BART
     C* ASJ
     C           BCOCD     WHEQ 'I'
     C           A2LOT1    IFGE '0'
     C           A2LOT1    ANDLE'9'
     C                     MOVELTYP,1     D@BART
     C                     ELSE
     C* ASJ WASHER ORDER
     C                     MOVELTYP,2     D@BART
     C                     END
     C* HEAT TREATMENT
     C                     OTHER
     C                     MOVELTYP,3     D@BART
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C           #SCRN3    BEGSR
     C**************************************************************************
     C                     EXFMTDSP03
     C*
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '01'      @@ID
     C                     OTHER
     C                     EXSR #CHK3
     C           *IN99     IFEQ *OFF
     C                     EXSR #WRT1
     C                     MOVE ZZID      @@ID
     C                     MOVE D@KNBN    D@KNBV 17
     C                     MOVE *BLANK    D@KNBN
     C                     Z-ADD*ZERO     D@KANS
     C                     ENDIF
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C           #CHK3     BEGSR
     C**************************************************************************
     C                     MOVE *OFF      *IN99                        F5
     C                     MOVE *OFF      *IN61                        F5
     C                     MOVE *BLANK    D@ERR                        F5
     C*
     C                     ENDSR
     C**************************************************************************
     C*     WRITE FROM KANBAN
     C           #WRT1     BEGSR
     C**************************************************************************
     C                     CLEARINVPP501
     C*
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    IVDATE
     C                     Z-ADDWSSTM6    IVTIME
     C                     MOVELD@USER    IVUSER
     C                     MOVELD@BAR     IVBARC
     C                     MOVELW@SHN1    IVSHN1
     C                     MOVELW@SHN2    IVSHN2
     C                     MOVELW@SHN3    IVSHN3
     C                     MOVELD@LOCT    W@LOCT
     C                     MOVELW@LOC1    IVLOC1
     C                     MOVELW@LOC2    IVLOC2
     C                     MOVELW@LOC3    IVLOC3
     C                     MOVELW@LOC4    IVLOC4
     C           *INKB     IFEQ '1'
     C           -1        MULT D@KANS    IVKANS
     C                     ELSE
     C                     Z-ADDD@KANS    IVKANS
     C                     END
     C                     Z-ADDD@QPCT    IVSSYS
     C*
     C*
     C           IVKANS    MULT IVSSYS    IVSRYO
     C*
     C                     WRITEINVPP501
      *
     C                     ENDSR
** ERR
KANBAN ERROR
ALREADY SCANNED
NOT SCANNED YET
LOCATION ERROR
USER CODE INVALID
** TYP
ASJ
ASJ WASHER ORDER
HEAT TREATMENT
FREEWAY
FREEWAY RETRVL
RK METAL
RK METAL RETRVL
ASJ WASHER RETRVL
