     H            Y.                                    1
     FINVPP70 UF  E           K        DISK
     FCPYPP70 IF  E           K        DISK
     F            INVPP701                          KRENAMEINVPP70C
      **************************************************************************
     I*
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
     C           K#INV     KLIST
     C                     KFLD           K@DATE  80
      *
     C           K#CPY     KLIST
     C                     KFLD           IVDATE
     C                     KFLD           IVBARC
      *
     C                     Z-ADD20231031  K@DATE
     C           K#INV     SETLLINVPP70
      *
     C           *IN50     DOWEQ*OFF
     C           K#INV     READEINVPP70                  50
      *
     C           *IN50     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C           K#CPY     CHAINCPYPP70              51
     C           *IN51     IFEQ *OFF
     C                     DELETINVPP701
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C**************************************************************************
