     H            Y.                                    1
      ** IWAR79I ***************************************************************
      *  WASHER INVENTORY INQUIRY
      *  LEC   CREATE 2025/11/10
      **************************************************************************
     FIZAPW79 CF  E                    WORKSTN
     F                                        RRN2  KSFILE SFL020
     F                                        RRN3  KSFILE SFL030
     F                                              KINFDS @INFDS
     FAKBPL06 IF  E           K        DISK
     FIWAPP70 IF  E           K        DISK
     FIWAPP71 IF  E           K        DISK
     FIWAPP7L IF  E           K        DISK
      **************************************************************************
     E                    ERR     1  10 70
      **************************************************************************
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      * SCANNED TIME
     I            DS
     I                                        1   60##TIME
     I                                        1   40LGHHMM
      *
      * EDIT LOCATION
     I            DS
     I                                        1   6 ##LOCN
     I                                        2   3 ##LOC1
     I                                        4   5 ##LOC2
      *
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'20'      #FMT20
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      **************************************************************************
      *         INITIALIZE
      **************************************************************************
     C           *INZSR    BEGSR
      *
     C                     TIME           WSDT
      *
     C                     CLEARFMT010
     C                     MOVEL*BLANK    MSG
      *
     C                     MOVEL'10'      @@ID    2
     C                     MOVEL*OFF      *IN49
      *
     C           IZA01     KLIST
     C                     KFLD           F1MATN
     C                     KFLD           F1DIAM
      *
     C           IZA02     KLIST
     C                     KFLD           ZCKNO2
     C                     KFLD           F1ZETI
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN(SEARCH BY WIRE ID OR WIRE MATERIAL/DIAMETER
      **************************************************************************
     C           #FMT10    BEGSR
      *
     C                     SETOF                     4748
     C                     MOVELW#PGM     #PGM
     C                     EXFMTFMT010
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKE     WHEQ *ON
     C                     EXSR #DOWN
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN49     IFEQ *OFF
     C                     EXSR #SET20
     C                     ENDIF
     C           *IN49     IFEQ *ON
     C                     MOVEL'10'      @@ID
     C                     ELSE
     C                     MOVEL'20'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN CHECK
      **************************************************************************
     C           #CHK10    BEGSR
      *
     C                     SETOF                     313249
     C                     SETOF                     33
      *
     C                     DO
      *
     C           F1ZETI    IFEQ *BLANKS
     C           F1MATN    ANDEQ*BLANKS
     C           F1DIAM    ANDEQ*ZEROS
     C                     SETON                     313233
     C                     SETON                     49
     C                     MOVELERR,1     MSG
     C                     LEAVE
     C                     ENDIF
      *
     C           F1ZETI    IFNE *BLANKS
      *
     C                     MOVEL'W'       ZCKNO2
     C           IZA02     CHAINIZAPL02              75
     C           *IN75     DOWEQ*OFF
     C           ZCSKJY    IFEQ ' '
     C           ZCSTYY    ANDEQ9999
     C                     LEAVE
     C                     ENDIF
     C           IZA02     READEIZAPL02                  75
     C                     ENDDO
      *
     C           *IN75     IFEQ *ON
     C                     SETON                     3149
     C                     MOVELERR,2     MSG
     C                     LEAVE
     C                     ELSE
     C                     MOVELZCZAIS    F1MATN
     C                     Z-ADDZCZAIK    F1DIAM
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           F1MATN    IFNE *BLANKS
     C           F1DIAM    ORNE *ZERO
      *
     C           IZA01     CHAINIZAPL01              75
     C           *IN75     DOWEQ*OFF
     C           ZCSKJY    IFEQ ' '
     C           ZCSTYY    ANDEQ9999
     C                     LEAVE
     C                     ENDIF
     C           IZA01     READEIZAPL01                  75
     C                     ENDDO
      *
     C           *IN75     IFEQ *ON
     C                     SETON                     323349
     C                     MOVELERR,4     MSG
     C                     LEAVE
     C                     ELSE
     C                     MOVELZCKNO3    F1ZETI
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN SET
      **************************************************************************
     C           #SET20    BEGSR
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL020
     C                     MOVEL*OFF      *IN41
     C                     MOVEL*OFF      *IN42
     C                     Z-ADD*ZERO     RRN2    40
     C                     Z-ADD*ZERO     F1TFUL
     C                     Z-ADD*ZERO     F1TPTL
      *
      *
     C           F1ZETI    CHAINIZAPL70              94
      *
     C           *IN94     DOWEQ*OFF
      *
     C           WISKJY    IFEQ *BLANK
      *
     C                     CLEARSFL020
     C                     MOVELWIZETI    H2ZETI
     C                     MOVELWIMATN    H2MATN
     C                     Z-ADDWIDIAM    H2DIAM
     C                     MOVELWIQA#     S2QA#
     C                     MOVELWICHRG    S2CHRG
     C                     MOVELWICOIL    S2COIL
     C                     MOVELWILOT     S2LOT
     C                     Z-ADDWICODT    S2CODT
     C           WICOTM    DIV  100       S2HHMM
     C                     MOVELWICOUS    S2COUS
      *
     C                     SELEC
     C           WICLOC    WHEQ *BLANK
     C           WICLOC    OREQ 'RECV'
     C           WICLOC    OREQ 'QD'
     C           WICLOC    OREQ 'WIRE'
     C                     MOVELWICLOC    S2CLOC
     C                     OTHER
     C                     MOVELWICLOC    ##LOCN
     C           ##LOC1    CAT  '-':0     S2CLOC
     C           S2CLOC    CAT  ##LOC2:0  S2CLOC
     C                     ENDSL
      *
     C                     SELEC
     C           WIQTY     WHEQ 1.0
     C                     MOVEL'F'       S2PRTL
     C                     ADD  1         F1TFUL
     C           WIQTY     WHEQ .5
     C                     MOVEL'P'       S2PRTL
     C                     ADD  1         F1TPTL
     C           WIQTY     WHEQ *ZERO
     C                     MOVEL'C'       S2PRTL
     C                     ENDSL
     C                     MOVELWIKBQR    H2KBQR
      *
     C                     ADD  1         RRN2    40
     C                     WRITESFL020
      *
     C                     ENDIF
      *
     C           F1ZETI    READEIZAPL70                  94
     C                     ENDDO
      *
     C           RRN2      IFEQ *ZERO
     C                     SETON                     313233
     C                     SETON                     49
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN
      **************************************************************************
     C           #FMT20    BEGSR
      *
     C                     Z-ADD1         W#RNP2  40
      *
     C                     DO   *HIVAL
      *
     C                     MOVEL*OFF      *IN47
     C                     MOVEL*ON       *IN48
     C                     WRITEFMT099
     C                     Z-ADDW#RNP2    #RCN02
     C                     MOVELW#PGM     #PGM
     C                     EXFMTCTL020
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP2
     C                     ENDIF
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     CLEARFMT010
     C                     MOVEL'10'      @@ID
     C                     LEAVE
     C                     OTHER
     C                     EXSR #CHK20
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
      *     2ND SCREEN CHECK
      **************************************************************************
     C           #CHK20    BEGSR
      *
     C                     Z-ADD*ZERO     RRN2
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN2
     C           RRN2      CHAINSFL020               93
     C   93                LEAVE
      *
     C           S2SEL     IFEQ 'X'
     C                     MOVEL*ON       *IN52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     MOVEL*OFF      *IN52
     C                     EXSR #SET30
     C           *IN49     IFEQ *OFF
     C                     EXSR #FMT30
     C                     ENDIF
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ELSE
     C                     MOVEL*OFF      *IN52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     ENDIF
      *
     C           *INKL     IFEQ *ON
     C                     EXSR #SET20
     C                     MOVEL'20'      @@ID
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     3RD SCREEN SET
      **************************************************************************
     C           #SET30    BEGSR
      *
     C                     MOVEL*ON       *IN61
     C                     WRITECTL030
     C                     MOVEL*OFF      *IN61
     C                     MOVEL*OFF      *IN62
     C                     Z-ADD*ZERO     RRN3    40
      *
     C                     MOVEL*ON       *IN63
     C                     MOVEL*OFF      *IN71
      *
     C                     MOVELH2KBQR    C3KBQR
     C           C3KBQR    CHAINIZAPP7L              97
      *
     C           *IN97     DOWEQ*OFF
      *
     C                     CLEARSFL030
     C                     Z-ADDLGKODT    S3DATE
     C                     Z-ADDLGKOTM    ##TIME
     C                     Z-ADDLGHHMM    S3TIME
      *
     C                     MOVELLGKOUS    S3TMNM
      *
      * edit previous location...
     C                     SELEC
     C           LGPLOC    WHEQ *BLANK
     C           LGPLOC    OREQ 'RECV'
     C           LGPLOC    OREQ 'QD'
     C           LGPLOC    OREQ 'WIRE'
     C                     MOVELLGPLOC    S3PLOC
     C                     OTHER
     C                     MOVELLGPLOC    ##LOCN
     C           ##LOC1    CAT  '-':0     S3PLOC
     C           S3PLOC    CAT  ##LOC2:0  S3PLOC
     C                     ENDSL
      *
      * edit current location...
     C                     SELEC
     C           LGCLOC    WHEQ *BLANK
     C           LGCLOC    OREQ 'RECV'
     C           LGCLOC    OREQ 'QD'
     C           LGCLOC    OREQ 'WIRE'
     C                     MOVELLGCLOC    S3CLOC
     C                     OTHER
     C                     MOVELLGCLOC    ##LOCN
     C           ##LOC1    CAT  '-':0     S3CLOC
     C           S3CLOC    CAT  ##LOC2:0  S3CLOC
     C                     ENDSL
      *
     C                     SELEC
     C           LGQTY     WHEQ 1.0
     C                     MOVEL'F'       S3PRTL
     C           LGQTY     WHEQ .5
     C                     MOVEL'P'       S3PRTL
     C           LGQTY     WHEQ *ZERO
     C                     MOVEL'C'       S3PRTL
     C                     ENDSL
      *
     C                     MOVE *OFF      *IN81
     C                     MOVE *OFF      *IN82
      *
     C                     SELEC
     C           LGKOPG    WHEQ 'ALFR40'
     C           LGKOPG    OREQ 'ALFR76'
     C                     MOVE *ON       *IN82
     C           LGKOPG    WHEQ 'ALFR41'
     C           LGKOPG    OREQ 'ALFR77'
     C                     MOVE *ON       *IN81
     C                     ENDSL
      *
     C                     ADD  1         RRN3
     C                     WRITESFL030
     C           C3KBQR    READEIZAPP7L                  97
      *
     C                     ENDDO
      *
     C           RRN3      IFEQ *ZERO
     C                     SETON                     49
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *
      *************************************************************************
      *     3RD SCREEN (LOG DETAIL)
      **************************************************************************
     C           #FMT30    BEGSR
      *
     C                     Z-ADD1         W#RNP3  40
     C                     MOVEL*OFF      *IN49
      *
     C                     DO
      *
     C                     SETON                     4748
     C                     WRITEFMT099
     C                     Z-ADDW#RNP3    #RCN03
     C                     MOVELW#PGM     #PGM
     C                     EXFMTCTL030
     C   KA
     COR KL                LEAVE
      *
     C  NKJ                MOVELN#MOD3    *IN63
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP3
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *
      **************************************************************************
      *     CALL DOWNLOAD PROGRAM
      **************************************************************************
     C           #DOWN     BEGSR
      *
     C                     CALL 'IZAC79D'
      *
     C                     ENDSR
      *
      **************************************************************************
** ERR
ENTER SEARCH CRITERIA
WIRE ID NOT FOUND IN M/F
NO DATA FOUND!
WIRE MATERIAL/DIAMETER NOT FOUND
     #5
     #6
     #7
     #8
     #9
     #10
