     H            Y.
     F** IZAR25 *********************************************
     F* MATERIALS COLOR  M/F
     F*   HOTTA.          2019.01.24                        *
     F*******************************************************
     FIZAPW25 CF  E                    WORKSTN
     FIZAPL20 UF  E           K        DISK                      A
     E                    ER      1  11 65
      *
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  14 SDATE
     I                                        1   6 STIME
     I                                        1   20STIMH
     I                                        3   40STIMM
     I                                        5   60STIMS
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTIZAPW251
     C                     MOVEL*BLANK    D1ERR
     C                     SETOF                     313233
     C                     SETOF                     349930
      *
     C                     TIME           WTIME
     C           *IN01     IFEQ '1'
     C                     MOVEL'99'      DSPSW   2
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           *IN08     IFEQ '1'
     C                     CALL 'IZAR26'
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1UPD     IFEQ '0'
     C           D1UPD     OREQ '1'
     C           D1UPD     OREQ '2'
     C                     ELSE
     C                     SETON                     3099
     C                     MOVELER,1      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1TYPE    IFEQ *BLANK
     C                     SETON                     3199
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           KEYCN     KLIST
     C                     KFLD           D1TYPE
      *
     C           KEYCN     CHAINIZAPL201             20
     C           *IN20     IFEQ '0'
     C           ZCSKJY    ANDEQ'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     SETON                     20
     C                     ENDIF
      *
     C                     SETOF                     29
     C                     MOVEL*BLANK    D1ZAIS
     C                     SELEC
     C           D1UPD     WHEQ '0'
     C           D1UPD     OREQ '1'
     C           *IN20     IFEQ '1'
     C                     SETON                     303199
     C                     MOVELER,3      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
     C                     MOVELZCZAIS    D1ZAIS
     C           D1UPD     WHEQ '2'
     C           *IN20     IFEQ '0'
     C                     SETON                     303199
     C                     MOVELER,4      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
     C                     ENDSL
      *
     C           D1UPD     IFEQ '0'
     C                     SETON                     29
     C                     ENDIF
     C                     MOVEL'02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C                     EXFMTIZAPW252
     C                     MOVEL*BLANK    D1ERR
     C                     SETOF                     313233
     C                     SETOF                     349930
      *
     C           *IN03     IFEQ '1'
     C                     MOVEL'01'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           D1ZAIS    IFEQ *BLANK
     C                     SETON                     3199
     C                     MOVELER,5      D1ERR
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           *IN05     IFEQ '1'
     C                     TIME           WTIME
     C                     EXSR #SB500
     C                     MOVEL*BLANK    D1UPD
     C                     MOVEL*BLANK    D1TYPE
     C                     MOVEL*BLANK    D1ZAIS
     C                     MOVEL'01'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * UPDATE                                             *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C           KEYCN     CHAINIZAPL201             20
      *
     C                     SELEC
      *
     C           D1UPD     WHEQ '0'
     C                     MOVEL'D'       ZCSKJY
     C                     Z-ADD*YEAR     ZCSKYY
     C                     Z-ADDUMONTH    ZCSKMM
     C                     Z-ADDUDAY      ZCSKDD
     C           *IN20     IFEQ '0'
     C                     UPDATIZAPL201
     C                     ENDIF
      *
     C           D1UPD     WHEQ '1'
     C           *IN20     IFEQ '0'
     C                     Z-ADD*YEAR     ZCKOYY
     C                     Z-ADDUMONTH    ZCKOMM
     C                     Z-ADDUDAY      ZCKODD
     C                     Z-ADDSTIMH     ZCKOHH
     C                     Z-ADDSTIMM     ZCKOSS
     C                     MOVELW#USER    ZCKOME
     C                     MOVELD1ZAIS    ZCZAIS
     C                     UPDATIZAPL201
     C                     ENDIF
      *
     C           D1UPD     WHEQ '2'
     C                     CLEARIZAPL201
     C                     Z-ADD*YEAR     ZCKOYY
     C                     Z-ADDUMONTH    ZCKOMM
     C                     Z-ADDUDAY      ZCKODD
     C                     Z-ADDSTIMH     ZCKOHH
     C                     Z-ADDSTIMM     ZCKOSS
     C                     MOVELW#USER    ZCKOME
     C                     MOVELD1TYPE    ZCTYPE
     C                     MOVELD1ZAIS    ZCZAIS
     C           *IN20     IFEQ '0'
     C                     UPDATIZAPL201
     C                     ELSE
     C                     WRITEIZAPL201
     C                     ENDIF
      *
     C                     ENDSL
      *
     CSR         ESB500    ENDSR
**
ER-1 INPUT 0,1,2.
ER-2 INPUT TYPE.
ER-3 NO DATA.
ER-4 ALREADY EXIST.
ER-5 INPUT MATERIAL CODE.
