     H            Y.                                    1
      ** IZAR78 ****************************************************************
      *  WIRE INVENTORY PURGE
      *  LEC   CREATE 2025/06/12
      **************************************************************************
     FIZAPP70 UF  E           K        DISK
     FIZAPP7L UF  E           K        DISK
     FIZAPP70HO   E           K        DISK                      A
     F            IZAPP701                          KRENAMEIZAPP70R
     FIZAPP7LHO   E           K        DISK                      A
     F            IZAPP7L1                          KRENAMEIZAPP7LR
      **************************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     I                                        7  14 WSDATE
      *
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
      *
     C                     TIME           WSDT
      *
      * get date for expiration...
     C                     EXSR #GETDT
      *
      * if get date is okay, process wire files...
     C           $RTN      IFEQ *BLANK
      *
     C                     MOVEL$TGT8     PRGDAT  80
      *
     C                     READ IZAPP70                  51
     C           *IN51     DOWEQ*OFF
      *
     C                     SELEC
     C           WISKJY    WHEQ 'D'
     C                     EXSR #PURGE
     C           WIQTY     WHEQ *ZERO
     C           WIKODT    ANDLTPRGDAT
     C                     EXSR #PURGE
     C                     ENDSL
      *
     C                     READ IZAPP70                  51
     C                     ENDDO
      *
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *
      **************************************************************************
      * Get Date 2 weeks ago to be used as an Expiration for Purging
      **************************************************************************
      *
     C           #GETDT    BEGSR
      *
     C                     CALL 'UTLR10A'
     C                     PARM           WSDATE
     C                     PARM '-'       $SIGN   1
     C                     PARM '0014'    $DAYS   4
     C                     PARM 'N'       $IAF    1
     C                     PARM           $TGT8   8
     C                     PARM           $RTN    1
      *
     C                     ENDSR
      *
      *************************************************************************
      * Write record to history file and delete from inv and log files
      **************************************************************************
      *
     C           #PURGE    BEGSR
      *
      * remove from inventory file...
     C                     Z-ADDWSSDAT    WIPGDT
     C                     WRITEIZAPP70R
     C                     DELETIZAPP701
      *
      * remove from log file...
     C           WIKBQR    CHAINIZAPP7L              52
      *
     C           *IN52     DOWEQ*OFF
      *
     C                     Z-ADDWSSDAT    LGPGDT
     C                     WRITEIZAPP7LR
     C                     DELETIZAPP7L1
      *
     C           WIKBQR    READEIZAPP7L                  52
      *
     C                     ENDDO
      *
     C                     ENDSR
      *
      *************************************************************************
