     H            Y.
     F** IZAR20 ***********************************
     F* ISSUING REPORT FORM FOR NEW ROD MATERIAL  *
     F*   I-HASADA                  2000.07.28    *
     F* UPDATE:K.OKACHI    2001.07.06 %0001       *
     F*********************************** IZAR20 **
     FIZAPW20 CF  E                    WORKSTN
     FIZAPL01 IF  E           K        DISK
     FIZBPL01 IF  E           K        DISK
     FIZAWP201O   F     100            DISK
     FIZAWP202O   F     100            DISK
     E                    ER      1   5 60               d[ｰxｮﾈｰﾆﾞ
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
     I            DS
     I                                        1   80ZDSKHZ
     I                                        1   40ZDSKYY
     I                                        5   60ZDSKMM
     I                                        7   80ZDSKDD
%0001 *
     I            DS
     I                                        1   80ZCSTHZ
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
     I            DS
     I                                        1   80ZDSTHZ
     I                                        1   40ZDSTYY
     I                                        5   60ZDSTMM
     I                                        7   80ZDSTDD
%0001 *
      *
     C           KEY1      KLIST
     C                     KFLD           IZAIS
     C                     KFLD           IZAIK
      *
     C*------------------*
     C*  ..画面－１..  *
     C*------------------*
     C           STP1      TAG
     C                     EXFMTIZAPW201
     C                     SETOF                     0199
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           INO       IFNE '1'
     C           INO       ANDNE'2'
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C                     MOVE *BLANK    IZAIS
     C                     Z-ADD0         IZAIK
      *
     C*------------------*
     C*  ..画面－２..  *
     C*------------------*
     C           STP2      TAG
     C                     EXFMTIZAPW202
     C                     SETOF                     020399
      *
     C           *INKC     IFEQ '1'
     C                     MOVE *BLANK    INO
     C                     GOTO STP1
     C                     END
      *
     C           IZAIS     IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVE ER,2      MSG
     C                     GOTO STP2
     C                     END
      *
     C           IZAIK     IFEQ 0
     C                     SETON                     0399
     C                     MOVE ER,3      MSG
     C                     GOTO STP2
     C                     END
      *
     C*------------------------*
     C*  ..完成材かんばん..  *
     C*------------------------*
     C           INO       IFEQ '1'
     C                     MOVE *BLANK    WCHK    1
     C           KEY1      SETLLIZAPL011
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEIZAPL011                 10
     C           *IN10     IFEQ '0'
     C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     10
     C                     MOVE '*'       WCHK
      *
     C                     END
     C                     END
     C  N10                END
      *
     C           WCHK      IFEQ *BLANK
     C                     SETON                     020399
     C                     MOVE ER,4      MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C*----------------------*
     C*  ..母材かんばん..  *
     C*----------------------*
     C           INO       IFEQ '2'
     C                     MOVE *BLANK    WCHK
     C           KEY1      SETLLIZBPL011
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEIZBPL011                 10
     C           *IN10     IFEQ '0'
     C           ZDSKJY    IFEQ 'D'
     C           ZDSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     10
     C                     MOVE '*'       WCHK
      *
     C                     END
     C                     END
     C  N10                END
      *
     C           WCHK      IFEQ *BLANK
     C                     SETON                     020399
     C                     MOVE ER,5      MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STP2
     C                     END
      *
     C*------------------------*
     C*  ..完成材かんばん..  *
     C*------------------------*
     C           INO       IFEQ '1'
     C           KEY1      SETLLIZAPL011
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEIZAPL011                 10
     C           *IN10     IFEQ '0'
     C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ELSE
      *
%0001C           ZCSTHZ    IFGT *DATE
     C                     SETON                     U1
     C                     EXCPTDT1
%0001C                     END
      *
     C                     END
     C                     END
     C  N10                END
     C                     END
      *
     C*----------------------*
     C*  ..母材かんばん..  *
     C*----------------------*
     C           INO       IFEQ '2'
     C           KEY1      SETLLIZBPL011
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEIZBPL011                 10
     C           *IN10     IFEQ '0'
     C           ZDSKJY    IFEQ 'D'
     C           ZDSKHZ    ANDLE*DATE
     C                     ELSE
      *
%0001C           ZDSTHZ    IFGT *DATE
     C                     SETON                     U2
     C                     EXCPTDT2
%0001C                     END
      *
     C                     END
     C                     END
     C  N10                END
     C                     END
      *
     C                     MOVE *BLANK    IZAIS
     C                     Z-ADD0         IZAIK
     C                     GOTO STP2
      *
     OIZAWP201E                DT1
     O                                    1 'W'
     O                         ZCZAIS    16
     O                         ZCZAIK    21
     O                         ZCKNO3    25
     O                         ZCKAKE    29
     O                         ZCKOJE    33
     O                         ZCTKJR    38
     O                         ZCMKJR    46
     O                         ZCADR1    47
     O                         ZCADR2    49
     O                         ZCADR3    51
     O                         ZCADR4    52
      *
     OIZAWP202E                DT2
     O                                    1 'R'
     O                         ZDZAIS    16
     O                         ZDZAIK    21
     O                         ZDKNO3    25
     O                         ZDSIRE    29
     O                         ZDKOJE    33
     O                         ZDTKJR    38
     O                         ZDMKJR    46
     O                         ZDADR1    47
     O                         ZDADR2    49
     O                         ZDADR3    51
     O                         ZDADR4    52
      *
** ER
E-01 SELECT NO. IS < 1 / 2 >
E-02 INPUT MATERIAL
E-03 INPUT DIAMETER
E-04 NO FINISHED MATERIAL KANBAN M/F
E-05 NO ROD MATERIAL KANBAN M/F
