     H            Y.
     F** IZAR99 *******************************************************
     F* TEST SAKAKI ERIAL KANBAN MASTER FILE 作成
     F*  IZAPP01 --> IZAWP99                                2020.05.29
     F*****************************************************************
      * FINISHED MATERIAL KANBAN MASTER FILE *
     FIZAPP01 IF  E           K        DISK
      * TEST SAKAKI ERIAL KANBAN MASTER FILE
     FIZAWP99 O   E                    DISK
      *================================================================
      *  MAIN ROUTINE                                    *
      *================================================================
     C*
      *-------------------------*
     C                     DO   *HIVAL
     C                     READ IZAPP01                  90
     C   90                LEAVE
     C           ZCSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C*
     C           ZCSTYY    IFEQ 9999
     C           ZCSTMM    ANDEQ99
     C           ZCSTDD    ANDEQ99
     C                     ELSE
     C                     ITER
     C                     ENDIF
     C* **
     C                     CALL 'UEXR24'
     C                     PARM           ZCZAIS
     C                     PARM           ZCZAIK
     C                     PARM           ZCMKJR
     C                     PARM           ZCTKJR
     C                     PARM           ZCKEIS
     C                     PARM           ZCSLTM
     C                     PARM           ZCLOTO
     C                     PARM           ZCCHOS
     C                     PARM           $KQTY   30
     C                     PARM           $RTN    1
     C* **
     C                     Z-ADD0         ZCNEWK
     C           $RTN      IFEQ *BLANK
     C                     Z-ADD$KQTY     ZCNEWK
     C                     ENDIF
     C*
     C                     WRITEIZAWP991
     C*
     C                     ENDDO
      *-------------------------*
     C                     SETON                     LR
     C                     RETRN
      *
      *================================================================
