     H            Y.
     F** IZBR05 ************************************
     F*  INQUIRY OF ROD  MATERIAL KANBAN M/F     *
     F*       MSK.KUNIUEDA         2000.09.21      *
     F*       N.HYOTO 2001.07.12                   *
     F************************************ IZBR05 **
     FIZBPW05 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
     FIZBPL01 IF  E           K        DISK
     FIZBPL10 IF  E           K        DISK
     FMBEPL02 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FABBPL21 IF  E           K        DISK
      *
     E                    ER      1   3 60
     E                    CMT1    1  13  1   CMT2    8   コメント名
      *
     I            DS
     I                                        1   60TIME
     I                                        1   20TIMHH
     I                                        3   40TIMMM
      *
     I            DS
     I                                        1   80HYMD8
     I                                        3   80HYMD6
     I                                        1   60HYM6
     I                                        1   40HYY
     I                                        5   60HMM
     I                                        7   80HDD
      *
     I            DS
     I                                        1   80WKHYMD
     I                                        1   40WKHY4
     I                                        1   20WKHY2
     I                                        3   80WKYMD
     I                                        3   40WKHY
     I                                        5   60WKHM
     I                                        7   80WKHD
      *
     I            DS
     I                                        1  11 WKSMDB
     I                                        3  11 WKSYMD
     I                                        3   80WSYMD
     I                                        1   40WKUKYY
     I                                        5   60WKUKMM
     I                                        7   80WKUKDD
     I                                        9   9 WKF1
     I                                       10  110WKUBIN
     I            DS
     I                                        1  11 WKEMDB
     I                                        3  11 WKEYMD
     I                                        3   80WEYMD
     I                                        1   40WKSTYY
     I                                        5   60WKSTMM
     I                                        7   80WKSTDD
     I                                        9   9 WKF2
     I                                       10  110WKSBIN
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     I            DS
     I                                        1   80ZDKOHZ
     I                                        5   80@CKOMD
     I                                        1   40ZDKOYY
     I                                        5   60ZDKOMM
     I                                        7   80ZDKODD
      *
     I            DS
     I                                        1   80ZDSKHZ
     I                                        1   40ZDSKYY
     I                                        5   60ZDSKMM
     I                                        7   80ZDSKDD
      *
     I            DS
     I                                        1   80ZASKHZ
     I                                        1   40ZASKYY
     I                                        5   60ZASKMM
     I                                        7   80ZASKDD
      *
     I            DS
     I                                        1   40XXMD
     I                                        1   20XXMM
     I                                        3   40XXDD
     I            DS
     I                                        1   8 @KNRN
     I                                        1   1 @CKNO1
     I                                        2   2 @CKNO2
     I                                        3   6 @CKNO3
     I                                        7   7 WKFX
     I                                        8   8 @CKNOE
      *
      *----------------------------------------------------*
      *  PARAMETER TRANSFER                                *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PCMD1   1
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C           KEYZD1    KLIST
     C                     KFLD           #SZAIS 15
     C                     KFLD           #SZAIK  52
     C                     KFLD           #SKOJE  40
     C                     KFLD           #SKAKE  40
      *
     C           KEYZD2    KLIST
     C                     KFLD           #KZAIS 15
     C                     KFLD           #KZAIK  52
      *
     C           KEYZD3    KLIST
     C                     KFLD           #CZAIS 15
     C                     KFLD           #CZAIK  52
     C                     KFLD           #CKOJE  40
     C                     KFLD           #CKAKE  40
     C                     KFLD           #KHYY   40
     C                     KFLD           #KHMM   20
     C                     KFLD           #KHDD   20
      *
     C           KEYZB1    KLIST
     C                     KFLD           #BZAIS 15
     C                     KFLD           #BZAIK  52
     C                     KFLD           #BKOJE  40
     C                     KFLD           #BKAKE  40
      *
     C           KEYF21    KLIST
     C                     KFLD           #KSHN1  5
     C                     KFLD           #KSHN2  5
     C                     KFLD           #KSHN3  2
      *
     C           KEYU11    KLIST
     C                     KFLD           #KSHN1
     C                     KFLD           #KSHN2
     C                     KFLD           #KSHN3
     C                     KFLD           #KNTYM  60
      *
     C           KEYA51    KLIST
     C                     KFLD           #KJOKN  2
     C                     KFLD           #KKANB  1
      *
     C           KEYF81    KLIST
     C                     KFLD           #KHYY   40
     C                     KFLD           #KHMM   20
     C                     KFLD           #KHDD   20
      *----------------------------------------------------*
      *  MAIN ROUTINE                                    *
      *----------------------------------------------------*
     C                     EXSR $SB100
     C           *IN01     DOWEQ'0'
     C                     EXSR $SB200
     C                     END
     C                     EXSR $SB300
      *----------------------------------------------------*
      *   INITIAL PROCESS                                *
      *----------------------------------------------------*
     CSR         $SB100    BEGSR
     C                     TIME           TIME
     C                     Z-ADD*DATE     HYMD8
     C                     SETOF                     1613
     C                     SETOF                     1599
     C                     MOVEL*BLANK    @ERR
     C                     MOVE *BLANK    DSPSW1  1
     C                     MOVE *BLANK    DSPSW2  1
     C                     MOVE *BLANK    DSPSW3  1
     C                     Z-ADD0         SAVNBR  40
     C                     Z-ADD0         MAXNBR  40
     C                     MOVE '1'       INQPTY  1
      *SFL CLEAR
     C                     SETON                     71
     C                     WRITESFLREC
     C                     SETOF                     71
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         WKPAGE  20
     C                     Z-ADD1         @SFRC1
     C                     MOVE '1'       DSPSW1
     C                     MOVE '0'       DSPSW2
     C                     MOVE '0'       DSPSW3
     CSR         $S100E    ENDSR
      *----------------------------------------------------*
      *   MAIN PROCESS                                   *
      *----------------------------------------------------*
     CSR         $SB200    BEGSR
      *
     C           *IN01     DOWEQ'0'
     C           *IN02     ANDEQ'0'
     C           DSPSW1    ANDEQ'1'
     C                     EXSR $SB210
     C                     END
      *
     C           *IN01     DOWEQ'0'
     C           *IN02     ANDEQ'0'
     C           DSPSW2    ANDEQ'1'
     C                     EXSR $SB220
     C                     END
      *
     C           *IN03     DOWEQ'0'
     C           DSPSW3    ANDEQ'1'
     C                     EXSR $SB230
     C                     END
      *
     CSR         $S200E    ENDSR
      *----------------------------------------------------*
      *    1ST. SCERRN     (IZBPW051)                      *
      *----------------------------------------------------*
     CSR         $SB210    BEGSR
     C                     EXFMTIZBPW051
     C                     SETOF                     323399
     C                     MOVEL*BLANK    @ERR
     C                     MOVE ' '       CMD2    1
      *
     C           *IN01     IFEQ '1'
     C                     GOTO $S210E
     C                     END
      *
     C           *IN02     IFEQ '1'
     C                     MOVE '0'       DSPSW1
     C                     MOVE '0'       DSPSW2
     C                     MOVE '0'       DSPSW3
     C                     MOVE '1'       CMD2
     C                     SETON                     01
     C                     GOTO $S210E
     C                     END
      *
     C           @IZIS     IFEQ *BLANK
     C           @IZIK     ANDNE0
     C                     SETON                     3299
     C                     MOVELER,1      @ERR
     C                     GOTO $S210E
     C                     END
      *
     C                     MOVE '1'       INQPTY
     C           @IZIK     IFEQ 0
     C                     MOVE '2'       INQPTY
     C                     END
     C           @IZIS     IFEQ *BLANK
     C           @IZIK     ANDEQ0
     C                     MOVE '3'       INQPTY
     C                     END
      *
     C                     MOVEL@IZIS     #KZAIS
     C                     Z-ADD@IZIK     #KZAIK
     C                     SETOF                     2123
      *
     C           INQPTY    IFEQ '1'
     C           KEYZD2    SETLLIZBPL01
     C                     END
      *
     C           INQPTY    IFEQ '2'
     C           #KZAIS    SETLLIZBPL01
     C                     END
      *
     C           INQPTY    IFEQ '3'
     C           *LOVAL    SETLLIZBPL01
     C                     END
      *
     C                     DO   *HIVAL
      *
     C           INQPTY    IFEQ '1'
     C           KEYZD2    READEIZBPL011                 21
     C                     END
     C           INQPTY    IFEQ '2'
     C           #KZAIS    READEIZBPL011                 21
     C                     END
     C           INQPTY    IFEQ '3'
     C                     READEIZBPL011                 21
     C                     END
      *
     C                     SETOF                     22
     C           *IN21     IFEQ '0'
     C           ZDSKJY    ANDEQ'D'
     C           ZDSKHZ    ANDLEHYMD8
     C                     SETON                       22
     C                     END
      *
     C           ZDSTYY    IFNE 9999
     C                     SETON                       22
     C                     END
      *
     C           *IN21     IFEQ '0'
     C           *IN22     ANDEQ'0'
     C                     SETON                       23
     C                     END
      *
     C  N21N23             END
     C           *IN21     IFEQ '1'
     C           *IN23     ANDEQ'0'
     C                     SETON                     323399
     C                     MOVELER,2      @ERR
     C                     GOTO $S210E
     C                     END
      *
     C                     SETOF                     8166
     C                     Z-ADD0         @NUBR
      *
     C           KEYZD2    SETLLIZBPL01
      *
     C           INQPTY    IFNE '3'
     C                     DO   *HIVAL
     C                     EXSR $SB401
     C  N81N66             END
     C                     END
      *
     C           INQPTY    IFEQ '3'
     C                     DO   *HIVAL
     C                     EXSR $SB400
     C  N81N66             END
     C                     END
      *
     C                     EXSR $SB900
      *
     C                     MOVE '0'       DSPSW1
     C                     MOVE '1'       DSPSW2
     C                     MOVE '0'       DSPSW3
     CSR         $S210E    ENDSR
      *----------------------------------------------------*
      *   SFL DISPLAY    (SFL SFLREC)                    *
      *----------------------------------------------------*
     CSR         $SB220    BEGSR
     C                     SETON                     70
     C                     WRITEIZBPW059
     C                     WRITESFLREC
     C                     EXFMTIZBPW057
     C                     SETOF                     7035
     C                     SETOF                     99
      * CMD-1
     C           *IN01     IFEQ '1'
     C                     GOTO $S220E
     C                     END
      * CMD-2
     C           *IN02     IFEQ '1'
     C                     SETOF                     03
     C                     EXSR $SB410
     C                     MOVE '1'       DSPSW1
     C                     MOVE '0'       DSPSW2
     C                     MOVE '0'       DSPSW3
     C                     GOTO $S220E
     C                     END
      * ROLLDOWN
     C           *IN52     IFEQ '1'
     C                     ADD  1         CTRX
     C                     Z-ADDMAXNBR    @NUBR
     C           WKPAGE    IFGT 2
     C                     ADD  1         @NUBR
     C                     END
      *
     C           WKPAGE    IFEQ 1
     C                     GOTO $S220E
     C                     END
      *
     C           *IN81     IFEQ '1'
      *
     C                     SETOF                       81
     C                     MOVE @IZIS     #KZAIS
     C                     MOVE @IZIK     #KZAIK
     C           INQPTY    IFEQ '1'
     C           KEYZD2    SETGTIZBPL011
     C                     END
     C           INQPTY    IFEQ '2'
     C           #KZAIS    SETGTIZBPL011
     C                     END
     C           INQPTY    IFEQ '3'
     C           *HIVAL    SETGTIZBPL011
     C                     END
      *
     C                     END
      *
     C                     ADD  14        CTRX
     C                     SETOF                     27
      *
     C           INQPTY    IFNE '3'
     C                     DO   *HIVAL
     C                     EXSR $SB403
     C  N81N27             END
     C                     END
      *
     C           INQPTY    IFEQ '3'
     C                     DO   *HIVAL
     C                     EXSR $SB402
     C  N81N27             END
     C                     END
      * CTR CLEAR
     C                     Z-ADD0         CTRX    40
      *
     C           *IN81     IFEQ '1'
     C                     SETOF                       81
     C                     MOVE @IZIS     #KZAIS
     C                     MOVE @IZIK     #KZAIK
      *
     C           INQPTY    IFEQ '3'
     C           *LOVAL    SETLLIZBPL011
     C                     END
     C           INQPTY    IFEQ '2'
     C           #KZAIS    SETLLIZBPL011
     C                     END
     C           INQPTY    IFEQ '1'
     C           KEYZD2    SETLLIZBPL011
     C                     END
      *
     C                     Z-ADD0         @NUBR
     C                     Z-ADD0         MAXNBR
     C                     END
      *
      * SUB-FILE CLEAR
     C                     SETON                     71
     C                     WRITESFLREC
     C                     SETOF                     71
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
      *
     C                     SETOF                       66
     C           INQPTY    IFNE '3'
     C                     DO   *HIVAL
     C                     EXSR $SB401
     C  N81N66             END
     C                     END
      *
     C           INQPTY    IFEQ '3'
     C                     DO   *HIVAL
     C                     EXSR $SB400
     C  N81N66             END
     C                     END
      *
     C                     EXSR $SB900
     C                     SUB  1         WKPAGE
     C                     END
      * ROLL-UP
     C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
     C                     Z-ADDMAXNBR    @NUBR
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
     C                     SETON                       71
     C                     WRITESFLREC
     C                     SETOF                       7166
      *
     C           INQPTY    IFEQ '3'
     C                     DO   *HIVAL
     C                     EXSR $SB400
     C  N81N66             END
     C                     END
      *
     C           INQPTY    IFNE '3'
     C                     DO   *HIVAL
     C                     EXSR $SB401
     C  N81N66             END
     C                     END
      *
     C                     EXSR $SB900
     C                     ADD  1         WKPAGE
     C                     END
      *
     C           @BANGO    IFNE *ZERO
     C                     SETOF                       6823
     C                     Z-ADD0         X       20
     C                     DO   *HIVAL
     C                     ADD  1         X
     C                     SETOF                     2928
     C           X         CHAINSFL                  29
     C           *IN23     IFEQ '0'
     C           @BANGO    IFEQ @NUBR
     C                     SETON                     28
     C                     END
     C                     END
     C  N29N28             END
     C           *IN28     IFEQ '0'
     C           *IN29     ANDEQ'1'
     C                     SETON                     9935
     C                     MOVELER,3      @ERR
     C                     GOTO $S220E
     C                     END
      *KEY FILD SETTING
     C                     MOVE @DSYMD    WKSYMD
     C                     MOVE WSYMD     SAVYMD  60
     C                     MOVEL@DZAIK    #CZAIK
     C                     MOVE @DZAIS    #CZAIS
     C                     Z-ADD@KAKE     #CKAKE
     C                     Z-ADD@KOJE     #CKOJE
     C                     Z-ADD@DUKYY    #KHYY
     C                     Z-ADD@DUKMM    #KHMM
     C                     Z-ADD@DUKDD    #KHDD
     C                     SETOF                     29
     C           KEYZD3    CHAINIZBPL011             29
     C  N29                EXSR $SB221
      *
     C                     MOVE '0'       DSPSW1
     C                     MOVE '0'       DSPSW2
     C                     MOVE '1'       DSPSW3
     C                     END
      *
     CSR         $S220E    ENDSR
      *----------------------------------------------------*
      *     NEXT DISPLAY FILD EDIT                       *
      *----------------------------------------------------*
     CSR         $SB221    BEGSR
     C                     MOVEL@DCMT     @KOSN
     C                     MOVEL@DZAIS    @ZIS
     C                     Z-ADD@DZAIK    @ZIK
      *
     C                     SETOF                     29
     C           @KOJE     CHAINFGBPL011             29
     C           *IN29     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLEHYMD8
     C                     SETON                     29
     C                     END
     C           *IN29     IFEQ '0'
     C                     MOVELB2SMEI    @KOJNM
     C                     END
     C                     SETOF                     29
     C           @KAKE     CHAINFGBPL011             29
     C           *IN29     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLEHYMD8
     C                     SETON                     29
     C                     END
     C           *IN29     IFEQ '0'
     C                     MOVELB2SMEI    @SUPNM
     C                     END
     C                     Z-ADDZDTKJR    @TKJR
     C                     MOVE ZDNISG    @NISG
     C                     MOVE *BLANK    @NISN
     C           @NISG     IFEQ 1
     C                     MOVEL'CARRIER' @NISN
     C                     END
     C           @NISG     IFEQ 2
     C                     MOVEL'COIL'    @NISN
     C                     END
     C                     MOVE ZDKOSN    @CKOSN
     C                     MOVELZDZIRO    @ZIRO
     C                     Z-ADDZDMSJR    @MSJR
     C                     Z-ADDZDMKJR    @MKJR
     C                     MOVE ZDADR1    @ADR1
     C                     MOVE ZDADR2    @ADR2
     C                     MOVE ZDADR3    @ADR3
     C                     MOVE ZDADR4    @ADR4
      *
     C                     MOVE @DZAIS    #BZAIS
     C                     MOVE @DZAIK    #BZAIK
     C                     Z-ADD@KAKE     #BKAKE
     C                     Z-ADD@KOJE     #BKOJE
     C                     MOVE *BLANK    @KNRN
     C                     MOVE ZDKNO1    @CKNO1
     C                     MOVE ZDKNO2    @CKNO2
     C                     MOVE ZDKNO3    @CKNO3
     C                     MOVE ZDKNOE    @CKNOE
     C                     MOVE '-'       WKFX
     C           @CKNOE    IFEQ *BLANK
     C                     MOVE *BLANK    WKFX
     C                     END
      *
     C                     EXSR $SB910
      *
     CSR         $S221E    ENDSR
      *----------------------------------------------------*
      *     3RD. SCRREN PROCESS (IZBPW053)                 *
      *----------------------------------------------------*
     CSR         $SB230    BEGSR
     C                     EXFMTIZBPW053
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     373940
     C                     SETOF                     99
     C                     MOVEL*BLANK    @ERR
      * CMD-3
     C           *IN03     IFEQ '1'
     C                     SETOF                     03
     C                     MOVE '0'       DSPSW3
     C                     MOVE '1'       DSPSW2
     C                     MOVE '0'       DSPSW1
     C                     MOVE *ZERO     @BANGO
     C           KEYZD1    SETLLIZBPL011
     C                     Z-ADDSAVNBR    @NUBR
     C                     GOTO $S230E
     C                     END
      *
     CSR         $S230E    ENDSR
      *----------------------------------------------------*
      *   EXIT PROCESS                                   *
      *----------------------------------------------------*
     CSR         $SB300    BEGSR
     C           *IN01     IFEQ '1'
     C                     MOVE '1'       PCMD1
     C                     END
     C           CMD2      IFEQ '1'
     C                     MOVE '2'       PCMD1
     C                     END
     C                     SETON                     LR
     C                     RETRN
     CSR         $S300E    ENDSR
      *----------------------------------------------------*
      *   ALL DATA SELECT                                *
      *----------------------------------------------------*
     CSR         $SB400    BEGSR
     C                     READ IZBPL01                  81
     C                     SETOF                       67
      *
     C           *IN81     IFEQ '0'
     C           ZDSKJY    ANDEQ'D'
     C           ZDSKHZ    ANDLEHYMD8
     C                     SETON                       67
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN67     ANDEQ'0'
      *
     C                     EXSR $SB499
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     ADD  1         CTRX
     C                     ADD  1         @NUBR
     C                     Z-ADD@NUBR     SAVNBR
     C                     Z-ADD@NUBR     MAXNBR
     C                     WRITESFL
      *
     C           CTRX      IFEQ 14
     C                     SETON                       66
     C                     END
      *
     C                     END
      *
     CSR         $S400E    ENDSR
      *----------------------------------------------------*
      *   KEY SELECT                                     *
      *----------------------------------------------------*
     CSR         $SB401    BEGSR
     C           INQPTY    IFEQ '1'
     C           KEYZD2    READEIZBPL011                 81
     C                     END
     C           INQPTY    IFEQ '2'
     C           #KZAIS    READEIZBPL011                 81
     C                     END
     C                     SETOF                       67
      *
     C           *IN81     IFEQ '0'
     C           ZDSKJY    ANDEQ'D'
     C           ZDSKHZ    ANDLEHYMD8
     C                     SETON                       67
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN67     ANDEQ'0'
      *
     C                     EXSR $SB499
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     ADD  1         CTRX
     C                     ADD  1         @NUBR
     C                     Z-ADD@NUBR     SAVNBR
     C                     Z-ADD@NUBR     MAXNBR
     C                     WRITESFL
      *
     C           CTRX      IFEQ 14
     C                     SETON                       66
     C                     END
      *
     C                     END
      *
     CSR         $S401E    ENDSR
      *----------------------------------------------------*
      *   READP                                          *
      *----------------------------------------------------*
     CSR         $SB402    BEGSR
     C                     SETOF                       27
     C                     DO   *HIVAL
     C                     READPIZBPL01                  81
      *
     C                     SETOF                       67
     C           *IN81     IFEQ '0'
     C           ZDSKJY    ANDEQ'D'
     C           ZDSKHZ    ANDLEHYMD8
     C                     SETON                       67
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN67     ANDEQ'0'
      *
     C                     SUB  1         CTRX           27
     C                     SUB  1         @NUBR
     C                     Z-ADD@NUBR     SAVNBR
     C                     Z-ADD@NUBR     MAXNBR
      *
     C                     END
      *
     C  N27N81             END
     CSR         $S402E    ENDSR
      *----------------------------------------------------*
      *   ROD      KANBAN M/F (READP)                    *
      *----------------------------------------------------*
     CSR         $SB403    BEGSR
     C                     SETOF                       27
     C                     DO   *HIVAL
      *
     C           INQPTY    IFEQ '1'
     C           KEYZD2    REDPEIZBPL01                  81
     C                     END
     C           INQPTY    IFEQ '2'
     C           #KZAIS    REDPEIZBPL01                  81
     C                     END
      *
     C                     SETOF                     67
     C           *IN81     IFEQ '0'
     C           ZDSKJY    ANDEQ'D'
     C           ZDSKHZ    ANDLEHYMD8
     C                     SETON                       67
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN67     ANDEQ'0'
      *
     C                     SUB  1         CTRX           27
     C                     SUB  1         @NUBR
     C                     Z-ADD@NUBR     SAVNBR
     C                     Z-ADD@NUBR     MAXNBR
      *
     C                     END
      *
     C  N27N81             END
     CSR         $S403E    ENDSR
      *----------------------------------------------------*
      *   CLEAR IS DSIPLAY ITEM                          *
      *----------------------------------------------------*
     CSR         $SB410    BEGSR
     C                     SETON                     71
     C                     WRITESFLREC
     C                     SETOF                     710203
     C                     Z-ADD0         RRN
     C                     Z-ADD0         @RRN
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
     C                     MOVE *BLANK    @IZIS
     C                     Z-ADD0         @IZIK
     C                     Z-ADD0         @BANGO
     CSR         $S410E    ENDSR
      *----------------------------------------------------*
      *   EDIT                                             *
      *----------------------------------------------------*
     CSR         $SB499    BEGSR
      *
     C                     MOVELZDZAIS    @DZAIS
     C                     Z-ADDZDZAIK    @DZAIK
     C                     MOVE ZDSIRE    @DSIRE
     C                     SETOF                     29
     C                     MOVEL*BLANK    @DSIRN
     C           ZDSIRE    CHAINFGBPL011             29
     C           *IN29     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLEHYMD8
     C                     SETON                     29
     C                     END
     C           *IN29     IFEQ '0'
     C                     MOVELB2SMEI    @DSIRN
     C                     END
      *
     C                     MOVE ZDSIRE    @KAKE
     C                     MOVE ZDKOJE    @KOJE
      *
     C                     MOVE ZDUKYY    WKUKYY
     C                     MOVE ZDUKMM    WKUKMM
     C                     MOVE ZDUKDD    WKUKDD
     C                     MOVE '-'       WKF1
     C                     MOVE ZDUBIN    WKUBIN
     C                     MOVE WKSYMD    @DSYMD
      *
     C                     MOVE ZDSTYY    WKSTYY
     C                     MOVE ZDSTMM    WKSTMM
     C                     MOVE ZDSTDD    WKSTDD
     C                     MOVE '-'       WKF2
     C                     MOVE ZDSBIN    WKSBIN
     C                     MOVE WKEYMD    @DEYMD
     C                     SETOF                     29
     C                     Z-ADD1         J       20
     C           ZDDTKO    LOKUPCMT1,J                   29
     C   29                MOVELCMT2,J    @DCMT
      *
     C                     Z-ADDZDUKYY    @DUKYY
     C                     Z-ADDZDUKMM    @DUKMM
     C                     Z-ADDZDUKDD    @DUKDD
     CSR         $S499E    ENDSR
      *----------------------------------------------------*
      *    RECORD POINTER SETTING                        *
      *----------------------------------------------------*
     CSR         $SB900    BEGSR
      *
     C                     SETOF                         69
     C                     DO   *HIVAL
      *
     C           INQPTY    IFEQ '1'
     C           KEYZD2    READEIZBPL01                  81
     C                     END
      *
     C           INQPTY    IFEQ '2'
     C           #KZAIS    READEIZBPL01                  81
     C                     END
      *
     C           INQPTY    IFEQ '3'
     C                     READ IZBPL011                 81
     C                     END
      *
     C                     SETOF                       64
      *
     C           *IN81     IFEQ '0'
     C           ZDSKJY    ANDEQ'D'
     C           ZDSKHZ    ANDLEHYMD8
     C                     SETON                       64
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN64     ANDEQ'0'
     C                     MOVE ZDZAIS    #SZAIS
     C                     Z-ADDZDZAIK    #SZAIK
     C                     Z-ADDZDSIRE    #SKAKE
     C                     Z-ADDZDKOJE    #SKOJE
     C                     SETON                       69
     C                     END
      *
     C  N81N69             END
      *
     C           *IN69     IFEQ '1'
     C           KEYZD1    SETLLIZBPL011
     C                     END
      *
     CSR         $S900E    ENDSR
      *----------------------------------------------------*
      *    IZAPP10 READ                                  *
      *----------------------------------------------------*
     CSR         $SB910    BEGSR
     C                     MOVE *BLANK    #KSHN1
     C                     MOVE *BLANK    #KSHN2
     C                     MOVE *BLANK    #KSHN3
     C                     Z-ADD0         @ZJIT
     C                     Z-ADD0         @1NAIG
     C                     Z-ADD0         @2NAIG
     C                     Z-ADD0         WKSOZI  72
     C                     Z-ADD0         WKNAI1 112
     C                     Z-ADD0         WKNAI2 112
     C                     Z-ADD0         WKN1SU  90
     C                     Z-ADD0         WKN2SU  90
      *
     C           KEYZB1    SETLLIZBPL101
     C                     DO   *HIVAL
     C                     SETOF                     30
     C           KEYZB1    READEIZBPL101                 30
     C           *IN30     IFEQ '0'
     C           ZASKJY    IFEQ 'D'
     C           ZASKHZ    ANDLEHYMD8
     C                     ELSE
      *
     C                     MOVE ZASHN1    #KSHN1
     C                     MOVE ZASHN2    #KSHN2
     C                     MOVE ZASHN3    #KSHN3
     C                     Z-ADDZASOZI    WKSOZI
      *
     C                     Z-ADD0         WKGOKE  90
     C           KEYF21    SETLLMBEPL021
     C                     DO   *HIVAL
     C                     SETOF                     29
     C           KEYF21    READEMBEPL021                 29
     C           *IN29     IFEQ '0'
     C           F2SKJY    ANDEQ*BLANK
     C                     ADD  F2GOKE    WKGOKE
     C                     END
     C  N29                END
      *
     C           WKGOKE    MULT WKSOZI    WKJIT  112
     C           WKJIT     DIV  1000      WGOSO1  80H
     C                     ADD  WGOSO1    @ZJIT
      *
     C                     SETOF                     29
     C                     Z-ADD0         WKN1SU
     C                     Z-ADD0         WKN2SU
     C                     MOVE HYM6      #KNTYM  60
     C           KEYU11    CHAINABBPL211             29
     C           *IN29     IFEQ '1'
     C                     Z-ADDZAGEKN    WKN1SU
     C                     Z-ADDZAGEKN    WKN2SU
     C                     ELSE
      *
     C           U1NGKB    IFEQ 'N'
     C                     Z-ADDU1N1NM    WKN1SU
     C                     Z-ADDU1N2NM    WKN2SU
     C                     ELSE
     C                     Z-ADDU1S1NM    WKN1SU
     C                     Z-ADDU1S2NM    WKN2SU
     C                     END
     C                     END
      *
     C           WKN1SU    MULT WKSOZI    WKNAI1
     C           WKN2SU    MULT WKSOZI    WKNAI2
     C           WKNAI1    DIV  1000      WGOSO1    H
     C                     ADD  WGOSO1    @1NAIG
     C           WKNAI2    DIV  1000      WGOSO1    H
     C                     ADD  WGOSO1    @2NAIG
      *
     C                     END
     C                     END
     C  N30                END
      *
     C           @MSJR     DIV  20        @DSJR     H
     C           @MKJR     DIV  20        @DKJR     H
      *
     C                     MOVE ZDSETI    @MSET
     C                     MOVE ZDLOTO    @LOT
     C                     MOVE ZDSLTM    @LT
     C                     MOVE ZDKEIS    @BARA
     C                     Z-ADDZDKMAL    @CKMAL
     C                     Z-ADDZDKMMN    @CKMMN
     C                     Z-ADDZDKMMX    @CKMMX
     C                     Z-ADDZDCHOS    @CHOS
     C                     MOVE ZDUKIR    @RCVC
     C                     MOVE ZDUKYY    WKUKYY
     C                     MOVE ZDUKMM    WKUKMM
     C                     MOVE ZDUKDD    WKUKDD
     C                     MOVE WSYMD     @SYMD
     C                     MOVE ZDUBIN    @SBIN
     C                     MOVE ZDSTYY    WKSTYY
     C                     MOVE ZDSTMM    WKSTMM
     C                     MOVE ZDSTDD    WKSTDD
     C                     MOVE WEYMD     @EYMD
     C                     MOVE ZDSBIN    @EBIN
     C                     Z-ADDZDKMAL    WKALL   30
     C                     Z-ADDZDKMMN    WMIN    30
     C                     Z-ADDZDKMMX    WMAX    30
     C           ZDKMAL    IFLT ZDKMMX
     C                     Z-ADDZDKMMX    WALL    30
     C                     ELSE
     C                     Z-ADDZDKMAL    WALL
     C                     END
     C                     MOVE ZDKMAL    @CKMAL  30
     C                     MOVE ZDKMMN    @CKMMN  30
     C                     MOVE ZDKMMX    @CKMMX  30
     C                     MOVE ZDDTKO    @CDTKO  1
     C                     MOVE ZDDOUT    @CDOUT  1
     C                     MOVE ZDKOYY    @CKOYY  40
     C                     MOVE ZDKSHK    @CKSHK  1
     C                     MOVE ZDALHK    @CALHK  30
     C                     MOVE ZDMXHK    @CMXHK  30
     C                     MOVE ZDKOSN    @CKOSN
     C                     MOVE ZDKOSN    KSKBN   10
     C                     MOVE ZDSRMS    @CSRMS  30
     C                     MOVE ZDKOUT    @CKOUT  1
      *
     CSR         $S910E    ENDSR
** MSG
E-01 MATERIAL ISN'T INPUT
E-02 THERE IS NOT DATA WHICH IS INQUIRED TO
E-03 INPUT DETAIL NUMBER DISPLAYED
**  CMT1/CMT2 (COMMENT NAME)
0CANCEL                                               1
1UPDATED                                              2
2ADD                                                  3
3SET NBR                                              4
4                                                     5
5CHPD.DAY                                             6
6EFCT.DAY                                             7
7LAPS.DAY                                             8
8INCREASE                                             9
9DECREASE                                            10
ALOCATION                                            11
DKIND                                                12
EKIND CHG                                            13
