     H            Y.
     F** JCMR10 **********************************************
     F*  PROGRAM: SAVE EDI(856) ASN DATA TO FORD (FOR J-COM) *
     F*  WRITTEN: JW (SRA)                                   *
     F*  DATE   : 05/06/2016                                 *
     F*         : READ AB#EP66 AND CALL JMCC12               *
     F*----------------------------------------------        *
     F*  JW1      2024.08.06 CHG AB#EL67S TO AB#EL66A        *
     F*------------------------------------------------------*
     F**AB#EP66SUF  E                    DISK
     F**AB#EL67SUF  E                    DISK
JW1  FAB#EL66AUF  E                    DISK
      *--------------------------------------------------------
     C                     MOVE *OFF      *IN91
     C           *IN91     DOWEQ*OFF
     C                     READ AB#E66S1                 91
     C           *IN91     IFEQ *OFF
     C           E6FILR    ANDEQ*BLANK
     C                     MOVEL'*'       E6FILR
     C                     UPDATAB#E66S1
      *
     C                     MOVELE6SHID    SHIP#
     C                     CALL 'JCMR12'
     C                     PARM           SHIP#  10
     C                     PARM           RTN     1
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
