     H            Y.
      ** JCMR20B *******************************************************
      *  FORD ASN INQ +(997) +(BY PROCESS DATE)                        *
      *  JW     2024/08/13                                             *
      ******************************************************************
     FJCMPW20BCF  E                    WORKSTN
     F                                        RRN   KSFILE SFL01
     FJCMPL11AIF  E           K        DISK
     F            JCMPP111                          KRENAMEJCMPL111
     FJCMPL11DIF  E           K        DISK
     FJCMPL11CIF  E           K        DISK
     F            JCMPP111                          KRENAMEJCMPL11X
     FJCMPP12 IF  E           K        DISK
      *---------------------------------------------------
     E                    MSG     1  20 50
     E                    MHN        12 14
     E                    QTY        12  7 0
     E                    CUM        12  7 0
     E                    BOX        12  3 0
     I            DS
     I                                        1 168 MHN
     I                                        1  14 J2MHN1
     I                                       15  28 J2MHN2
     I                                       29  42 J2MHN3
     I                                       43  56 J2MHN4
     I                                       57  70 J2MHN5
     I                                       71  84 J2MHN6
     I                                       85  98 J2MHN7
     I                                       99 112 J2MHN8
     I                                      113 126 J2MHN9
     I                                      127 140 J2MHNA
     I                                      141 154 J2MHNB
     I                                      155 168 J2MHNC
     I            DS
     I                                        1  840QTY
     I                                        1   70J2QTY1
     I                                        8  140J2QTY2
     I                                       15  210J2QTY3
     I                                       22  280J2QTY4
     I                                       29  350J2QTY5
     I                                       36  420J2QTY6
     I                                       43  490J2QTY7
     I                                       50  560J2QTY8
     I                                       57  630J2QTY9
     I                                       64  700J2QTYA
     I                                       71  770J2QTYB
     I                                       78  840J2QTYC
     I            DS
     I                                        1  840CUM
     I                                        1   70J2CUM1
     I                                        8  140J2CUM2
     I                                       15  210J2CUM3
     I                                       22  280J2CUM4
     I                                       29  350J2CUM5
     I                                       36  420J2CUM6
     I                                       43  490J2CUM7
     I                                       50  560J2CUM8
     I                                       57  630J2CUM9
     I                                       64  700J2CUMA
     I                                       71  770J2CUMB
     I                                       78  840J2CUMC
     I            DS
     I                                        1  360BOX
     I                                        1   30J2BOX1
     I                                        4   60J2BOX2
     I                                        7   90J2BOX3
     I                                       10  120J2BOX4
     I                                       13  150J2BOX5
     I                                       16  180J2BOX6
     I                                       19  210J2BOX7
     I                                       22  240J2BOX8
     I                                       25  270J2BOX9
     I                                       28  300J2BOXA
     I                                       31  330J2BOXB
     I                                       34  360J2BOXC
     I            DS
     I                                        1  140@TIME
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I              'BOX90     '          C         @@PLT
     I              'PLT90     '          C         @@LID
     I              'RETURNABLE'          C         @@RET
     I              'FORD BOX  '          C         @@BOX
     I              '********* '          C         @@NOT
      *************************************************************
      *  MAIN
      *************************************************************
     C                     EXSR #INIT
      * DISPLAY
     C           W@ID      DOWEQ'01'
     C                     EXFMTDSP01
     C                     MOVEL*BLANKS   XMSG
     C                     MOVE *OFF      *IN85
     C                     SETOF                     41  42
     C                     SETOF                     43  44
     C                     SETOF                     45  46
      * F1/3 END
     C           *INKA     IFEQ *ON
     C           *INKC     OREQ *ON
     C           *INKL     OREQ *ON
     C                     MOVE '99'      W@ID
     C                     LEAVE
     C                     ENDIF
      *
     C                     EXSR #CHK1
      * NO ERROR & F5
     C           *IN85     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #INQ
     C           RC@CNT    IFEQ 0
     C                     MOVELMSG,8     XMSG
     C                     ENDIF
     C                     ENDIF
      * NO ERROR & NOT F5
     C           *IN85     IFEQ *OFF
     C           *INKE     ANDEQ*OFF
     C                     MOVELMSG,5     XMSG
     C                     ENDIF
      *
     C                     ENDDO
      * FOOT
     C           XASN      IFNE *BLANK
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------------
      *          CHECK DATA
      *-----------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     MOVE *OFF      *IN85
     C                     MOVE *BLANK    ETYPE   1
      * CHECK ENTRY
     C           XFROM3    IFNE *BLANK
     C           XTO3      ORNE *BLANK
     C                     MOVE 'I'       ETYPE            BY ISSUE DATE
     C                     ENDIF
      *
     C           XFROM1    IFNE *BLANK
     C           XTO1      ORNE *BLANK
     C           ETYPE     IFEQ *BLANK
     C                     MOVE 'S'       ETYPE            BY SHI DATE
     C                     ELSE
     C                     MOVE 'X'       ETYPE
     C                     SETON                     41  42
     C                     ENDIF
     C                     ENDIF
      *
     C           XAFROM    IFNE 0
     C           XATO      ORNE 0
     C           ETYPE     IFEQ *BLANK
     C                     MOVE 'A'       ETYPE            BY ASN#
     C                     ELSE
     C                     MOVE 'X'       ETYPE
     C                     SETON                     43  44
     C                     ENDIF
     C                     ENDIF
      *
     C           ETYPE     IFEQ *BLANK
     C                     SETON                     45  85
     C                     MOVELMSG,1     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           ETYPE     IFEQ 'X'
     C                     SETON                         85
     C                     MOVELMSG,3     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      * CHECK ENTRY DATA
     C                     SELEC
     C           ETYPE     WHEQ 'I'
     C                     EXSR #CKISS
     C           ETYPE     WHEQ 'S'
     C                     EXSR #CKSHP
     C           ETYPE     WHEQ 'A'
     C                     EXSR #CKASN
     C                     ENDSL
      *
     C           XCHK1     ENDSR
      *-----------------------------------------------------------
      * CHECK ISSUE DATE
      *-----------------------------------------------------------
     C           #CKISS    BEGSR
      * VALIDATE DATE FROM
     C                     MOVELXFROM3    $SRC
     C                     CALL 'UTLR01A'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE1  8
     C                     PARM           $TRUE2 10
     C                     PARM           $RTN    1
     C           $RTN      IFEQ *BLANK
     C                     MOVEL$TRUE2    XFROM3
     C                     MOVEL$TRUE1    #FROM3  80
     C                     ELSE
     C                     MOVE *ON       *IN45
     C                     MOVE *ON       *IN85
     C                     MOVELMSG,2     XMSG
     C                     GOTO XCKISS
     C                     ENDIF
      *
     C           XTO3      IFEQ *BLANK
     C                     MOVELXFROM3    XTO3
     C                     ENDIF
      * VALIDATE DATE TO
     C           XTO3      IFEQ '99999999'
     C           XTO3      OREQ MSG,13
     C                     MOVELMSG,7     XTO3
     C                     Z-ADD99999999  #TO3
     C                     ELSE
     C                     MOVELXTO3      $SRC
     C                     CALL 'UTLR01A'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE1  8
     C                     PARM           $TRUE2 10
     C                     PARM           $RTN    1
     C           $RTN      IFEQ *BLANK
     C                     MOVEL$TRUE2    XTO3
     C                     MOVEL$TRUE1    #TO3    80
     C                     ELSE
     C                     MOVE *ON       *IN46
     C                     MOVE *ON       *IN85
     C                     MOVELMSG,4     XMSG
     C                     GOTO XCKISS
     C                     ENDIF
     C                     ENDIF
      * COMPARE
     C           XFROM3    IFGT XTO3
     C                     MOVE *ON       *IN45
     C                     MOVE *ON       *IN46
     C                     MOVE *ON       *IN85
     C                     MOVELMSG,6     XMSG
     C                     GOTO XCKISS
     C                     ENDIF
      * IF NO ERROR..
     C                     MOVELMSG,19    XBY
     C                     MOVE *ON       *IN49            YLW
     C                     MOVE *ON       *IN50
      *
     C           XCKISS    ENDSR
      *-----------------------------------------------------------
      * CHECK SHIP DATE
      *-----------------------------------------------------------
     C           #CKSHP    BEGSR
      * VALIDATE DATE FROM
     C                     MOVELXFROM1    $SRC
     C                     CALL 'UTLR01A'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE1  8
     C                     PARM           $TRUE2 10
     C                     PARM           $RTN    1
     C           $RTN      IFEQ *BLANK
     C                     MOVEL$TRUE2    XFROM1
     C                     MOVEL$TRUE1    #FROM1  80
     C                     ELSE
     C                     MOVE *ON       *IN41
     C                     MOVE *ON       *IN85
     C                     MOVELMSG,2     XMSG
     C                     GOTO XCKSHP
     C                     ENDIF
      *
     C           XTO1      IFEQ *BLANK
     C                     MOVELXFROM1    XTO1
     C                     ENDIF
      * VALIDATE DATE TO
     C           XTO1      IFEQ '99999999'
     C           XTO1      OREQ MSG,13
     C                     MOVELMSG,7     XTO1
     C                     Z-ADD99999999  #TO1
     C                     ELSE
     C                     MOVELXTO1      $SRC
     C                     CALL 'UTLR01A'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE1  8
     C                     PARM           $TRUE2 10
     C                     PARM           $RTN    1
     C           $RTN      IFEQ *BLANK
     C                     MOVEL$TRUE2    XTO1
     C                     MOVEL$TRUE1    #TO1    80
     C                     ELSE
     C                     MOVE *ON       *IN42
     C                     MOVE *ON       *IN85
     C                     MOVELMSG,4     XMSG
     C                     GOTO XCKSHP
     C                     ENDIF
     C                     ENDIF
      * COMPARE
     C           XFROM1    IFGT XTO1
     C                     MOVE *ON       *IN41
     C                     MOVE *ON       *IN42
     C                     MOVE *ON       *IN85
     C                     MOVELMSG,6     XMSG
     C                     GOTO XCKSHP
     C                     ENDIF
      * IF NO ERROR..
     C                     MOVELMSG,16    XBY
     C                     MOVE *OFF      *IN49            TRQ
     C                     MOVE *OFF      *IN50
      *
     C           XCKSHP    ENDSR
      *-----------------------------------------------------------
      * CHECK ASN#
      *-----------------------------------------------------------
     C           #CKASN    BEGSR
      *
     C           XATO      IFEQ 0
     C                     Z-ADDXAFROM    XATO
     C                     ENDIF
      *
     C           XAFROM    IFGT XATO
     C                     MOVE *ON       *IN43
     C                     MOVE *ON       *IN44
     C                     MOVE *ON       *IN85
     C                     MOVELMSG,15    XMSG
     C                     GOTO XCKASN
     C                     ENDIF
      * IF NO ERROR...
     C                     MOVELXAFROM    #AFROM  8
     C                     MOVELXATO      #ATO    8
     C                     MOVELMSG,17    XBY
     C                     MOVE *ON       *IN49            WHT
     C                     MOVE *OFF      *IN50
      *
     C           XCKASN    ENDSR
      *-----------------------------------------------------------
      *                    ASN INQUIRY
      *-----------------------------------------------------------
     C           #INQ      BEGSR
     C           START     TAG
      * SET DATA
     C                     SELEC
     C           ETYPE     WHEQ 'I'
     C                     EXSR #SET3
     C           ETYPE     WHEQ 'S'
     C                     EXSR #SET1
     C           ETYPE     WHEQ 'A'
     C                     EXSR #SET2
     C                     ENDSL
      *
     C                     MOVE *OFF      *INKL
     C                     MOVELMSG,9     XMSG
      *
     C           RC@CNT    IFEQ 0
     C                     GOTO EINQ
     C                     ENDIF
      *
     C                     DO   *HIVAL
      * DISPLAY SFL
     C                     WRITEDSP99
     C                     MOVE *ON       *IN70
     C                     EXFMTSFLCTL
     C                     MOVEL*BLANKS   XMSG
     C                     MOVE *OFF      *IN99
     C                     MOVE *OFF      *IN70
      *
     C                     SELEC
      * F5  REFRESH
     C           *INKE     WHEQ *ON
     C                     GOTO START
      *
      * F10 PRINT
     C**         *INKJ     WHEQ *ON
     C**                   EXSR #CHK2
     C**         *IN86     IFEQ *ON
     C**                   MOVELMSG,9     XMSG
     C**                   ELSE
     C**                   EXSR #DTL
     C**                   ENDIF
      * F12
     C           *INKA     WHEQ *ON
     C           *INKL     OREQ *ON
     C                     LEAVE
      * ENTR
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN86     IFEQ *ON
     C                     MOVELMSG,9     XMSG
     C                     ENDIF
     C           *IN86     IFEQ *OFF
     C           X@CNT     ANDNE0
     C                     MOVELMSG,12    XMSG
     C                     ENDIF
      *
     C                     ENDSL
     C                     ENDDO
      *
     C           EINQ      ENDSR
      *-----------------------------------------------------------
      *                    SET INQUIRY DATA (BY SHIP DATE)
      *-----------------------------------------------------------
     C           #SET1     BEGSR
      * CLEAR SUBFILE
     C           RRN       IFEQ 0
     C                     Z-ADD1         RRN
     C                     WRITESFL01
     C                     ENDIF
      *
     C                     MOVE *ON       *IN71
     C                     WRITESFLCTL
     C                     MOVE *OFF      *IN71
     C                     Z-ADD0         SVREHZ  80
     C                     Z-ADD0         SVBIN   20
      * GET DATA
     C                     Z-ADD0         RRN
     C                     Z-ADD1800      MAX#    40
     C                     MOVE *OFF      *IN51   1
     C           #FROM1    SETLLJCMPL11D
     C           *IN51     DOWEQ*OFF
     C                     READ JCMPL11D                 51
     C           *IN51     IFEQ *OFF
      * END?
     C**         J1NOHZ    IFGT #TO1
     C           J1REHZ    IFGT #TO1
     C                     MOVE *ON       *IN51
     C                     LEAVE
     C                     ENDIF
      * END?
     C           RRN       IFGE MAX#
     C                     MOVE *ON       *IN51
     C                     LEAVE
     C                     ENDIF
      * BREAK LINE
     C           SVREHZ    IFNE 0
     C           J1REHZ    IFNE SVREHZ
     C           J1BIN     ORNE SVBIN
     C                     CLEARSFL01
     C                     ADD  1         RRN
     C                     SETON                     47
     C                     WRITESFL01
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDJ1REHZ    SVREHZ
     C                     Z-ADDJ1BIN     SVBIN
      *
     C                     ADD  1         RRN
     C                     SETOF                     47
     C                     MOVE *OFF      *IN51
     C                     MOVE *BLANK    H@SEL
     C                     MOVE *BLANK    S@SEL
     C                     Z-ADDJ1DATE    S@ISSU
     C                     Z-ADDJ1TIME    S@TIME
     C                     Z-ADDJ1REHZ    S@SHDT
     C                     MOVELJ1NONY    S@NONY
     C                     MOVELJ1BIN     S@BIN
     C                     MOVELJ1ASN#    S@ASN
     C                     MOVE J1ASN#    S@ASN6
     C                     MOVELJ1NUKE    S@DOCK
     C                     MOVELJ1PSCC    S@SCAC
     C                     MOVELJ1SMEI    S@NAME
     C                     MOVELJ1SHID    S@SHID
     C                     Z-ADDJ1BOX     S@BOX
     C                     EXSR #PICK2
     C                     MOVEL$PICK#    S@PL
      * GET STATUS
     C                     EXSR #STS
     C                     MOVE @STS      S@STS
      * 997
     C           S@STS     IFEQ ' '
     C                     MOVE J1CRME    AFLG    1
     C                     SELEC
     C           J1KOHZ    WHEQ 0
     C                     MOVE '-'       S@997
     C                     Z-ADD0         S@997T
     C           AFLG      WHEQ 'A'
     C                     MOVE 'Y'       S@997
     C                     MOVELJ1KOTM    S@997T
     C                     OTHER
     C                     MOVE 'X'       S@997
     C                     MOVELJ1KOTM    S@997T
     C                     ENDSL
     C                     ELSE
     C                     MOVE *BLANK    S@997
     C                     Z-ADD0         S@997T
     C                     ENDIF
      * CANCELLED
     C           J1SKJY    IFEQ 'D'
     C                     MOVE 'X'       S@STS
     C                     ENDIF
      *
     C                     WRITESFL01
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADDRRN       RC@CNT  60
      *
     C                     ENDSR
      *-----------------------------------------------------------
      *  GET STATUS
      *-----------------------------------------------------------
     C           #STS      BEGSR
      *
     C           J1SHID    CHAINJCMPP12              99
     C   99                MOVE 'X'       @STS    1
     C  N99                MOVE ' '       @STS
      *
     C                     ENDSR
      *-----------------------------------------------------------
      *                    SET INQUIRY DATA (ASN)
      *-----------------------------------------------------------
     C           #SET2     BEGSR
      * CLEAR SUBFILE
     C           RRN       IFEQ 0
     C                     Z-ADD1         RRN
     C                     WRITESFL01
     C                     ENDIF
      *
     C                     MOVE *ON       *IN71
     C                     WRITESFLCTL
     C                     MOVE *OFF      *IN71
      * GET DATA
     C                     Z-ADD0         RRN
     C                     Z-ADD1800      MAX#    40
     C                     MOVE *OFF      *IN51   1
     C           #AFROM    SETLLJCMPL11A
     C           *IN51     DOWEQ*OFF
     C                     READ JCMPL11A                 51
     C           *IN51     IFEQ *OFF
      * END?
     C           J1ASN#    IFGT #ATO
     C                     MOVE *ON       *IN51
     C                     LEAVE
     C                     ENDIF
      * END?
     C           RRN       IFGE MAX#
     C                     MOVE *ON       *IN51
     C                     LEAVE
     C                     ENDIF
      *
     C                     ADD  1         RRN
     C                     MOVE *OFF      *IN51
     C                     MOVE *BLANK    H@SEL
     C                     MOVE *BLANK    S@SEL
     C                     Z-ADDJ1DATE    S@ISSU
     C                     Z-ADDJ1TIME    S@TIME
     C**                   Z-ADDJ1NOHZ    S@SHDT
     C                     Z-ADDJ1REHZ    S@SHDT
     C                     MOVELJ1NONY    S@NONY
     C                     MOVELJ1BIN     S@BIN
     C                     MOVELJ1ASN#    S@ASN
     C                     MOVE J1ASN#    S@ASN6
     C***                  MOVELJ1NKOJ    S@FACT
     C                     MOVELJ1NUKE    S@DOCK
     C                     MOVELJ1PSCC    S@SCAC
     C                     MOVELJ1SMEI    S@NAME
     C                     MOVELJ1SHID    S@SHID
     C                     Z-ADDJ1BOX     S@BOX
     C                     EXSR #PICK2
     C                     MOVEL$PICK#    S@PL
      * GET STATUS
     C                     EXSR #STS
     C                     MOVE @STS      S@STS
      * 997
     C           S@STS     IFEQ ' '
     C                     MOVE J1CRME    AFLG    1
     C                     SELEC
     C           J1KOHZ    WHEQ 0
     C                     MOVE '-'       S@997
     C                     Z-ADD0         S@997T
     C           AFLG      WHEQ 'A'
     C                     MOVE 'Y'       S@997
     C                     MOVELJ1KOTM    S@997T
     C                     OTHER
     C                     MOVE 'X'       S@997
     C                     MOVELJ1KOTM    S@997T
     C                     ENDSL
     C                     ELSE
     C                     MOVE *BLANK    S@997
     C                     Z-ADD0         S@997T
     C                     ENDIF
      * CANCELLED
     C           J1SKJY    IFEQ 'D'
     C                     MOVE 'X'       S@STS
     C                     ENDIF
      *
     C                     WRITESFL01
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADDRRN       RC@CNT  60
      *
     C                     ENDSR
      *-----------------------------------------------------------
      *                    SET INQUIRY DATA (BY ISSUE DATE)
      *-----------------------------------------------------------
     C           #SET3     BEGSR
      * CLEAR SUBFILE
     C           RRN       IFEQ 0
     C                     Z-ADD1         RRN
     C                     WRITESFL01
     C                     ENDIF
      *
     C                     MOVE *ON       *IN71
     C                     WRITESFLCTL
     C                     MOVE *OFF      *IN71
     C                     Z-ADD0         SVDATE  80
     C                     Z-ADD0         SVTIME  60
      * GET DATA
     C                     Z-ADD0         RRN
     C                     Z-ADD1800      MAX#    40
     C                     MOVE *OFF      *IN51   1
     C           #FROM3    SETLLJCMPL11C
     C           *IN51     DOWEQ*OFF
     C                     READ JCMPL11C                 51
     C           *IN51     IFEQ *OFF
      * END?
     C           J1DATE    IFGT #TO3
     C                     MOVE *ON       *IN51
     C                     LEAVE
     C                     ENDIF
      * END?
     C           RRN       IFGE MAX#
     C                     MOVE *ON       *IN51
     C                     LEAVE
     C                     ENDIF
      * BREAK
     C           SVDATE    IFNE 0
     C           J1DATE    IFNE SVDATE
     C           J1TIME    ORNE SVTIME
     C                     CLEARSFL01
     C                     ADD  1         RRN
     C                     SETON                     47
     C                     WRITESFL01
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDJ1DATE    SVDATE
     C                     Z-ADDJ1TIME    SVTIME
      *
     C                     ADD  1         RRN
     C                     SETOF                     47
     C                     MOVE *OFF      *IN51
     C                     MOVE *BLANK    H@SEL
     C                     MOVE *BLANK    S@SEL
     C                     Z-ADDJ1DATE    S@ISSU
     C                     Z-ADDJ1TIME    S@TIME
     C**                   Z-ADDJ1NOHZ    S@SHDT
     C                     Z-ADDJ1REHZ    S@SHDT
     C                     MOVELJ1NONY    S@NONY
     C                     MOVELJ1BIN     S@BIN
     C                     MOVELJ1ASN#    S@ASN
     C                     MOVE J1ASN#    S@ASN6
     C***                  MOVELJ1NKOJ    S@FACT
     C                     MOVELJ1NUKE    S@DOCK
     C                     MOVELJ1PSCC    S@SCAC
     C                     MOVELJ1SMEI    S@NAME
     C                     MOVELJ1SHID    S@SHID
     C                     Z-ADDJ1BOX     S@BOX
     C                     EXSR #PICK2
     C                     MOVEL$PICK#    S@PL
      * GET STATUS
     C                     EXSR #STS
     C                     MOVE @STS      S@STS
      * 997
     C           S@STS     IFEQ ' '
     C                     MOVE J1CRME    AFLG    1
     C                     SELEC
     C           J1KOHZ    WHEQ 0
     C                     MOVE '-'       S@997
     C                     Z-ADD0         S@997T
     C           AFLG      WHEQ 'A'
     C                     MOVE 'Y'       S@997
     C                     MOVELJ1KOTM    S@997T
     C                     OTHER
     C                     MOVE 'X'       S@997
     C                     MOVELJ1KOTM    S@997T
     C                     ENDSL
      *
     C                     ELSE
     C                     MOVE *BLANK    S@997
     C                     Z-ADD0         S@997T
     C                     ENDIF
      * CANCELLED
     C           J1SKJY    IFEQ 'D'
     C                     MOVE 'X'       S@STS
     C                     ENDIF
      *
     C                     WRITESFL01
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADDRRN       RC@CNT  60
      *
     C                     ENDSR
      *-----------------------------------------------------------
      *                    SET DETAIL INQUIRY DATA
      *-----------------------------------------------------------
     C           #CHK2     BEGSR
      *
     C                     Z-ADD0         X@CNT   40
     C                     MOVE *BLANK    XASN    8
     C                     MOVE *OFF      *IN86
      *
     C           1         DO   RC@CNT    RRN
     C           RRN       CHAINSFL01                52
     C           *IN52     IFEQ *OFF
     C**         S@SEL     IFNE 'X'
     C           S@SEL     IFEQ *BLANK
     C                     MOVE 'H'       H@SEL
     C                     MOVE *ON       *IN52
     C                     MOVE *ON       *IN86
     C                     ELSE
     C                     MOVE ' '       H@SEL
     C                     MOVE *OFF      *IN52
     C           S@SEL     IFNE ' '
      * DISPLAY DETAIL
     C                     EXSR #DTL
      *
     C                     ADD  1         X@CNT
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE ' '       S@SEL
     C                     UPDATSFL01
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------------
      *          PRINT ASN
      *-----------------------------------------------------------
     C           #DTL      BEGSR
      *
     C           K#11A     CHAINJCMPL11A             99
     C   99                GOTO XDTL
      * RETRIEVE USER NAME
     C                     MOVELJ1NONY    X1NONY
     C                     MOVELJ1CTEL    X1CTEL
     C                     MOVELJ1BIN     X1BIN
     C                     MOVELJ1BLN#    X1BLN#
     C                     Z-ADDJ1BOX     X1BOX
     C                     Z-ADDJ1REHZ    XNOHZ
     C                     MOVELJ1CRME    X1CRME
     C                     MOVELJ1CRME    $USER
     C                     CALL 'UTLR31'
     C                     PARM           $USER  10
     C                     PARM           $NAME  15
     C                     MOVEL$NAME     X1CRNM
      * GET PACKING LIST#
     C**                   MOVELJ1NOHZ    $NOHZ
     C                     MOVELJ1REHZ    $NOHZ
     C                     MOVEL'5149'    $CUST
     C                     MOVELJ1NONY    $NONY
     C                     MOVELJ1NKOJ    $NKOJ
     C                     MOVELJ1NUKE    $NUKE
     C                     MOVELJ1BIN     $BINN
     C                     MOVELJ1REHZ    $RLHZ
     C                     MOVEL'11111'   $ODRN
     C                     CALL 'UTLR51'
     C                     PARM           $NOHZ   8
     C                     PARM           $CUST   4
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $BINN   2
     C                     PARM           $RLHZ   8
     C                     PARM           $ODRN  10
     C                     PARM           $PICK#  9
     C                     PARM           $RTN    1
     C           $PICK#    IFNE *BLANK
     C                     MOVEL$PICK#    X1PICK
     C                     ELSE
     C                     EXSR #PICK2
     C                     MOVEL$PICK#    X1PICK
     C                     ENDIF
      * PART#
     C           1         DO   12        IX      20
     C                     MOVELMSG,18    MHN,IX
     C                     ENDDO
      *
     C                     MOVE '0'       RFLG
     C                     Z-ADD0         QTY
     C                     Z-ADD0         CUM
     C                     Z-ADD0         BOX
     C                     MOVE *BLANK    XMORE
     C           J1SHID    SETLLJCMPP12
     C           1         DO   13        IX
     C           J1SHID    READEJCMPP12                  97
     C   97                LEAVE
      *
     C           IX        IFEQ 13
     C                     MOVEL'(+MORE)' XMORE
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVELJ2MHIN    MHN,IX
     C                     Z-ADDJ2SRYO    QTY,IX
     C                     Z-ADDJ2CUMQ    CUM,IX
     C                     Z-ADDJ2BOX#    BOX,IX
      * CHECK RETURNABLE
     C           RFLG      IFNE 'Y'
     C           'ST8'     SCAN J2MHIN                   10
     C           *IN10     IFEQ *ON
     C                     MOVE 'Y'       RFLG
     C                     ELSE
     C                     MOVE 'N'       RFLG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDDO
      *
JW1  C           LFLG      IFEQ 'Y'
 .   C                     MOVEL@@LID     X1PACK           PLT90
 .   C                     ELSE
 .   C                     MOVEL@@PLT     X1PACK           BOX90
 .   C                     ENDIF
 .    *
     C                     SELEC
 .   C           RFLG      WHEQ 'Y'
 .   C                     MOVEL@@RET     X1CONT           RETURNABLE
 .   C           RFLG      WHEQ 'N'
 .   C                     MOVEL@@BOX     X1CONT           FORD BOX
 .   C                     OTHER
 .   C                     MOVEL@@NOT     X1CONT           NOT FOUND
JW1  C                     ENDSL
      * REVERSE GROSS WGT
     C           J1WHT     IFEQ 0
     C                     MOVE *ON       *IN31
     C                     ELSE
     C                     MOVE *OFF      *IN31
     C                     ENDIF
      * REVERSE CONTAINE
     C           RFLG      IFEQ '0'
     C                     MOVE *ON       *IN32
     C                     ELSE
     C                     MOVE *OFF      *IN32
     C                     ENDIF
      * NOTE
     C           J1SKJY    IFEQ 'D'
     C                     MOVEL'CANCELED'XNOTE1
     C                     ELSE
     C                     MOVE *BLANK    XNOTE1
     C                     ENDIF
      *
     C                     EXFMTDSP02
      *
     C           XDTL      ENDSR
      *-----------------------------------------------------------
      * GET PACKING LIST# (2)
      *-----------------------------------------------------------
     C           #PICK2    BEGSR
      *
     C                     MOVELJ1REHZ    $NOHZ            RELEASE DATE
     C                     MOVEL'5149'    $CUST
     C                     MOVELJ1NONY    $NONY
     C                     MOVELJ1NKOJ    $NKOJ
     C                     MOVELJ1NUKE    $NUKE
     C                     MOVELJ1BIN     $BINN
     C                     MOVELJ1REHZ    $RLHZ
     C                     MOVE *BLANK    $ODRN
     C                     CALL 'UTLR51'
     C                     PARM           $NOHZ   8
     C                     PARM           $CUST   4
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $BINN   2
     C                     PARM           $RLHZ   8
     C                     PARM           $ODRN  10
     C                     PARM           $PICK#  9
     C                     PARM           $RTN    1
      *
     C                     ENDSR
      *-----------------------------------------------------------
      *          INITIALIZE
      *-----------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           K#11A     KLIST
     C                     KFLD           S@ASN
     C                     KFLD           S@SHID
      *
     C                     Z-ADD0         RRN     50
     C                     MOVE '01'      W@ID    2
     C                     TIME           @TIME
      *
     C                     MOVELTODAY     XFROM3
     C                     MOVELTODAY     XTO3
     C                     MOVE 'N'       RFLG    1        RET FLG
     C                     MOVE 'N'       LFLG    1        LID FLG
      *
     C                     ENDSR
** MSG(50A)........2.........3.........4.........5
ENTER DATE(FROM)!                                   01
DATE(FROM) NOT FOND IN CALENDAR MASTER!             02
CHOOSE ONE CONDITION!                               03
DATE(TO) NOT FOND IN CALENDAR MASTER!               04
PRESS F5 TO GO TO INQUIRY SCREEN...                 05
DATE(TO) SHOULD BE GREATER THAN DATE(FROM)!         06
9999/99/99                                          07
NO RECORD!                                          08
ENTER "X" FOR ASN DETAIL...                         09
                                                    10
                                                    11
                                                    12
9999/99/99                                          13
ENTER ISSUE DATE, SHIP DATE OR ASN#!                14
ASN(TO) SHOULD BE GREATER THAN ASN(FROM)!           15
(BY SHIP DATE)                                      16
  (BY ASN)                                          17
- - - - - - - - - - -                               18
(BY ISSUE DATE)                                     19
                                                    20
