     H            Y.
     FJZ#PW01 CF  E                    WORKSTN
     FJZ#PP01 O   E                    DISK                      A
      *---------------------------------------------------
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************
      *  MAIN
      *************************************************************
      * INITIALIZE
     C                     EXSR #INIT
      * DISPLAY
     C           W@ID      DOWEQ'01'
     C                     EXFMTDSP01
      * F1/3 END
     C           *INKA     IFEQ *ON
     C                     MOVE '99'      W@ID
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVELD@BCD     JZBCOD
     C                     WRITEJZ#PP011
     C                     CLEARJZ#PP011
     C                     MOVE *BLANKS   D@BCD
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------------
      *          INITIALIZE
      *-----------------------------------------------------------
     C           #INIT     BEGSR
      *
     C                     MOVE '01'      W@ID    2
     C                     TIME           WSDT
      *
     C                     ENDSR
