     H            Y.
     F** KCLR07 **************************************
     F*......//INQUIRY OF LIMITATION PART UNDELIVERED SITUATION   *.
     F* A-IDOTA                 1987.09.29           *
     F************************************** KCLR07 **
     FKCLPW07 CF  E                    WORKSTN
     FFCEPL01 IF  E           K        DISK
     FFCLPL31 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FDC#TL11 IF  E           K        DISK
     FDC#PL11 IF  E           K        DISK
     E                    MHNB       13 14
     E                    NSKI       13 15
     E                    TNO        13  7
     E                    NUKI       13  6 0
     E                    NUSU       13  7 0
     E                    HKHI       13  6 0
     E                    BUMON      15  4 0
     E                    KOU        15 14
     E                    CNOU       15  4 0
     E                    CKAN       15  4 0
     E                    NOUH       15  6 0
     E                    KBN        15  2 0
     E                    GKOT       15  3
     E                    RKOT       15  3
     E                    ER      1   9 60
     I            DS
     I                                        1   60NICB
     I                                        1   40HIZ
     I                                        5   60BNN
     I            DS
     I                                        1   40HIZUK
     I                                        1   20TKI
     I                                        3   40NIT
     I            DS
     I                                        1   80NOUKI
     I                                        1   40P5NOYY
     I                                        5   60P5NOMM
     I                                        7   80P5NODD
     I            DS
     I                                        1   7 PTHAI
     I                                        1   1 P5THIM
     I                                        2   2 P5THID
     I                                        3   40P5THIR
     I                                        5   5 HIHO1
     I                                        6   70P5THIS
     I            DS
     I                                        1   9 BANC
     I                                        1   1 P5BAN1
     I                                        2   2 HIHO2
     I                                        3   4 P5BAN2
     I                                        5   5 HIHO3
     I                                        6   7 P5BAN3
     I                                        8   8 HIHO4
     I                                        9   9 P5BAN4
     I            DS
     I                                        1  900NOUH
     I                                        1   60NOUHI1
     I                                        7  120NOUHI2
     I                                       13  180NOUHI3
     I                                       19  240NOUHI4
     I                                       25  300NOUHI5
     I                                       31  360NOUHI6
     I                                       37  420NOUHI7
     I                                       43  480NOUHI8
     I                                       49  540NOUHI9
     I                                       55  600NOUHIA
     I                                       61  660NOUHIB
     I                                       67  720NOUHIC
     I                                       73  780NOUHID
     I                                       79  840NOUHIE
     I                                       85  900NOUHIF
     I            DS
     I                                        1 182 MHNB
     I                                        1  14 MHNB1
     I                                       15  28 MHNB2
     I                                       29  42 MHNB3
     I                                       43  56 MHNB4
     I                                       57  70 MHNB5
     I                                       71  84 MHNB6
     I                                       85  98 MHNB7
     I                                       99 112 MHNB8
     I                                      113 126 MHNB9
     I                                      127 140 MHNBA
     I                                      141 154 MHNBB
     I                                      155 168 MHNBC
     I                                      169 182 MHNBD
     I            DS
     I                                        1  300KBN
     I                                        1   20P5KBN1
     I                                        3   40P5KBN2
     I                                        5   60P5KBN3
     I                                        7   80P5KBN4
     I                                        9  100P5KBN5
     I                                       11  120P5KBN6
     I                                       13  140P5KBN7
     I                                       15  160P5KBN8
     I                                       17  180P5KBN9
     I                                       19  200P5KBNA
     I                                       21  220P5KBNB
     I                                       23  240P5KBNC
     I                                       25  260P5KBND
     I                                       27  280P5KBNE
     I                                       29  300P5KBNF
     I            DS
     I                                        1  14 HNBAN
     I                                        1   5 P5HIN1
     I                                        6   6 MI1
     I                                        7  11 P5HIN2
     I                                       12  12 MI2
     I                                       13  14 P5HIN3
     I            DS
     I                                        1  23 UHINB
     I                                        1   5 P5UHN1
     I                                        6   6 UMI1
     I                                        7  11 P5UHN2
     I                                       12  12 UMI2
     I                                       13  17 P5UHN3
     I                                       18  18 UMI3
     I                                       19  23 P5UHN4
     I            DS
     I                                        1  91 TNO
     I                                        1   7 THNO1
     I                                        8  14 THNO2
     I                                       15  21 THNO3
     I                                       22  28 THNO4
     I                                       29  35 THNO5
     I                                       36  42 THNO6
     I                                       43  49 THNO7
     I                                       50  56 THNO8
     I                                       57  63 THNO9
     I                                       64  70 THNOA
     I                                       71  77 THNOB
     I                                       78  84 THNOC
     I                                       85  91 THNOD
     I            DS
     I                                        1   7 THI
     I                                        1   1 THIM
     I                                        2   2 THID
     I                                        3   40THIR
     I                                        5   5 HI1
     I                                        6   70THIS
     I            DS
     I                                        1   7 THI2
     I                                        1   1 TIM
     I                                        2   2 TID
     I                                        3   40TIR
     I                                        5   5 HI2
     I                                        6   70TIS
     I            DS
     I                                        1 195 NSKI
     I                                        1  15 NSKI1
     I                                       16  30 NSKI2
     I                                       31  45 NSKI3
     I                                       46  60 NSKI4
     I                                       61  75 NSKI5
     I                                       76  90 NSKI6
     I                                       91 105 NSKI7
     I                                      106 120 NSKI8
     I                                      121 135 NSKI9
     I                                      136 150 NSKIA
     I                                      151 165 NSKIB
     I                                      166 180 NSKIC
     I                                      181 195 NSKID
     I            DS
     I                                        1  780NUKI
     I                                        1   60NUKI1
     I                                        7  120NUKI2
     I                                       13  180NUKI3
     I                                       19  240NUKI4
     I                                       25  300NUKI5
     I                                       31  360NUKI6
     I                                       37  420NUKI7
     I                                       43  480NUKI8
     I                                       49  540NUKI9
     I                                       55  600NUKIA
     I                                       61  660NUKIB
     I                                       67  720NUKIC
     I                                       73  780NUKID
     I            DS
     I                                        1  910NUSU
     I                                        1   70NUSU1
     I                                        8  140NUSU2
     I                                       15  210NUSU3
     I                                       22  280NUSU4
     I                                       29  350NUSU5
     I                                       36  420NUSU6
     I                                       43  490NUSU7
     I                                       50  560NUSU8
     I                                       57  630NUSU9
     I                                       64  700NUSUA
     I                                       71  770NUSUB
     I                                       78  840NUSUC
     I                                       85  910NUSUD
     I            DS
     I                                        1  780HKHI
     I                                        1   60HKHI1
     I                                        7  120HKHI2
     I                                       13  180HKHI3
     I                                       19  240HKHI4
     I                                       25  300HKHI5
     I                                       31  360HKHI6
     I                                       37  420HKHI7
     I                                       43  480HKHI8
     I                                       49  540HKHI9
     I                                       55  600HKHIA
     I                                       61  660HKHIB
     I                                       67  720HKHIC
     I                                       73  780HKHID
     I            DS
     I                                        1  600BUMON
     I                                        1   40P5BMN1
     I                                        5   80P5BMN2
     I                                        9  120P5BMN3
     I                                       13  160P5BMN4
     I                                       17  200P5BMN5
     I                                       21  240P5BMN6
     I                                       25  280P5BMN7
     I                                       29  320P5BMN8
     I                                       33  360P5BMN9
     I                                       37  400P5BMNA
     I                                       41  440P5BMNB
     I                                       45  480P5BMNC
     I                                       49  520P5BMND
     I                                       53  560P5BMNE
     I                                       57  600P5BMNF
     I            DS
     I                                        1 210 KOU
     I                                        1  14 KMEI1
     I                                       15  28 KMEI2
     I                                       29  42 KMEI3
     I                                       43  56 KMEI4
     I                                       57  70 KMEI5
     I                                       71  84 KMEI6
     I                                       85  98 KMEI7
     I                                       99 112 KMEI8
     I                                      113 126 KMEI9
     I                                      127 140 KMEIA
     I                                      141 154 KMEIB
     I                                      155 168 KMEIC
     I                                      169 182 KMEID
     I                                      183 196 KMEIE
     I                                      197 210 KMEIF
     I            DS
     I                                        1  600CNOU
     I                                        1   40P5MD01
     I                                        5   80P5MD02
     I                                        9  120P5MD03
     I                                       13  160P5MD04
     I                                       17  200P5MD05
     I                                       21  240P5MD06
     I                                       25  280P5MD07
     I                                       29  320P5MD08
     I                                       33  360P5MD09
     I                                       37  400P5MD10
     I                                       41  440P5MD11
     I                                       45  480P5MD12
     I                                       49  520P5MD13
     I                                       53  560P5MD14
     I                                       57  600P5MD15
     I            DS
     I                                        1  600CKAN
     I                                        1   40P5KHI1
     I                                        5   80P5KHI2
     I                                        9  120P5KHI3
     I                                       13  160P5KHI4
     I                                       17  200P5KHI5
     I                                       21  240P5KHI6
     I                                       25  280P5KHI7
     I                                       29  320P5KHI8
     I                                       33  360P5KHI9
     I                                       37  400P5KHIA
     I                                       41  440P5KHIB
     I                                       45  480P5KHIC
     I                                       49  520P5KHID
     I                                       53  560P5KHIE
     I                                       57  600P5KHIF
     I            DS
     I                                        1  45 GKOT
     I                                        1   3 P4KTE1
     I                                        4   6 P4KTE2
     I                                        7   9 P4KTE3
     I                                       10  12 P4KTE4
     I                                       13  15 P4KTE5
     I                                       16  18 P4KTE6
     I                                       19  21 P4KTE7
     I                                       22  24 P4KTE8
     I                                       25  27 P4KTE9
     I                                       28  30 P4KTEA
     I                                       31  33 P4KTEB
     I                                       34  36 P4KTEC
     I                                       37  39 P4KTED
     I                                       40  42 P4KTEE
     I                                       43  45 P4KTEF
     I            DS
     I                                        1  45 RKOT
     I                                        1   3 P5KTE1
     I                                        4   6 P5KTE2
     I                                        7   9 P5KTE3
     I                                       10  12 P5KTE4
     I                                       13  15 P5KTE5
     I                                       16  18 P5KTE6
     I                                       19  21 P5KTE7
     I                                       22  24 P5KTE8
     I                                       25  27 P5KTE9
     I                                       28  30 P5KTEA
     I                                       31  33 P5KTEB
     I                                       34  36 P5KTEC
     I                                       37  39 P5KTED
     I                                       40  42 P5KTEE
     I                                       43  45 P5KTEF
     C*-----------------------------------------------*
     C*                  初期値設定                 *
     C*-----------------------------------------------*
     C                     Z-ADDUMONTH    TKI
     C                     Z-ADDUDAY      NIT
     C                     SETOF                     100190
     C                     MOVE '1'       SA      1
     C                     MOVE *BLANK    P5HIN1
     C                     MOVE *BLANK    P5HIN2
     C                     MOVE *BLANK    P5HIN3
     C                     MOVE *BLANK    TNO
     C                     MOVE *BLANK    NSKI
     C                     Z-ADD1         I       20
     C                     Z-ADD0         NUKI
     C                     Z-ADD0         NUSU
     C                     Z-ADD0         HKHI
     C                     Z-ADD0         P5TEYY
     C                     Z-ADD0         P5TEMM
     C                     Z-ADD0         P5TEDD
     C           LOOP1     TAG
     C                     READ DC#TL111                 26
     C           *IN26     IFEQ '1'
     C                     SETON                     0290
     C                     MOVE ER,8      ERR
     C           LOOP2     TAG
     C                     EXFMTKCLPW071
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C   LR                RETRN
     C                     END
     C                     GOTO LOOP2
     C                     END
     C                     EXSR MINOU
     C           MINO      IFEQ '0'
     C                     GOTO LOOP1
     C                     END
     C           HINBAN    SETLLDC#TL111
     C*-----------------------------------------------*
     C*                  画　面　１                 *
     C*-----------------------------------------------*
     C                     MOVE '-'       MI1
     C                     MOVE '-'       MI2
     C                     MOVE '-'       UMI1
     C                     MOVE '-'       UMI2
     C                     MOVE '-'       UMI3
     C                     Z-ADD1         PAG     30
     C                     SETOF                     111213
     C                     SETOF                     900215
     C                     Z-ADD0         NO
     C                     Z-ADD1         I       20
     C           YOMI1     TAG
     C                     MOVE *BLANK    THI
     C                     MOVE *BLANK    NSKI
     C                     MOVE *BLANK    MHNB
     C                     Z-ADD0         NUKI
     C                     Z-ADD0         NUSU
     C                     Z-ADD0         HKHI
     C                     MOVE *BLANK    TNO
     C           YOMI      TAG
     C           ROLLD     IFEQ '1'
     C           I         IFEQ 0
     C           LOROU     TAG
     C                     MOVE P5HIN1    ROU     5
     C                     MOVE P5HIN2    ROU11   5
     C                     MOVE P5HIN3    ROU12   2
     C                     MOVE P5THIM    ROU1    1
     C                     MOVE P5THID    ROU2    1
     C                     Z-ADDP5THIR    ROU3    20
     C                     Z-ADDP5THIS    ROU4    20
     C                     Z-ADDNOUKI     ROU5    80
     C                     GOTO RUD
     C                     END
     C                     ELSE
     C           I         IFEQ 14
     C           LOROD     TAG
     C                     MOVE P5HIN1    ROD     5
     C                     MOVE P5HIN2    ROD11   5
     C                     MOVE P5HIN3    ROD12   2
     C                     MOVE P5THIM    ROD1    1
     C                     MOVE P5THID    ROD2    1
     C                     Z-ADDP5THIR    ROD3    20
     C                     Z-ADDP5THIS    ROD4    20
     C                     Z-ADDNOUKI     ROD5    80
     C                     GOTO RUD
     C                     END
     C                     END
     C           ROLLD     IFEQ '1'
     C                     SETOF                     15
     C                     READPDC#TL111                 15
     C                     ELSE
     C                     SETOF                     11
     C                     READ DC#TL111                 11
     C                     END
     C           *IN15     IFEQ '1'
     C                     GOTO LOROU
     C                     END
     C           *IN11     IFEQ '1'
     C                     GOTO LOROD
     C                     END
     C           P5SKJY    IFEQ 'D'
     C                     GOTO YOMI
     C                     END
     C           P5NYMD    IFNE *ZERO
     C                     GOTO YOMI
     C                     ELSE
     C           P5YHIZ    IFNE *ZERO
     C                     GOTO YOMI
     C                     END
     C                     END
     C                     EXSR MINOU
     C           MINO      IFEQ '0'
     C                     GOTO YOMI
     C                     END
     C                     MOVE P5NMEI    NSKI,I
     C                     MOVE HNBAN     MHNB,I
     C                     Z-ADDP5NHZK    NUKI,I
     C                     Z-ADDP5SRYO    NUSU,I
     C                     Z-ADDP5HYMD    HKHI,I
     C                     MOVE P5THIM    THIM
     C                     MOVE P5THID    THID
     C                     Z-ADDP5THIR    THIR
     C                     MOVE '-'       HI1
     C                     Z-ADDP5THIS    THIS
     C                     MOVE THI       TNO,I
     C           ROLLD     IFEQ '1'
     C                     SUB  1         I
     C                     ELSE
     C                     ADD  1         I
     C                     END
     C                     GOTO YOMI
     C*-----------------------------------------------*
     C*     ＲＯＬＬーＵＰ＆ＲＯＬＬーＤＯＷＮ      *
     C*-----------------------------------------------*
     C           RUD       TAG
     C                     MOVE '0'       ROLLD
     C                     SETOF                     5055
     C                     EXFMTKCLPW071
     C                     SETOF                     9002
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C   LR                RETRN
     C                     END
     C*---------ＲＯＬＬーＤＯＷＮ--------*
     C           *IN55     IFEQ '1'
     C           PAG       IFEQ 1
     C                     MOVE ER,2      ERR
     C                     SETON                     90
     C                     GOTO RUD
     C                     END
     C                     SUB  1         PAG
     C                     MOVE ROU       P5HIN1
     C                     MOVE ROU11     P5HIN2
     C                     MOVE ROU12     P5HIN3
     C                     MOVE ROU1      P5THIM
     C                     MOVE ROU2      P5THID
     C                     Z-ADDROU3      P5THIR
     C                     Z-ADDROU4      P5THIS
     C                     Z-ADDROU5      NOUKI
     C                     MOVE ROU       ROD
     C                     MOVE ROU11     ROD11
     C                     MOVE ROU12     ROD12
     C                     MOVE ROU1      ROD1
     C                     MOVE ROU2      ROD2
     C                     Z-ADDROU3      ROD3
     C                     Z-ADDROU4      ROD4
     C                     Z-ADDROU5      ROD5
     C           HINBAN    SETLLDC#TL111
     C                     Z-ADD13        I
     C                     MOVE '1'       ROLLD   1
     C                     Z-ADD0         NO
     C                     SETON                     65
     C                     SETOF                     11
     C                     GOTO YOMI1
     C                     END
     C*---------ＲＯＬＬーＵＰ--------*
     C           *IN50     IFEQ '1'
     C                     MOVE ROD       P5HIN1
     C                     MOVE ROD11     P5HIN2
     C                     MOVE ROD12     P5HIN3
     C                     MOVE ROD1      P5THIM
     C                     MOVE ROD2      P5THID
     C                     Z-ADDROD3      P5THIR
     C                     Z-ADDROD4      P5THIS
     C                     Z-ADDROD5      NOUKI
     C           *IN65     IFEQ '0'
     C           HINBAN    SETGTDC#TL111
     C                     ELSE
     C           HINBAN    SETLLDC#TL111
     C                     END
     C           UP        TAG
     C                     READ DC#TL111                 13
     C           *IN13     IFEQ '1'
     C                     MOVE ER,4      ERR
     C                     SETON                     90
     C                     GOTO RUD
     C                     END
     C           P5SKJY    IFEQ 'D'
     C                     GOTO UP
     C                     END
     C           P5NYMD    IFNE *ZERO
     C                     GOTO UP
     C                     ELSE
     C           P5YHIZ    IFNE *ZERO
     C                     GOTO UP
     C                     END
     C                     END
     C                     EXSR MINOU
     C           MINO      IFEQ '0'
     C                     GOTO UP
     C                     END
     C           HINBAN    SETLLDC#TL111
     C                     MOVE P5HIN1    ROU
     C                     MOVE P5HIN2    ROU11
     C                     MOVE P5HIN3    ROU12
     C                     MOVE P5THIM    ROU1
     C                     MOVE P5THID    ROU2
     C                     Z-ADDP5THIR    ROU3
     C                     Z-ADDP5THIS    ROU4
     C                     Z-ADDNOUKI     ROU5
     C                     MOVE ROU       ROD
     C                     MOVE ROU11     ROD11
     C                     MOVE ROU12     ROD12
     C                     MOVE ROU1      ROD1
     C                     MOVE ROU2      ROD2
     C                     Z-ADDROU3      ROD3
     C                     Z-ADDROU4      ROD4
     C                     Z-ADDROU5      ROD5
     C                     ADD  1         PAG
     C                     Z-ADD1         I
     C                     Z-ADD0         NO
     C                     SETOF                     65
     C                     GOTO YOMI1
     C                     END
     C*-----------------------------------------------*
     C*                  画　面　２                 *
     C*-----------------------------------------------*
     C                     MOVE *BLANK    THI
     C                     MOVE *BLANK    THI2
     C           NO        IFEQ *ZERO
     C                     SETON                     0290
     C                     MOVE ER,6      ERR
     C                     GOTO RUD
     C                     END
     C           NO        IFGT 13
     C                     SETON                     0290
     C                     MOVE ER,5      ERR
     C                     GOTO RUD
     C                     END
     C                     MOVE TNO,NO    THI2
     C           TIM       IFEQ *BLANK
     C                     MOVE ER,7      ERR
     C                     SETON                     0290
     C                     GOTO RUD
     C                     END
     C                     MOVE *BLANK    KOU
     C                     MOVE TIM       P5THIM
     C                     MOVE TID       P5THID
     C                     Z-ADDTIR       P5THIR
     C                     Z-ADDTIS       P5THIS
     C                     MOVE P5THIM    THIM
     C                     MOVE P5THID    THID
     C                     Z-ADDP5THIR    THIR
     C                     Z-ADDP5THIS    THIS
     C                     EXSR KESU
     C           THIK      CHAINDC#PL111             14
     C           HIN       CHAINFCEPL01              15
     C           HIN       CHAINFCLPL31              16
     C                     Z-ADD1         A       20
     C                     SETOF                     93
     C           1         DO   15        A
     C           GKOT,A    IFNE RKOT,A
     C                     SETON                     93
     C                     EXSR KESU
     C                     END
     C  N93                END
     C                     Z-ADD1         E       20
     C                     Z-ADD*ZERO     NOUH
     C           1         DO   15        E
     C           CKAN,E    IFEQ *ZERO
     C                     ELSE
     C                     Z-ADDCKAN,E    HIZ
     C                     Z-ADDKBN,E     BNN
     C                     Z-ADDNICB      NOUH,E
     C                     END
     C                     END
     C                     MOVE '-'       HIHO1
     C                     MOVE '-'       HIHO2
     C                     MOVE '-'       HIHO3
     C                     MOVE '-'       HIHO4
     C                     Z-ADD1         I       20
     C*                    BITOF'01234567'KAN     1
     C*                    BITON'4567'    KAN     1
     C           YOMZ      TAG
     C           BUMON,I   IFNE *ZERO
     C           I         IFLE 15
     C           BUMON,I   CHAINFGBPL01              58
     C                     MOVELB2SMEI    KOU,I  14
     C*                    MOVE KAN       KOU,I
     C                     ADD  1         I
     C                     GOTO YOMZ
     C                     END
     C                     END
     C           P5ZHIZ    IFEQ *ZERO
     C                     MOVE ' NO '    KTHI1   4
     C                     ELSE
     C                     MOVE 'EXST'    KTHI1   4
     C                     END
     C           P5WHIZ    IFEQ *ZERO
     C                     MOVE ' NO '    KTHI2   4
     C                     ELSE
     C                     MOVE 'EXST'    KTHI2   4
     C                     END
     C           P5KHIZ    IFEQ *ZERO
     C                     MOVE ' NO '    KTHI3   4
     C                     ELSE
     C                     MOVE 'EXST'    KTHI3   4
     C                     END
     C           START3    TAG
     C                     EXSR THSB2
     C                     Z-ADDP5HYMD    PPHYMD  60
     C                     Z-ADDP5NHZK    PPNHZK  60
     C                     Z-ADDP5THZK    PPTHZK  60
     C                     Z-ADDP5ZHIZ    PPZHIZ  60
     C                     Z-ADDP5WHIZ    PPWHIZ  60
     C                     Z-ADDP5KHIZ    PPKHIZ  60
     C                     Z-ADDP5MHAT    PPMHAT  60
     C                     Z-ADDP5NYMD    PPNYMD  60
     C                     Z-ADDP5YHIZ    PPYHIZ  60
     C           P5UHN3    IFEQ *BLANK
     C                     MOVE *BLANK    UMI2
     C                     END
     C           P5UHN4    IFEQ *BLANK
     C                     MOVE *BLANK    UMI3
     C                     END
     C                     EXFMTKCLPW072
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C           *INKC     IFEQ '1'
     C                     Z-ADD0         NO
     C                     SETOF                     02
     C                     GOTO RUD
     C                     END
     C                     GOTO START3
     C*-----------------------------------------------*
     C*             未納検索　サブルーチン          *
     C*-----------------------------------------------*
     C           MINOU     BEGSR
     C                     MOVE '0'       MINO    1
     C                     Z-ADD1         A       20
     C                     SETOF                     20
     C           1         DO   15        A
     C           CNOU,A    IFEQ 0
     C                     SETON                     20
     C                     ELSE
     C                     EXSR MINOU2
     C           TCK1      IFLT *DATE
     C           TCK2      IFEQ 0
     C                     MOVE '1'       MINO
     C                     ELSE
     C           TCK1      IFLT TCK2
     C                     MOVE '1'       MINO
     C                     END
     C                     END
     C                     END
     C                     END
     C  N20                END
     C                     ENDSR
     C*-----------------------------------------------*
     C*           未納検索２　サブルーチン          *
     C*-----------------------------------------------*
     C           THSB2     BEGSR
     C                     Z-ADD1         B       20
     C                     Z-ADD1         C       20
     C           33        DO   62        B
     C                     MOVE '0'       *IN,B
     C                     END
     C                     Z-ADD32        B
     C                     Z-ADD47        C
     C                     SETOF                     77
     C           1         DO   15        A
     C                     ADD  1         B
     C                     ADD  1         C
     C           CNOU,A    IFEQ 0
     C                     SETON                     77
     C                     ELSE
     C                     EXSR MINOU2
     C           TCK1      IFLT *DATE
     C           TCK2      IFEQ 0
     C                     MOVE '1'       *IN,B
     C                     MOVE '1'       *IN,C
     C                     ELSE
     C           TCK1      IFLT TCK2
     C                     MOVE '1'       *IN,B
     C                     MOVE '1'       *IN,C
     C                     END
     C                     END
     C                     END
     C                     END
     C  N77                END
     C                     ENDSR
     C*-----------------------------------------------*
     C*           未納検索３　サブルーチン          *
     C*-----------------------------------------------*
     C           MINOU2    BEGSR
     C***** 年度による日付チェック*****
     C                     Z-ADD0         TCK1    80
     C                     Z-ADD0         TCK2    80
     C                     Z-ADD0         MCHK1   20
     C                     Z-ADD0         MCHK2   20
     C                     MOVELCNOU,A    MCHK1
     C                     MOVELCKAN,A    MCHK2
     C*
     C           P5NOMM    IFEQ 1
     C           P5NOMM    OREQ 2
     C           P5NOMM    OREQ 3
     C           MCHK1     IFEQ 10
     C           MCHK1     OREQ 11
     C           MCHK1     OREQ 12
     C           P5NOYY    SUB  1         YNOK1   40
     C                     ELSE
     C                     Z-ADDP5NOYY    YNOK1
     C                     END
     C                     ELSE
     C           P5NOMM    IFEQ 10
     C           P5NOMM    OREQ 11
     C           P5NOMM    OREQ 12
     C           MCHK1     IFEQ 1
     C           MCHK1     OREQ 2
     C           MCHK1     OREQ 3
     C           P5NOYY    ADD  1         YNOK1
     C                     ELSE
     C                     Z-ADDP5NOYY    YNOK1
     C                     END
     C                     ELSE
     C                     Z-ADDP5NOYY    YNOK1
     C                     END
     C                     END
     C                     MOVELYNOK1     TCK1
     C                     MOVE CNOU,A    TCK1
     C*
     C           MCHK2     IFNE 0
     C           P5NOMM    IFEQ 1
     C           P5NOMM    OREQ 2
     C           P5NOMM    OREQ 3
     C           MCHK2     IFEQ 10
     C           MCHK2     OREQ 11
     C           MCHK2     OREQ 12
     C           P5NOYY    SUB  1         YNOK2   40
     C                     ELSE
     C                     Z-ADDP5NOYY    YNOK2
     C                     END
     C                     ELSE
     C           P5NOMM    IFEQ 10
     C           P5NOMM    OREQ 11
     C           P5NOMM    OREQ 12
     C           MCHK2     IFEQ 1
     C           MCHK2     OREQ 2
     C           MCHK2     OREQ 3
     C           P5NOYY    ADD  1         YNOK2
     C                     ELSE
     C                     Z-ADDP5NOYY    YNOK2
     C                     END
     C                     ELSE
     C                     Z-ADDP5NOYY    YNOK2
     C                     END
     C                     END
     C                     MOVELYNOK2     TCK2
     C                     MOVE CKAN,A    TCK2
     C                     END
     C                     ENDSR
     C*-----------------------------------------------*
     C*             型番消去　サブルーチン          *
     C*-----------------------------------------------*
     C           KESU      BEGSR
     C                     MOVE *BLANK    P4KAT1
     C                     MOVE *BLANK    P4KAT2
     C                     MOVE *BLANK    P4KAT3
     C                     MOVE *BLANK    P4KAT4
     C                     MOVE *BLANK    P4KAT5
     C                     MOVE *BLANK    P4KAT6
     C                     MOVE *BLANK    P4KAT7
     C                     MOVE *BLANK    P4KAT8
     C                     MOVE *BLANK    P4KAT9
     C                     MOVE *BLANK    P4KATA
     C                     MOVE *BLANK    P4KATB
     C                     MOVE *BLANK    P4KATC
     C                     MOVE *BLANK    P4KATD
     C                     MOVE *BLANK    P4KATE
     C                     MOVE *BLANK    P4KATF
     C                     ENDSR
     C*-------------合成ＫＥＹ--------------*
     C           HINBAN    KLIST
     C                     KFLD           P5HIN1
     C                     KFLD           P5HIN2
     C                     KFLD           P5HIN3
     C                     KFLD           P5NOYY
     C                     KFLD           P5NOMM
     C                     KFLD           P5NODD
     C                     KFLD           P5THIM
     C                     KFLD           P5THID
     C                     KFLD           P5THIR
     C                     KFLD           P5THIS
     C*-------------合成ＫＥＹ--------------*
     C           HIN       KLIST
     C                     KFLD           P5HIN1
     C                     KFLD           P5HIN2
     C                     KFLD           P5HIN3
     C*-------------合成ＫＥＹ--------------*
     C           THIK      KLIST
     C                     KFLD           THIM
     C                     KFLD           THID
     C                     KFLD           THIR
     C                     KFLD           THIS
**
E-01 P/N ISN'T IN FILE  WHETHER IT ISN'T INPUT
E-02 NO MORE ROLL-DOWN
E-03 PGM ERROR(ROLL-DOWN)
E-04 NO MORE ROLL-UP
E-05 NO IS  FROM 1 TO 13.
E-06 NO ISN'T INPUT YET .
E-07 THIS NO DOESN'T HAVE DATA
E-08 CAN'T BE UNDELIVERED
E-09 IT DOESN'T  CHAIN.
