     H            Y.
     F** KCLR08 **************************************
     F*.....//CREATE LIMITATION PART UNDELIVERED SITUATION LIST  ///     *.
     F* A-IDOTA                 1988.03.14           *
     F************************************** KCLR08 **
     FRGAPL11 IF  E           K        DISK
     FKCLWP04 IF  F     547            DISK
     FKCLPR04 O   E             77     PRINTER
     E                    KAKO       15 16
     E                    KTEI       15  3
     E                    GNKI       15  4 0
     E                    NBN        15  8
     E                    NOUK       15  5
     E                    NUNY       15  8
     E                    PKTE       15  3
     IKCLWP04 AA
     I                                        1   40BMONKO
     I                                        5  20 KOJYOU
     I                                       21  27 TEHINO
     I                                       28  41 HINBAN
     I                                       42  50 TOKORO
     I                                       51  540TOKUIS
     I                                       55  580NOUNYU
     I                                       59  59 KOJYNO
     I                                       60  63 UKEIRE
     I                                       64  690UNOUKI
     I                                       70  750SYUKAT
     I                                       76  820SURYOU
     I                                       83  85 KOTE01
     I                                       86 101 KOUJ01
     I                                      102 1050NOUK01
     I                                      106 113 NOUN01
     I                                      114 116 KOTE02
     I                                      117 132 KOUJ02
     I                                      133 1360NOUK02
     I                                      137 144 NOUN02
     I                                      145 147 KOTE03
     I                                      148 163 KOUJ03
     I                                      164 1670NOUK03
     I                                      168 175 NOUN03
     I                                      176 178 KOTE04
     I                                      179 194 KOUJ04
     I                                      195 1980NOUK04
     I                                      199 206 NOUN04
     I                                      207 209 KOTE05
     I                                      210 225 KOUJ05
     I                                      226 2290NOUK05
     I                                      230 237 NOUN05
     I                                      238 240 KOTE06
     I                                      241 256 KOUJ06
     I                                      257 2600NOUK06
     I                                      261 268 NOUN06
     I                                      269 271 KOTE07
     I                                      272 287 KOUJ07
     I                                      288 2910NOUK07
     I                                      292 299 NOUN07
     I                                      300 302 KOTE08
     I                                      303 318 KOUJ08
     I                                      319 3220NOUK08
     I                                      323 330 NOUN08
     I                                      331 333 KOTE09
     I                                      334 349 KOUJ09
     I                                      350 3530NOUK09
     I                                      354 361 NOUN09
     I                                      362 364 KOTE10
     I                                      365 380 KOUJ10
     I                                      381 3840NOUK10
     I                                      385 392 NOUN10
     I                                      393 395 KOTE11
     I                                      396 411 KOUJ11
     I                                      412 4150NOUK11
     I                                      416 423 NOUN11
     I                                      424 426 KOTE12
     I                                      427 442 KOUJ12
     I                                      443 4460NOUK12
     I                                      447 454 NOUN12
     I                                      455 457 KOTE13
     I                                      458 473 KOUJ13
     I                                      474 4770NOUK13
     I                                      478 485 NOUN13
     I                                      486 488 KOTE14
     I                                      489 504 KOUJ14
     I                                      505 5080NOUK14
     I                                      509 516 NOUN14
     I                                      517 519 KOTE15
     I                                      520 535 KOUJ15
     I                                      536 5390NOUK15
     I                                      540 547 NOUN15
     I            DS
     I                                        1   60UNOUKI
     I                                        1   20UNY
     I                                        3   40UNM
     I            DS
     I                                        1   60HIZK
     I                                        1   20NEN
     I                                        3   40TUKI
     I                                        5   60HINI
     I            DS
     I                                        1 240 KAKO
     I                                        1  16 KOUJ01
     I                                       17  32 KOUJ02
     I                                       33  48 KOUJ03
     I                                       49  64 KOUJ04
     I                                       65  80 KOUJ05
     I                                       81  96 KOUJ06
     I                                       97 112 KOUJ07
     I                                      113 128 KOUJ08
     I                                      129 144 KOUJ09
     I                                      145 160 KOUJ10
     I                                      161 176 KOUJ11
     I                                      177 192 KOUJ12
     I                                      193 208 KOUJ13
     I                                      209 224 KOUJ14
     I                                      225 240 KOUJ15
     I            DS
     I                                        1  45 KTEI
     I                                        1   3 KOTE01
     I                                        4   6 KOTE02
     I                                        7   9 KOTE03
     I                                       10  12 KOTE04
     I                                       13  15 KOTE05
     I                                       16  18 KOTE06
     I                                       19  21 KOTE07
     I                                       22  24 KOTE08
     I                                       25  27 KOTE09
     I                                       28  30 KOTE10
     I                                       31  33 KOTE11
     I                                       34  36 KOTE12
     I                                       37  39 KOTE13
     I                                       40  42 KOTE14
     I                                       43  45 KOTE15
     I            DS
     I                                        1  45 PKTE
     I                                        1   3 PKTE01
     I                                        4   6 PKTE02
     I                                        7   9 PKTE03
     I                                       10  12 PKTE04
     I                                       13  15 PKTE05
     I                                       16  18 PKTE06
     I                                       19  21 PKTE07
     I                                       22  24 PKTE08
     I                                       25  27 PKTE09
     I                                       28  30 PKTE10
     I                                       31  33 PKTE11
     I                                       34  36 PKTE12
     I                                       37  39 PKTE13
     I                                       40  42 PKTE14
     I                                       43  45 PKTE15
     I            DS
     I                                        1  600GNKI
     I                                        1   40NOUK01
     I                                        5   80NOUK02
     I                                        9  120NOUK03
     I                                       13  160NOUK04
     I                                       17  200NOUK05
     I                                       21  240NOUK06
     I                                       25  280NOUK07
     I                                       29  320NOUK08
     I                                       33  360NOUK09
     I                                       37  400NOUK10
     I                                       41  440NOUK11
     I                                       45  480NOUK12
     I                                       49  520NOUK13
     I                                       53  560NOUK14
     I                                       57  600NOUK15
     I            DS
     I                                        1 120 NBN
     I                                        1   8 NOUN01
     I                                        9  16 NOUN02
     I                                       17  24 NOUN03
     I                                       25  32 NOUN04
     I                                       33  40 NOUN05
     I                                       41  48 NOUN06
     I                                       49  56 NOUN07
     I                                       57  64 NOUN08
     I                                       65  72 NOUN09
     I                                       73  80 NOUN10
     I                                       81  88 NOUN11
     I                                       89  96 NOUN12
     I                                       97 104 NOUN13
     I                                      105 112 NOUN14
     I                                      113 120 NOUN15
     I            DS
     I                                        1 120 NUNY
     I                                        1   8 NUNYU1
     I                                        9  16 NUNYU2
     I                                       17  24 NUNYU3
     I                                       25  32 NUNYU4
     I                                       33  40 NUNYU5
     I                                       41  48 NUNYU6
     I                                       49  56 NUNYU7
     I                                       57  64 NUNYU8
     I                                       65  72 NUNYU9
     I                                       73  80 NUNYUA
     I                                       81  88 NUNYUB
     I                                       89  96 NUNYUC
     I                                       97 104 NUNYUD
     I                                      105 112 NUNYUE
     I                                      113 120 NUNYUF
     I            DS
     I                                        1  75 NOUK
     I                                        1   5 NOUKI1
     I                                        6  10 NOUKI2
     I                                       11  15 NOUKI3
     I                                       16  20 NOUKI4
     I                                       21  25 NOUKI5
     I                                       26  30 NOUKI6
     I                                       31  35 NOUKI7
     I                                       36  40 NOUKI8
     I                                       41  45 NOUKI9
     I                                       46  50 NOUKIA
     I                                       51  55 NOUKIB
     I                                       56  60 NOUKIC
     I                                       61  65 NOUKID
     I                                       66  70 NOUKIE
     I                                       71  75 NOUKIF
     I            DS
     I                                        1   5 NKI
     I                                        1   2 TU
     I                                        3   3 HI
     I                                        4   5 HN
     I            DS
     I                                        1   5 BHIZK
     I                                        1   20BTUKI
     I                                        3   3 HIHON
     I                                        4   50BNITI
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     PARM           KUBN    1
     C                     PARM           KUBN2   1
     C                     PARM           WNAME  16
      *
     C           US        CHAINRGAPL111             23
     C                     MOVELJ8NAME    USR     9
      *
     C           KUBN      IFEQ '4'
     C                     SETON                     50
     C                     END
     C           KUBN2     IFEQ '2'
     C                     SETON                     51
     C                     END
      *
     C                     DO   *HIVAL
     C           START     TAG
     C                     READ KCLWP04                  90
     C           *IN90     IFEQ '1'
     C                     SETON                     LR
     C   LR                RETRN
     C                     END
      *
     C           *IN91     IFEQ '0'
     C                     MOVE *BLANK    OTEHI   7
     C                     Z-ADD0         NABA    30
     C                     Z-ADD8         I       20
     C                     Z-ADD0         J       20
     C                     Z-ADD*DATE     HIZK
     C                     MOVE '.'       HIHON
     C                     MOVE '.'       HI
     C                     TIME           WTIME   60
     C                     WRITEKCLPR041
     C                     WRITEKCLPR042
     C                     MOVE BMONKO    OBMN    40
     C                     SETON                     91
     C                     END
      *
     C           OTEHI     IFEQ TEHINO
     C                     GOTO START
     C                     ELSE
     C                     MOVE TEHINO    OTEHI
     C                     END
      *
     C                     MOVE *BLANK    NOUK
     C                     MOVE *BLANK    NUNY
     C                     EXSR KENSA
     C                     EXSR CHK
     C                     EXSR NDIN
     C                     EXSR CBMN
      *
     C           OBMN      IFEQ BMONKO
     C                     ELSE
     C                     Z-ADD0         NABA
     C                     Z-ADD0         PAGE
     C                     Z-ADDBMONKO    OBMN
     C                     WRITEKCLPR041
     C                     WRITEKCLPR042
     C                     Z-ADD8         I
     C                     END
      *
     C           KO        IFGE 1
     C           KO        ANDLE5
     C                     ADD  8         I
     C                     Z-ADD8         J
     C                     END
      *
     C           KO        IFGE 6
     C           KO        ANDLE10
     C                     ADD  12        I
     C                     Z-ADD12        J
     C                     END
      *
     C           KO        IFGE 11
     C           KO        ANDLE15
     C                     ADD  16        I
     C                     Z-ADD16        J
     C                     END
      *
     C           I         IFLE 66
     C                     ELSE
     C                     Z-ADD0         I
     C                     WRITEKCLPR041
     C                     WRITEKCLPR042
     C           J         ADD  8         I
     C                     END
      *
     C           KO        IFGE 1
     C           KO        ANDLE5
     C                     ADD  1         NABA
     C                     MOVE *BLANK    WAT
     C                     WRITEKCLPR043
     C                     WRITEKCLPR046
     C                     END
      *
     C           KO        IFGE 6
     C           KO        ANDLE10
     C                     ADD  1         NABA
     C                     MOVE *BLANK    WAT
     C                     WRITEKCLPR043
     C                     WRITEKCLPR044
     C                     WRITEKCLPR046
     C                     END
      *
     C           KO        IFGE 11
     C           KO        ANDLE15
     C                     ADD  1         NABA
     C                     MOVE *BLANK    WAT
     C                     WRITEKCLPR043
     C                     WRITEKCLPR044
     C                     WRITEKCLPR045
     C                     WRITEKCLPR046
     C                     END
     C                     END
      *
     C*-----------------------------------------------*
     C*          工程数の検索　サブルーチン         *
     C*-----------------------------------------------*
     C           KENSA     BEGSR
     C                     Z-ADD15        A       20
     C           LOOP1     TAG
     C           A         IFGE 1
     C           KTEI,A    IFEQ *BLANK
     C                     SUB  1         A
     C                     GOTO LOOP1
     C                     END
     C                     END
     C                     Z-ADDA         KO      20
     C                     ENDSR
      *
     C*-----------------------------------------------*
     C*           納期の検索　サブルーチン          *
     C*-----------------------------------------------*
     C           CHK       BEGSR
     C                     Z-ADD1         B       20
     C           1         DO   KO        B
     C           NBN,B     IFEQ '  .  -  '
     C                     MOVELGNKI,B    CNKI1   20
      *
     C           UNM       IFEQ 1
     C           UNM       OREQ 2
     C           UNM       OREQ 3
     C           CNKI1     IFEQ 10
     C           CNKI1     OREQ 11
     C           CNKI1     OREQ 12
     C           UNY       SUB  1         YNKI    20
     C                     ELSE
     C                     Z-ADDUNY       YNKI
     C                     END
     C                     ELSE
     C           UNM       IFEQ 10
     C           UNM       OREQ 11
     C           UNM       OREQ 12
     C           CNKI1     IFEQ 1
     C           CNKI1     OREQ 2
     C           CNKI1     OREQ 3
     C           UNY       ADD  1         YNKI
     C                     ELSE
     C                     Z-ADDUNY       YNKI
     C                     END
     C                     ELSE
     C                     Z-ADDUNY       YNKI
     C                     END
     C                     END
      *
     C                     MOVE GNKI,B    CNKI2   60
     C                     MOVELYNKI      CNKI2
     C           CNKI2     IFLE HIZK
     C                     MOVE 'NO INPUT'NUNY,B
     C                     END
     C                     ELSE
     C                     MOVE NBN,B     NUNY,B
     C                     END
     C                     END
     C                     ENDSR
      *
     C*-----------------------------------------------*
     C*           納期の代入　サブルーチン          *
     C*-----------------------------------------------*
     C           NDIN      BEGSR
     C                     Z-ADD1         C       20
     C           1         DO   KO        C
     C                     MOVELGNKI,C    TU
     C                     MOVE GNKI,C    HN
     C                     MOVE NKI       NOUK,C
     C                     END
     C                     ENDSR
      *
     C*-----------------------------------------------*
     C*          部門チェック　サブルーチン         *
     C*-----------------------------------------------*
     C           CBMN      BEGSR
     C                     Z-ADD1         D       20
     C                     SETOF                     72
     C           1         DO   15        D
     C                     MOVE '0'       *IN,D
     C                     END
     C                     Z-ADD1         D
     C           1         DO   15        D
     C           KAKO,D    IFEQ *BLANK
     C                     SETON                     72
     C                     ELSE
     C           *IN50     CABEQ'1'       NSLOP
     C           KOJYOU    IFEQ KAKO,D
     C           NSLOP     TAG
     C           NBN,D     IFEQ '  .  -  '
     C                     MOVELGNKI,D    CNKI1
      *
     C           UNM       IFEQ 1
     C           UNM       OREQ 2
     C           UNM       OREQ 3
     C           CNKI1     IFEQ 10
     C           CNKI1     OREQ 11
     C           CNKI1     OREQ 12
     C           UNY       SUB  1         YNKI
     C                     ELSE
     C                     Z-ADDUNY       YNKI
     C                     END
     C                     ELSE
      *
     C           UNM       IFEQ 10
     C           UNM       OREQ 11
     C           UNM       OREQ 12
     C           CNKI1     IFEQ 1
     C           CNKI1     OREQ 2
     C           CNKI1     OREQ 3
     C           UNY       ADD  1         YNKI
     C                     ELSE
     C                     Z-ADDUNY       YNKI
     C                     END
     C                     ELSE
     C                     Z-ADDUNY       YNKI
     C                     END
     C                     END
      *
     C                     MOVE GNKI,D    CNKI2
     C                     MOVELYNKI      CNKI2
     C           CNKI2     IFLE HIZK
     C                     MOVE '1'       *IN,D
     C                     MOVE KTEI,D    PKTE,D
     C                     END
     C                     ELSE
     C                     MOVELNBN,D     BHIZ    5
     C                     MOVELGNKI,D    BTUKI
     C                     MOVE GNKI,D    BNITI
     C                     MOVELBHIZ      CNKI3   2
     C                     MOVE UNM       @UNM    2
      *
     C           @UNM      IFEQ '01'
     C           @UNM      OREQ '02'
     C           @UNM      OREQ '03'
     C           CNKI3     IFEQ '10'
     C           CNKI3     OREQ '11'
     C           CNKI3     OREQ '12'
     C           UNY       SUB  1         YNKI1   20
     C                     MOVE YNKI1     YNKI11  2
     C                     ELSE
     C                     MOVE UNY       YNKI11
     C                     END
     C                     ELSE
     C           @UNM      IFEQ '10'
     C           @UNM      OREQ '11'
     C           @UNM      OREQ '12'
     C           CNKI3     IFEQ '01'
     C           CNKI3     OREQ '02'
     C           CNKI3     OREQ '03'
     C           UNY       ADD  1         YNKI1
     C                     MOVE YNKI1     YNKI11
     C                     ELSE
     C                     MOVE UNY       YNKI11
     C                     END
     C                     ELSE
     C                     MOVE UNY       YNKI11
     C                     END
     C                     END
      *
     C                     MOVE BHIZ      CNKI4   7
     C                     MOVELYNKI11    CNKI4
      *
     C           UNM       IFEQ 1
     C           UNM       OREQ 2
     C           UNM       OREQ 3
     C           BTUKI     IFEQ 10
     C           BTUKI     OREQ 11
     C           BTUKI     OREQ 12
     C           UNY       SUB  1         YNKI2   20
     C                     MOVE YNKI2     YNKI22  2
     C                     ELSE
     C                     MOVE UNY       YNKI22
     C                     END
     C                     ELSE
     C           UNM       IFEQ 10
     C           UNM       OREQ 11
     C           UNM       OREQ 12
     C           BTUKI     IFEQ 1
     C           BTUKI     OREQ 2
     C           BTUKI     OREQ 3
     C           UNY       ADD  1         YNKI2
     C                     MOVE YNKI2     YNKI22
     C                     ELSE
     C                     MOVE UNY       YNKI22
     C                     END
     C                     ELSE
     C                     MOVE UNY       YNKI22
     C                     END
     C                     END
      *
     C                     MOVE BHIZK     CNKI5   7
     C                     MOVELYNKI22    CNKI5
     C           CNKI5     IFLT CNKI4
     C                     MOVE '1'       *IN,D
     C                     MOVE KTEI,D    PKTE,D
     C                     END
     C                     END
     C                     END
     C                     END
     C  N72                END
     C                     ENDSR
