     H            Y.
     F**KCLR14****************************************
     F* LIMITATION PART UNDELIVERED SITUATION LIST / DATE APPOINTMENT *
     F*           K-NAKAMURA 1990.09.14              *
     F****************************************KCLR14**
     FRGAPL11 IF  E           K        DISK
     FAGDPL11 IF  E           K        DISK
     FKCLWP04 IF  F     610            DISK
     FKCLPR13 O   E             77     PRINTER
     E                    KAKO       15 16
     E                    KTEI       15  3
     E                    PKTE       15  3
     E                    GNKI       15  4 0
     E                    NBN        15  8
     E                    NOUK       15  5
     E                    NUNY       15  8
     E                    @NYU       15  8 0
     E                    @NKI       15  6 0
     E                    @BMN       15  4 0
     E                    KOUT    1   1  4 0             ﾃcmb
     E                    TAB1    1   1  8 0 TAB2    1 0 ﾒｰnﾞjbw
     IKCLWP04 AA
     I                                        1   40BMONKO
     I                                        5  20 KOJYOU
     I                                       21  27 TEHINO
     I                                       28  41 HINBAN
     I                                       42  50 TOKORO
     I                                       51  540TOKUIS
     I                                       55  580NOUNYU
     I                                       59  59 KOJYNO
     I                                       60  63 UKEIRE
     I                                       64  710UNOUKI
     I                                       72  770SYUKAT
     I                                       78  840SURYOU
     I                                       85  87 KOTE01
     I                                       88 103 KOUJ01
     I                                      104 1070NOUK01
     I                                      108 115 NOUN01
     I                                      116 118 KOTE02
     I                                      119 134 KOUJ02
     I                                      135 1380NOUK02
     I                                      139 146 NOUN02
     I                                      147 149 KOTE03
     I                                      150 165 KOUJ03
     I                                      166 1690NOUK03
     I                                      170 177 NOUN03
     I                                      178 180 KOTE04
     I                                      181 196 KOUJ04
     I                                      197 2000NOUK04
     I                                      201 208 NOUN04
     I                                      209 211 KOTE05
     I                                      212 227 KOUJ05
     I                                      228 2310NOUK05
     I                                      232 239 NOUN05
     I                                      240 242 KOTE06
     I                                      243 258 KOUJ06
     I                                      259 2620NOUK06
     I                                      263 270 NOUN06
     I                                      271 273 KOTE07
     I                                      274 289 KOUJ07
     I                                      290 2930NOUK07
     I                                      294 301 NOUN07
     I                                      302 304 KOTE08
     I                                      305 320 KOUJ08
     I                                      321 3240NOUK08
     I                                      325 332 NOUN08
     I                                      333 335 KOTE09
     I                                      336 351 KOUJ09
     I                                      352 3550NOUK09
     I                                      356 363 NOUN09
     I                                      364 366 KOTE10
     I                                      367 382 KOUJ10
     I                                      383 3860NOUK10
     I                                      387 394 NOUN10
     I                                      395 397 KOTE11
     I                                      398 413 KOUJ11
     I                                      414 4170NOUK11
     I                                      418 425 NOUN11
     I                                      426 428 KOTE12
     I                                      429 444 KOUJ12
     I                                      445 4480NOUK12
     I                                      449 456 NOUN12
     I                                      457 459 KOTE13
     I                                      460 475 KOUJ13
     I                                      476 4790NOUK13
     I                                      480 487 NOUN13
     I                                      488 490 KOTE14
     I                                      491 506 KOUJ14
     I                                      507 5100NOUK14
     I                                      511 518 NOUN14
     I                                      519 521 KOTE15
     I                                      522 537 KOUJ15
     I                                      538 5410NOUK15
     I                                      542 549 NOUN15
     I                                      550 5530@BMN01
     I                                      554 5570@BMN02
     I                                      558 5610@BMN03
     I                                      562 5650@BMN04
     I                                      566 5690@BMN05
     I                                      570 5730@BMN06
     I                                      574 5770@BMN07
     I                                      578 5810@BMN08
     I                                      582 5850@BMN09
     I                                      586 5890@BMN10
     I                                      590 5930@BMN11
     I                                      594 5970@BMN12
     I                                      598 6010@BMN13
     I                                      602 6050@BMN14
     I                                      606 6090@BMN15
     I            DS
     I                                        1   80HIZK
     I                                        1   40NEN
     I                                        5   60TUKI
     I                                        7   80HINI
     I            DS
     I                                        1 240 KAKO
     I                                        1  16 KOUJ01
     I                                       17  32 KOUJ02
     I                                       33  48 KOUJ03
     I                                       49  64 KOUJ04
     I                                       65  80 KOUJ05
     I                                       81  96 KOUJ06
     I                                       97 112 KOUJ07
     I                                      113 128 KOUJ08
     I                                      129 144 KOUJ09
     I                                      145 160 KOUJ10
     I                                      161 176 KOUJ11
     I                                      177 192 KOUJ12
     I                                      193 208 KOUJ13
     I                                      209 224 KOUJ14
     I                                      225 240 KOUJ15
     I            DS
     I                                        1  45 KTEI
     I                                        1   3 KOTE01
     I                                        4   6 KOTE02
     I                                        7   9 KOTE03
     I                                       10  12 KOTE04
     I                                       13  15 KOTE05
     I                                       16  18 KOTE06
     I                                       19  21 KOTE07
     I                                       22  24 KOTE08
     I                                       25  27 KOTE09
     I                                       28  30 KOTE10
     I                                       31  33 KOTE11
     I                                       34  36 KOTE12
     I                                       37  39 KOTE13
     I                                       40  42 KOTE14
     I                                       43  45 KOTE15
     I            DS
     I                                        1  45 PKTE
     I                                        1   3 PKTE01
     I                                        4   6 PKTE02
     I                                        7   9 PKTE03
     I                                       10  12 PKTE04
     I                                       13  15 PKTE05
     I                                       16  18 PKTE06
     I                                       19  21 PKTE07
     I                                       22  24 PKTE08
     I                                       25  27 PKTE09
     I                                       28  30 PKTE10
     I                                       31  33 PKTE11
     I                                       34  36 PKTE12
     I                                       37  39 PKTE13
     I                                       40  42 PKTE14
     I                                       43  45 PKTE15
     I            DS
     I                                        1  600GNKI
     I                                        1   40NOUK01
     I                                        5   80NOUK02
     I                                        9  120NOUK03
     I                                       13  160NOUK04
     I                                       17  200NOUK05
     I                                       21  240NOUK06
     I                                       25  280NOUK07
     I                                       29  320NOUK08
     I                                       33  360NOUK09
     I                                       37  400NOUK10
     I                                       41  440NOUK11
     I                                       45  480NOUK12
     I                                       49  520NOUK13
     I                                       53  560NOUK14
     I                                       57  600NOUK15
     I            DS
     I                                        1 120 NBN
     I                                        1   8 NOUN01
     I                                        9  16 NOUN02
     I                                       17  24 NOUN03
     I                                       25  32 NOUN04
     I                                       33  40 NOUN05
     I                                       41  48 NOUN06
     I                                       49  56 NOUN07
     I                                       57  64 NOUN08
     I                                       65  72 NOUN09
     I                                       73  80 NOUN10
     I                                       81  88 NOUN11
     I                                       89  96 NOUN12
     I                                       97 104 NOUN13
     I                                      105 112 NOUN14
     I                                      113 120 NOUN15
     I            DS
     I                                        1 120 NUNY
     I                                        1   8 NUNYU1
     I                                        9  16 NUNYU2
     I                                       17  24 NUNYU3
     I                                       25  32 NUNYU4
     I                                       33  40 NUNYU5
     I                                       41  48 NUNYU6
     I                                       49  56 NUNYU7
     I                                       57  64 NUNYU8
     I                                       65  72 NUNYU9
     I                                       73  80 NUNYUA
     I                                       81  88 NUNYUB
     I                                       89  96 NUNYUC
     I                                       97 104 NUNYUD
     I                                      105 112 NUNYUE
     I                                      113 120 NUNYUF
     I            DS
     I                                        1  75 NOUK
     I                                        1   5 NOUKI1
     I                                        6  10 NOUKI2
     I                                       11  15 NOUKI3
     I                                       16  20 NOUKI4
     I                                       21  25 NOUKI5
     I                                       26  30 NOUKI6
     I                                       31  35 NOUKI7
     I                                       36  40 NOUKI8
     I                                       41  45 NOUKI9
     I                                       46  50 NOUKIA
     I                                       51  55 NOUKIB
     I                                       56  60 NOUKIC
     I                                       61  65 NOUKID
     I                                       66  70 NOUKIE
     I                                       71  75 NOUKIF
     I            DS
     I                                        1  600@BMN
     I                                        1   40@BMN01
     I                                        5   80@BMN02
     I                                        9  120@BMN03
     I                                       13  160@BMN04
     I                                       17  200@BMN05
     I                                       21  240@BMN06
     I                                       25  280@BMN07
     I                                       29  320@BMN08
     I                                       33  360@BMN09
     I                                       37  400@BMN10
     I                                       41  440@BMN11
     I                                       45  480@BMN12
     I                                       49  520@BMN13
     I                                       53  560@BMN14
     I                                       57  600@BMN15
     I            DS
     I                                        1   5 NKI
     I                                        1   2 TU
     I                                        3   3 HI
     I                                        4   5 HN
     I            DS
     I                                        1   5 AHIZK
     I                                        1   20ATUKI
     I                                        3   3 HIHON
     I                                        4   50ANITI
     I            DS
     I                                        1   40@HIZK
     I                                        1   20@TUKI
     I                                        3   40@NITI
     I            DS
     I                                        1   80FHIZ
     I                                        1   40F1
     I                                        5   60F2
     I                                        7   80F3
     I            DS
     I                                        1   80THIZ
     I                                        1   40T1
     I                                        5   60T2
     I                                        7   80T3
     I            DS
     I                                        1   80UNOUKI
     I                                        1   40P5NOYY
     I                                        5   60P5NOMM
     I                                        7   80P5NODD
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80XXNYU
     I                                        1   40XXYY
     I                                        5   60XXMM
     I                                        7   80XXDD
     I            DS
     I                                        1   80@@KAKO
     I                                        1   40WWBMN
     I                                        5   80XXKAKO
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     PARM           KUBN    1
     C                     PARM           FH      8
     C                     PARM           TH      8
     C                     PARM           WTEHI   1
     C           KEY       KLIST
     C                     KFLD           XXYY
     C                     KFLD           XXMM
     C                     KFLD           XXDD
     C           US        CHAINRGAPL111             23
     C                     MOVELJ8NAME    USR     9
     C                     MOVE FH        FHIZ    80
     C                     MOVE TH        THIZ    80
     C           KUBN      IFEQ '4'
     C                     SETON                     50
     C                     END
     C                     DO   *HIVAL
     C           START     TAG
     C                     READ KCLWP04                  90
     C           *IN90     IFEQ '1'
     C                     WRITEKCLPR137
     C                     SETON                     LR
     C   LR                RETRN
     C                     END
     C           *IN91     IFEQ '0'
     C                     MOVE *BLANK    OTEHI   7
     C                     Z-ADD0         NABA    30
     C                     Z-ADD0         @@CNT
     C                     Z-ADD8         I       20
     C                     Z-ADD0         J       20
     C                     Z-ADD*DATE     HIZK
     C                     MOVE '.'       HIHON
     C                     MOVE '.'       HI
     C                     TIME           WTIME   60
     C***   ﾒﾇn jbnﾓ ﾆｬcﾈb  1994.05.23 S.OHTAKE  ***
     C                     MOVE WTEHI     WKTEHI  1
     C           WKTEHI    IFEQ 'Z'
     C                     SETON                     95
     C                     END
     C                     WRITEKCLPR131
     C                     WRITEKCLPR132
     C                     MOVE BMONKO    OBMN    40
     C                     SETON                     91
     C                     END
     C           OTEHI     IFEQ TEHINO
     C                     GOTO START
     C                     ELSE
     C                     MOVE TEHINO    OTEHI
     C                     END
     C                     MOVE *BLANK    NOUK
     C                     MOVE *BLANK    NUNY
     C                     EXSR KENSA
     C                     EXSR CHK
     C                     EXSR NDIN
     C                     EXSR CBMN
     C*
     C           @@CNT     IFNE 0
     C           OBMN      IFNE BMONKO
     C                     WRITEKCLPR137
     C                     Z-ADD0         @@CNT
     C                     END
     C                     END
      *
     C                     SETOF                     68
     C           BMONKO    LOKUPKOUT                     68
     C           *IN68     IFEQ '1'
     C                     SETOF                     71
     C                     Z-ADD1         P       20
     C                     DO   KO
     C           *IN,P     IFEQ '1'
     C                     ADD  1         @@CNT
     C                     SETON                     71
     C                     END
     C                     ADD  1         P
     C                     END
     C                     ELSE
     C                     SETOF                     71
     C                     Z-ADD1         P       20
     C                     MOVEL*BLANK    SW2     1
     C                     DO   KO
     C           *IN,P     IFEQ '1'
     C           SW2       IFEQ *BLANK
     C                     ADD  1         @@CNT
     C                     END
     C                     MOVEL'*'       SW2
     C                     SETON                     71
     C                     ELSE
     C                     MOVEL*BLANK    SW2
     C                     END
     C                     ADD  1         P
     C                     END
     C                     END
     C  N71                GOTO START
     C*
     C                     MOVE KTEI      PKTE
     C*
     C           OBMN      IFEQ BMONKO
     C                     ELSE
     C                     Z-ADD0         NABA
     C                     Z-ADD0         PAGE
     C                     Z-ADDBMONKO    OBMN
     C                     WRITEKCLPR131
     C                     WRITEKCLPR132
     C                     Z-ADD8         I
     C                     END
     C           KO        IFGE 1
     C           KO        ANDLE5
     C                     ADD  8         I
     C                     Z-ADD8         J
     C                     END
     C           KO        IFGE 6
     C           KO        ANDLE10
     C                     ADD  12        I
     C                     Z-ADD12        J
     C                     END
     C           KO        IFGE 11
     C           KO        ANDLE15
     C                     ADD  16        I
     C                     Z-ADD16        J
     C                     END
     C           I         IFLE 66
     C                     ELSE
     C                     Z-ADD0         I
     C                     WRITEKCLPR131
     C                     WRITEKCLPR132
     C           J         ADD  8         I
     C                     END
     C           KO        IFGE 1
     C           KO        ANDLE5
     C                     ADD  1         NABA
     C                     WRITEKCLPR133
     C                     WRITEKCLPR136
     C                     END
     C           KO        IFGE 6
     C           KO        ANDLE10
     C                     ADD  1         NABA
     C                     WRITEKCLPR133
     C                     WRITEKCLPR134
     C                     WRITEKCLPR136
     C                     END
     C           KO        IFGE 11
     C           KO        ANDLE15
     C                     ADD  1         NABA
     C                     WRITEKCLPR133
     C                     WRITEKCLPR134
     C                     WRITEKCLPR135
     C                     WRITEKCLPR136
     C                     END
     C                     END
     C*-----------------------------------------------*
     C*          工程数の検索　サブルーチン         *
     C*-----------------------------------------------*
     C           KENSA     BEGSR
     C                     Z-ADD15        A       20
     C           LOOP1     TAG
     C           A         IFGE 1
     C           KTEI,A    IFEQ *BLANK
     C                     SUB  1         A
     C                     GOTO LOOP1
     C                     END
     C                     END
     C                     Z-ADDA         KO      20
     C                     ENDSR
     C*-----------------------------------------------*
     C*           納入日の検索　サブルーチン        *
     C*-----------------------------------------------*
     C           CHK       BEGSR
     C                     Z-ADD1         B       20
     C           1         DO   KO        B
     C*
     C                     MOVELGNKI,B    CNKI1   20
     C           P5NOMM    IFEQ 1
     C           P5NOMM    OREQ 2
     C           P5NOMM    OREQ 3
     C           CNKI1     IFEQ 10
     C           CNKI1     OREQ 11
     C           CNKI1     OREQ 12
     C           P5NOYY    SUB  1         YNKI    40
     C                     ELSE
     C                     Z-ADDP5NOYY    YNKI
     C                     END
     C                     ELSE
     C           P5NOMM    IFEQ 10
     C           P5NOMM    OREQ 11
     C           P5NOMM    OREQ 12
     C           CNKI1     IFEQ 1
     C           CNKI1     OREQ 2
     C           CNKI1     OREQ 3
     C           P5NOYY    ADD  1         YNKI
     C                     ELSE
     C                     Z-ADDP5NOYY    YNKI
     C                     END
     C                     ELSE
     C                     Z-ADDP5NOYY    YNKI
     C                     END
     C                     END
     C                     MOVE GNKI,B    CNKI2   80
     C                     MOVELYNKI      CNKI2
     C*
     C           NBN,B     IFEQ '  .  -  '
     C           CNKI2     IFLE HIZK
     C                     MOVE 'NO INPUT'NUNY,B
     C                     END
     C                     ELSE
     C                     MOVE NBN,B     NUNY,B
     C                     MOVELNUNY,B    AHIZK
     C                     MOVELYNKI      @NYU,B
     C                     Z-ADDATUKI     @TUKI
     C                     Z-ADDANITI     @NITI
     C                     MOVE @HIZK     @NYU,B
     C                     END
     C                     MOVELYNKI      @NKI,B
     C                     MOVE GNKI,B    @NKI,B
     C                     END
     C                     ENDSR
     C*-----------------------------------------------*
     C*           納期の代入　サブルーチン          *
     C*-----------------------------------------------*
     C           NDIN      BEGSR
     C                     Z-ADD1         C       20
     C           1         DO   KO        C
     C                     MOVELGNKI,C    TU
     C                     MOVE GNKI,C    HN
     C                     MOVE NKI       NOUK,C
     C                     END
     C                     ENDSR
     C*-----------------------------------------------*
     C*          未納チェック　サブルーチン         *
     C*-----------------------------------------------*
     C           CBMN      BEGSR
     C*
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'00000'   *IN,11
     C*
     C                     MOVE *BLANK    MINUU   1
     C                     MOVE *BLANK    @@MINO  1
     C                     Z-ADD0         WWNKI   60
     C*
     C                     Z-ADD1         D       20
     C                     DO   KO        D
     C*
     C                     SETOF                     6066
     C                     MOVE *BLANK    SW      1
     C*
     C*
     C           NUNY,D    CABEQ*BLANK    @END
     C                     MOVELKAKO,D    WWKAKO 16
     C*
     C           D         IFEQ 1
     C                     EXSR SYOKOU
     C                     GOTO @@END
     C                     END
     C*
     C           NUNY,D    IFEQ 'NO INPUT'
     C                     EXSR MINIU
     C                     GOTO @@END
     C                     END
     C*
     C           @NKI,D    IFGE @NYU,D
     C                     MOVEL*BLANK    MINUU
     C                     MOVEL*BLANK    @@MINO
     C                     GOTO @@END
     C                     END
     C*
     C           MINUU     IFEQ '*'
     C                     MOVEL*BLANK    MINUU
     C                     GOTO @@END
     C                     END
     C*
     C                     SETON                     60
     C                     Z-ADDD         Y       20
     C                     SUB  1         Y
     C           Y         IFGT 0
     C           KAKO,Y    ANDEQKAKO,D
     C           @BMN,D    LOKUPKOUT                     60
     C  N60                SETON                     66
     C           WWNKI     IFEQ 0
     C                     SETOF                     66
     C                     END
     C                     END
     C*
     C           @@MINO    IFNE '*'
     C                     SETOF                     60
     C                     EXSR JIKOU
     C                     GOTO @@END
     C                     END
     C*
     C                     EXSR JIKOU
     C           @@END     TAG
     C                     MOVE @BMN,D    XXKAKO  40
     C                     MOVE @NYU,D    XXNYU
     C                     END
     C           @END      TAG
     C                     ENDSR
     C**
     C**
     C*-----------------------------------------------*
     C*          未納チェック　（初工程）　         *
     C*-----------------------------------------------*
     C           SYOKOU    BEGSR
     C*
     C           NUNY,D    IFEQ 'NO INPUT'
     C                     EXSR MINIU
     C                     GOTO @@@END
     C                     END
     C*
     C           @NKI,D    IFGE @NYU,D
     C                     MOVEL*BLANK    MINUU
     C                     MOVEL*BLANK    @@MINO
     C                     GOTO @@@END
     C                     END
     C*
     C                     EXSR JIKOU
     C*
     C           @@@END    TAG
     C                     ENDSR
     C**
     C**
     C*-----------------------------------------------*
     C*          未納チェック　（未入力）　         *
     C*-----------------------------------------------*
     C           MINIU     BEGSR
     C*
     C           MINUU     IFNE '*'
     C*
     C           @NKI,D    IFLT FHIZ
     C           @NKI,D    ORGT THIZ
     C                     GOTO @@@@1
     C                     END
     C*
     C           *IN50     CABEQ'1'       NSLOP
     C           KOJYOU    IFEQ KAKO,D
     C           NSLOP     TAG
     C                     MOVE '1'       *IN,D
     C                     END
     C           @@@@1     TAG
     C                     END
     C                     MOVE '*'       MINUU
     C                     MOVE '*'       @@MINO
     C*
     C                     ENDSR
     C**
     C**
     C*--------------------------------------------------------*
     C*          未納チェック　（次工程以後連続する同一工場で
     C*          　　　　　　　　　　　　　　未納挽回したか？）
     C*--------------------------------------------------------*
     C           JIKOU     BEGSR
     C                     Z-ADDD         E       20
     C                     ADD  1         E
     C                     Z-ADDE         G       20
     C*
     C           E         DO   KO
     C           WWKAKO    IFNE KAKO,G
     C                     GOTO PPEND
     C                     END
     C*
     C           *IN66     IFEQ '0'
     C           @NKI,G    IFGE @NYU,G
     C           NUNY,G    ANDNE'NO INPUT'
     C                     MOVE '*'       SW
     C                     GOTO PPEND
     C                     END
     C                     ELSE
     C           WWNKI     IFGE @NYU,G
     C           NUNY,G    ANDNE'NO INPUT'
     C                     MOVE '*'       SW
     C                     GOTO PPEND
     C                     END
     C                     END
     C                     ADD  1         G
     C*
     C                     END
     C           PPEND     TAG
     C*
     C           *IN66     IFEQ '1'
     C           WWNKI     IFNE 0
     C           WWNKI     ANDGE@NYU,D
     C                     MOVEL'*'       SW
     C                     END
     C                     END
      *
     C           *IN,60    IFEQ '1'
     C                     EXSR REDTIM
     C                     END
     C*
     C           SW        IFEQ *BLANK
     C*
     C           @NKI,D    IFLT FHIZ
     C           @NKI,D    ORGT THIZ
     C                     GOTO @@@@2
     C                     END
     C*
     C           *IN50     CABEQ'1'       NSLOP1
     C           KOJYOU    IFEQ KAKO,D
     C           NSLOP1    TAG
     C                     MOVE '1'       *IN,D
     C                     END
     C           @@@@2     TAG
     C                     MOVE '*'       @@MINO
     C                     END
     C*
     C                     ENDSR
     C**
     C**
     C*-----------------------------------------------*
     C*          未納チェック　（ＲＥＡＤ．ＴＩＭＥ）
     C*-----------------------------------------------*
     C           REDTIM    BEGSR
     C*
     C                     SETOF                     31
     C           XXKAKO    LOKUPKOUT                     31
     C           *IN,31    IFNE '1'
     C                     MOVEL9999      XXKAKO
     C                     END
     C*
     C                     SETOF                     31
     C           @BMN,D    LOKUPKOUT                     31
     C           *IN,31    IFNE '1'
     C                     MOVEL9999      @BMN,D
     C                     END
     C*
     C                     MOVE @BMN,D    WWBMN   40
     C*
     C                     SETOF                     55
     C           @@KAKO    LOKUPTAB1      TAB2           55
     C           *IN,55    IFEQ '1'
     C                     MOVE TAB2      @@HI    10
     C                     ADD  1         @@HI
     C                     END
     C           WWBMN     IFEQ 9999
     C                     EXSR KOBAI
     C                     END
     C           KEY       SETLLAGDPL111
     C                     DO   @@HI
     C                     READ AGDPL111                 33
     C  N33                END
     C           @NYU,D    IFLE F8KAHZ
     C                     MOVE '*'       SW
     C******                     MOVEL*BLANK    @@MINO
     C                     END
     C                     Z-ADD0         WWNKI   60
     C                     Z-ADDF8KAHZ    WWNKI
     C                     ENDSR
     C**
     C**
     C*-----------------------------------------------*
     C*     購買用（ＲＥＡＤ．ＴＩＭＥ）            *
     C*          　　連続する工程が　１～２　４日   *
     C*          　　　　　　　　　　３～４　５日   *
     C*          　　　　　　　　　　５～　　６日   *
     C*-----------------------------------------------*
     C           KOBAI     BEGSR
     C*
     C                     Z-ADD0         WWCNT   20
     C                     Z-ADDD         X       20
     C           STEPX     TAG
     C           KAKO,D    IFEQ KAKO,X
     C                     ADD  1         WWCNT
     C                     ELSE
     C                     GOTO EXIT1
     C                     END
     C           X         CABGEKO        EXIT1
     C                     ADD  1         X
     C                     GOTO STEPX
     C           EXIT1     TAG
      *
     C           WWCNT     IFGE 3
     C           WWCNT     ANDLE4
     C                     ADD  1         @@HI
     C                     END
     C           WWCNT     IFGE 5
     C                     ADD  2         @@HI
     C                     END
      *
     C                     ENDSR
     C**
**  (KOUT)
0111
**  (TAB1/TAB2)
011101111
