     H            Y.
     F** KFAR02 **********************************
     F* PRINT SIGNAL KANBAN LOCATION     *
     F* PROGRAM ID. : KFAR02. <RPG> *
     F* CREATE DATE. : APR.04,'88.               *
     F* AUTHOR.         : G.B.C.                 *
     F********************************** KFAR02 **
     FKFAWP02 IP  F      35            DISK
     FAAMPL11 IF  E           K        DISK
     FKFAPR02 O   E             77     PRINTER                        UC
     E                    TAB1    1   1  4 0 TAB2    4   ﾃcﾆﾞｭc xb
     E                    TAB3    1   6  3   TAB4    6   ﾌﾃbﾜ xb
     E                    CKHZ       15 10 0             gﾒfdﾍﾞ
     E                    CKKO       15  3               ﾃcmb (NEW)
     E                    CKQK       15  3               ﾃcmb (OLD)
     E                    CKNB       15  6               nﾃﾜ ﾌﾞ]k (NEW)
     E                    CKQT       15  6               nﾃﾜ ﾌﾞ]k (OLD)
     E                    KOT        15  3               ﾃcmb
     E                    PLC        15  6               nﾃﾜ ﾌﾞ]k
     IKFAWP02 NS  01
     I                                        1   40KFBMONL1
     I                                        5   5 KFBAN1
     I                                        6   7 KFBAN2
     I                                        8   9 KFBAN3
     I                                       10  10 KFBAN4
     I                                       11  11 KFHICR
     I                                       12  16 KFHIN1
     I                                       17  21 KFHIN2
     I                                       22  23 KFHIN3
     I                                       24  26 KFKIB1
     I                                       27  29 KFKIB2
     I                                       30  32 KFKIB3
     I                                       33  33 KFYOTP
     I                                       34  350KFHIMS
     I            DS
     I                                        1 150 CKHZ
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1  45 CKKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  45 CKQK
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  90 CKNB
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  90 CKQT
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1  14 KFHINB
     I                                        1   5 KFHIN1
     I                                        6   6 KFH1
     I                                        7  11 KFHIN2
     I                                       12  12 KFH2
     I                                       13  14 KFHIN3
     I            DS
     I                                        1   6 KFBAN
     I                                        1   1 KFBAN1
     I                                        2   3 KFBAN2
     I                                        4   5 KFBAN3
     I                                        6   6 KFBAN4
     I                                        2   2 KFBAN5
     I                                        4   4 KFBAN6
     I            DS
     I                                        1   4 NAME
     I                                        1   2 NAME01
     I                                        3   4 NAME02
     C           *ENTRY    PLIST
     C                     PARM           USER   10
      *
     C  N01                GOTO @END
      *
     C           *IN,90    IFEQ '0'
     C                     Z-ADD0         CNT     10
     C                     MOVE *BLANK    PSW     1
     C                     MOVEL'1'       *IN77
     C                     MOVEA'1'       *IN,90
     C                     END
      *
     C           PSW       IFEQ *BLANK
     C                     OPEN KFAPR02
     C                     MOVEL'*'       PSW
     C                     END
      *
     C                     MOVE '-'       KFH1
     C                     MOVE '-'       KFH2
      *
     C           *INL1     IFEQ '1'
     C                     MOVE *BLANK    NAME
     C           KFBMON    LOKUPTAB1      TAB2           10
     C   10                MOVELTAB2      NAME
     C                     ADD  1         CNT
     C           CNT       IFEQ 1
     C                     WRITEKFAPR021
     C                     END
      *
     C           CNT       IFEQ 2
     C                     WRITEKFAPR022
     C                     END
      *
     C           CNT       IFEQ 3
     C                     WRITEKFAPR023
     C                     Z-ADD0         CNT
     C                     END
      *
     C                     END
      *
     C                     MOVE *BLANK    KOT
     C                     MOVE *BLANK    PLC
     C           KEY1      KLIST
     C                     KFLD           KFHIN1
     C                     KFLD           KFHIN2
     C                     KFLD           KFHIN3
     C           KEY1      CHAINAAMPL111             10
B01  C           *IN,10    IFEQ '0'
     C           CKSKJY    ANDNE*BLANK
     C           CKSKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,10
E01  C                     END
B01  C           *IN,10    IFEQ '0'
B02  C                     DO   15        I       50
     C                     MOVELCKHZ,I    Z06     80
B03  C           Z06       IFGT *DATE
     C                     MOVELCKQK,I    KOT,I
     C                     MOVELCKQT,I    PLC,I
X03  C                     ELSE
     C                     MOVELCKKO,I    KOT,I
     C                     MOVELCKNB,I    PLC,I
E03  C                     END
E02  C                     END
E01  C                     END
      *
     C                     MOVE *BLANK    COL     6
     C                     Z-ADD1         I
     C           KFBAN     LOKUPPLC,I                    10
B01  C           *IN,10    IFEQ '1'
     C                     ADD  1         I
B02  C           I         IFLE 15
     C           KOT,I     LOKUPTAB3      TAB4           10
     C   10                MOVELTAB4      COL
E02  C                     END
E01  C                     END
      *
     C*          KFBAN5    IFEQ '0'
     C*                    MOVE *BLANK    KFBAN5
     C*                    END
     C*          KFBAN6    IFEQ '0'
     C*                    MOVE *BLANK    KFBAN6
     C*                    END
     C*          KFBAN4    IFEQ '0'
     C*                    MOVE '-'       KFBAN4
     C*                    END
      *
     C                     DO   KFHIMS
     C                     ADD  1         CNT
     C           CNT       IFEQ 1
     C                     WRITEKFAPR024
     C                     END
      *
     C           CNT       IFEQ 2
     C                     WRITEKFAPR025
     C                     END
      *
     C           CNT       IFEQ 3
     C                     WRITEKFAPR026
     C                     Z-ADD0         CNT
     C                     END
      *
     C                     END
      *
     C           @END      TAG
      *
**  TAB1 / TAB2 (FACTORY NAME )
0111IAF
**  TAB3 / TAB4 ( BOX COLOR NAME )
OQ PINK                                                     1
AOQYELLOW                                                   2
LANBLUE                                                     3
COQREDISH                                                   4
SB RED                                                      5
KANBROWN                                                    6
