     H            Y/                                    1
     FMBDPP11 IP  E           K        DISK
     FMBDTL12 UF  E           K        DISK                      A
      *
     C           F4TNEN    IFEQ 6005
     C                     Z-ADDF4TOKU    @4TOKU  40
     C                     MOVELF4TKOJ    @4TKOJ  1
     C                     MOVELF4TUKE    @4TUKE  4
     C                     Z-ADDF4NONY    @4NONY  40
     C                     MOVELF4NKOJ    @4NKOJ  1
     C                     MOVELF4NUKE    @4NUKE  4
     C                     MOVELF4SHN1    @4SHN1  5
     C                     MOVELF4SHN2    @4SHN2  5
     C                     MOVELF4SHN3    @4SHN3  2
     C                     MOVELF4MHN1    @4MHN1  5
     C                     MOVELF4MHN2    @4MHN2  5
     C                     MOVELF4MHN3    @4MHN3  5
     C                     MOVELF4MHN4    @4MHN4  5
     C                     MOVELF4TTAI    @4TTAI  1
     C                     Z-ADDF4TS07    @4TS07  70
     C                     Z-ADDF4TN07    @4TN07 115
     C                     EXSR SUB
     C                     END
      *
     CSR         SUB       BEGSR
     C           KEY       KLIST
     C                     KFLD           F4SHN1
     C                     KFLD           F4SHN2
     C                     KFLD           F4SHN3
     C                     KFLD           F4TOKU
     C                     KFLD           F4NONY
     C                     KFLD           F4NKOJ
     C                     KFLD           F4NUKE
     C                     KFLD           @4TNEN  40
     C                     Z-ADD2005      @4TNEN
     C           KEY       CHAINMBDTL121             25
     C           *IN25     IFEQ '0'
     C                     Z-ADD@4TS07    F4TS07
     C           F4TN07    IFEQ 0
     C                     Z-ADD@4TN07    F4TN07
     C                     ENDIF
     C                     UPDATMBDTL121
     C                     ELSE
     C                     CLEARMBDTL121
     C                     Z-ADD@4TOKU    F4TOKU
     C                     MOVEL@4TKOJ    F4TKOJ
     C                     MOVEL@4TUKE    F4TUKE
     C                     Z-ADD@4NONY    F4NONY
     C                     MOVEL@4NKOJ    F4NKOJ
     C                     MOVEL@4NUKE    F4NUKE
     C                     MOVEL@4SHN1    F4SHN1
     C                     MOVEL@4SHN2    F4SHN2
     C                     MOVEL@4SHN3    F4SHN3
     C                     MOVEL@4MHN1    F4MHN1
     C                     MOVEL@4MHN2    F4MHN2
     C                     MOVEL@4MHN3    F4MHN3
     C                     MOVEL@4MHN4    F4MHN4
     C                     Z-ADD2005      F4TNEN
     C                     MOVEL@4TTAI    F4TTAI
     C                     Z-ADD@4TS07    F4TS07
     C                     Z-ADD@4TN07    F4TN07
     C                     WRITEMBDTL121
     C                     ENDIF
     CSR         SUBE      ENDSR
      *
