     H            Y.                                    1
      *** MBDRTA *******************************************
      *   SET PROCESS CODE TABLE FOR HEADER                *
     F******************************************************
     FAAMPP11 IF  E           K        DISK
     FMBDWPTA UF  E           K        DISK                      A
      *****************************************************************
     E                    PRC        15  3
     E                    MCN        15  3
      *
     I            DS
     I                                        1  45 PRC
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
      *
     I            DS
     I                                        1  45 MCN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
      *****************************************************************
      *
     C                     DO   *HIVAL
     C                     READ AAMPP11                  98
     C   98                LEAVE
      *
     C           CKSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           1         DO   15        IX      20
     C           PRC,IX    IFEQ *BLANK
     C                     LEAVE
     C                     ENDIF
      *
     C           PRC,IX    CHAINMBDWPTA              99
      *
     C           *IN99     IFEQ *OFF
     C           IX        ANDEQ1
     C           FATYP     ANDEQ'3'
     C                     MOVEL'2'       FATYP
     C                     UPDATMBDWPTA1
     C                     ENDIF
      *
     C           *IN99     IFEQ *ON
     C                     MOVELPRC,IX    FAPROC
     C           IX        IFEQ 1
     C                     MOVE '1'       FATYP
     C                     ELSE
     C                     MOVE '3'       FATYP
     C                     ENDIF
     C                     WRITEMBDWPTA1
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
