     H            Y.                                    1
     F** MBDR01 ********************************************
     F*  SALES STATISTICS AND FORECAST (PARAMETER ENTRY)   *
     F*  (COPIED FROM MBDRT7)                              *
     F*  J.WATANABE   2019.02.18                           *
     F******************************************************
     FMBDPW01 CF  E                    WORKSTN
     FFGBPL01 IF  E           K        DISK
      *-----------------------------------------------------
     E                    ERR     1   9 65
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C           KEYB21    KLIST
     C                     KFLD           #KCODE  40
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
     C                     EXSR #INIT
      *
     C                     DO   *HIVAL
     C                     EXSR #DSP01
     C   KA                LEAVE
     C   80                LEAVE
     C                     ENDDO
      *
     C           *INKA     IFEQ *ON
     C                     MOVEL'F1'      P@RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  DISPLAY ENTRY SCREEN
      *----------------------------------------------------*
     C           #DSP01    BEGSR
      *
     C                     EXFMTDSP01
     C                     SETOF                     85
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     3738
     C                     SETOF                     39
     C                     SETOF                     80
     C                     MOVE *BLANK    MSG
      *----------------*
      * F01: EXIT
      *----------------*
     C           *INKA     IFEQ *ON
     C                     GOTO XEND
     C                     ENDIF
      *------------------------------*
      * F10: CUSTOMER GROUP MAINT
      *------------------------------*
     C           *INKJ     IFEQ *ON
     C                     CALL 'EDIC53'
     C                     GOTO XEND
     C                     ENDIF
      *  CHECK DATA
     C           @TOKU     IFEQ 0
     C           @TOKU     OREQ 9999
     C                     SETON                     8531
     C                     MOVELERR,05    MSG
     C                     GOTO XEND
     C                     ENDIF
      *
     C           @TOKU     CHAINFGBPL01              99
     C           *IN99     IFEQ *ON
     C                     SETON                     8531
     C                     MOVELERR,09    MSG
     C                     GOTO XEND
     C                     ENDIF
      *
     C           @YYYY     IFEQ 0
     C                     SETON                     8535
     C                     MOVELERR,01    MSG
     C                     GOTO XEND
     C                     END
      *
     C           @MMMM     IFGE 1
     C           @MMMM     ANDLE12
     C                     ELSE
     C                     SETON                     8536
     C                     MOVELERR,02    MSG
     C                     GOTO XEND
     C                     END
     C*
     C           @SIZI     IFNE '1'
     C           @SIZI     ANDNE'2'
     C           @SIZI     ANDNE'3'
     C                     SETON                     8537
     C                     MOVELERR,06    MSG
     C                     GOTO XEND
     C                     END
     C*
     C           @TYPE     IFNE '1'
     C           @TYPE     ANDNE'2'
     C                     SETON                     8539
     C                     MOVELERR,07    MSG
     C                     GOTO XEND
     C                     END
      *
      *----------------*
      * F05: RUN
      *----------------*
     C           *INKE     IFEQ *ON
     C                     EXSR #WRT
      **
     C           P@STS     IFEQ *BLANK
     C                     SETON                     80
     C                     GOTO XEND
     C                     ENDIF
      **
     C           P@STS     IFNE *BLANK
     C                     SETOF                     80
     C                     SETON                     85
     C                     SETON                     313233
     C                     SETON                     343536
     C                     SETON                     37
     C                     SETON                     39
     C                     MOVELERR,04    MSG
     C                     GOTO XEND
     C                     ENDIF
      *
     C                     ENDIF
      *  ENTR KEY
     C           *INKE     IFEQ *OFF
     C                     MOVELERR,08    MSG
     C                     ENDIF
      **
     C           XEND      ENDSR
      *----------------------------------------------------*
      *  GET SALES DATA
      *----------------------------------------------------*
     C           #WRT      BEGSR
      *
     C                     MOVEL@TOKU     P@TOKU  4
     C                     MOVEL@NONY     P@NONY  4
     C                     MOVEL@NKOJ     P@NKOJ  1
     C                     MOVEL@NUKE     P@NUKE  4
     C                     MOVEL@YYYY     P@YYYY  4
     C                     MOVEL@MMMM     P@MMMM  2
     C                     MOVEL@SIZI     P@SIZI  1
     C                     MOVEL@TYPE     P@TYPE  1
     C                     MOVEL*BLANK    P@STS   1
      *
     C                     CALL 'MBDR02'
     C                     PARM           P@TOKU
     C                     PARM           P@NONY
     C                     PARM           P@NKOJ
     C                     PARM           P@NUKE
     C                     PARM           P@YYYY
     C                     PARM           P@MMMM
     C                     PARM           P@SIZI
     C                     PARM           P@TYPE
     C                     PARM           P@STS
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SET
      *----------------------------------------------------*
     C           #INIT     BEGSR
      * OUTPUT PARAMETER
     C           *ENTRY    PLIST
     C                     PARM           P@TOKU
     C                     PARM           P@NONY
     C                     PARM           P@NKOJ
     C                     PARM           P@NUKE
     C                     PARM           P@RTN   2
      *
     C                     MOVE *BLANK    P@RTN
      *
     C                     ENDSR
      *----------------------------------------------------------------
** ERR
E-01 ENTER CORRECT YEAR !
E-02 ENTER CORRECT MONTH !
E-03 YEAR AND MONTH ARE INVALID !
E-04 NO DATA !
E-05 ENTER CORRECT CUSTOMER CODE !
E-06 ENTER RANGE 1, 2 OR 3 !
E-07 ENTER TYPE 1 OR 2 !
E-08 PRESS F5 TO RUN...
E-09 CUSTOMER CODE DOES NOT EXIST IN MASTER!
