     H            Y.
     FMBDPP01 IP  E                    DISK
     FMBDPP11 O   E                    DISK
     C                     EXSR #SB100
     C                     WRITEMBDPP111
      *-----------------------------------------------------*
     C           #SB100    BEGSR
     C                     MOVEL*BLANK    F4SKJY
     C                     Z-ADD0         F4SKYY
     C                     Z-ADD0         F4SKMM
     C                     Z-ADD0         F4SKDD
     C                     Z-ADDF3TOKU    F4TOKU
     C                     MOVELF3TKOJ    F4TKOJ
     C                     MOVELF3TUKE    F4TUKE
     C                     Z-ADDF3NONY    F4NONY
     C                     MOVELF3NKOJ    F4NKOJ
     C                     MOVELF3NUKE    F4NUKE
     C                     MOVELF3SHN1    F4SHN1
     C                     MOVELF3SHN2    F4SHN2
     C                     MOVELF3SHN3    F4SHN3
     C                     MOVELF3MHN1    F4MHN1
     C                     MOVELF3MHN2    F4MHN2
     C                     MOVELF3MHN3    F4MHN3
     C                     MOVELF3MHN4    F4MHN4
     C                     Z-ADD2004      F4TNEN
     C                     MOVELF3TTAI    F4TTAI
     C                     Z-ADDF3ENSU    F4TS01
     C                     Z-ADDF3TANK    F4TN01
     C                     Z-ADDF3DNSU    F4TS02
     C                     Z-ADDF3TANK    F4TN02
     C                     Z-ADDF3CNSU    F4TS03
     C                     Z-ADDF3TANK    F4TN03
     C                     Z-ADDF3BNSU    F4TS04
     C                     Z-ADDF3TANK    F4TN04
     C                     Z-ADDF3ANSU    F4TS05
     C                     Z-ADDF3TANK    F4TN05
     C                     Z-ADDF3TNSU    F4TS06
     C                     Z-ADDF3TANK    F4TN06
     C                     Z-ADD0         F4TS07
     C                     Z-ADD0         F4TN07
     C                     Z-ADD0         F4TS08
     C                     Z-ADD0         F4TN08
     C                     Z-ADD0         F4TS09
     C                     Z-ADD0         F4TN09
     C                     Z-ADD0         F4TS10
     C                     Z-ADD0         F4TN10
     C                     Z-ADD0         F4TS11
     C                     Z-ADD0         F4TN11
     C                     Z-ADD0         F4TS12
     C                     Z-ADD0         F4TN12
     C                     ENDSR
