     H            Y/
     F** MBDR83 *****************************************
     F*  WASHER PART VOLUME LIST (CREATE WF: MBDWP86)   *
     F*  J.WATANABE   2021.01.21                        *
     F***************************************************
     FAKBPL04 IF  E           K        DISK
     FFCEPL01BIF  E           K        DISK
     FMBDPL14 IF  E           K        DISK
     FEDIPP43 IF  E           K        DISK
     FMBDWP86 IF  E           K        DISK                      A
      *------------------------------------------------------------
     E                    SLS        12  7 0
      *------------------------------------------------------------
     I            DS
     I                                        1  20 W1MHIN
     I                                        1   5 W1MHN1
     I                                        6  10 W1MHN2
     I                                       11  15 W1MHN3
     I                                       16  20 W1MHN4
     I            DS
     I                                        1  23 W2MHIN
     I                                        1   5 W2MHN1
     I                                        6   6 W2HP1
     I                                        7  11 W2MHN2
     I                                       12  12 W2HP2
     I                                       13  17 W2MHN3
     I                                       18  18 W2HP3
     I                                       19  23 W2MHN4
     I            DS
     I                                        1  20 F4MHIN
     I                                        1   5 F4MHN1
     I                                        6  10 F4MHN2
     I                                       11  15 F4MHN3
     I                                       16  20 F4MHN4
     I            DS
     I                                        1  12 F4SHIN
     I                                        1   5 F4SHN1
     I                                        6  10 F4SHN2
     I                                       11  12 F4SHN3
     I            DS
     I                                        1  840SLS
     I                                        1   70F4TS01
     I                                        8  140F4TS02
     I                                       15  210F4TS03
     I                                       22  280F4TS04
     I                                       29  350F4TS05
     I                                       36  420F4TS06
     I                                       43  490F4TS07
     I                                       50  560F4TS08
     I                                       57  630F4TS09
     I                                       64  700F4TS10
     I                                       71  770F4TS11
     I                                       78  840F4TS12
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C                     EXSR #INIT
      *
     C           *LOVAL    SETLLAKBPL04
     C                     DO   *HIVAL
     C                     READ AKBPL04                  91
     C   91                LEAVE
      * IGNORE
     C           L1SKJY    IFEQ 'D'
     C           L1STYY    ORNE 9999
     C           L1BMON    OREQ 8990
     C                     ITER
     C                     ENDIF
      * GET SALES DATA
     C                     EXSR #SLS
     C                     ENDDO
      * SET TOTAL VOLUME
     C                     EXSR #TTL
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  GET SALES AND OUTPUT MBDWP86
      *------------------------------------------------------
     C           #SLS      BEGSR
      *
      * GET IAF FINAL GOODS
     C           K#PL1B    KLIST
     C                     KFLD           K21HB5  5
     C                     KFLD           K22HB5  5
     C                     KFLD           K23HB2  2
      *
     C                     MOVELL1SHN1    K21HB5    P
     C                     MOVELL1SHN2    K22HB5    P
     C                     MOVELL1SHN3    K23HB2    P
     C           K#PL1B    SETLLFCEPL01B
     C                     DO   *HIVAL
     C           K#PL1B    READEFCEPL01B                 94
     C   94                LEAVE
      * GET SALES
     C           K#PL14    KLIST
     C                     KFLD           K4SHN1  5
     C                     KFLD           K4SHN2  5
     C                     KFLD           K4SHN3  2
      *
     C                     MOVE 'Y'       FIRST   1
     C                     MOVELA2BHB1    K4SHN1
     C                     MOVELA2BHB2    K4SHN2
     C                     MOVELA2BHB3    K4SHN3
     C           K#PL14    SETLLMBDPL14
     C                     DO   *HIVAL
     C           K#PL14    READEMBDPL14                  92
     C   92                LEAVE
      * CHECK YEAR
     C           F4TNEN    IFLT @FYY
     C           F4TNEN    ORGT @TYY
     C                     ITER
     C                     ENDIF
      * FIRST?
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     Z-ADDF4TOKU    SVTOKU  40
     C                     Z-ADDF4NONY    SVNONY  40
     C                     MOVELF4MHIN    SVMHIN 20
     C                     MOVELF4SHIN    SVSHIN 12
     C                     ENDIF
      * BREAK?
     C           F4NONY    IFNE SVNONY
     C                     EXSR #BRK1
     C                     ENDIF
      * DETAIL
      *
     C                     ENDDO
      * LAST BREAK?
     C           FIRST     IFEQ 'N'
     C                     EXSR #BRK1
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           XSLS      ENDSR
      *------------------------------------------------------
      *  BREAK BY NONY
      *------------------------------------------------------
     C           #BRK1     BEGSR
      *
      * OUTPUT MBDWP86
     C                     CLEARMBDWP861
     C                     MOVELL1SHN1    W2MHN1    P
     C                     MOVELL1SHN2    W2MHN2    P
     C                     MOVELL1SHN3    W2MHN3    P
     C                     MOVE *BLANK    W2MHN4
     C           W2MHN3    IFEQ *BLANK
     C                     MOVE *BLANK    W2HP2
     C                     ELSE
     C                     MOVE '-'       W2HP2
     C                     ENDIF
     C           W2MHN4    IFEQ *BLANK
     C                     MOVE *BLANK    W2HP3
     C                     ELSE
     C                     MOVE '-'       W2HP3
     C                     ENDIF
     C                     MOVELW2MHIN    M6WHIN
      *
     C                     MOVELL1BMON    M6SUP
     C                     MOVELL1BMON    $DLV
     C                     EXSR #NAME
     C                     MOVEL$NAME1    M6SUPN
      *
     C                     MOVELSVMHIN    W1MHIN
     C                     MOVELW1MHN1    W2MHN1    P
     C                     MOVELW1MHN2    W2MHN2    P
     C                     MOVELW1MHN3    W2MHN3    P
     C                     MOVE *BLANK    W2MHN4
     C           W2MHN3    IFEQ *BLANK
     C                     MOVE *BLANK    W2HP2
     C                     ELSE
     C                     MOVE '-'       W2HP2
     C                     ENDIF
     C           W2MHN4    IFEQ *BLANK
     C                     MOVE *BLANK    W2HP3
     C                     ELSE
     C                     MOVE '-'       W2HP3
     C                     ENDIF
     C                     MOVELW2MHIN    M6MHIN
      *
     C                     MOVELSVSHIN    W1MHIN
     C                     MOVELW1MHN1    W2MHN1    P
     C                     MOVELW1MHN2    W2MHN2    P
     C                     MOVELW1MHN3    W2MHN3    P
     C                     MOVE *BLANK    W2MHN4
     C           W2MHN3    IFEQ *BLANK
     C                     MOVE *BLANK    W2HP2
     C                     ELSE
     C                     MOVE '-'       W2HP2
     C                     ENDIF
     C           W2MHN4    IFEQ *BLANK
     C                     MOVE *BLANK    W2HP3
     C                     ELSE
     C                     MOVE '-'       W2HP3
     C                     ENDIF
     C                     MOVELW2MHIN    M6SHIN
     C                     Z-ADD@FSLS     M6FSLS
     C                     MOVELSVTOKU    M6TOKU
     C                     MOVELSVNONY    M6NONY
      *
      * GET VOLUME BY DELIV
     C                     MOVELSVNONY    $DLV
     C                     EXSR #YSLS
     C**                   Z-ADD@TAMT     M6DSLS           VOL BY DELV#
     C                     Z-ADD@TQTY     M6DSLS           VOL BY DELV#
      *
     C                     EXSR #NAME
     C                     MOVEL$NAME1    M6SMEI
     C                     MOVEL$GRP      M6GRP
     C           $GRP      CHAINEDIPP43              98
     C   98                MOVE *BLANK    E3GPNM
     C                     MOVELE3GPNM    M6GRPN
     C                     MOVEL$FROM     M6FROM
     C                     MOVEL$TO       M6TO
      * OUT MBDWP86        =============
     C                     WRITEMBDWP861
      *                    =============
      * RESET
     C                     Z-ADDF4TOKU    SVTOKU
     C                     Z-ADDF4NONY    SVNONY
     C                     MOVELF4MHIN    SVMHIN
     C                     MOVELF4SHIN    SVSHIN
      *
     C                     ENDSR
      *------------------------------------------------------
      *  YEAR TOTAL VOLUME
      *------------------------------------------------------
     C           #YSLS     BEGSR
      *
     C                     MOVELSVTOKU    $TOKU
     C                     MOVELSVNONY    $NONY
     C                     MOVELSVMHIN    $MHIN
      *
     C                     CALL 'UEXC40'
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $MHIN  20
     C                     PARM           $FROM   6
     C                     PARM           $TO     6
     C                     PARM           $TQTY  10
     C                     PARM           $TAMT  12
      *
     C                     MOVEL$TQTY     @TQTY  100
     C                     MOVEL$TAMT     @TAMT  125
      *
     C                     ENDSR
      *------------------------------------------------------
      *  GET SUPPLIER NAME
      *------------------------------------------------------
     C           #NAME     BEGSR
      *
     C                     CALL 'UTLR62'
     C                     PARM           $DLV    4
     C                     PARM           $GRP    3
     C                     PARM           $NAME1 15
     C                     PARM           $NAME2 50
     C                     PARM           $RTN    1
      *
     C                     ENDSR
      *------------------------------------------------------
      *  SET TOTAL VOLUME
      *------------------------------------------------------
     C           #TTL      BEGSR
      *
      *
     C                     MOVE 'Y'       FIRST
     C           *LOVAL    SETLLMBDWP86
     C                     DO   *HIVAL
     C                     READ MBDWP86                  93
     C   93                LEAVE
      * FIRST?
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     MOVELM6WHIN    S6WHIN 20
     C                     Z-ADD0         @YSLS   90
     C                     ENDIF
      * BREAK?
     C           M6WHIN    IFNE S6WHIN
     C                     EXSR #BRK2
     C                     ENDIF
      * DETAIL
     C                     ADD  M6DSLS    @YSLS
      *
     C                     ENDDO
      * LAST BREAK?
     C           FIRST     IFEQ 'N'
     C                     EXSR #BRK2
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  BREAK 2
      *------------------------------------------------------
     C           #BRK2     BEGSR
      * UPDATE YEAR VOLUME
     C                     MOVELS6WHIN    $MHIN
     C                     MOVEL@YSLS     $YSLS
     C                     MOVEL#MM       $MM
     C                     CALL 'UEXR40B'
     C                     PARM           $MHIN  20
     C                     PARM           $YSLS   9
     C                     PARM           $MM     2
      * RESET
     C                     MOVELM6WHIN    S6WHIN
     C                     Z-ADD0         @YSLS
      *
     C                     ENDSR
      *------------------------------------------------------
      *  INITIAL SETTINGS
      *------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $FROM   6
     C                     PARM           $TO     6
      *
     C                     MOVEL$FROM     @FROM   60
     C                     MOVEL$FROM     @FYY    40
     C                     MOVE $FROM     @FMM    20
     C                     MOVEL$TO       @TO     60
     C                     MOVEL$TO       @TYY    40
     C                     MOVE $TO       @TMM    20
     C           @TO       SUB  @FROM     #MM     20
     C                     ADD  1         #MM
      *
     C                     MOVE '-'       W2HP1
     C                     MOVE '-'       W2HP2
     C                     MOVE '-'       W2HP3
     C                     Z-ADD0         @FSLS   90
      *
     C                     ENDSR
