     H            Y.                                                      DDM020
     F***MBDR12**************************************
     F* DEVIVERY STATISTICAL LIST BY PART NO CREATE *
     F* M-OKUDA S53.12.14                           *
     F* S.YAMAGAMI H03.07.06 HENKOU                 *
     F***********************************************
     FMBDPL01 IP  E           K        DISK
     FMBDPW12 CF  E                    WORKSTN
     FQPRINT  O   F     132     OF    LPRINTER
     E                    ER      1  10 60               *d[-
     E                    SU          6  7 0
     E                    MO          6  2 0
     E                    TO          6  8 0
     E                    SO          6  9 0
     LQPRINT   88FL 84OL
     IMBDPL011    01
     I                                              F3NONYL3
     I                                              F3NKOJL2
     I                                              F3NUKEL1
     I                                              F3SHN1L6
     I                                              F3SHN2L5
     I                                              F3SHN3L4        03
     I            DS
     I                                        1  420SU
     I                                        1   70F3TNSU
     I                                        8  140F3ANSU
     I                                       15  210F3BNSU
     I                                       22  280F3CNSU
     I                                       29  350F3DNSU
     I                                       36  420F3ENSU
     I            DS
     I                                        1  120MO
     I                                        1   20N1
     I                                        3   40N2
     I                                        5   60N3
     I                                        7   80N4
     I                                        9  100N5
     I                                       11  120N6
     I            DS
     I                                        1   80WDATE
     I                                        5   60WMO
     C                     SETOF                     21
     C   20                GOTO STEP1
     C                     SETON                     2021
      *
      *  S.YAMAGAMI ﾃﾃf[  (lg ･ ﾌﾆﾞxf[ﾍｭcﾆﾞ)
     C                     Z-ADD0         MO
     C                     Z-ADD*DATE     WDATE
     C                     Z-ADD1         A       20
     C                     DO   6         A
     C           WMO       IFEQ 1
     C                     Z-ADD12        WMO
     C                     ELSE
     C                     SUB  1         WMO
     C                     END
     C                     Z-ADDWMO       MO,A
     C                     ENDDO
      *  S.YAMAGAMI ﾃﾃumﾞ
      *
     C           TOBU      TAG
     C                     EXFMTMBDPW121
     C   KA                SETON                     LR
     C   KA                GOTO END
     C                     SETOF                     99
     C           N1        COMP 1                      99
     C   99                MOVE ER,1      MSG
     C   99                GOTO TOBU
     C           N1        COMP 12                   99
     C   99                MOVE ER,2      MSG
     C   99                GOTO TOBU
     C           N2        COMP 1                      99
     C   99                MOVE ER,1      MSG
     C   99                GOTO TOBU
     C           N2        COMP 12                   99
     C   99                MOVE ER,2      MSG
     C   99                GOTO TOBU
     C           N3        COMP 1                      99
     C   99                MOVE ER,1      MSG
     C   99                GOTO TOBU
     C           N3        COMP 12                   99
     C   99                MOVE ER,2      MSG
     C   99                GOTO TOBU
     C           N4        COMP 1                      99
     C   99                MOVE ER,1      MSG
     C   99                GOTO TOBU
     C           N4        COMP 12                   99
     C   99                MOVE ER,2      MSG
     C   99                GOTO TOBU
     C           N5        COMP 1                      99
     C   99                MOVE ER,1      MSG
     C   99                GOTO TOBU
     C           N5        COMP 12                   99
     C   99                MOVE ER,2      MSG
     C   99                GOTO TOBU
     C           N6        COMP 1                      99
     C   99                MOVE ER,1      MSG
     C   99                GOTO TOBU
     C           N6        COMP 12                   99
     C   99                MOVE ER,2      MSG
     C   99                GOTO TOBU
     C           STEP1     TAG
     C   L1      1         ADD  UK        UK      30
     C   L3      1         ADD  NK        NK      30
     C           SU,1      ADD  TO,6      TO,6
     C           SU,2      ADD  TO,5      TO,5
     C           SU,3      ADD  TO,4      TO,4
     C           SU,4      ADD  TO,3      TO,3
     C           SU,5      ADD  TO,2      TO,2
     C           SU,6      ADD  TO,1      TO,1
     C           KENS      ADD  1         KENS    30
     C           END       TAG
     CL4         TO        ADD  SO        SO
     CL4                   XFOOTTO        WTOG    90
     CL4         KENST     ADD  KENS      KENST   50
     CL4                   SETOF                     1011
     CL4         NK        COMP 1                        10
     CL4 10      UK        COMP 1                        11
     CL4                   Z-ADD0         NK
     CL4                   Z-ADD0         UK
     CLR                   XFOOTSO        WSOG   100
     OQPRINT  H   04   21
     O       OR        OF
     O                                   54 'DELIVERY'
     O                                   77 'STATISTICAL LIST BY P/N'
     O                                  100 'LIST-UP DATE'
     O                         UDATE Y  109
     O                                  115 'PAGE'
     O                         PAGE  Z  120
     O                                  132 'MBDR12-K8H1'
     O        H 2      21
     O       OR        OF
     O                                    2 'KB'
     O                                   14 'PART NO '
     O                                   26 'COUNT'
     O                                   35 'PROD ODR'
     O                         N6    Z   40
     O                                   46 '-MONTH'
     O                         N5    Z   53
     O                                   59 '-MONTH'
     O                         N4    Z   66
     O                                   72 '-MONTH'
     O                         N3    Z   79
     O                                   85 '-MONTH'
     O                         N2    Z   92
     O                                   98 '-MONTH'
     O                         N1    Z  105
     O                                  111 '-MONTH'
     O                                  126 '6 MONTHS TOTAL'
     O        T 2      L4
     O                N11 10              1 '*'
     O                 11 10              2 '**'
     O                         F3SHN1    11
     O                                   12 '-'
     O                         F3SHN2    17
     O                N03                18 '-'
     O                         F3SHN3    20
     O                         KENS  ZB  26
     O                         F3TEHA    33
     O                         TO     B 111 '&&&  ,   ,   '
     O                         WTOG   B 125 '   ,   ,   '
     O        T   83   LR
     O                                   33 '* FINAL TOTAL '
     O                         SO     B 111 '&&   ,   , * '
     O                         WSOG   B 125 ' ,   ,   , * '
     O        T 2      LR
     O                                   20 'RECORD COUNT'
     O                         KENST 2   27
**
IT MUST BE BIGGER THAN JANUARY OR IT
IT MUST BE SMALLER THAN DECEMBER OR IT
