     H            Y.
     F** MBDRB1 *********************************************
     F*  IAF PASS THROUGH  INVESTIGATION DATA               *
     F*       MSK.......           2007.04.25               *
     F********************************************* MBDRB1 **
     FMBDPWBT CF  E                    WORKSTN
     FMBDPL12 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FMBDWPB1 O   F     100            DISK
      *
     E                    ER      1   7 72
     E                    SRY        12  7 0
     E                    PRD        12  6 0
      *
     I            DS
     I                                        1   80WDATE
     I                                        1   20WDD
     I                                        3   40WMM
     I                                        5   60WYY
      *
     I            DS
     I                                        1   60TIME
     I                                        1   40TIMEHM
     I                                        1   20TIMEHH
     I                                        3   40TIMEMM
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     I            DS
     I                                        1  840SRY
     I                                        1   70F4TS01
     I                                        8  140F4TS02
     I                                       15  210F4TS03
     I                                       22  280F4TS04
     I                                       29  350F4TS05
     I                                       36  420F4TS06
     I                                       43  490F4TS07
     I                                       50  560F4TS08
     I                                       57  630F4TS09
     I                                       64  700F4TS10
     I                                       71  770F4TS11
     I                                       78  840F4TS12
      *
     I            DS
     I                                        1   80F4SKHZ
     I                                        1   40F4SKYY
     I                                        5   60F4SKMM
     I                                        7   80F4SKDD
      *
     I            DS
     I                                        1   60@FYM
     I                                        1   40@FHY
     I                                        5   60@FHM
      *
     I            DS
     I                                        1   60@TYM
     I                                        1   40@THY
     I                                        5   60@THM
      *
     I            DS
     I                                        1   60W@HYM
     I                                        1   40W@HYY
     I                                        5   60W@HMM
      *
     I           SDS
     I                                      254 263 @@USER
      *
      *----------------------------------------------------*
      *  パラメータＴＲＡＮＣＦＥＲ                      *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1FYM   6
     C                     PARM           P1TYM   6
     C                     PARM           P1NONY  4
      *
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *検索用KEY定義
     C           KEYF41    KLIST
     C                     KFLD           #KNEN   40
      *
      *----------------------------------------------------*
      *  メインルーチン                                  *
      *----------------------------------------------------*
     C                     EXSR $SB100
     C           *IN01     DOWEQ'0'
     C           *IN05     ANDEQ'0'
     C                     EXSR $SB200
     C                     END
     C                     EXSR $SB300
      *----------------------------------------------------*
      *   初期処理                                       *
      *----------------------------------------------------*
     CSR         $SB100    BEGSR
     C                     Z-ADD0         @FYM
     C                     Z-ADD0         @TYM
     C                     MOVE *BLANK    DSPSW1  1
      *
     C                     MOVE '1'       DSPSW1
     CSR         $S100E    ENDSR
      *----------------------------------------------------*
      *   主処理                                         *
      *----------------------------------------------------*
     CSR         $SB200    BEGSR
     C           *IN01     DOWEQ'0'
     C           *IN05     ANDEQ'0'
     C           DSPSW1    ANDEQ'1'
     C                     EXSR $SB210
     C                     END
     CSR         $S200E    ENDSR
      *----------------------------------------------------*
      *   第一画面処理(MBDPWBT1)                         *
      *----------------------------------------------------*
     CSR         $SB210    BEGSR
     C                     EXFMTMBDPWBT1
     C                     SETOF                     993132
     C                     SETOF                     333435
     C                     MOVEL*BLANK    MSG
      * CMD-1
     C           *IN01     IFEQ '1'
     C                     GOTO $S210E
     C                     END
      *--------------------*
      *入力項目チェック  *
      *--------------------*
      *期間
     C           @FYM      IFEQ 0
     C                     MOVELER,1      MSG
     C                     SETON                     313299
     C                     SETOF                       05
     C                     GOTO $S210E
     C                     END
     C           @FHM      IFGE 01
     C           @FHM      ANDLE12
     C                     ELSE
     C                     MOVELER,2      MSG
     C                     SETON                     3299
     C                     SETOF                       05
     C                     GOTO $S210E
     C                     END
      *
     C           @TYM      IFEQ 0
     C                     MOVELER,1      MSG
     C                     SETON                     333499
     C                     SETOF                       05
     C                     GOTO $S210E
     C                     END
     C           @THM      IFGE 01
     C           @THM      ANDLE12
     C                     ELSE
     C                     MOVELER,2      MSG
     C                     SETON                     3499
     C                     SETOF                       05
     C                     GOTO $S210E
     C                     END
     C           @FYM      IFGT @TYM
     C                     MOVELER,3      MSG
     C                     SETON                     313233
     C                     SETON                     3499
     C                     SETOF                       05
     C                     GOTO $S210E
     C                     END
      *納入先
     C           @NONY     IFEQ 0
     C                     MOVELER,4      MSG
     C                     SETOF                       05
     C                     SETON                     3599
     C                     GOTO $S210E
     C                     END
     C           @NONY     IFNE 9999
     C                     SETOF                     21
     C           @NONY     CHAINFGBPL011             21
     C           *IN21     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                       21
     C                     END
     C           *IN21     IFEQ '1'
     C                     MOVELER,5      MSG
     C                     SETON                     3599
     C                     SETOF                       05
     C                     GOTO $S210E
     C                     END
     C  N21                MOVELB2SMEI    @NONM
     C                     END
      *期間指定範囲チェック
     C                     MOVE @FYM      W@HYM
     C                     MOVE *ALL'0'   PRD
     C                     EXSR $SB299
     C           *IN99     IFEQ '1'
     C                     SETOF                       05
     C                     SETON                     313233
     C                     SETON                     34  99
     C                     MOVELER,6      MSG
     C                     GOTO $S210E
     C                     END
      *CMD5
     C                     Z-ADD0         CTRX   100
     C           *IN05     IFEQ '1'
     C                     EXSR $SB500
     C           CTRX      IFEQ 0
     C                     SETOF                       05
     C                     SETON                     313233
     C                     SETON                     343599
     C                     MOVELER,7      MSG
     C                     END
     C                     END
      *
     C                     MOVE @FYM      P1FYM
     C                     MOVE @TYM      P1TYM
     C                     MOVE @NONY     P1NONY
      *
     CSR         $S210E    ENDSR
      *----------------------------------------------------*
      *  期間を求める                                    *
      *----------------------------------------------------*
     CSR         $SB299    BEGSR
     C                     Z-ADD1         X       20
     C           1         DO   *HIVAL    X
     C           X         IFGT 12
     C                     SETON                     99
     C                     LEAVE
     C                     END
      *
     C                     MOVE W@HYM     PRD,X
      *
     C           W@HYM     IFEQ @TYM
     C                     LEAVE
     C                     END
      *
     C                     ADD  1         W@HMM
     C           W@HMM     IFGT 12
     C                     SUB  12        W@HMM
     C                     ADD  1         W@HYY
     C                     END
     C                     ENDDO
     CSR         $S299E    ENDSR
      *----------------------------------------------------*
      *   終了処理                                       *
      *----------------------------------------------------*
     CSR         $SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         $S300E    ENDSR
      *----------------------------------------------------*
      *   期間指定の年月を取得　　　　                   *
      *----------------------------------------------------*
     CSR         $SB500    BEGSR
     C                     Z-ADD1         X
     C           1         DO   12        X
      *
     C           PRD,X     IFEQ 0
     C                     LEAVE
     C                     END
      *
     C                     MOVE PRD,X     W@HYM
     C                     MOVE W@HYY     #KNEN
     C                     MOVE W@HMM     M       20
     C                     EXSR $SB510
      *
     C                     ENDDO
     CSR         $S500E    ENDSR
      *----------------------------------------------------*
      *    納入統計ファイル検索　　　                    *
      *----------------------------------------------------*
     CSR         $SB510    BEGSR
     C           KEYF41    SETLLMBDPL121
     C                     SETOF                     81
     C                     DO   *HIVAL
     C           KEYF41    READEMBDPL121                 81
     C   81                LEAVE
     C                     MOVE '0'       GETSW   1
     C           F4SKJY    IFEQ 'D'
     C           F4SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
      *
     C           @NONY     IFEQ 9999
     C                     MOVE '1'       GETSW
     C                     ELSE
     C           @NONY     IFEQ F4NONY
     C                     MOVE '1'       GETSW
     C                     END
     C                     END
      *
     C           GETSW     IFEQ '1'
     C                     Z-ADDSRY,M     @@SRYO  70
     C                     EXCPTFILE
     C                     ADD  1         CTRX
     C                     END
      *
     C                     ENDDO
      *
     CSR         $S4510    ENDSR
      *
     OMBDWPB1 E                FILE
     O                         W@HYM      6
     O                         F4NONY    10
     O                         F4SHN1    15
     O                         F4SHN2    20
     O                         F4SHN3    22
     O                         F4MHN1    27
     O                         F4MHN2    32
     O                         F4MHN3    37
     O                         F4MHN4    42
     O*                        F4MHN5    47
     O*                        F4MHN6    52
     O*                        F4MHN7    57
     O                         @@SRYO    64
** MSG
ER-01開始日を入力して下さい。
ER-02月の指定が正しく有りません。
ER-03期間の指定が正しく有りません。
ER-04納入先を入力して下さい。
ER-05納入先が正しく有りません。
ER-06１２ヶ月以上の指定がされています。
ER-07対象データが有りません。
