     H            Y.                                    1
     F*** MBDRT2 *******************************************
     F* SALES DATA STATISTICS     .                        *
     F*        M.TAKAGI             2004.03.22             *
     F* MSK 2009.01.12-------------------------------------*
JW1  F* JW(SRA) 2016/01/22 ADD TYPE FIELD                  *
     F******************************************************
     FMBDPWT2 CF  E                    WORKSTN
      *-----------------------------------------------------
     E                    ERR     1  80 65
      *----------------------------------------------------*
      *   ENTRY     L  I  S  T                             *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PDEST  50
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C           KEYB21    KLIST
     C                     KFLD           #KCODE  40
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
     C                     EXSR $SB100
     C           *IN01     DOWEQ'0'
     C                     EXSR $SB200
     C                     END
     C                     EXSR $SB300
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
     CSR         $SB100    BEGSR
     C                     MOVE *BLANK    DSPSW1  1
     C                     MOVELPDEST     @DEST
      *
     C                     MOVE '1'       DSPSW1
     CSR         $S100E    ENDSR
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
     CSR         $SB200    BEGSR
      *
     C           *IN01     DOWEQ'0'
     C           DSPSW1    ANDEQ'1'
     C                     EXSR $SB210
     C                     END
      *
     CSR         $S200E    ENDSR
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
     CSR         $SB210    BEGSR
      *
     C                     EXFMTMBDPWT21
     C                     SETOF                     99
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     3738
JW1  C                     SETOF                     39
     C                     MOVE *BLANK    MSG
      * CMD-1
     C           *IN01     IFEQ '1'
     C                     GOTO $S210E
     C                     END
      *
      *
      *
     C           @TOKU     IFEQ 0
     C                     SETON                     9931
     C                     SETOF                     05
     C                     MOVELERR,05    MSG
     C                     GOTO $S210E
     C                     ENDIF
      *DESTINATION
     C           @DEST     IFEQ *BLANK
     C                     SETON                     9938
     C                     SETOF                     05
     C                     MOVELERR,06    MSG
     C                     GOTO $S210E
     C                     END
      *
     C           @YYYY     IFEQ 0
     C                     SETON                     9935
     C                     SETOF                     05
     C                     MOVELERR,01    MSG
     C                     GOTO $S210E
     C                     END
      *
     C           @MMMM     IFGE 1
     C           @MMMM     ANDLE12
     C                     ELSE
     C                     SETON                     9936
     C                     SETOF                     05
     C                     MOVELERR,02    MSG
     C                     GOTO $S210E
     C                     END
     C*
     C           @SIZI     IFNE '1'
     C           @SIZI     ANDNE'2'
     C           @SIZI     ANDNE'3'
     C                     SETON                     9937
     C                     SETOF                     05
     C                     MOVELERR,03    MSG
     C                     GOTO $S210E
     C                     END
     C*
JW1  C           @TYPE     IFNE '1'
JW1  C           @TYPE     ANDNE'2'
JW1  C                     SETON                     9939
JW1  C                     SETOF                     05
JW1  C                     MOVELERR,07    MSG
JW1  C                     GOTO $S210E
JW1  C                     END
      *
      *----------------*
      *
      *----------------*
     C           *IN05     IFEQ '1'
     C                     EXSR $SB500
      **
     C           P@STS     IFNE ' '
     C                     SETON                     99
     C                     SETON                     313233
     C                     SETON                     343536
     C                     SETON                     37
JW1  C                     SETON                     39
     C                     SETON                     99
     C                     MOVELERR,04    MSG
     C                     GOTO $S210E
     C                     END
      **
     C                     SETON                     01
      **
     C                     END
      *
     CSR         $S210E    ENDSR
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
     CSR         $SB300    BEGSR
     C                     MOVEL*BLANK    PDEST
     C                     MOVEL@DEST     PDEST
     C                     SETON                     LR
     C                     RETRN
     CSR         $S300E    ENDSR
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
     CSR         $SB500    BEGSR
      *
      **
     C                     MOVEL@TOKU     P@TOKU  4
     C                     MOVEL@NONY     P@NONY  4
     C                     MOVEL@NKOJ     P@NKOJ  1
     C                     MOVEL@NUKE     P@NUKE  4
     C                     MOVEL@YYYY     P@YYYY  4
     C                     MOVEL@MMMM     P@MMMM  2
     C                     MOVEL@SIZI     P@SIZI  1
JW1  C                     MOVEL@TYPE     P@TYPE  1
      *                    MOVEL@TANK     P@TANK  1
     C                     MOVEL*BLANK    P@STS   1
     C                     CALL 'MBDRT4'
     C                     PARM           P@TOKU
     C                     PARM           P@NONY
     C                     PARM           P@NKOJ
     C                     PARM           P@NUKE
     C                     PARM           P@YYYY
     C                     PARM           P@MMMM
     C                     PARM           P@SIZI
JW1  C                     PARM           P@TYPE
      *                    PARM           P@TANK
     C                     PARM           P@STS
     CSR         $S500E    ENDSR
      *----------------------------------------------------------------
** ERR
E-01 YEAR IS WRONG.
E-02 MONTH IS WRONG.
E-03 YEAR AND MONTH IS WRONG.
E-04 NO DATA.
E-05 REQUIRED
E-06 ENTER E-MAIL ADDRESS
E-07 ENTER TYPE 1 OR 2.
