     H            Y/
     F** MBDR83 *****************************************
     F*  WASHER PART VOLUME LIST (CREATE WF: MBDWP86)   *
     F*  J.WATANABE   2021.01.21                        *
     F***************************************************
     FAKBPL04 IF  E           K        DISK
     F**FCEPL01BIF  E           K        DISK
     FMBDPL14 IF  E           K        DISK
     FEDIPP43 IF  E           K        DISK
     FMBDWP86 IF  E           K        DISK                      A
      *------------------------------------------------------------
     E                    PRT        50 12
     E                    SLS        12  7 0
      *------------------------------------------------------------
     I            DS
     I                                        1  12 WKSHIN
     I                                        1   5 WKSHN1
     I                                        6  10 WKSHN2
     I                                       11  12 WKSHN3
     I            DS
     I                                        1  20 W1MHIN
     I                                        1   5 W1MHN1
     I                                        6  10 W1MHN2
     I                                       11  15 W1MHN3
     I                                       16  20 W1MHN4
     I            DS
     I                                        1  23 W2MHIN
     I                                        1   5 W2MHN1
     I                                        6   6 W2HP1
     I                                        7  11 W2MHN2
     I                                       12  12 W2HP2
     I                                       13  17 W2MHN3
     I                                       18  18 W2HP3
     I                                       19  23 W2MHN4
     I            DS
     I                                        1  20 F4MHIN
     I                                        1   5 F4MHN1
     I                                        6  10 F4MHN2
     I                                       11  15 F4MHN3
     I                                       16  20 F4MHN4
     I            DS
     I                                        1  12 F4SHIN
     I                                        1   5 F4SHN1
     I                                        6  10 F4SHN2
     I                                       11  12 F4SHN3
     I            DS
     I                                        1  12 L1SHIN
     I                                        1   5 L1SHN1
     I                                        6  10 L1SHN2
     I                                       11  12 L1SHN3
     I            DS
     I                                        1  840SLS
     I                                        1   70F4TS01
     I                                        8  140F4TS02
     I                                       15  210F4TS03
     I                                       22  280F4TS04
     I                                       29  350F4TS05
     I                                       36  420F4TS06
     I                                       43  490F4TS07
     I                                       50  560F4TS08
     I                                       57  630F4TS09
     I                                       64  700F4TS10
     I                                       71  770F4TS11
     I                                       78  840F4TS12
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1 600 PRT
     I                                        1  12 $FPR01
     I                                       13  24 $FPR02
     I                                       25  36 $FPR03
     I                                       37  48 $FPR04
     I                                       49  60 $FPR05
     I                                       61  72 $FPR06
     I                                       73  84 $FPR07
     I                                       85  96 $FPR08
     I                                       97 108 $FPR09
     I                                      109 120 $FPR10
     I                                      121 132 $FPR11
     I                                      133 144 $FPR12
     I                                      145 156 $FPR13
     I                                      157 168 $FPR14
     I                                      169 180 $FPR15
     I                                      181 192 $FPR16
     I                                      193 204 $FPR17
     I                                      205 216 $FPR18
     I                                      217 228 $FPR19
     I                                      229 240 $FPR20
     I                                      241 252 $FPR21
     I                                      253 264 $FPR22
     I                                      265 276 $FPR23
     I                                      277 288 $FPR24
     I                                      289 300 $FPR25
     I                                      301 312 $FPR26
     I                                      313 324 $FPR27
     I                                      325 336 $FPR28
     I                                      337 348 $FPR29
     I                                      349 360 $FPR30
     I                                      361 372 $FPR31
     I                                      373 384 $FPR32
     I                                      385 396 $FPR33
     I                                      397 408 $FPR34
     I                                      409 420 $FPR35
     I                                      421 432 $FPR36
     I                                      433 444 $FPR37
     I                                      445 456 $FPR38
     I                                      457 468 $FPR39
     I                                      469 480 $FPR40
     I                                      481 492 $FPR41
     I                                      493 504 $FPR42
     I                                      505 516 $FPR43
     I                                      517 528 $FPR44
     I                                      529 540 $FPR45
     I                                      541 552 $FPR46
     I                                      553 564 $FPR47
     I                                      565 576 $FPR48
     I                                      577 588 $FPR49
     I                                      589 600 $FPR50
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C                     EXSR #INIT
      *
     C           *LOVAL    SETLLAKBPL04
     C                     DO   *HIVAL
     C                     READ AKBPL04                  91
     C   91                LEAVE
      * EXCPTION
     C           L1SHN1    IFEQ 'AA061'
     C           L1SHN2    ANDEQ'2A3F3'
     C           L1SHN3    ANDEQ'9D   '
     C                     GOTO @SKP1
     C                     ENDIF
      * IGNORE
     C           L1SKJY    IFEQ 'D'
     C           L1STYY    ORNE 9999
     C           L1BMON    OREQ 8990
     C                     ITER
     C                     ENDIF
      *
     C           @SKP1     TAG
      * GET SALES DATA
     C                     EXSR #SLS
     C                     ENDDO
      * SET TOTAL VOLUME
     C                     EXSR #TTL
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  GET SALES AND OUTPUT MBDWP86
      *------------------------------------------------------
     C           #SLS      BEGSR
      *
     C* GET IAF FINISH GOOD
     C                     MOVELL1SHIN    $CPART
     C                     CALL 'UTLR75C' PLST1
      * LOOP 5 TIMES
     C           1         DO   60        IX      20
     C           PRT,IX    IFEQ *BLANK
     C                     LEAVE
     C                     ENDIF
      * GET SALES
     C           K#PL14    KLIST
     C                     KFLD           K4SHN1  5
     C                     KFLD           K4SHN2  5
     C                     KFLD           K4SHN3  2
      *
     C                     MOVE 'Y'       FIRST   1
     C                     MOVELPRT,IX    WKSHIN
     C                     MOVELWKSHN1    K4SHN1
     C                     MOVELWKSHN2    K4SHN2
     C                     MOVELWKSHN3    K4SHN3
     C           K#PL14    SETLLMBDPL14
     C                     DO   *HIVAL
     C           K#PL14    READEMBDPL14                  92
     C   92                LEAVE
      * CHECK YEAR
     C           F4TNEN    IFLT @FYY
     C           F4TNEN    ORGT @TYY
     C                     ITER
     C                     ENDIF
      * FIRST?
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     Z-ADDF4TOKU    SVTOKU  40
     C                     Z-ADDF4NONY    SVNONY  40
     C                     MOVELF4MHIN    SVMHIN 20
     C                     MOVELF4SHIN    SVSHIN 12
     C                     ENDIF
      * BREAK?
     C           F4NONY    IFNE SVNONY
     C                     EXSR #BRK1
     C                     ENDIF
      * DETAIL
      *
     C                     ENDDO
      * LAST BREAK?
     C           FIRST     IFEQ 'N'
     C                     EXSR #BRK1
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           XSLS      ENDSR
      *------------------------------------------------------
      *  BREAK BY NONY
      *------------------------------------------------------
     C           #BRK1     BEGSR
      *
      * OUTPUT MBDWP86
     C                     CLEARMBDWP861
     C                     MOVELL1SHN1    W2MHN1    P
     C                     MOVELL1SHN2    W2MHN2    P
     C                     MOVELL1SHN3    W2MHN3    P
     C                     MOVE *BLANK    W2MHN4
     C           W2MHN3    IFEQ *BLANK
     C                     MOVE *BLANK    W2HP2
     C                     ELSE
     C                     MOVE '-'       W2HP2
     C                     ENDIF
     C           W2MHN4    IFEQ *BLANK
     C                     MOVE *BLANK    W2HP3
     C                     ELSE
     C                     MOVE '-'       W2HP3
     C                     ENDIF
     C                     MOVELW2MHIN    M6WHIN
      *
     C                     MOVELL1BMON    M6SUP
     C                     MOVELL1BMON    $DLV
     C                     EXSR #NAME
     C                     MOVEL$NAME1    M6SUPN
      *
     C                     MOVELSVMHIN    W1MHIN
     C                     MOVELW1MHN1    W2MHN1    P
     C                     MOVELW1MHN2    W2MHN2    P
     C                     MOVELW1MHN3    W2MHN3    P
     C                     MOVE *BLANK    W2MHN4
     C           W2MHN3    IFEQ *BLANK
     C                     MOVE *BLANK    W2HP2
     C                     ELSE
     C                     MOVE '-'       W2HP2
     C                     ENDIF
     C           W2MHN4    IFEQ *BLANK
     C                     MOVE *BLANK    W2HP3
     C                     ELSE
     C                     MOVE '-'       W2HP3
     C                     ENDIF
     C                     MOVELW2MHIN    M6MHIN
      *
     C                     MOVELSVSHIN    W1MHIN
     C                     MOVELW1MHN1    W2MHN1    P
     C                     MOVELW1MHN2    W2MHN2    P
     C                     MOVELW1MHN3    W2MHN3    P
     C                     MOVE *BLANK    W2MHN4
     C           W2MHN3    IFEQ *BLANK
     C                     MOVE *BLANK    W2HP2
     C                     ELSE
     C                     MOVE '-'       W2HP2
     C                     ENDIF
     C           W2MHN4    IFEQ *BLANK
     C                     MOVE *BLANK    W2HP3
     C                     ELSE
     C                     MOVE '-'       W2HP3
     C                     ENDIF
     C                     MOVELW2MHIN    M6SHIN
     C                     Z-ADD@FSLS     M6FSLS
     C                     MOVELSVTOKU    M6TOKU
     C                     MOVELSVNONY    M6NONY
      *
      * GET VOLUME BY DELIV
     C                     MOVELSVNONY    $DLV
     C                     EXSR #YSLS
     C**                   Z-ADD@TAMT     M6DSLS           VOL BY DELV#
     C                     Z-ADD@TQTY     M6DSLS           VOL BY DELV#
      *
     C                     EXSR #NAME
     C                     MOVEL$NAME1    M6SMEI
     C                     MOVEL$GRP      M6GRP
     C           $GRP      CHAINEDIPP43              98
     C   98                MOVE *BLANK    E3GPNM
     C                     MOVELE3GPNM    M6GRPN
     C                     MOVEL$FROM     M6FROM
     C                     MOVEL$TO       M6TO
      * OUT MBDWP86        =============
     C                     WRITEMBDWP861
      *                    =============
      * RESET
     C                     Z-ADDF4TOKU    SVTOKU
     C                     Z-ADDF4NONY    SVNONY
     C                     MOVELF4MHIN    SVMHIN
     C                     MOVELF4SHIN    SVSHIN
      *
     C                     ENDSR
      *------------------------------------------------------
      *  YEAR TOTAL VOLUME
      *------------------------------------------------------
     C           #YSLS     BEGSR
      *
     C                     MOVELSVTOKU    $TOKU
     C                     MOVELSVNONY    $NONY
     C                     MOVELSVMHIN    $MHIN
      *
     C                     CALL 'UEXC40'
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $MHIN  20
     C                     PARM           $FROM   6
     C                     PARM           $TO     6
     C                     PARM           $TQTY  10
     C                     PARM           $TAMT  12
      *
     C                     MOVEL$TQTY     @TQTY  100
     C                     MOVEL$TAMT     @TAMT  125
      *
     C                     ENDSR
      *------------------------------------------------------
      *  GET SUPPLIER NAME
      *------------------------------------------------------
     C           #NAME     BEGSR
      *
     C                     CALL 'UTLR62'
     C                     PARM           $DLV    4
     C                     PARM           $GRP    3
     C                     PARM           $NAME1 15
     C                     PARM           $NAME2 50
     C                     PARM           $RTN    1
      *
     C                     ENDSR
      *------------------------------------------------------
      *  SET TOTAL VOLUME
      *------------------------------------------------------
     C           #TTL      BEGSR
      *
      *
     C                     MOVE 'Y'       FIRST
     C           *LOVAL    SETLLMBDWP86
     C                     DO   *HIVAL
     C                     READ MBDWP86                  93
     C   93                LEAVE
      * FIRST?
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     MOVELM6WHIN    S6WHIN 20
     C                     Z-ADD0         @YSLS   90
     C                     ENDIF
      * BREAK?
     C           M6WHIN    IFNE S6WHIN
     C                     EXSR #BRK2
     C                     ENDIF
      * DETAIL
     C                     ADD  M6DSLS    @YSLS
      *
     C                     ENDDO
      * LAST BREAK?
     C           FIRST     IFEQ 'N'
     C                     EXSR #BRK2
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  BREAK 2
      *------------------------------------------------------
     C           #BRK2     BEGSR
      * UPDATE YEAR VOLUME
     C                     MOVELS6WHIN    $MHIN
     C                     MOVEL@YSLS     $YSLS
     C                     MOVEL#MM       $MM
     C                     CALL 'UEXR40B'
     C                     PARM           $MHIN  20
     C                     PARM           $YSLS   9
     C                     PARM           $MM     2
      * RESET
     C                     MOVELM6WHIN    S6WHIN
     C                     Z-ADD0         @YSLS
      *
     C                     ENDSR
      *------------------------------------------------------
      *  INITIAL SETTINGS
      *------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $FROM   6
     C                     PARM           $TO     6
      *
     C           PLST1     PLIST
     C                     PARM           $CPART 12
     C                     PARM           $FPR01 12
     C                     PARM           $FPR02 12
     C                     PARM           $FPR03 12
     C                     PARM           $FPR04 12
     C                     PARM           $FPR05 12
     C                     PARM           $FPR06 12
     C                     PARM           $FPR07 12
     C                     PARM           $FPR08 12
     C                     PARM           $FPR09 12
     C                     PARM           $FPR10 12
     C                     PARM           $FPR11 12
     C                     PARM           $FPR12 12
     C                     PARM           $FPR13 12
     C                     PARM           $FPR14 12
     C                     PARM           $FPR15 12
     C                     PARM           $FPR16 12
     C                     PARM           $FPR17 12
     C                     PARM           $FPR18 12
     C                     PARM           $FPR19 12
     C                     PARM           $FPR20 12
     C                     PARM           $FPR21 12
     C                     PARM           $FPR22 12
     C                     PARM           $FPR23 12
     C                     PARM           $FPR24 12
     C                     PARM           $FPR25 12
     C                     PARM           $FPR26 12
     C                     PARM           $FPR27 12
     C                     PARM           $FPR28 12
     C                     PARM           $FPR29 12
     C                     PARM           $FPR30 12
     C                     PARM           $FPR31 12
     C                     PARM           $FPR32 12
     C                     PARM           $FPR33 12
     C                     PARM           $FPR34 12
     C                     PARM           $FPR35 12
     C                     PARM           $FPR36 12
     C                     PARM           $FPR37 12
     C                     PARM           $FPR38 12
     C                     PARM           $FPR39 12
     C                     PARM           $FPR40 12
     C                     PARM           $FPR41 12
     C                     PARM           $FPR42 12
     C                     PARM           $FPR43 12
     C                     PARM           $FPR44 12
     C                     PARM           $FPR45 12
     C                     PARM           $FPR46 12
     C                     PARM           $FPR47 12
     C                     PARM           $FPR48 12
     C                     PARM           $FPR49 12
     C                     PARM           $FPR50 12
      *
     C                     MOVEL$FROM     @FROM   60
     C                     MOVEL$FROM     @FYY    40
     C                     MOVE $FROM     @FMM    20
     C                     MOVEL$TO       @TO     60
     C                     MOVEL$TO       @TYY    40
     C                     MOVE $TO       @TMM    20
     C           @TO       SUB  @FROM     #MM     20
     C                     ADD  1         #MM
      *
     C                     MOVE '-'       W2HP1
     C                     MOVE '-'       W2HP2
     C                     MOVE '-'       W2HP3
     C                     Z-ADD0         @FSLS   90
      *
     C                     ENDSR
