     H            Y.
     FMBEPL02 IF  E           K        DISK
     C           *ENTRY    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@GOKE  80
      *
     C                     MOVE P@HIN1    K@HIN1
     C                     MOVE P@HIN2    K@HIN2
     C                     MOVE P@HIN3    K@HIN3
      *
     C           HINKEY    KLIST
     C                     KFLD           K@HIN1  5
     C                     KFLD           K@HIN2  5
     C                     KFLD           K@HIN3  2
      *
     C                     Z-ADD0         P@GOKE
      *
     C           HINKEY    SETLLMBEPL02
     C                     DO   *HIVAL
     C           HINKEY    READEMBEPL02                  77
     C   77                LEAVE
     C           F2SKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C                     ADD  F2GOKE    P@GOKE
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
