     H            Y.
     F** MBERS2 ********************************************
     F*  LAST MONTH'S DELIVERY REPORT BY CUST. GROUP(SRT)
     F*  T.SAKAKI               2018.09.14
     F******************************************************
     FMBEPL02 IF  E           K        DISK
     FEDIPP42 IF  E           K        DISK
     C*
     C           *ENTRY    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@GRP   3
     C                     PARM           P@GOKE  80
      *
     C                     MOVE P@HIN1    K@HIN1
     C                     MOVE P@HIN2    K@HIN2
     C                     MOVE P@HIN3    K@HIN3
      *
     C           HINKEY    KLIST
     C                     KFLD           K@HIN1  5
     C                     KFLD           K@HIN2  5
     C                     KFLD           K@HIN3  2
      *
     C                     Z-ADD0         P@GOKE
      *
     C           HINKEY    SETLLMBEPL02
     C                     DO   *HIVAL
     C           HINKEY    READEMBEPL02                  77
     C   77                LEAVE
      *
     C           F2SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C                     MOVE F2NONY    K@NONY  4
     C                     MOVE *BLANK    K@GRP   3
     C           K@NONY    CHAINEDIPP42              78
     C           *IN78     IFEQ *OFF
     C           F2SKJY    IFEQ 'D'
     C                     ELSE
     C                     MOVELE4GRP2    K@GRP
     C                     ENDIF
     C                     ENDIF
      *
     C           P@GRP     IFEQ *BLANK
     C                     ADD  F2GOKE    P@GOKE
     C                     ELSE
     C           P@GRP     IFEQ K@GRP
     C                     ADD  F2GOKE    P@GOKE
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
