     H            Y.
      **MBER20 *****************************************************************
      * SHIPPED PALLET SUMMARY REPORT                                          *
      * J.WATANABE  2018.03.02                                                 *
      **************************************************************************
     FMBEPW20 CF  E                    WORKSTN
     FAB#PL06 IF  E           K        DISK
     FEDIPP42 IF  E           K        DISK
     FAB#PL90 IF  E           K        DISK
     FMBEWP20 O   E                    DISK
      *------------------------------------------------------------
     E                    ERR     1  10 60
      *------------------------------------------------------------
     I*
     I            DS
     I                                        1   80W1NOHZ
     I                                        1   40W1NOYY
     I                                        5   60W1NOMM
     I                                        7   80W1NODD
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        1   20WSHH
     I                                        3   40WSMN
     I                                        5   60WSSS
     I                                        7  100WSYY
     I                                       11  120WSMM
     I                                       13  140WSDD
     I                                        1   40WSTM4
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C                     EXSR #INIT
      *
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      **************************************************************************
      *          DISPLAY SCREEN 1
      **************************************************************************
     C           #SCRN1    BEGSR
      *
     C           XFROM     IFEQ 0
     C                     Z-ADDTODAY     XFROM
     C                     Z-ADDTODAY     XTO
     C                     ENDIF
      *
     C                     EXFMTDSP01
     C                     MOVE *OFF      *IN41
     C                     MOVE *OFF      *IN42
     C                     MOVE *OFF      *IN85
     C                     MOVE *BLANK    XMSG
     C*
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C*
     C                     OTHER
     C                     EXSR #CHK1
      * IF NO ERROR
     C           *IN85     IFEQ *OFF
     C           *INKE     IFEQ *ON
     C                     EXSR #OUT
     C                     MOVELERR,7     XMSG
     C                     MOVE '99'      W@ID
     C                     ELSE
     C                     MOVELERR,8     XMSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      **************************************************************************
      *  CHECK--WORKER ID
      **************************************************************************
     C           #CHK1     BEGSR
      *
     C           XFROM     IFEQ 0
     C  N85                MOVELERR,1     XMSG
     C                     MOVE *ON       *IN85
     C                     MOVE *ON       *IN41
     C                     ENDIF
      * CHECK CALENDAR
     C                     MOVELXFROM     $SRC      P
     C                     CALL 'UTLR01'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE   8
     C                     PARM           $RTN    1
      *
     C           $RTN      IFNE *BLANK
     C  N85                MOVELERR,2     XMSG
     C                     MOVE *ON       *IN85
     C                     MOVE *ON       *IN41
     C                     ENDIF
      *
     C           XTO       IFEQ 0
     C  N85                MOVELERR,3     XMSG
     C                     MOVE *ON       *IN85
     C                     MOVE *ON       *IN42
     C                     ENDIF
      * CHECK CALENDAR
     C                     MOVELXTO       $SRC      P
     C                     CALL 'UTLR01'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE   8
     C                     PARM           $RTN    1
      *
     C           $RTN      IFNE *BLANK
     C  N85                MOVELERR,4     XMSG
     C                     MOVE *ON       *IN85
     C                     MOVE *ON       *IN42
     C                     ENDIF
      *
     C           XFROM     IFGT XTO
     C  N85                MOVELERR,5     XMSG
     C                     MOVE *ON       *IN85
     C                     MOVE *ON       *IN41
     C                     MOVE *ON       *IN42
     C                     ENDIF
      * IF NO ERROR -------------------
     C           *IN85     IFEQ *OFF
     C                     Z-ADDXFROM     W1NOHZ
     C                     Z-ADDW1NOYY    K@NOYY
     C                     Z-ADDW1NOMM    K@NOMM
     C                     Z-ADDW1NODD    K@NODD
      *
     C                     Z-ADD0         RCNT    60
     C                     MOVE *OFF      *IN98
     C           K@PPA1    SETLLAB#PL06
     C           *IN98     DOWEQ*OFF
     C                     READ AB#PL06                  98
     C           *IN98     IFEQ *OFF
      *
     C           B1NOHZ    IFGT XTO
     C                     MOVE *ON       *IN98
     C                     ITER
     C                     ENDIF
      *
     C                     EXSR #CHK2
     C           OKFLG     IFEQ 'Y'
     C                     ADD  1         RCNT
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           RCNT      IFEQ 0
     C  N85                MOVELERR,6     XMSG
     C                     MOVE *ON       *IN85
     C                     MOVE *ON       *IN41
     C                     MOVE *ON       *IN42
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      **************************************************************************
      *  OUTPUT
      **************************************************************************
     C           #OUT      BEGSR
      *
     C                     MOVE *OFF      *IN98
     C           K@PPA1    SETLLAB#PL06
     C           *IN98     DOWEQ*OFF
     C                     READ AB#PL06                  98
     C           *IN98     IFEQ *OFF
      * END?
     C           B1NOHZ    IFGT XTO
     C                     MOVE *ON       *IN98
     C                     ITER
     C                     ENDIF
      * OUTPUT?
     C                     EXSR #CHK2
     C           OKFLG     IFEQ 'Y'
     C                     EXSR #OUT2
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
      *  CHECK 2
      **************************************************************************
     C           #CHK2     BEGSR
      *
     C                     MOVE 'N'       OKFLG   1
      * OMIT 5211 4355 3278 1111 5299 4250 5531
     C** JEFF    B1NONY    IFEQ 1111
     C**         B1NONY    OREQ 3278
     C**         B1NONY    OREQ 4250
     C**         B1NONY    OREQ 4355
     C**         B1NONY    OREQ 5211
     C**         B1NONY    OREQ 5299
     C**         B1NONY    OREQ 5531
     C**                   GOTO ECHK2
     C**                   ENDIF
      * OMIT DELETE FLG
     C           B1SKJY    IFNE *BLANK
     C                     GOTO ECHK2
     C                     ENDIF
      * OMIT FEDEX
     C                     MOVELB1NONY    X1NONY  4
     C           X1NONY    CHAINAB#PL90              99
     C           *IN99     IFEQ *ON
     C                     GOTO ECHK2
     C                     ENDIF
      *
     C** JEFF    YATRAN    IFEQ 'FEDEX'
     C**                   GOTO ECHK2
     C**                   ENDIF
      *
     C**         YAMXPL    IFLE 0
     C**                   GOTO ECHK2
     C**                   ENDIF
      * CHECK FORD GROUP
     C           X1NONY    CHAINEDIPP42              99
     C           *IN99     IFEQ *ON
     C                     GOTO ECHK2
     C                     ENDIF
      *
     C           E4SKJY    IFEQ 'D'
     C                     GOTO ECHK2
     C                     ENDIF
      *
     C           E4GRP     IFNE 'FRD'
     C           E4GRP     ANDNE'PIS'
     C           X1NONY    ANDNE'0603'
     C           X1NONY    ANDNE'0944'
     C           X1NONY    ANDNE'0950'
     C           X1NONY    ANDNE'3266'
     C           X1NONY    ANDNE'3334'
     C           X1NONY    ANDNE'4355'
     C           X1NONY    ANDNE'5149'
     C           X1NONY    ANDNE'5300'
     C           X1NONY    ANDNE'5530'
     C           X1NONY    ANDNE'5673'
     C           X1NONY    ANDNE'5916'
     C           X1NONY    ANDNE'5917'
     C           X1NONY    ANDNE'6243'
     C           X1NONY    ANDNE'6864'
     C           X1NONY    ANDNE'7449'
     C                     GOTO ECHK2
     C                     ENDIF
      *
     C                     MOVE 'Y'       OKFLG
     C                     Z-ADDYAMXPL    MAXBOX  60
     C                     MOVE E4FLG1    PPFLG   1        PART/PALLET
      *
     C           ECHK2     ENDSR
      **************************************************************************
      *  OUTPUT2
      **************************************************************************
     C           #OUT2     BEGSR
      *
     C                     CLEARMBEWP201
     C                     Z-ADDB1NOHZ    M0NOHZ
     C                     Z-ADDB1TOKU    M0TOKU
     C                     Z-ADDB1NONY    M0NONY
     C                     Z-ADDB1NOBI    M0NOBN
     C                     MOVELB1ODR1    M0ODRN
     C                     Z-ADDB1URHZ    M0URHZ
     C                     Z-ADDB1SRYO    M0SRYO
     C                     Z-ADDB1SYUY    M0SYOS
     C                     MOVELB1MHN1    M0MHN1
     C                     MOVELB1MHN2    M0MHN2
     C                     MOVELB1MHN3    M0MHN3
     C                     MOVELB1MHN4    M0MHN4
     C                     MOVELB1NUKE    M0NUKE
      *
     C           B1SYUY    IFNE 0
     C           B1SRYO    DIV  B1SYUY    M0BOX
     C                     ELSE
     C                     Z-ADD1         M0BOX
     C                     ENDIF
      *
     C           M0BOX     DIV  MAXBOX    M0PAL
     C                     MVR            FLD2    53
     C           FLD2      IFGT 0
     C                     ADD  1         M0PAL
     C                     ENDIF
      *
     C                     WRITEMBEWP201
      *
     C                     ENDSR
      **************************************************************************
      * INITIALIZE
      **************************************************************************
     C           #INIT     BEGSR
      *
     C           K@PPA1    KLIST
     C                     KFLD           K@NOYY  40
     C                     KFLD           K@NOMM  20
     C                     KFLD           K@NODD  20
      * RETRIEVE SYSTEM TIME
     C                     TIME           WSDT
     C                     MOVEL'01'      W@ID    2
      *
     C                     ENDSR
      **************************************************************************
** ERR
ENTER FROM_DATE!
FROM_DATE IS INVALID!
ENTER TO_DATE!
TO_DATE IS INVALID!
INVALID DATE CONBINATION! (FROM > TO)
THERE IS NO TARGET RECORD!
PRINTED SUCCESSFULLY...
PRESS F5 TO RUN OR F1 TO EXIT...


