     H            Y.                                                      ECM010
     F**MCER21**********************************************
     F* SALES ACCUMULATION FILE FROM  MONTHLY REPORT PULLED OUT CREATE FILE
     F*            M-OKUDA             1981.08.22          *
     F******************************************************
     FAB#PP01 IP  E                    DISK
     FMCEWP21 O   F     100            DISK
     I            DS
     I                                        1   80UGSIME
     I                                        5   60UMM
     I                                        9   90URERUN
     I                                       10  170B1NOHZ
     I                                       10  130B1NOYY
     I                                       14  150B1NOMM
     I                                       16  170B1NODD
     I                                       18  250MHIZK
     I                                       18  210MYY
     I                                       22  230MMM
     I                                       24  250MDD
     I            DS
     I                                        1  20 B1MHIN
     I                                        1   5 B1MHN1
     I                                        6  10 B1MHN2
     I                                       11  15 B1MHN3
     I                                       16  20 B1MHN4
     I            DS
     I                                        1   80WMINHZ
     I                                        1   40WMINYY
     I                                        5   60WMINMM
     I                                        7   80WMINDD
      *
     C           *ENTRY    PLIST
     C                     PARM           PGSIME  8
     C                     PARM           PRERUN  1
      *---- INZ -----*
     C           *IN05     IFEQ '0'
     C                     SETON                     05
     C                     MOVE PGSIME    UGSIME
     C                     MOVE PGSIME    MHIZK
     C                     Z-ADD31        MDD
     C                     MOVE PRERUN    URERUN
      *
     C           URERUN    COMP 1                        07ﾒ[]
     C           UMM       DIV  2         SYO     10
     C                     MVR            AMR     10
     C           AMR       COMP 1                      080909gﾇc,08hﾞcﾇc
     C   08                Z-ADD2         WKBN    10
     C   09                Z-ADD1         WKBN
      *
     C                     MOVE PGSIME    WMINHZ
     C                     Z-ADD01        WMINDD
     C           1         DO   6         I       30
     C           WMINMM    IFEQ 01
     C                     SUB  1         WMINYY
     C                     Z-ADD12        WMINMM
     C                     ELSE
     C                     SUB  1         WMINMM
     C                     END
     C                     ENDDO
      *
     C                     END
      *
      *---- MAIN-----*
      *
     C                     SETOF                     030410
     C           B1SKJY    COMP 'D'                      11
     C   11                GOTO END
      *
     C           B1NOHZ    COMP UGSIME               03
     C   03                GOTO END
      *
      *---- RERUN DATA ----*
     C           *IN07     IFEQ '1'
     C           B1GEMM    ANDNE0
     C*
     C           B1NOHZ    IFGE WMINHZ
     C           B1GEMM    ANDEQUMM
     C                     SETON                     04
     C                     ELSE
     C                     GOTO END
     C                     END
     C*
     C                     ELSE
      *
      *----- FARST DATA ---*
     C           B1GEMM    IFNE 0
     C                     GOTO END
     C                     END
     C*
     C                     END
      *
      *----- DATA SET   ---*
     C                     SETON                     04
      *
     C                     MOVE B1TOKU    @TOKU   4
     C                     MOVE B1NONY    @NONY   4
     C                     MOVE B1NKOJ    @NKOJ   1
     C                     MOVE B1NUKE    @NUKE   4
     C                     MOVE B1MHIN    @MHIN  20
     C                     MOVE B1NOHZ    @HIZK   8
     C                     Z-ADD0         @TANK  105
     C                     MOVE *BLANK    @CHEK   1
      *
     C                     CALL 'FBCR10'
     C                     PARM           @TOKU
     C                     PARM           @NONY
     C                     PARM           @NKOJ
     C                     PARM           @NUKE
     C                     PARM           @MHIN
     C                     PARM           @HIZK
     C                     PARM           @TANK
     C                     PARM           @CHEK
      *
     C                     Z-ADD@TANK     WTANK  115
      *
     C           END       TAG
      *
     OMCEWP21 D        04
     O                                    3 'GS '
     O                         B1TOKU     7
     O                         B1TKOJ     8
     O                         B1TUKE    12
     O                         B1NONY    16
     O                         B1NKOJ    17
     O                         B1NUKE    21
     O                         B1SHN1    26
     O                         B1SHN2    31
     O                         B1SHN3    33
     O                         B1MHN1    38
     O                         B1MHN2    43
     O                         B1MHN3    48
     O                         B1MHN4    53
     O                         WTANK     59P
     O                         B1TKBN    60
     O                         B1TTAI    61
     O                         B1NODD    63
     O                         B1SRYO    67P
     O                         B1RCOD    74
     O                         B1URMM    76
