     H            Y.
     F*** MCER44 *******************************************
     F* INQUIRY OF ENTIRE ABOLITION PART NO M/F <CHANGE DAY ORDER>
     F*           H.ITO               90.02.14             *
     F******************************************* MCER44 ***
     FMCEPW44 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        SFLRRNKSFILE SFLREC
     FMCEPL43 IF  E           K        DISK
     E                    ER      1   3 60               d[ｰxｮﾈｰﾆﾞ
     IINFDS       DS
     I                                      273 282 #SNAME
     I            DS
     I                                        1  18 SKEYDS
     I            DS
     I                                        1  18 EKEYDS
     I* SEARCH LOVAL KEY
     I            DS
     I                                        1   40LVKY01
     I                                        5   60LVKY02
     I                                        7   80LVKY03
     I                                        9  13 LVKY04
     I                                       14  18 LVKY05
     I                                       19  20 LVKY06
     I                                        1  20 LVKYDS
     I* SEARCH HIVAL KEY
     I            DS
     I                                        1   40HVKY01
     I                                        5   60HVKY02
     I                                        7   80HVKY03
     I                                        9  13 HVKY04
     I                                       14  18 HVKY05
     I                                       19  20 HVKY06
     I                                        1  20 HVKYDS
     I* mﾞ-jsﾞ-ﾇ gb- ﾝ-hﾎb-ﾓnﾞ
     I            DS
     I                                        1   40FLKY01
     I                                        5   60FLKY02
     I                                        7   80FLKY03
     I                                        9  13 FLKY04
     I                                       14  18 FLKY05
     I                                       19  20 FLKY06
     I                                        1  20 FKEYDS
     I* mﾞ-jsﾞ-ﾇ ﾆﾑcfb gb-ﾎbﾓnﾞ
     I            DS
     I                                        1   40M1KRYY
     I                                        5   60M1KRMM
     I                                        7   80M1KRDD
     I                                        9  13 M1HIN1
     I                                       14  18 M1HIN2
     I                                       19  20 M1HIN3
     I                                        1  20 DBKEY
     I            DS
     I                                        1   5 M1HKBN
     I                                        1   1 M1HKB1
     I                                        3   3 B1
     I                                        5   5 M1HKB2
     I            DS
     I                                        1  14 @HIN
     I                                        1   5 MMHIN1
     I                                        6   6 M1
     I                                        7  11 MMHIN2
     I                                       12  12 M2
     I                                       13  14 MMHIN3
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
     C*
     C* mﾞ-jsﾞ-ﾇ ﾆﾑcfb gb-ﾆﾞﾏ]b
     C*
     C           FULKEY    KLIST
     C                     KFLD           FLKY01
     C                     KFLD           FLKY02
     C                     KFLD           FLKY03
     C                     KFLD           FLKY04
     C                     KFLD           FLKY05
     C                     KFLD           FLKY06
     C*
     C* ﾅﾎﾞﾎabﾓ xbﾅbgﾞﾑc ﾉ ﾆmb
     C*
     C                     Z-ADD19        LINES   30
     C/SPACE 1
     C*****************************************************
     C* KEY fﾞx]
     C*****************************************************
     C           @001      TAG
     C                     EXFMT@SCR1
     C                     MOVEA'0'       *IN,88
     C*
     C* CMD-1 ﾆﾏcﾒﾑc kdlh
     C*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C           @KRYY     IFEQ 0
     C                     MOVELER,01     ERRMSG
     C                     GOTO @END
     C                     END
     C*
     C* HIVAL/LOVAL/FULLKEY  ﾈln ﾇﾓ
     C*
     C                     MOVE *HIVAL    HVKYDS
     C                     MOVE *LOVAL    LVKYDS
     C                     MOVE *BLANK    FLKY01
     C                     MOVE *BLANK    FLKY02
     C                     MOVE *BLANK    FLKY03
     C                     MOVE *BLANK    FLKY04
     C                     MOVE *BLANK    FLKY05
     C                     MOVE *BLANK    FLKY06
     C*
     C* HIVAL/LOVAL/FULLKEYY ﾈln
     C*
     C                     MOVE @KRYY     HVKY01
     C                     MOVE @KRYY     LVKY01
     C                     MOVE @KRYY     FLKY01
     C           @KRMM     IFNE 0
     C                     MOVE @KRMM     HVKY02
     C                     MOVE @KRMM     LVKY02
     C                     MOVE @KRMM     FLKY02
     C                     END
     C           @KRDD     IFNE 0
     C                     MOVE @KRDD     HVKY03
     C                     MOVE @KRDD     LVKY03
     C                     MOVE @KRDD     FLKY03
     C                     END
     C*
     C* mﾞ-jsﾞ-ﾇ ﾑvﾃv ﾅﾎﾞﾓ-k]
     C*
     C                     SETON                     9091
     C                     EXSR #SET1
     C                     SETOF                     9091
     C   99                GOTO @001
     C                     GOTO @002
     C           @END      TAG
     C                     SETON                     99
     C                     GOTO @001
     C*
     C* jﾞb 2 fﾞx] ﾉ ﾆﾏlﾒﾑh
     C*
     C           @002      TAG
     C                     WRITE@SCR2
     C                     DO   *HIVAL
     C   99                SETON                     98
     C  N99                SETON                     9798
     C                     EXFMTSFLCTL
     C                     SETOF                     9798
     C*
     C* CMD-1 ﾆﾏcﾒﾑc kdlh
     C*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C  N91N92             GOTO @001
     C*
     C* mﾞ-jsﾞ-ﾇ ﾑvﾃv ﾅﾎﾞﾓ-k]
     C*
     C                     EXSR #SET1
     C                     END
     C/SPACE 1
     C*****************************************************
     C*  mﾞ-j ･ xyﾒ- p ﾑvﾃv ﾅﾎﾞﾓ-k]
     C*****************************************************
     C           #SET1     BEGSR
     C                     Z-ADD*ZERO     LINECT
     C*
     C* ROLL-UP ﾉ ng gb- ﾉ ﾈln
     C*
     C           *IN91     IFEQ '1'
     C                     Z-ADD1         SFLRRN  40
     C* lgﾞﾉ ﾎabﾓ fﾞ aﾓf kdlhﾇﾓ
     C           *IN90     IFEQ '1'
     C           FULKEY    SETLLMCEPL431
     C                     ELSE
     C           LAST      IFEQ '*'
     C                     MOVELER,02     ERRMSG
     C                     GOTO @ERR
     C                     END
     C* PREVIOUS END KEY SET
     C                     MOVE EKEYDS    FKEYDS
     C           FULKEY    SETGTMCEPL431
     C                     END
     C* ROLL-DOWN gb- fﾞ eﾅﾛjng gb- ﾉ ﾈln
     C                     ELSE
     C           PAGCNT    SUB  1         PAGWRK  30
     C           PAGWRK    IFLE *ZERO
     C                     MOVE ER,02     ERRMSG
     C                     GOTO @ERR
     C                     END
     C* ﾆgﾞﾉ xbﾅbﾆﾏlﾒﾑhﾇﾓ ﾅbﾆﾑ ﾉ gb- e ﾈlnﾇﾓ
     C                     MOVE SKEYDS    FKEYDS
     C           FULKEY    SETLLMCEPL431
     C                     Z-ADDLINES     SFLRRN
     C                     END
     C* fﾞx] ﾉ ﾆﾑgﾈlmb
     C           *IN90     IFEQ '1'
     C                     Z-ADD*ZERO     PAGCNT
     C                     END
     C* ﾅﾎﾞﾎabﾓ hﾒa
     C                     SETON                     96
     C                     WRITESFLCTL
     C                     SETOF                     96
     C* ﾅﾎﾞﾎabﾓ p mﾞ-j ﾑvﾃv
     C                     DO   *HIVAL
     C           @00X      TAG
     C           *IN91     IFEQ '1'
     C                     READ MCEPL431                 20
     C   20                SETON                     94
     C                     ELSE
     C                     READPMCEPL431                 20
     C                     END
     C* ﾅbﾃﾞ ﾉ mﾞ-jumﾞ ﾑvgljng ﾉ ﾆﾑﾒ
     C           *IN20     CABEQ'1'       LPOUT
     C*
     C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    CABLE*DATE     @00X
     C                     END
     C* ﾆﾑcfb gb- ﾉ kdlh
     C           DBKEY     CABLTLVKYDS    LPOUT
     C           DBKEY     IFGT HVKYDS
     C                     SETON                     94
     C                     GOTO LPOUT
     C                     END
     C*                                                                ER*
     C                     ADD  1         LINECT  30
     C                     MOVE *BLANK    M1
     C                     MOVE *BLANK    M2
     C                     MOVE M1HIN1    MMHIN1
     C                     MOVE M1HIN2    MMHIN2
     C                     MOVE M1HIN3    MMHIN3
     C           M1HIN2    IFNE *BLANK
     C                     MOVE '-'       M1
     C                     END
     C           M1HIN3    IFNE *BLANK
     C                     MOVE '-'       M2
     C                     END
     C           M1HKB1    IFNE *BLANK
     C                     MOVE '-'       B1
     C                     ELSE
     C                     MOVE *BLANK    B1
     C                     END
     C                     MOVEA'0'       *IN,88
     C           M1TOKU    IFEQ 3174
     C           M1TOKU    OREQ 8482
     C           M1TOKU    OREQ 8481
     C                     MOVEA'1'       *IN,88
     C                     END
     C                     WRITESFLREC
     C* ﾅbﾆﾑﾉ xbﾅbgb- tf]
     C           SFLRRN    IFEQ 1
     C                     MOVE DBKEY     SKEYDS
     C           *IN91     CABEQ'0'       LPOUT
     C                     END
     C* ﾅbﾃﾞ ﾉ xbﾅbgﾞﾑc ﾉ tf]
     C           SFLRRN    IFEQ LINES
     C                     MOVE DBKEY     EKEYDS
     C           *IN91     CABEQ'1'       LPOUT
     C                     END
     C           *IN91     IFEQ '1'
     C                     ADD  1         SFLRRN
     C                     ELSE
     C                     SUB  1         SFLRRN
     C                     END
     C                     END
     C           LPOUT     TAG
     C           LINECT    IFEQ *ZEROS
     C                     MOVELER,03     ERRMSG
     C                     GOTO @ERR
     C                     END
     C*
     C* PAGE ﾃ]nﾜ-ﾓ
     C*
     C           *IN91     IFEQ '1'
     C                     ADD  1         PAGCNT  30
     C           LINECT    IFLT LINES
     C                     MOVE '*'       LAST    1
     C                     ELSE
     C                     MOVE *BLANK    LAST
     C                     END
     C                     ELSE
     C                     MOVE *BLANK    LAST
     C                     SUB  1         PAGCNT
     C                     END
     C                     GOTO ENDSTR
     C           @ERR      TAG
     C                     SETON                     99
     C           ENDSTR    ENDSR
**  ERR ARAY
E-01 THIS REFERENCE KEY IS NOT RIGHT.
E-02 THE APPLICALBE DATA IS NOT FOUND ANY MORE.
E-03 THE APPLICABLE DATA IS NOT FOUND.
