     H            Y.
     F** MCER11 *********************
     F* ..COMPONENTS DATA CREATE .. *
     F* I-HASADA 88.11.14 *
     F* T.TODA 2021.06.02  CHANGES(20199)  *
     F********************* MCER11 **
     FFCEPP01 IP  E                    DISK
     FMBEPL02 IF  E           K        DISK
     FAEBPL01 IF  E           K        DISK
     FMCEWP11 O   F     100            DISK
     E                    KMAS        4  1 0
     E                    TB1     1   1  4 0 TB2     1   mﾌbhﾎﾞ]
     I            DS
     I                                        1  12 KYBAN
     I                                        1   5 KYBAN1
     I                                        6  10 KYBAN2
     I                                       11  12 KYBAN3
     I            DS
     I                                        1   40KMAS
     I                                        1   10A2SYK1
     I                                        2   20A2SYK2
     I                                        3   30A2SYK3
     I                                        4   40A2SYK4
     I            DS
     I                                        1  12 KHBN1
     I                                        1   5 A21HB5
     I                                        6  10 A22HB5
     I                                       11  12 A23HB2
     I            DS
     I                                        1  12 KHBN2
     I                                        1   5 A24HB5
     I                                        6  10 A25HB5
     I                                       11  12 A26HB2
     I            DS
     I                                        1  12 KHBN3
     I                                        1   5 A27HB5
     I                                        6  10 A28HB5
     I                                       11  12 A29HB2
     I            DS
     I                                        1  12 KHBN4
     I                                        1   5 A210H5
     I                                        6  10 A211H5
     I                                       11  12 A212H2
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
      * KEY *
     C           KEY       KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *
     C           KEY2      KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C                     KFLD           KYBAN1
     C                     KFLD           KYBAN2
     C                     KFLD           KYBAN3
%0001 *
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     GOTO END
     C                     END
%0001 *
      *
     C                     Z-ADDA2GEKN    WGEKN   70
      *
     C*--------------------------*
     C*  ..納入月報ファイル..  *
     C*--------------------------*
     C                     Z-ADD0         WGOKE   70
     C           KEY       SETLLMBEPL021
      *
     C                     DO   *HIVAL
     C                     SETOF                     20
     C           KEY       READEMBEPL021                 20
     C           *IN20     IFEQ '0'
     C           F2SKJY    IFEQ *BLANK
      *
     C                     ADD  F2GOKE    WGOKE
      *
     C                     END
     C                     END
     C  N20                END
      *
     C                     EXSR SBRT
      *
     C           END       TAG
      *
     C*----------------------*
     C*  ..サブルーチン..  *
     C*----------------------*
     C           SBRT      BEGSR
      *****
     C                     Z-ADD0         KBMN    40
     C                     MOVE *BLANK    WTEKB   1
     C           KMAS,1    IFNE 0
     C                     MOVELKHBN1     KYBAN
     C                     SETOF                     31
     C           KEY2      SETLLAEBPL011
      *
     C                     DO   *HIVAL
     C           KEY2      READEAEBPL011                 31
     C           *IN31     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDAFKBMN    KBMN
     C                     END
     C                     END
     C  N31                END
      *
     C                     SETOF                     10
     C                     Z-ADD1         A       20
     C           KBMN      LOKUPTB1,A                    10
     C           *IN10     IFEQ '1'
     C                     MOVE TB2,A     WTEKB   1
     C                     ELSE
     C                     MOVE '9'       WTEKB
     C                     END
      *
     C           KMAS,1    MULT WGOKE     WKSU    80
     C                     MOVE KHBN1     WHBAN  12
     C                     EXCPTDATA
     C                     END
      *****
     C                     Z-ADD0         KBMN
     C                     MOVE *BLANK    WTEKB
     C           KMAS,2    IFNE 0
     C                     MOVELKHBN2     KYBAN
     C                     SETOF                     31
     C           KEY2      SETLLAEBPL011
      *
     C                     DO   *HIVAL
     C           KEY2      READEAEBPL011                 31
     C           *IN31     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDAFKBMN    KBMN
     C                     END
     C                     END
     C  N31                END
      *
     C                     SETOF                     10
     C                     Z-ADD1         A
     C           KBMN      LOKUPTB1,A                    10
     C           *IN10     IFEQ '1'
     C                     MOVE TB2,A     WTEKB   1
     C                     ELSE
     C                     MOVE '9'       WTEKB
     C                     END
      *
     C           KMAS,2    MULT WGOKE     WKSU
     C                     MOVE KHBN2     WHBAN
     C                     EXCPTDATA
     C                     END
      *****
     C                     Z-ADD0         KBMN
     C                     MOVE *BLANK    WTEKB
     C           KMAS,3    IFNE 0
     C                     MOVELKHBN3     KYBAN
     C                     SETOF                     31
     C           KEY2      SETLLAEBPL011
      *
     C                     DO   *HIVAL
     C           KEY2      READEAEBPL011                 31
     C           *IN31     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDAFKBMN    KBMN
     C                     END
     C                     END
     C  N31                END
      *
     C                     SETOF                     10
     C                     Z-ADD1         A
     C           KBMN      LOKUPTB1,A                    10
     C           *IN10     IFEQ '1'
     C                     MOVE TB2,A     WTEKB   1
     C                     ELSE
     C                     MOVE '9'       WTEKB
     C                     END
      *
     C           KMAS,3    MULT WGOKE     WKSU
     C                     MOVE KHBN3     WHBAN
     C                     EXCPTDATA
     C                     END
      *****
     C                     Z-ADD0         KBMN
     C                     MOVE *BLANK    WTEKB
     C           KMAS,4    IFNE 0
     C                     MOVELKHBN4     KYBAN
     C                     SETOF                     31
     C           KEY2      SETLLAEBPL011
      *
     C                     DO   *HIVAL
     C           KEY2      READEAEBPL011                 31
     C           *IN31     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDAFKBMN    KBMN
     C                     END
     C                     END
     C  N31                END
      *
     C                     SETOF                     10
     C                     Z-ADD1         A
     C           KBMN      LOKUPTB1,A                    10
     C           *IN10     IFEQ '1'
     C                     MOVE TB2,A     WTEKB   1
     C                     ELSE
     C                     MOVE '9'       WTEKB
     C                     END
      *
     C           KMAS,4    MULT WGOKE     WKSU
     C                     MOVE KHBN4     WHBAN
     C                     EXCPTDATA
     C                     END
      *
     C                     ENDSR
      *
     OMCEWP11 E                DATA
     O                         A2BHB1     5
     O                         A2BHB2    10
     O                         A2BHB3    12
     O                         WTEKB     13
     O                         KBMN      17
     O                         A2TUSZ    20
     O                         A2KUBI    25
     O                         WHBAN     37
     O                         WGEKN     41P
     O                         WKSU   B  46P
**  TB1.TB2
01111
