     H            Y.
     F** MCER71 ****************************
     F* PRINTING OF COMPONENT TOTALIZATION LIST *
     F* M-OKUDA               94.06.14     *
     F* T.TODA CHANGES(20199) 2021.06.14        *
     F**************************** MCER71 **
     FMCEWP71 IP  F      50            DISK
     FFGBPL01 IF  E           K        DISK
     FMCENP70 O   E                    DISK
     E                    MS          5  8 0
     E                    TO          5  9 0
     IMCEWP71 AA  01
     I                                        1   5 OHB1
     I                                        6  10 OHB2
     I                                       11  12 OHB3            04
     I                                       13  13 TKBN
     I                                       14  170THAI
     I                                       18  201SAIZ
     I                                       21  252KUBI
     I                                       26  30 KHB1
     I                                       31  35 KHB2
     I                                       36  37 KHB3            05
     I                                    P  38  420SRYO
     I                                    P  43  470KSU
     I                                       26  37 KHIN  L2
     I                                        1  12 SHIN  L1
     I            DS
     I                                        1   6 UHIZK
     I                                        1   4 UNEN
     I                                        5   6 UTUK
     I                                        9  120THAI
     C           *ENTRY    PLIST
     C                     PARM           PHIZK   6
      *
     C           *IN06     IFEQ '0'
     C                     SETON                     06
     C                     MOVE PHIZK     UHIZK
     C                     MOVE UNEN      NEN     40
     C                     MOVE UTUK      TUK     20
     C                     END
      *
     C                     SETOF                     81
     C  N80                SETON                     8081
     C   17                SETOF                     2117
      *
     C   L2N21
     COR 81N21
     CORN81N21             SETON                     21
      *
     C           TKBN      IFEQ '1'
     C                     Z-ADD1         I       10
     C                     ELSE
     C                     Z-ADD2         I
     C                     END
      *
     C           MS,I      ADD  KSU       MS,I
     C           TO,I      ADD  KSU       TO,I
     C           KENS      ADD  1         KENS    50
     C                     ADD  SRYO      WSRYO   80
     C                     ADD  KSU       WKSU    90
      *
     CL1                   EXSR SUBRTN
      *
     C           SUBRTN    BEGSR
     C                     MOVE OHB1      MCSHN1
     C                     MOVE OHB2      MCSHN2
     C                     MOVE OHB3      MCSHN3
     C                     MOVE TKBN      MCTKBN
     C                     Z-ADDTHAI      MCTHCD
     C                     Z-ADDSAIZ      MCSAIZ
     C                     Z-ADDKUBI      MCKBST
     C                     MOVE KHB1      MCKHN1
     C                     MOVE KHB2      MCKHN2
     C                     MOVE KHB3      MCKHN3
     C                     Z-ADDWSRYO     MCSRYO
     C                     Z-ADDWKSU      MCKOSU
     C                     WRITEMCENP701
     C                     Z-ADD0         WSRYO
     C                     Z-ADD0         WKSU
      *
     C                     MOVE *BLANK    TMEI   16
     C                     SETOF                     16
     C           THAI      CHAINFGBPL011             16
     C  N16                MOVELB2SMEI    TMEI   16
     C   16                MOVELTHAI      TMEI
      *
     C                     XFOOTTO        WGOK    90
     C                     SETON                     17
     C                     ENDSR
