     H            Y.
     I            DS
     I                                        1   80@@HZ
     I                                        1   60@@YM
     I                                        1   40@@YY
     I                                        5   60@@MM
     I                                        7   80@@DD
     C*
     C           *ENTRY    PLIST
     C                     PARM           P@T     6        N
     C                     PARM           P@A     6        N-1
     C                     PARM           P@B     6        N-2
     C                     PARM           P@C     6        N-3
     C                     PARM           P@D     6        N-4
     C                     PARM           P@E     6        N-5
     C*
     C                     CALL 'MCEC00'
     C                     PARM           P@YMD8  8
     C*
     C* * *                CALL 'DATR00'
     C* * *                PARM           P@YMD6  6
     C* * *                PARM           P@YMD8  8
     C* N
     C                     MOVE P@YMD8    @@HZ
     C                     MOVE @@YM      P@T
     C* N-1
     C           @@MM      SUB  1         @@MM
     C           @@MM      IFEQ 0
     C                     Z-ADD12        @@MM
     C                     SUB  1         @@YY
     C                     END
     C                     MOVE @@YM      P@A
     C* N-2
     C           @@MM      SUB  1         @@MM
     C           @@MM      IFEQ 0
     C                     Z-ADD12        @@MM
     C                     SUB  1         @@YY
     C                     END
     C                     MOVE @@YM      P@B
     C* N-3
     C           @@MM      SUB  1         @@MM
     C           @@MM      IFEQ 0
     C                     Z-ADD12        @@MM
     C                     SUB  1         @@YY
     C                     END
     C                     MOVE @@YM      P@C
     C* N-4
     C           @@MM      SUB  1         @@MM
     C           @@MM      IFEQ 0
     C                     Z-ADD12        @@MM
     C                     SUB  1         @@YY
     C                     END
     C                     MOVE @@YM      P@D
     C* N-5
     C           @@MM      SUB  1         @@MM
     C           @@MM      IFEQ 0
     C                     Z-ADD12        @@MM
     C                     SUB  1         @@YY
     C                     END
     C                     MOVE @@YM      P@E
     C*
     C                     SETON                     LR
     C                     RETRN
