     H           _Y.
     F** MCHR14 ********************************************
     F*    Gﾌﾞ]SﾞL ﾉCﾒﾑHﾎABﾓ F[  GFBﾉCﾒﾑH ﾉ ﾆﾑCFB          *
     F*            M-OKUDA          1985.05.10             *
     F******************************************************
     FMCHPW14 CF  E                    WORKSTN
     FNCHNP01 IF  E           K        DISK
     FMZAPL27 IF  E           K        DISK
     FMDAPL22 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     E                    A          15  1               JﾞBﾍﾑC
     E                    B          15 14               ﾍ]ﾌﾞ]
     E                    C          15  9 0             ﾈLMBﾇC
     E                    D          15  9 0             ﾆﾞLﾈG
     E                    ER      1   6 60               D[-XLﾈBﾆﾞ
   #@E*
   #@E                    ##@        15  1
     I            DS
     I                                        1   40JTIME
     I                                        1   20JHH
     I                                        3   40JMM
     I            DS
     I                                        1   40STIME
     I                                        1   20SHH
     I                                        3   40SMM
     I            DS
     I                                        1   3 KKBAN
     I                                        1   1 WKBAN1
     I                                        2   3 WKBAN2
     I            DS
     I                                        1   40JHIZ1
     I                                        1   20JYY1
     I                                        3   40JMM1
     I            DS
     I                                        1   40NHIZ1
     I                                        1   20NYY1
     I                                        3   40NMM1
     I            DS
     I                                        1   40NHIZ2
     I                                        1   20NYY2
     I                                        3   40NMM2
     I            DS
     I                                        1   20NHIZ3
     I                                        1   20NYY3
     I                                        3   40NMM3
     I            DS
     I                                        1   40NTIME1
     I                                        1   20NHH1
     I                                        3   40NSS1
     I            DS
     I                                        1   40NTIME2
     I                                        1   20NHH2
     I                                        3   40NSS2
     I            DS
     I                                        1   40NTIME3
     I                                        1   20NHH3
     I                                        3   40NSS3
     I            DS
     I                                        1  14 DHBAN
     I                                        1   5 DHIN1
     I                                        6   6 FF1
     I                                        7  11 DHIN2
     I                                       12  12 FF2
     I                                       13  14 DHIN3
     I            DS
     I                                        1   40WSTTI
     I                                        1   20WSTHH
     I                                        3   40WSTMM
     I            DS
     I                                        1   40KJKAN
     I                                        1   20KHH1
     I                                        3   40KMM1
     I            DS
     I                                        1   40YJKAN
     I                                        1   20YHH1
     I                                        3   40YMM1
     I            DS
     I                                        1  15 A
     I                                        1   1 A1
     I                                        2   2 A2
     I                                        3   3 A3
     I                                        4   4 A4
     I                                        5   5 A5
     I                                        6   6 A6
     I                                        7   7 A7
     I                                        8   8 A8
     I                                        9   9 A9
     I                                       10  10 A10
     I                                       11  11 A11
     I                                       12  12 A12
     I                                       13  13 A13
     I                                       14  14 A14
     I                                       15  15 A15
     I            DS
     I                                        1 210 B
     I                                        1  14 B1
     I                                       15  28 B2
     I                                       29  42 B3
     I                                       43  56 B4
     I                                       57  70 B5
     I                                       71  84 B6
     I                                       85  98 B7
     I                                       99 112 B8
     I                                      113 126 B9
     I                                      127 140 B10
     I                                      141 154 B11
     I                                      155 168 B12
     I                                      169 182 B13
     I                                      183 196 B14
     I                                      197 210 B15
     I            DS
     I                                        1 135 C
     I                                        1   90C1
     I                                       10  180C2
     I                                       19  270C3
     I                                       28  360C4
     I                                       37  450C5
     I                                       46  540C6
     I                                       55  630C7
     I                                       64  720C8
     I                                       73  810C9
     I                                       82  900C10
     I                                       91  990C11
     I                                      100 1080C12
     I                                      109 1170C13
     I                                      118 1260C14
     I                                      127 1350C15
     I            DS
     I                                        1 135 D
     I                                        1   90D1
     I                                       10  180D2
     I                                       19  270D3
     I                                       28  360D4
     I                                       37  450D5
     I                                       46  540D6
     I                                       55  630D7
     I                                       64  720D8
     I                                       73  810D9
     I                                       82  900D10
     I                                       91  990D11
     I                                      100 1080D12
     I                                      109 1170D13
     I                                      118 1260D14
     I                                      127 1350D15
      *
     I            DS
     I                                        1   80MXDEHZ
     I                                        1   40MXDEBY
     I                                        5   60MXDEBM
     I                                        7   80MXDEBD
      *
     I            DS
     I                                        1   80MXKAHZ
     I                                        1   40MXKADY
     I                                        5   60MXKADM
     I                                        7   80MXKADD
      *
     I            DS
     I                                        1   80MXSIHZ
     I                                        1   40MXSIKY
     I                                        5   60MXSIKM
     I                                        7   80MXSIKD
   #@I*
   #@I            DS
   #@I                                        1  15 #@YFC
   #@I                                        1  15 ##@
     C           *ENTRY    PLIST
     C                     PARM           PJYM1   4
     C                     PARM           PNYM1   4
     C                     PARM           PNYM2   4
     C                     PARM           PNYM3   4
     C                     PARM           PJKD1   2
     C                     MOVE PJYM1     JHIZ1
     C                     MOVE PNYM1     NHIZ1
     C                     MOVE PNYM2     NHIZ2
     C                     MOVE PNYM3     NHIZ3
     C                     MOVE PJKD1     WJKD1   20
     C                     TIME           WTIME   60
     C                     MOVE '-'       FF1
     C                     MOVE '-'       FF2
     C           STEP10    TAG
     C                     EXFMTMCHPW141
     C   KA                GOTO END
     C                     SETOF                     919203
     C                     SETOF                     99
      * 工場コード表を表示して選択されたコードを取り込む
     C           PBMON     IFEQ *BLANK
     C           PARM1     PLIST
     C                     PARM           PKOJY   4
     C                     MOVE *BLANK    PKOJY
     C                     CALL 'DGAR31'  PARM1
     C                     MOVE PKOJY     PBMON
     C                     SETON                     92
     C                     GOTO STEP10
     C                     END
     C           PBMON     IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,1      MSG    60
     C                     GOTO STEP10
     C                     END
      * 設備管理マスターを工場、機番順に表示して選択内容を取り込む
     C           PARM2     PLIST
     C                     PARM           PKOJY   4
     C                     PARM           PKBN1   3
     C                     PARM           PKBN2   1
     C                     PARM           PKOTE   3
     C                     PARM           PSYS1   4
     C                     PARM           PSYS2   4
     C                     PARM           PKEIS  10
     C                     PARM           PKGUN   3
     C                     PARM           PCOS1   2
     C                     PARM           PCOS2   2
     C                     PARM           PCOS3   2
     C                     MOVE PBMON     PKOJY
      * パラメーターの内必要な項目をフィールドに転送して使用する
     C           PKBAN     IFEQ *BLANK
     C                     CALL 'DGAR32'  PARM2
     C                     MOVE PKBN1     PKBAN
     C                     MOVE PKOTE     PKOTE
     C                     SETON                     93
     C                     GOTO STEP10
     C                     END
     C           PKBAN     IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,2      MSG    60
     C                     GOTO STEP10
     C                     END
     C           PKOTE     IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,6      MSG    60
     C                     GOTO STEP10
     C                     END
     C                     MOVE PBMON     KBMON   40
     C                     MOVE PKBAN     KKBAN   3
     C                     MOVE PKOTE     KKOTE   3
     C                     SETOF                     28
     C           KBMON     CHAINFGBPL011             28
   #@C  N28                EXSR S#@C04
     C           *IN28     IFEQ '0'
     C                     MOVELB2SMEI    BMEI   15
     C                     ELSE
     C                     MOVE *BLANK    BMEI
     C                     END
     C           MKEY      KLIST
     C                     KFLD           KBMON
     C                     KFLD           KKBAN
     C                     KFLD           KHIN1
     C                     KFLD           KHIN2
     C                     KFLD           KHIN3
     C                     MOVE *BLANK    KHIN1   5
     C                     MOVE *BLANK    KHIN2   5
     C                     MOVE *BLANK    KHIN3   2
     C                     Z-ADD0         TJSU
     C                     Z-ADD0         STSU
     C                     Z-ADD0         NSU1
     C                     Z-ADD0         NSU2
     C                     Z-ADD0         NSU3
     C                     Z-ADD0         WHINSU
     C           MKEY      SETLLNCHNP01
     C           STEP00    TAG
     C                     SETOF                     02
     C                     READ NCHNP011                 02
     C   02                GOTO STEP07
     C           P1BMON    CABNEKBMON     STEP07
     C           P1KBAN    CABNEKKBAN     STEP07
     C           P1KOTE    CABNEKKOTE     STEP00
     C           TJSU      ADD  P1SRYO    TJSU    90
     C           STSU      ADD  P1SETI    STSU    90
     C           NSU1      ADD  P1NAJ1    NSU1    90
     C           NSU2      ADD  P1NAJ2    NSU2    90
     C           NSU3      ADD  P1NAJ3    NSU3    90
     C           WHINSU    ADD  1         WHINSU  40
     C                     GOTO STEP00
     C           STEP07    TAG
     C******************************************************
     C*   GFB ﾉCﾒﾑHUﾇJ- ﾉ ﾑVﾃV                             *
     C******************************************************
     C           NKEY      KLIST
     C                     KFLD           KBMON
     C                     KFLD           KKBAN
     C                     KFLD           KKOTE
     C           NKEY2     KLIST
     C                     KFLD           KBMON
     C                     KFLD           JYY1
     C                     KFLD           JMM1
     C                     KFLD           KKBAN
     C                     KFLD           KKOTE
   #@C*
   #@C           NKE$2     KLIST
   #@C                     KFLD           KBMON
   #@C                     KFLD           JY#@01  40
   #@C                     KFLD           JMM1
   #@C                     KFLD           KKBAN
   #@C                     KFLD           KKOTE
     C                     SETOF                     01
   #@C*
   #@C                     EXSR S#@K0L
   #@C           NKE$2     CHAINMDAPP201             01
   #@C  N01                EXSR S#@C03
     C   01                Z-ADD0         M2SIRT
      *-------------------*
     C                     SETOF                     01
     C                     Z-ADD0         M@RPMH  60
     C                     MOVE '0'       GETFLG
     C           NKEY      SETLLMZAPL271
      *
     C                     EXSR $SB901
      *
     C           GETFLG    IFEQ '0'
     C                     GOTO STEP01
     C                     END
      *
     C                     MOVE MXKOTE    WKOTE   3
     C                     Z-ADDM@RPMH    WROOL   50
     C                     Z-ADDM2SIRT    WKADO   52
     C                     Z-ADD16        WSTHH   20
     C                     Z-ADD0         WSTMM   20
     C                     MOVELMXKKNO    WKEISK 10
     C                     MOVELMXKGCD    AKGUN
     C                     GOTO STEP08
      *
     C           STEP01    TAG
     C                     Z-ADD0         WROOL
     C                     Z-ADD0         WKADO
     C                     Z-ADD0         WSTHH
     C                     Z-ADD0         WSTMM
     C                     MOVE *BLANK    WKEISK
     C                     MOVE *BLANK    WKOTE
     C                     SETON                     99
     C                     MOVELER,5      MSG
     C                     GOTO STEP10
     C******************************************************
     C*   FNﾞCﾆﾞF] ﾉ IBﾅ]                                  *
     C******************************************************
     C           STEP08    TAG
     C           WJKD1     COMP 0                        13
     C   13                Z-ADD0         WSRYO
     C  N13      TJSU      DIV  WJKD1     WSRYO   90
     C           STSU      COMP 0                        13
     C   13                Z-ADD0         WSETI
     C  N13      STSU      DIV  20        WSETI   90
     C           NSU1      DIV  20        WNAIJ1  90
     C           NSU2      DIV  20        WNAIJ2  90
     C           NSU3      DIV  20        WNAIJ3  90
     C           WKADO     COMP 0                        13
     C   13                Z-ADD0         WR1
     C  N13      WKADO     DIV  100       WR1     54
     C           WROOL     MULT WR1       WHDKA   90
     C           WHDKA     COMP 0                        13
     C   13                Z-ADD0         KST1
     C   13                Z-ADD0         KHH1
     C   13                Z-ADD0         KMM1
     C  N13      WSRYO     DIV  WHDKA     KST1    42
     C  N13      KST1      MULT 60        KWT     40
     C  N13      KWT       DIV  60        KHH1    20
     C  N13                MVR            KMM1    20
     C           WHDKA     COMP 0                        13
     C   13                Z-ADD0         KST2
     C   13                Z-ADD0         KHH2
     C   13                Z-ADD0         KMM2
     C  N13      WSETI     DIV  WHDKA     KST2    42
     C  N13      KST2      MULT 60        KWT
     C  N13      KWT       DIV  60        KHH2    20
     C  N13                MVR            KMM2    20
     C           WHDKA     COMP 0                        13
     C   13                Z-ADD0         KST3
     C   13                Z-ADD0         KHH3
     C   13                Z-ADD0         KMM3
     C  N13      WNAIJ1    DIV  WHDKA     KST3    42
     C  N13      KST3      MULT 60        KWT
     C  N13      KWT       DIV  60        KHH3    20
     C  N13                MVR            KMM3    20
     C           WHDKA     COMP 0                        13
     C   13                Z-ADD0         KST4
     C   13                Z-ADD0         KHH4
     C   13                Z-ADD0         KMM4
     C  N13      WNAIJ2    DIV  WHDKA     KST4    42
     C  N13      KST4      MULT 60        KWT
     C  N13      KWT       DIV  60        KHH4    20
     C  N13                MVR            KMM4    20
     C           WHDKA     COMP 0                        13
     C   13                Z-ADD0         KST5
     C   13                Z-ADD0         KHH5
     C   13                Z-ADD0         KMM5
     C  N13      WNAIJ3    DIV  WHDKA     KST5    42
     C  N13      KST5      MULT 60        KWT
     C  N13      KWT       DIV  60        KHH5    20
     C  N13                MVR            KMM5    20
     C           WSTMM     COMP 0                        13
     C   13                Z-ADD0         WJKAN
     C  N13      WSTMM     DIV  0.6       WJKAN   42
     C           WJKAN     ADD  WSTHH     WJKAN   42
     C******************************************************
     C*   ﾈBﾅ] ﾑﾒﾑHﾆﾞF]  Eﾑﾍﾞ  ﾈBﾅ]ﾑﾒﾑHﾇCﾒﾑC ﾉ IBﾅ]        *
     C******************************************************
     C                     SETOF                     040814
     C           WJKAN     SUB  KST1      YRK     42   0804 08UBOﾇ
     C  N04      YRK       MULT 60        WTF     40
     C  N04      WTF       COMP 0                        14
     C  N04 14             Z-ADD0         YHH1
     C  N04N14   WTF       DIV  60        YHH1    20
     C  N04                MVR            YMM1    20
     C   04                Z-ADD0         YHH1
     C   04                Z-ADD0         YMM1
     C           YRK       MULT WHDKA     JYSU    90
     C                     SETOF                       090414
     C           WJKAN     SUB  KST2      YRK          0904 09UBOﾇ
     C  N04      YRK       MULT 60        WTF
     C  N04      WTF       COMP 0                        14
     C  N04 14             Z-ADD0         YHH2
     C  N04N14   WTF       DIV  60        YHH2    20
     C  N04                MVR            YMM2    20
     C   04                Z-ADD0         YHH2
     C   04                Z-ADD0         YMM2
     C           YRK       MULT WHDKA     SYSU    90
     C                     SETOF                     041014
     C           WJKAN     SUB  KST3      YRK          1004 10UBOﾇ
     C  N04      YRK       MULT 60        WTF
     C  N04      WTF       COMP 0                        14
     C  N04 14             Z-ADD0         YHH3
     C  N04N14   WTF       DIV  60        YHH3    20
     C  N04                MVR            YMM3    20
     C   04                Z-ADD0         YHH3
     C   04                Z-ADD0         YMM3
     C           YRK       MULT WHDKA     NYSU1   90
     C                     SETOF                     041114
     C           WJKAN     SUB  KST4      YRK          1104 11UBOﾇ
     C  N04      YRK       MULT 60        WTF
     C  N04      WTF       COMP 0                        14
     C  N04 14             Z-ADD0         YHH4
     C  N04N14   WTF       DIV  60        YHH4    20
     C  N04                MVR            YMM4    20
     C   04                Z-ADD0         YHH4
     C   04                Z-ADD0         YMM4
     C           YRK       MULT WHDKA     NYSU2   90
     C                     SETOF                     041214
     C           WJKAN     SUB  KST5      YRK          1204 12UBOﾇ
     C  N04      YRK       MULT 60        WTF
     C  N04      WTF       COMP 0                        14
     C  N04 14             Z-ADD0         YHH5
     C  N04N14   WTF       DIV  60        YHH5    20
     C  N04                MVR            YMM5    20
     C   04                Z-ADD0         YHH5
     C   04                Z-ADD0         YMM5
     C           YRK       MULT WHDKA     NYSU3   90
     C           JYSU      COMP 0                      21
     C           SYSU      COMP 0                      22
     C           NYSU1     COMP 0                      23
     C           NYSU2     COMP 0                      24
     C           NYSU3     COMP 0                      25
     C                     MOVE *BLANK    A
     C                     MOVE *BLANK    B
     C                     Z-ADD0         C
     C                     Z-ADD0         D
     C           MKEY      SETLLNCHNP01
     C           STEP11    TAG
     C                     Z-ADD1         I       20
     C           1         DO   15        I
     C           LOPAA     TAG
     C                     SETOF                     02
     C                     READ NCHNP011                 02
     C   02                GOTO STEP12
     C           P1BMON    CABNEKBMON     STEP12
     C           P1KBAN    CABNEKKBAN     STEP12
     C           P1KOTE    CABNEKKOTE     LOPAA
     C                     MOVE P1HIN1    DHIN1
     C                     MOVE P1HIN2    DHIN2
     C                     MOVE P1HIN3    DHIN3
     C                     MOVE '-'       FF1
     C                     MOVE '-'       FF2
     C                     MOVE P1SKBN    A,I
     C                     MOVE DHBAN     B,I
     C           P1SETI    DIV  20        C,I       H
     C           P1SRYO    DIV  WJKD1     D,I       H
     C           I         IFEQ 1
     C                     MOVE B,1       DHBAN
     C                     MOVE DHIN1     KHIN1
     C                     MOVE DHIN2     KHIN2
     C                     MOVE DHIN3     KHIN3
     C                     END
     C                     END
     C           I         ADD  1         I
     C           STEP12    TAG
     C                     EXFMTMCHPW142
     C                     SETOF                     99
     C******************************************************
     C* M-NO               ROLL-UP  ﾉ ﾆMB                  *
     C******************************************************
     C           *IN17     IFEQ '1'
     C           B,15      IFNE *BLANK
     C                     MOVE *BLANK    A
     C                     MOVE *BLANK    B
     C                     Z-ADD0         C
     C                     Z-ADD0         D
     C                     GOTO STEP11
     C                     ELSE
     C                     SETON                     99
     C                     MOVELER,3      MSG
     C                     GOTO STEP12
     C                     END
     C                     END
     C******************************************************
     C* M-NO               ROLL-DUN ﾉ ﾆMB                  *
     C******************************************************
     C           *IN18     IFEQ '1'
     C           MKEY      SETLLNCHNP011
     C                     Z-ADD16        N       20
     C                     Z-ADD1         M       20
     C           1         DO   N         M
     C           LOPBB     TAG
     C                     SETOF                     26
     C                     READPNCHNP01                  26
     C  N26      P1BMON    COMP KBMON                2626
     C  N26      P1KBAN    COMP KKBAN                2626
     C  N26      P1KOTE    CABNEKKOTE     LOPBB
     C           M         IFGE 16
     C                     SETOF                     26
     C                     MOVE *BLANK    A
     C                     MOVE *BLANK    B
     C                     Z-ADD0         C
     C                     Z-ADD0         D
     C                     MOVE *BLANK    KHIN1
     C                     MOVE *BLANK    KHIN2
     C                     MOVE *BLANK    KHIN3
     C                     GOTO STEP11
     C                     ELSE
     C   26                GOTO STEP14
     C                     END
     C                     END
     C           *IN26     IFEQ '0'
     C           P1BMON    IFEQ KBMON
     C           P1KBAN    IFEQ KKBAN
     C           P1KOTE    IFEQ KKOTE
     C                     MOVE *BLANK    A
     C                     MOVE *BLANK    B
     C                     Z-ADD0         C
     C                     Z-ADD0         D
     C                     MOVE *BLANK    KHIN1
     C                     MOVE *BLANK    KHIN2
     C                     MOVE *BLANK    KHIN3
     C                     GOTO STEP11
     C                     END
     C                     END
     C                     END
     C                     END
     C           STEP14    TAG
     C           MKEY      SETLLNCHNP011
     C                     MOVE *BLANK    KHIN1
     C                     MOVE *BLANK    KHIN2
     C                     MOVE *BLANK    KHIN3
     C                     SETON                     99
     C                     MOVELER,4      MSG
     C                     GOTO STEP12
     C                     END
     C           *INKC     IFEQ '1'
     C                     Z-ADD0         TJSU
     C                     Z-ADD0         STSU
     C                     Z-ADD0         NSU1
     C                     Z-ADD0         NSU2
     C                     Z-ADD0         NSU3
     C                     Z-ADD0         WHINSU
     C                     Z-ADD0         KBMON
     C                     MOVE *BLANK    KKBAN
     C                     MOVE *BLANK    KKOTE
     C                     MOVE *BLANK    PBMON
     C                     MOVE *BLANK    PKBAN
     C                     MOVE *BLANK    PKOTE
     C                     MOVE *BLANK    KHIN1
     C                     MOVE *BLANK    KHIN2
     C                     MOVE *BLANK    KHIN3
     C                     GOTO STEP10
     C                     END
     C           B,15      IFNE *BLANK
     C                     MOVE *BLANK    A
     C                     MOVE *BLANK    B
     C                     Z-ADD0         C
     C                     Z-ADD0         D
     C                     GOTO STEP11
     C                     ELSE
     C                     SETON                     99
     C                     MOVELER,3      MSG
     C                     GOTO STEP12
     C                     END
     C           END       TAG
     C                     SETON                     LR
      *--------------------------------------------------------------*
      *   設備管理マスター検索                                     *
      *--------------------------------------------------------------*
     CSR         $SB901    BEGSR
     C                     DO   *HIVAL
     C           NKEY      READEMZAPL271                 01
     C   01                LEAVE
     C                     MOVE '0'       GETFLG  1
      *
     C           *IN01     IFEQ '0'
     C           MXSAKJ    ANDEQ'D'
     C           MXDEHZ    ANDLE*DATE
     C                     ITER
     C                     END
      *
     C           MXJTKB    IFEQ '1'
     C           MXOKKB    ANDEQ'A'
     C           *DATE     ANDGEMXKAHZ
     C           *DATE     ANDLEMXSIHZ
     C                     MOVE '1'       GETFLG
     C                     LEAVE
     C                     END
      *
     C                     ENDDO
     C           GETFLG    IFEQ '1'
     C                     Z-ADDMXKAIT    M@RPMH
     C                     END
     CSR         $S901E    ENDSR
   #@C*==============================================================*
   #@C*          S#@K0L   日付設定処理
   #@C*==============================================================*
   #@C           S#@K0L    BEGSR
   #@C*<<
   #@C                     MOVE JYY1      #@YFC
     C           JMM1      IFNE *ZERO
   #@C                     EXSR SB#@Y1
   #@C                     MOVE #@YTC     JY#@01  40
     C           JMM1      IFEQ 99
     C                     Z-ADD9999      JY#@01
     C                     ENDIF
     C                     ELSE
     C                     Z-ADD*ZERO     JY#@01
     C                     ENDIF
   #@C*
   #@C                     ENDSR
   #@C*==============================================================*
   #@C*          S#@C02   日付設定処理
   #@C*==============================================================*
   #@C           S#@C02    BEGSR
   #@C*
   #@C                     MOVE M@HIZ8    M@HIZU  60
   #@C                     MOVE M@HIZ8    M@HIZ8  80
   #@C                     MOVE M@KOY4    M@KOYY  20
   #@C                     MOVE M@KOY4    M@KOY4  40
   #@C                     MOVE M@SKY4    M@SKYY  20
   #@C                     MOVE M@SKY4    M@SKY4  40
   #@C                     MOVE M@STY4    M@STYY  20
   #@C                     MOVE M@STY4    M@STY4  40
   #@C*
   #@C                     ENDSR
   #@C*==============================================================*
   #@C*          S#@C03   日付設定処理
   #@C*==============================================================*
   #@C           S#@C03    BEGSR
   #@C*
   #@C*                    MOVE M2DTY4    M2DTYY  20
   #@C*                    MOVE M2DTY4    M2DTY4  40
   #@C*                    MOVE M2KOY4    M2KOYY  20
   #@C*                    MOVE M2KOY4    M2KOY4  40
   #@C*                    MOVE M2SKY4    M2SKYY  20
   #@C*                    MOVE M2SKY4    M2SKY4  40
   #@C*
   #@C                     ENDSR
   #@C*==============================================================*
   #@C*          S#@C04   日付設定処理
   #@C*==============================================================*
   #@C           S#@C04    BEGSR
   #@C*
   #@C                     MOVE B2KOY4    B2KOYY  20
   #@C                     MOVE B2KOY4    B2KOY4  40
   #@C                     MOVE B2SKY4    B2SKYY  20
   #@C                     MOVE B2SKY4    B2SKY4  40
   #@C*
   #@C                     ENDSR
   #@C*==============================================================*
   #@C*          SB#@Y1   日付変換処理 YY -> YYYY
   #@C*==============================================================*
   #@C           SB#@Y1    BEGSR
   #@C*<<フィ－ルド長の定義>>
   #@C           #@YFC     IFNE *BLANK
   #@C                     MOVEL#@YFC     #@YTC  15
   #@C                     EXSR SB#@XX
   #@C                     MOVE #@YFC     #@YFN  150
   #@C*<<  0 > YY >= -99 >>
   #@C           #@YFN     IFGE -99
   #@C           #@YFN     ANDLT0
   #@C                     ADD  100       #@YFN
   #@C*<<  50 > YY >= 0 >>
   #@C           #@YFN     IFGE 0
   #@C           #@YFN     ANDLT50
   #@C                     ADD  2000      #@YFN
   #@C                     MOVE #@YFN     #@YTC
   #@C                     ELSE
   #@C*<<  100 > YY >= 50 >>
   #@C           #@YFN     IFGE 50
   #@C           #@YFN     ANDLT100
   #@C                     ADD  1900      #@YFN
   #@C                     MOVE #@YFN     #@YTC
   #@C                     END
   #@C                     END
   #@C                     ELSE
   #@C*<< 50 > YY >= 0 >>
   #@C           #@YFN     IFGE 0
   #@C           #@YFN     ANDLT50
   #@C                     ADD  2000      #@YFN
   #@C                     MOVE #@YFN     #@YTC
   #@C                     ELSE
   #@C*<< 100 > YY >= 50 >>
   #@C           #@YFN     IFGE 50
   #@C           #@YFN     ANDLT100
   #@C                     ADD  1900      #@YFN
   #@C                     MOVE #@YFN     #@YTC
   #@C                     END
   #@C                     END
   #@C                     END
   #@C                     ELSE
   #@C                     MOVEL*BLANK    #@YTC
   #@C                     END
   #@C*
   #@C                     MOVEL*BLANK    #@YFC
   #@C*
   #@C                     ENDSR
   #@C*==============================================================*
   #@C*          SB#@XX   日付変換処理 ' '->'0' (XLATE)
   #@C*==============================================================*
   #@C           SB#@XX    BEGSR
   #@C*
   #@C           ##@,1     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,1
   #@C                     END
   #@C*
   #@C           ##@,2     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,2
   #@C                     END
   #@C*
   #@C           ##@,3     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,3
   #@C                     END
   #@C*
   #@C           ##@,4     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,4
   #@C                     END
   #@C*
   #@C           ##@,5     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,5
   #@C                     END
   #@C*
   #@C           ##@,6     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,6
   #@C                     END
   #@C*
   #@C           ##@,7     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,7
   #@C                     END
   #@C*
   #@C           ##@,8     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,8
   #@C                     END
   #@C*
   #@C           ##@,9     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,9
   #@C                     END
   #@C*
   #@C           ##@,10    IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,10
   #@C                     END
   #@C*
   #@C           ##@,11    IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,11
   #@C                     END
   #@C*
   #@C           ##@,12    IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,12
   #@C                     END
   #@C*
   #@C           ##@,13    IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,13
   #@C                     END
   #@C*
   #@C           ##@,14    IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,14
   #@C                     END
   #@C*
   #@C           ##@,15    IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,15
   #@C                     END
   #@C*
   #@C                     ENDSR
**
E-01工場が入力されていない
E-02機番が指定されていない
E-03これ以上データはない
E-04これ以上前のデータはない
E-05機械能力マスターが登録されていない
E-06工程が指定されていない
