     H            Y.
     F** MFAR09 **********************************
     F*       EQUIPMENT CONTROL LEDGER           *
     F*  PROGRAM ID.    :  MFAR09.      <RPG>    *
     F*  CREATE DATE.   :  OCT.30,'89.           *
     F*  AUTHOR.        :  E.KAWASHIMA <G.B.C>   *
     F********************************** MFAR09 **
     FMFAWP09 IP  F     100            DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     IMFAWP09 NS  01
     I                                        1   3 BSYO
     I                                        4   7 SYS1
     I                                        8  11 SYS2
     I                                       12  13 COS1
     I                                       14  15 COS2
     I                                       16  17 COS3
     I                                       18  18 BUKA
     I                                       19  19 KAKA
     I                                       20  230KOJO  L1
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C******************************************************
     C*  START PROGRAM  <MFAR09>                           *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           PKJ     4
     C                     PARM           PKBN    1
     C                     PARM           PLST    1
     C*
B001 C           *IN90     IFEQ '0'
     C                     MOVEA'1'       *IN,90
     C                     Z-ADD0         ANS     40
     C                     TIME           TIME    60
E001 C                     END
     C******************************************************
     C*  LET'S  PRINT-OUT                                  *
     C******************************************************
     C           *INL1     IFEQ '1'
     C                     MOVE *BLANK    KJNM   16
     C           KOJO      CHAINFGBPL011             10
     C           *IN,10    IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,10
     C                     END
     C*
     C  N10                MOVELB2SMEI    KJNM
     C*
     C                     MOVE *BLANK    SNM     8
B002 C           PKBN      IFEQ '1'
     C                     MOVEL'LUMP-SUM'SNM
X002 C                     ELSE
B003 C           PKBN      IFEQ '2'
     C                     MOVEL'ALLOCATE'SNM
E003 C                     END
E002 C                     END
E001 C                     END
     C*
     C                     MOVE *BLANK    AA01    1
     C                     MOVE *BLANK    AA03    1
     C                     MOVE *BLANK    AA04    1
B001 C           SYS2      IFNE *BLANK
     C                     MOVEL'-'       AA01
E001 C                     END
     C*
     C           COS2      IFNE *BLANK
     C                     MOVEL'-'       AA03
     C                     END
     C*
     C           COS3      IFNE *BLANK
     C                     MOVEL'-'       AA04
     C                     END
     C*
     C                     ADD  1         ANS
     C           @END      TAG
     C*
     OQPRINT  H   02   L1
     O       OR        OFNL1
     O                         #PGM       8
     O                                   16 '(MFAC04)'
     O                                   68 'PAGE'
     O                         PAGE  Z   72
     O                                  105 'NO.3'
     O        H   03   L1
     O       OR        OFNL1
     O                                   11 'FACTORY'
     O                         KOJO      18
     O                         KJNM      35
     O                                   61 'EQUIPMENT CONTROL LEDGER'
     O        H   04   L1
     O       OR        OFNL1
     O                                   72 ' DATE '
     O                         UDATE Y   80
     O        H   05   L1
     O       OR        OFNL1
     O                                   23 'EQUIPMENT DIVISION'
     O                         PKBN      25
     O                         SNM       35
     O                                   55 '(EQUIPMENT CONTROL'
     O                                   66 'MASTERING)'
     O                                   72 ' TIME '
     O                         TIME      80 '  :  :  '
     O        H   0709 L1
     O       OR        OFNL1
     O                                   22 'CONTROL POST NAME'
     O                                   36 'PROPERTY NO.'
     O                                   49 'COST CENTER'
     O                                   58 'SECTION'
     O                                   74 'NOTE COLUMN'
     O        D  1     01
     O                         BSYO   B  10
     O*                        BSNM   B  21
     O                         SYS1   B  29
     O                         AA01   B  30
     O                         SYS2   B  34
     O                         COS1   B  41
     O                         AA03   B  42
     O                         COS2   B  44
     O                         AA04   B  45
     O                         COS3   B  47
     O                         BUKA   B  53
     O                         KAKA   B  57
     O                                   61 '('
     O                                   83 ')'
     O        T  2     L1
     O                                   59 'TOTAL OF FACTORY'
     O                                   69 'EQUIPMENT'
     O                         ANS   2B  75
     O                                   82 'MATTER'
