     H            Y.
     F** MFAR04 *****************************************
     F* MAKING OF EQUIPMENT CONTROL MASTERING LEDGER  1 *
     F*  PROGRAM ID.    :  MFAR04.      <RPG>           *
     F*  CREATE DATE.   :  JNA.11,'91.                  *
     F*  AUTHOR.        :  M.                           *
     F********************************** MFAR04 *********
     FMFAPP21 IP  E                    DISK
     FMFAWP04 O   F     128            DISK
     IMFAPP211    01
     I            DS
     I                                        1   80M@SKHZ
     I                                        1   40M@SKYY
     I                                        5   60M@SKMM
     I                                        7   80M@SKDD
     C******************************************************
     C*  START PROGRAM  <MFAR04>                           *
     C******************************************************
     C  N01                GOTO @END
     C*
     C           *ENTRY    PLIST
     C                     PARM           PKJ     4
     C                     PARM           PKBN    1
     C                     PARM           PLST    1
     C                     MOVELPKJ       KOJO    40
     C*
     C           M@SKJY    IFEQ 'D'
     C           M@SKHZ    ANDLE*DATE
     C                     GOTO @END
     C                     END
     C*
     C           KOJO      IFNE 9999
     C           KOJO      CABNEM@KOJY    @END
     C                     END
     C*
     C           PKBN      IFNE '3'
     C           PKBN      CABNEM@SKBN    @END
     C                     END
     C*
     C                     SETON                     U1
     C                     EXCPTDT
     C           @END      TAG
     C*
     OMFAWP04 E                DT
     O                         M@KOJY     4
     O                         M@SKBN     5
     O                         M@BUKA     6
     O                         M@KAKA     7
     O                         M@KBN1    10
     O                         M@KBN2    11
     O                         M@HIZU    19
     O                         M@OKB1    22
     O                         M@OKB2    23
     O                         M@KGUN    26
     O                         M@KOTE    29
     O                         M@SYS1    33
     O                         M@SYS2    37
     O                         M@COS1    39
     O                         M@COS2    41
     O                         M@COS3    43
     O                         M@KEIS    53
     O                         M@RPMH    59
     O                         M@YOKW    64
     O                         M@YOLL    69
     O                         M@YOCD    71
     O                         M@GASM    76
     O                         M@GACD    78
     O                         M@KEIS    88
     O                         M@MEKA    92
     O                         M@JTKB    93
     O                         M@QKJY    97
     O                         M@QBKA    98
     O                         M@QKAK    99
     O                         M@QCS1   101
     O                         M@QCS2   103
     O                         M@QCS3   105
     O                         M@QKGN   108
     O                         M@STYY   112
     O                         M@STMM   114
