     H            Y.
     F** MFBR40 ************************
     F*INPUT OF  WORK DAILY BULLETIN DATA
     F* A-IDOTA 1989.10.24 *
     F************************ MFBR40 **
     FMFBPW40 CF  E                    WORKSTN
     FMFBPL01 UF  E           K        DISK                      A
     FMFAPL22 IF  E           K        DISK
     FMFEPL40 IF  E           K        DISK
     FMFAPL26 IF  E           K        DISK
     E                    ER      1  17 60
      * 作業日付 *
     I            DS
     I                                        1   80HIZU
     I                                        1   40@HIY
     I                                        5   60@HIM
     I                                        7   80@HID
      * 削除日付 *
     I            DS
     I                                        1   80M@SKHZ
     I                                        1   40M@SKYY
     I                                        5   60M@SKMM
     I                                        7   80M@SKDD
     I            DS
     I                                        1   80MHSKHZ
     I                                        1   40MHSKYY
     I                                        5   60MHSKMM
     I                                        7   80MHSKDD
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
      * 時間 *
     I            DS
     I                                        1   60WTIME
     I                                        1   20HH
     I                                        3   40SS
      * ＫＥＹ *
     C           KEY1      KLIST
     C                     KFLD           KJY
     C                     KFLD           @KIBN
     C                     KFLD           @KIHS
     C           KEY2      KLIST
     C                     KFLD           KJY
     C                     KFLD           @HIY
     C                     KFLD           @HIM
     C                     KFLD           @HID
     C                     KFLD           @HYC
     C                     KFLD           @KIBN
     C                     KFLD           @KIHS
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     TIME           WTIME   60
      ************
      * 画面１ *
      ************
     C           LOP00     TAG
     C                     SETOF                     010203
     C                     SETOF                     99
     C                     MOVE *BLANK    @KJY
     C                     MOVE *BLANK    @HIZ
     C                     MOVE *BLANK    @HYC
      *
     C           LOP10     TAG
     C                     EXFMTMFBPW401
     C                     SETOF                     010203
     C                     SETOF                     99
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *INKL     IFEQ '1'
     C                     CALL 'MFEC20'
     C                     GOTO LOP10
     C                     END
      * 工場 *
     C                     MOVE *BLANK    @KME
     C                     MOVEL@KJY      #KJY    40
     C           #KJY      CHAINMFEPL401             01
     C           *IN,01    IFEQ '0'
     C           MHSKJY    ANDEQ'D'
     C           MHSKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,01
     C                     END
     C*
     C           *IN,01    IFEQ '1'
     C           #KJY      ORNE 0111
     C                     MOVE ER,1      MSG
     C                     SETON                     99
     C                     GOTO LOP10
     C                     END
     C                     MOVELMHKJNM    @KME
      * 作業日付 *
     C                     MOVE @HIZ      HIZU
     C           @HIY      IFLT 1988
     C                     MOVE ER,2      MSG
     C                     SETON                     0299
     C                     GOTO LOP10
     C                     END
     C           @HIM      IFGE 1
     C           @HIM      ANDLE12
     C                     ELSE
     C                     MOVE ER,2      MSG
     C                     SETON                     0299
     C                     GOTO LOP10
     C                     END
     C           @HID      IFGE 1
     C           @HID      ANDLE31
     C                     ELSE
     C                     MOVE ER,2      MSG
     C                     SETON                     0299
     C                     GOTO LOP10
     C                     END
     C           *DATE     IFLT HIZU
     C                     MOVE ER,2      MSG
     C                     SETON                     0299
     C                     GOTO LOP10
     C                     END
      * 昼夜区分 *
     C           @HYC      IFNE 'H'
     C           @HYC      ANDNE'Y'
     C                     MOVE ER,10     MSG
     C                     SETON                     0399
     C                     GOTO LOP10
     C                     END
      * 画面２の初期設定 *
     C                     EXSR #GCLR
     C                     MOVE @KJY      KJY     40
     C           @HYC      IFEQ 'H'
     C                     MOVE 'DAY '    @HYK
     C                     ELSE
     C                     MOVE 'NGT '    @HYK
     C                     END
     C           LOP11     TAG
     C                     MOVEA'00000000'*IN,01
     C                     MOVEA'00000000'*IN,09
     C                     SETOF                     99KCKE
     C                     SETON                     50
      ************
      * 画面２ *
      ************
     C           LOP20     TAG
     C                     EXFMTMFBPW402
     C                     MOVEA'00000000'*IN,01
     C                     MOVEA'00000000'*IN,09
     C                     MOVEA'0'       *IN,99
     C                     SETOF                     50
     C           *INKC     IFEQ '1'
     C                     GOTO LOP00
     C                     END
      * 機番 *
     C           @KIBN     IFEQ *BLANK
     C                     MOVE ER,3      MSG
     C                     SETON                     015099
     C                     GOTO LOP20
     C                     END
     C                     SETOF                     25
     C           KEY2      CHAINMFBPL011             25
     C           *IN25     IFEQ '0'
     C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVE ER,6      MSG
     C                     SETON                     015099
     C                     GOTO LOP20
     C                     END
     C                     END
      * 機械能力マスター *
     C                     SETOF                     2021
     C           KEY1      CHAINMFAPL221             20
     C           *IN20     IFEQ '0'
     C           M@SKJY    ANDEQ'D'
     C           M@SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
     C*
     C           *IN,20    IFEQ '0'
     C                     Z-ADDM@RPMH    KITNSU
     C                     MOVE M@KOTE    @KTCD
     C                     MOVE M@BUKA    @KACD
     C                     MOVE M@KAKA    @RICD
     C                     MOVE M@KGUN    @KIGN
     C                     END
     C*
     C           *IN,20    IFEQ '1'
     C           KEY1      CHAINMFAPL261             21
     C           *IN,21    IFEQ '0'
     C           M@SKJY    ANDEQ'D'
     C           M@SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,21
     C                     END
     C*
     C           *IN,21    IFEQ '0'
     C                     Z-ADDM@RPMH    KITNSU
     C                     MOVE M@KOTE    @KTCD
     C                     MOVE M@QBKA    @KACD
     C                     MOVE M@QKAK    @RICD
     C                     MOVE M@QKGN    @KIGN
     C                     END
     C                     END
     C           *IN21     IFEQ '1'
     C                     MOVE ER,4      MSG
     C                     SETON                     995001
     C                     GOTO LOP20
     C                     END
      * 停止時間 *
     C           @KNTI     IFGT 720
     C                     MOVE ER,7      MSG
     C                     SETON                     0299
     C                     GOTO LOP20
     C                     END
     C           @DMTI     IFGT 720
     C                     MOVE ER,7      MSG
     C                     SETON                     0399
     C                     GOTO LOP20
     C                     END
     C           @ZMTI     IFGT 720
     C                     MOVE ER,7      MSG
     C                     SETON                     0499
     C                     GOTO LOP20
     C                     END
     C           @KMTI     IFGT 720
     C                     MOVE ER,7      MSG
     C                     SETON                     0599
     C                     GOTO LOP20
     C                     END
     C           @DNTI     IFGT 720
     C                     MOVE ER,7      MSG
     C                     SETON                     0699
     C                     GOTO LOP20
     C                     END
     C           @TYTI     IFGT 720
     C                     MOVE ER,7      MSG
     C                     SETON                     0799
     C                     GOTO LOP20
     C                     END
     C           @KSTI     IFGT 720
     C                     MOVE ER,7      MSG
     C                     SETON                     0899
     C                     GOTO LOP20
     C                     END
      *
     C                     Z-ADD0         CKTI    40
     C                     ADD  @KNTI     CKTI
     C                     ADD  @DMTI     CKTI
     C                     ADD  @ZMTI     CKTI
     C                     ADD  @KMTI     CKTI
     C                     ADD  @DNTI     CKTI
     C                     ADD  @TYTI     CKTI
     C                     ADD  @KSTI     CKTI
     C                     ADD  @ZITI     CKTI
     C           CKTI      IFGT 720
     C                     MOVE ER,8      MSG
     C                     MOVEA'1111111' *IN,02
     C                     SETON                     0999
     C                     GOTO LOP20
     C                     END
      * 実際出来高本数 *
     C*          @DEKI     IFEQ 0
     C*                    MOVE ER,9      MSG
     C*                    SETON                     1199
     C*                    GOTO LOP20
     C*                    END
      * 稼動時間 *
     C           @KADU     IFEQ 0
     C                     MOVE ER,11     MSG
     C                     SETON                     1399
     C                     GOTO LOP20
     C                     END
     C           @KADU     IFGT 12
     C                     MOVE ER,12     MSG
     C                     SETON                     1399
     C                     GOTO LOP20
     C                     END
     C           @MUHN     IFGT 1
     C           @DEKI     SUB  @MUHN     #DEKI   70
     C           KITNSU    MULT @KADU     MAX     70
     C           MAX       IFLT #DEKI
     C                     MOVE ER,13     MSG
     C                     SETON                     1199
     C                     GOTO LOP20
     C                     END
     C                     ELSE
     C           KITNSU    MULT @KADU     MAX
     C           MAX       IFLT @DEKI
     C                     MOVE ER,13     MSG
     C                     SETON                     1199
     C                     GOTO LOP20
     C                     END
     C                     END
      *
     C           @KADU     MULT 60        KADU    41
     C           CKTI      IFGT KADU
     C                     MOVE ER,17     MSG
     C                     MOVEA'1111111' *IN,02
     C                     SETON                     0999
     C                     GOTO LOP20
     C                     END
      * 無人生産本数　＆　箱数 *
     C           @MUHK     IFEQ 0
     C           @MUHN     ANDNE0
     C                     MOVE ER,14     MSG
     C                     SETON                     1499
     C                     GOTO LOP20
     C                     END
     C           @MUHK     IFNE 0
     C           @MUHN     ANDEQ0
     C                     MOVE ER,15     MSG
     C                     SETON                     1599
     C                     GOTO LOP20
     C                     END
      *
     C           @MUHN     IFGT @DEKI
     C                     MOVE ER,16     MSG
     C                     SETON                     1599
     C                     GOTO LOP20
     C                     END
      *
     C  NKE                GOTO LOP20
      * 更新 *
     C                     EXSR #FCLR
     C                     EXSR #MOVE
     C           *IN25     IFEQ '1'
     C                     WRITEMFBPL011
     C                     ELSE
     C                     UPDATMFBPL011
     C                     END
     C                     EXSR #GCLR
     C                     GOTO LOP11
     C************
     C* ＳＵＢ *
     C************
     C           #GCLR     BEGSR
     C                     MOVE *BLANK    @KIBN
     C                     MOVE *BLANK    @KIHS
     C                     Z-ADD0         KITNSU
     C                     MOVE *BLANK    @KTCD
     C                     MOVE *BLANK    @KACD
     C                     MOVE *BLANK    @RICD
     C                     MOVE *BLANK    @KIGN
     C                     Z-ADD0         @KNTI
     C                     Z-ADD0         @DMTI
     C                     Z-ADD0         @ZMTI
     C                     Z-ADD0         @KMTI
     C                     Z-ADD0         @DNTI
     C                     Z-ADD0         @TYTI
     C                     Z-ADD0         @KSTI
     C                     Z-ADD0         @ZITI   30
     C                     Z-ADD0         @TSTI   30
     C                     Z-ADD0         @DEKI
     C                     Z-ADD0         @DNKI
     C                     Z-ADD0         @KADU
     C                     Z-ADD0         @MUHK
     C                     Z-ADD0         @MUHN
     C                     Z-ADD0         @BISU
     C                     ENDSR
      *
     C           #FCLR     BEGSR
     C                     MOVE *BLANK    M1SKJY
     C                     Z-ADD0         M1SKYY
     C                     Z-ADD0         M1SKMM
     C                     Z-ADD0         M1SKDD
     C                     Z-ADD0         M1KOYY
     C                     Z-ADD0         M1KOMM
     C                     Z-ADD0         M1KODD
     C                     Z-ADD0         M1KOHH
     C                     Z-ADD0         M1KOSS
     C                     MOVE *BLANK    M1KOME
     C                     Z-ADD0         M1KJCD
     C                     MOVE *BLANK    M1KACD
     C                     MOVE *BLANK    M1RICD
     C                     MOVE *BLANK    M1HNCD
     C                     MOVE *BLANK    M1KTCD
     C                     MOVE *BLANK    M1KIBN
     C                     MOVE *BLANK    M1KIHS
     C                     MOVE *BLANK    M1SAGY
     C                     Z-ADD0         M1SAYY
     C                     Z-ADD0         M1SAMM
     C                     Z-ADD0         M1SADD
     C                     MOVE *BLANK    M1HYKU
     C                     Z-ADD0         M1DNTI
     C                     Z-ADD0         M1TYTI
     C                     Z-ADD0         M1DMTI
     C                     Z-ADD0         M1ZITI
     C                     Z-ADD0         M1ZMTI
     C                     Z-ADD0         M1KNTI
     C                     Z-ADD0         M1KTTI
     C                     Z-ADD0         M1KSTI
     C                     Z-ADD0         M1TKTI
     C                     Z-ADD0         M1TSTI
     C                     Z-ADD0         M1DEKI
     C                     Z-ADD0         M1DNKI
     C                     Z-ADD0         M1KADU
     C                     Z-ADD0         M1MUHK
     C                     Z-ADD0         M1MUHN
     C                     MOVE *BLANK    M1KIGN
     C                     Z-ADD0         M1BISU
     C                     ENDSR
      *
     C           #MOVE     BEGSR
     C                     Z-ADD*YEAR     M1KOYY
     C                     Z-ADDUMONTH    M1KOMM
     C                     Z-ADDUDAY      M1KODD
     C                     Z-ADDHH        M1KOHH
     C                     Z-ADDSS        M1KOSS
     C                     MOVE US        M1KOME
     C                     Z-ADDKJY       M1KJCD
     C                     MOVE @KACD     M1KACD
     C                     MOVE @RICD     M1RICD
     C                     MOVE @KTCD     M1KTCD
     C                     MOVE @KIBN     M1KIBN
     C                     MOVE @KIHS     M1KIHS
     C                     Z-ADD@HIY      M1SAYY
     C                     Z-ADD@HIM      M1SAMM
     C                     Z-ADD@HID      M1SADD
     C                     MOVE @HYC      M1HYKU
     C                     Z-ADD@DNTI     M1DNTI
     C                     Z-ADD@TYTI     M1TYTI
     C                     Z-ADD@DMTI     M1DMTI
     C                     Z-ADD@ZITI     M1ZITI
     C                     Z-ADD@ZMTI     M1ZMTI
     C                     Z-ADD@KNTI     M1KNTI
     C                     Z-ADD@KMTI     M1KTTI
     C                     Z-ADD@KSTI     M1KSTI
     C                     Z-ADD@TSTI     M1TSTI
     C                     Z-ADD@DEKI     M1DEKI
     C*****      @DNKI     IFEQ 0
     C*****                Z-ADD1         M1DNKI
     C*****                ELSE
     C                     Z-ADD@DNKI     M1DNKI
     C*****                END
     C                     Z-ADD@KADU     M1KADU
     C                     Z-ADD@MUHK     M1MUHK
     C                     Z-ADD@MUHN     M1MUHN
     C                     MOVE @KIGN     M1KIGN
     C           @BISU     IFEQ 0
     C                     Z-ADD1         M1BISU
     C                     ELSE
     C                     Z-ADD@BISU     M1BISU
     C                     END
     C                     ENDSR
** MSG
E-01 FACTORY CODE IS WRONG
E-02 DATE IS NOT RIGHT.
E-03 INPUT MACHINE NO
E-04 FACILITY MANAGEMENT M/F DOES NOT INCLUDE IT
E-05 FACILITY MANAGEMENT M/F HAS CANCELLED ALREADY.
E-06 THIS DATA HAS INPUT ALREADY.
E-07 MORE THAN 720 MINUTES STOPPING TIME IS NOT RIGHT.
E-08 TOTAL STOP TIME IS MORE THAN 720 MIN. THAT ISN'T RIGHT
E-09 INPUT ACTUAL NUMBER.
E-10 NIGHT AND DAY INSTRUCTION IS <H, Y>.
E-11 INPUT OPERATION TIME.
E-12 OPERATION TIME IS MORE THAN 12H THAT IS NOT RIGHT.
E-13 ACTUAL NUMBER IS TOO BIG.
E-14 INPUT UNINHABITED PRODUCTION NUMBER OF BOXES
E-15 INPUT UNINHABITED PRODUCTION NUMBER.
E-16 UNINHABITED PRODUCTION NUMBER IS TOO BIG.
E-17 STOPPED TIME IS BIGGER THAN OPERATION TIME
