     H            Y.
     F** MFBR02 *************************************
     F*         UPDATE OF WORKING DAILY REPORT DATA *
     F* PROGRAM ID. : MFBR02. <RPG>                 *
     F* CREATE DATE. : OCT.24,'89.                  *
     F* AUTHOR.         : E.KAWASHIMA <G.B.C>       *
     F********************************** MFBR02 *****
     FMFBPW02 CF  E                    WORKSTN
     FMFAPL22 IF  E           K        DISK
     FMFAPL26 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FMFBPL08 UF  E           K        DISK                      A
     FMFBPL41 UF  E           K        DISK                      A
     FAJSPLCD IF  E           K        DISK
     E                    MSG     1  35 60               d[ｰxｮﾈｰﾆﾞ
     E                    TB1     1   3  1   TB2     6   ﾃcﾆ]
     E                    TB3     1   7  1 0 TB4     3 0
     E                    @GY1       16  3               gﾞｭcﾌﾞ]ﾃﾞc
     E                    @TA1       16  7               ﾅﾞbﾒｭcjhﾞNO.1
     E                    @TA2       16  7               ﾅﾞbﾒｭcjhﾞNO.2
     E                    @SY1       16  1               ﾅbﾒｭﾒhﾎﾞ]
     E                    @AP1       16  4               ﾜｮnNO.1
     E                    @AP2       16  3               ﾜｮnNO.2
     E                    @PA1       16  2               sﾟｰﾆﾞNO.1
     E                    @PA2       16  2               sﾟｰﾆﾞNO.2
     E                    @PA3       16  2               sﾟｰﾆﾞNO.3
     E                    @PA4       16  2               sﾟｰﾆﾞNO.4
     E                    GYO1      112  3               gﾞｭcﾌﾞ]ﾃﾞc
     E                    TAG1      112  7               ﾅﾞbﾒｭcjhﾞNO.1
     E                    TAG2      112  7               ﾅﾞbﾒｭcjhﾞNO.2
     E                    SYO1      112  1               ﾅbﾒｭﾒhﾎﾞ]
     E                    API1      112  4               ﾜｮnNO.1
     E                    API2      112  3               ﾜｮnNO.2
     E                    PAG1      112  2               sﾟｰﾆﾞNO.1
     E                    PAG2      112  2               sﾟｰﾆﾞNO.2
     E                    PAG3      112  2               sﾟｰﾆﾞNO.3
     E                    PAG4      112  2               sﾟｰﾆﾞNO.4
     I            DS
     I                                        1   60WTIME
     I                                        1   20M1KOHH
     I                                        1   20M2KOHH
     I                                        3   40M1KOSS
     I                                        3   40M2KOSS
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
     I            DS
     I                                        1   80M2SKHZ
     I                                        1   40M2SKYY
     I                                        5   60M2SKMM
     I                                        7   80M2SKDD
     I            DS
     I                                        1   80JASKHZ
     I                                        1   40JASKYY
     I                                        5   60JASKMM
     I                                        7   80JASKDD
     I            DS
     I                                        1   80M1KOHZ
     I                                        1   40M1KOYY
     I                                        5   60M1KOMM
     I                                        7   80M1KODD
     I            DS
     I                                        1   80M2KOHZ
     I                                        1   40M2KOYY
     I                                        5   60M2KOMM
     I                                        7   80M2KODD
     I            DS
     I                                        1   80YMD
     I                                        1   40YY
     I                                        5   60MM
     I                                        7   80DD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1  48 @GY1
     I                                        1   3 GYOU1
     I                                        4   6 GYOU2
     I                                        7   9 GYOU3
     I                                       10  12 GYOU4
     I                                       13  15 GYOU5
     I                                       16  18 GYOU6
     I                                       19  21 GYOU7
     I                                       22  24 GYOU8
     I                                       25  27 GYOU9
     I                                       28  30 GYOUA
     I                                       31  33 GYOUB
     I                                       34  36 GYOUC
     I                                       37  39 GYOUD
     I                                       40  42 GYOUE
     I                                       43  45 GYOUF
     I                                       46  48 GYOUG
     I            DS
     I                                        1 112 @TA1
     I                                        1   7 TAGN11
     I                                        8  14 TAGN21
     I                                       15  21 TAGN31
     I                                       22  28 TAGN41
     I                                       29  35 TAGN51
     I                                       36  42 TAGN61
     I                                       43  49 TAGN71
     I                                       50  56 TAGN81
     I                                       57  63 TAGN91
     I                                       64  70 TAGNA1
     I                                       71  77 TAGNB1
     I                                       78  84 TAGNC1
     I                                       85  91 TAGND1
     I                                       92  98 TAGNE1
     I                                       99 105 TAGNF1
     I                                      106 112 TAGNG1
     I            DS
     I                                        1 112 @TA2
     I                                        1   7 TAGN12
     I                                        8  14 TAGN22
     I                                       15  21 TAGN32
     I                                       22  28 TAGN42
     I                                       29  35 TAGN52
     I                                       36  42 TAGN62
     I                                       43  49 TAGN72
     I                                       50  56 TAGN82
     I                                       57  63 TAGN92
     I                                       64  70 TAGNA2
     I                                       71  77 TAGNB2
     I                                       78  84 TAGNC2
     I                                       85  91 TAGND2
     I                                       92  98 TAGNE2
     I                                       99 105 TAGNF2
     I                                      106 112 TAGNG2
     I            DS
     I                                        1  16 @SY1
     I                                        1   1 SYORI1
     I                                        2   2 SYORI2
     I                                        3   3 SYORI3
     I                                        4   4 SYORI4
     I                                        5   5 SYORI5
     I                                        6   6 SYORI6
     I                                        7   7 SYORI7
     I                                        8   8 SYORI8
     I                                        9   9 SYORI9
     I                                       10  10 SYORIA
     I                                       11  11 SYORIB
     I                                       12  12 SYORIC
     I                                       13  13 SYORID
     I                                       14  14 SYORIE
     I                                       15  15 SYORIF
     I                                       16  16 SYORIG
     I            DS
     I                                        1  64 @AP1
     I                                        1   4 APIC11
     I                                        5   8 APIC21
     I                                        9  12 APIC31
     I                                       13  16 APIC41
     I                                       17  20 APIC51
     I                                       21  24 APIC61
     I                                       25  28 APIC71
     I                                       29  32 APIC81
     I                                       33  36 APIC91
     I                                       37  40 APICA1
     I                                       41  44 APICB1
     I                                       45  48 APICC1
     I                                       49  52 APICD1
     I                                       53  56 APICE1
     I                                       57  60 APICF1
     I                                       61  64 APICG1
     I            DS
     I                                        1  48 @AP2
     I                                        1   3 APIC12
     I                                        4   6 APIC22
     I                                        7   9 APIC32
     I                                       10  12 APIC42
     I                                       13  15 APIC52
     I                                       16  18 APIC62
     I                                       19  21 APIC72
     I                                       22  24 APIC82
     I                                       25  27 APIC92
     I                                       28  30 APICA2
     I                                       31  33 APICB2
     I                                       34  36 APICC2
     I                                       37  39 APICD2
     I                                       40  42 APICE2
     I                                       43  45 APICF2
     I                                       46  48 APICG2
     I            DS
     I                                        1  32 @PA1
     I                                        1   2 PAGE11
     I                                        3   4 PAGE21
     I                                        5   6 PAGE31
     I                                        7   8 PAGE41
     I                                        9  10 PAGE51
     I                                       11  12 PAGE61
     I                                       13  14 PAGE71
     I                                       15  16 PAGE81
     I                                       17  18 PAGE91
     I                                       19  20 PAGEA1
     I                                       21  22 PAGEB1
     I                                       23  24 PAGEC1
     I                                       25  26 PAGED1
     I                                       27  28 PAGEE1
     I                                       29  30 PAGEF1
     I                                       31  32 PAGEG1
     I            DS
     I                                        1  32 @PA2
     I                                        1   2 PAGE12
     I                                        3   4 PAGE22
     I                                        5   6 PAGE32
     I                                        7   8 PAGE42
     I                                        9  10 PAGE52
     I                                       11  12 PAGE62
     I                                       13  14 PAGE72
     I                                       15  16 PAGE82
     I                                       17  18 PAGE92
     I                                       19  20 PAGEA2
     I                                       21  22 PAGEB2
     I                                       23  24 PAGEC2
     I                                       25  26 PAGED2
     I                                       27  28 PAGEE2
     I                                       29  30 PAGEF2
     I                                       31  32 PAGEG2
     I            DS
     I                                        1  32 @PA3
     I                                        1   2 PAGE13
     I                                        3   4 PAGE23
     I                                        5   6 PAGE33
     I                                        7   8 PAGE43
     I                                        9  10 PAGE53
     I                                       11  12 PAGE63
     I                                       13  14 PAGE73
     I                                       15  16 PAGE83
     I                                       17  18 PAGE93
     I                                       19  20 PAGEA3
     I                                       21  22 PAGEB3
     I                                       23  24 PAGEC3
     I                                       25  26 PAGED3
     I                                       27  28 PAGEE3
     I                                       29  30 PAGEF3
     I                                       31  32 PAGEG3
     I            DS
     I                                        1  32 @PA4
     I                                        1   2 PAGE14
     I                                        3   4 PAGE24
     I                                        5   6 PAGE34
     I                                        7   8 PAGE44
     I                                        9  10 PAGE54
     I                                       11  12 PAGE64
     I                                       13  14 PAGE74
     I                                       15  16 PAGE84
     I                                       17  18 PAGE94
     I                                       19  20 PAGEA4
     I                                       21  22 PAGEB4
     I                                       23  24 PAGEC4
     I                                       25  26 PAGED4
     I                                       27  28 PAGEE4
     I                                       29  30 PAGEF4
     I                                       31  32 PAGEG4
     C******************************************************
     C*  START  PROGRAM <MFBR02>                           *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           US     10        ﾏｰﾅﾞｰ xb
     C                     Z-ADD0         M1SKHZ
     C*
     C                     MOVE *BLANK    KTYPE
     C                     MOVE *BLANK    KOJO
     C                     Z-ADD0         YMD
     C                     MOVE *BLANK    CHUYA
     C                     MOVE *BLANK    KTCD
     C                     MOVE *BLANK    KIB1
     C                     MOVE *BLANK    KIB2
     C                     MOVE *BLANK    @TA1
     C                     MOVE *BLANK    @TA2
     C                     MOVE *BLANK    @SY1
     C                     MOVE *BLANK    @AP1
     C                     MOVE *BLANK    @AP2
     C                     MOVE *BLANK    @PA1
     C                     MOVE *BLANK    @PA2
     C                     MOVE *BLANK    @PA3
     C                     MOVE *BLANK    @PA4
     C******  gﾞｭcﾌﾞ]ﾃﾞc ******
     C                     Z-ADD1         Z       30
     C                     DO   112
     C                     MOVE Z         GYO1,Z
     C                     ADD  1         Z
     C                     ENDDO
     C******************************************************
     C*  EXFMT  <fﾞx] 1>                                   *
     C******************************************************
     C           STP1      TAG
     C                     EXFMTMFBPW021
     C                     MOVEA'000000'  *IN,01
     C                     MOVEA'0'       *IN,07
     C                     MOVEA'00'      *IN,47
     C                     MOVEA'000'     *IN,50
     C                     MOVEA'000'     *IN,90
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
     C                     Z-ADD1         CONT    10
     C*  CMD-1
B001 C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
E001 C                     END
     C*  CMD-12
B001 C           *INKL     IFEQ '1'
     C                     CALL 'MFEC20'
     C                     GOTO STP1
E001 C                     END
     C******************************************************
     C*  <fﾞx] 1 ﾉ kｩｮh>                                   *
     C******************************************************
     C                     MOVE *BLANK    KNAM
     C                     Z-ADD1         D       10
     C           KTYPE     LOKUPTB1,D                    22
     C   22                MOVELTB2,D     KNAM
     C           *IN,22    IFEQ '0'
     C                     MOVEA'1'       *IN,06
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,13    ERR
     C                     GOTO STP1
E001 C                     END
     C*
     C           KTYPE     COMP '0'                      33
     C           KTYPE     COMP '2'                      34
     C*
     C*  ﾃcﾆﾞｭc kｩｮh
     C*
     C                     MOVE *BLANK    KJNM
     C                     MOVELKOJO      #KOJO   40
     C           #KOJO     CHAINFGBPL011             01
B001 C           *IN,01    IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,01
     C                     END
     C*
     C           *IN,01    IFEQ '1'
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,1     ERR
     C                     GOTO STP1
E001 C                     END
     C*
     C                     MOVELB2SMEI    KJNM
     C*
     C*  ﾍlﾞi kｩｮh
     C*
B001 C           YMD       IFGT *DATE
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,2     ERR
     C                     GOTO STP1
E001 C                     END
     C*
B001 C           YY        IFLT 1987
     C           MM        ORGT 12
     C           MM        ORLT 01
     C           DD        ORGT 31
     C           DD        ORLT 01
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,3     ERR
     C                     GOTO STP1
E001 C                     END
     C*
B001 C           CHUYA     IFNE '1'
     C           CHUYA     ANDNE'2'
     C           CHUYA     ANDNE'3'
     C                     MOVEA'1'       *IN,03
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,4     ERR
     C                     GOTO STP1
E001 C                     END
     C*
     C*                    MOVE *BLANK    CHUNM
B001 C*          CHUYA     IFEQ '1'
     C*                    MOVEL'SHIFT1'  CHUNM
X001 C*                    ELSE
B002 C*          CHUYA     IFEQ '2'
     C*                    MOVEL'SHIFT2'  CHUNM
X001 C*                    ELSE
B002 C*          CHUYA     IFEQ '3'
     C*                    MOVEL'SHIFT3'  CHUNM
E002 C*                    END
E001 C*                    END
E001 C*                    END
     C*
B001 C           KIB1      IFEQ *BLANK
     C                     MOVEA'1'       *IN,04
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,5     ERR
     C                     GOTO STP1
E001 C                     END
     C*
B001 C           KTCD      IFEQ *BLANK
     C                     MOVEA'1'       *IN,07
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,15    ERR
     C                     GOTO STP1
E001 C                     END
     C*
     C                     MOVE *BLANK    CDNA
     C*
     C           KEY1      KLIST
     C                     KFLD           #KOJO
     C                     KFLD           YY
     C                     KFLD           MM
     C                     KFLD           DD
     C                     KFLD           CHUYA
     C                     KFLD           KIB1
     C                     KFLD           KIB2
     C                     KFLD           KTCD
     C*
     C           KEY2      KLIST
     C                     KFLD           #KOJO
     C                     KFLD           KIB1
     C                     KFLD           KIB2
     C*
     C           KEY3      KLIST
     C                     KFLD           M2TAG1
     C                     KFLD           M2TAG2
     C                     KFLD           M2SYOR
     C                     KFLD           M2API1
     C                     KFLD           M2API2
     C                     KFLD           M2PAG1
     C                     KFLD           M2PAG2
     C                     KFLD           M2PAG3
     C                     KFLD           M2PAG4
     C*  uﾇjｰ kｩｮh
     C*
     C*
     C*                    SETOF                     50
     C*          KEY2      CHAINMFAPL221             50
     C*  50      KEY2      CHAINMFAPL261             50
     C* N50                MOVELM@KOTE    KTCD
      *
     C           KEY1      CHAINMFBPL081             90
     C           KTYPE     IFEQ '0'
     C           KTYPE     OREQ '1'
B001 C           *IN90     IFEQ '1'
     C                     MOVEA'111111'  *IN,01
     C                     MOVEA'1'       *IN,07
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,6     ERR
     C                     GOTO STP1
E001 C                     END
B001 C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     MOVEA'111111'  *IN,01
     C                     MOVEA'1'       *IN,07
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,7     ERR
     C                     GOTO STP1
E001 C                     END
     C                     END
     C*
     C           KTYPE     IFEQ '2'
B001 C           *IN90     IFEQ '0'
B001 C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     SETON                         48
     C                     GOTO LOOP1
     C                     END
     C                     MOVEA'111111'  *IN,01
     C                     MOVEA'1'       *IN,07
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,24    ERR
     C                     GOTO STP1
E001 C                     END
     C                     END
     C           LOOP1     TAG
     C*
     C           KTYPE     IFEQ '2'
     C                     EXSR CLR2
     C*                    GOTO GMN2
     C                     END
     C*
     C******************************************************
     C*  EXFMT  <fﾞx] 2>                                   *
     C******************************************************
     C*
     C                     Z-ADDM1TSTI    TSTI
     C                     Z-ADDM1KADU    KADU
     C                     Z-ADD0         M1TSTI
     C                     Z-ADD0         KAITEN
     C           STP3      TAG
     C*  34                GOTO GMN2
     C           KEY2      CHAINMFAPL221             50
     C   50      KEY2      CHAINMFAPL261             50
     C  N50                Z-ADDM@RPMH    KAITEN
     C                     Z-ADD0         KEI     40
     C           *IN50     IFEQ '0'
     C           M@KOTE    IFNE KTCD
     C                     MOVEA'111111'  *IN,01
     C                     MOVEA'1'       *IN,07
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,14    ERR
     C                     GOTO STP1
     C                     END
     C                     END
     C  N50                MOVELM@KOTE    KTCD
E001 C           *IN50     IFEQ '1'
     C                     MOVEA'111111'  *IN,01
     C                     MOVEA'1'       *IN,07
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,14    ERR
     C                     GOTO STP1
E001 C                     END
     C*
     C           GMN2      TAG
     C*
     C           KTYPE     IFEQ '2'
     C           KEY2      CHAINMFAPL221             50
     C   50      KEY2      CHAINMFAPL261             50
     C  N50                Z-ADDM@RPMH    KAITEN
     C  N50                MOVELM@KOTE    KTCD
     C                     Z-ADD0         KEI     40
E001 C           *IN50     IFEQ '1'
     C                     MOVEA'111111'  *IN,01
     C                     MOVEA'1'       *IN,07
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,14    ERR
     C                     GOTO STP1
E001 C                     END
     C                     END
      *
B001 C           KTCD      IFEQ *BLANK
     C                     MOVEA'1'       *IN,07
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,15    ERR
     C                     GOTO STP1
E001 C                     END
     C********** ﾅgﾞｭcﾆｫﾉi]ﾅh ******
     C           KTYPE     IFEQ '0'
     C           KTYPE     OREQ '1'
     C                     MOVE *BLANK    CDNA
     C           M1WKCD    CHAINAJSPLCD1             51
     C           *IN51     IFEQ '0'
     C           JASKJY    ANDEQ'D'
     C           JASKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,51
     C                     END
     C  N51                MOVELJAWKNM    CDNA
     C                     END
     C*
     C           @@END     TAG
     C                     EXFMTMFBPW022
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'00000'   *IN,11
     C                     MOVEA'00000'   *IN,16
     C                     MOVEA'0'       *IN,21
     C                     MOVEA'00'      *IN,51
     C                     MOVEA'0'       *IN,99
     C*  CMD-3
B001 C           *INKC     IFEQ '1'
     C                     EXSR CLR1
     C                     EXSR CLR2
     C                     EXSR CLR4
     C                     GOTO STP1
E001 C                     END
     C*
     C******************************************************
     C*  <fﾞx] 2 ﾉ kｩｮh>                                   *
     C******************************************************
     C           KTYPE     CABEQ'0'       LOP
     C*
B001 C           M1WKCD    IFEQ *BLANK
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,01
     C                     MOVELMSG,25    ERR
     C                     GOTO GMN2
E001 C                     END
     C*
     C           M1WKCD    CHAINAJSPLCD1             52
     C           *IN52     IFEQ '0'
     C           JASKJY    ANDEQ'D'
     C           JASKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,52
     C                     END
     C  N52                MOVELJAWKNM    CDNA
     C*
B001 C           *IN52     IFEQ '1'
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,01
     C                     MOVELMSG,26    ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C           M1DNTI    IFGT 720
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,04
     C                     MOVELMSG,8     ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C           M1TYTI    IFGT 720
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,05
     C                     MOVELMSG,8     ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C           M1DMTI    IFGT 720
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,06
     C                     MOVELMSG,8     ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C           M1ZITI    IFGT 720
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,07
     C                     MOVELMSG,8     ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C           M1ZMTI    IFGT 720
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,08
     C                     MOVELMSG,8     ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C           M1KNTI    IFGT 720
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,09
     C                     MOVELMSG,8     ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C           M1KTTI    IFGT 720
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,10
     C                     MOVELMSG,8     ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C           M1KSTI    IFGT 720
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,11
     C                     MOVELMSG,8     ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C           TSTI      IFGT 720
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,12
     C                     MOVELMSG,8     ERR
     C                     GOTO GMN2
E001 C                     END
     C*
     C           M1DNTI    ADD  M1TYTI    KEI
     C                     ADD  M1DMTI    KEI
     C                     ADD  M1ZITI    KEI
     C                     ADD  M1ZMTI    KEI
     C                     ADD  M1KNTI    KEI
     C                     ADD  M1KTTI    KEI
     C                     ADD  M1KSTI    KEI
     C                     ADD  TSTI      KEI
     C*
B001 C           KEI       IFGT 720
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'11111'   *IN,04
     C                     MOVEA'1111'    *IN,06
     C                     MOVELMSG,8     ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C*          M1DEKI    IFEQ 0
     C*          M1DEKG    ANDEQ0
     C*                    MOVEA'1'       *IN,99
     C*                    MOVEA'1'       *IN,13
     C*                    MOVEA'1'       *IN,19
     C*                    MOVELMSG,9     ERR
     C*                    GOTO GMN2
E001 C*                    END
     C*
B001 C*          M1DEKI    IFNE 0
     C*          M1DEKG    ANDNE0
     C*                    MOVEA'1'       *IN,99
     C*                    MOVEA'1'       *IN,13
     C*                    MOVEA'1'       *IN,19
     C*                    MOVELMSG,16    ERR
     C*                    GOTO GMN2
E001 C*                    END
     C*
B001 C*          M1MUHN    IFEQ 0
     C*          M1MUHG    ANDEQ0
     C*                    MOVEA'1'       *IN,99
     C*                    MOVEA'1'       *IN,17
     C*                    MOVEA'1'       *IN,20
     C*                    MOVELMSG,17    ERR
     C*                    GOTO GMN2
E001 C*                    END
     C*
B001 C           M1MUHN    IFNE 0
     C           M1MUHG    ANDNE0
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,17
     C                     MOVEA'1'       *IN,20
     C                     MOVELMSG,18    ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C*          M1HURY    IFEQ 0
     C*          M1HURG    ANDEQ0
     C*                    MOVEA'1'       *IN,99
     C*                    MOVEA'1'       *IN,18
     C*                    MOVEA'1'       *IN,21
     C*                    MOVELMSG,19    ERR
     C*                    GOTO GMN2
E001 C*                    END
     C*
B001 C           M1HURY    IFNE 0
     C           M1HURG    ANDNE0
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,18
     C                     MOVEA'1'       *IN,21
     C                     MOVELMSG,20    ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C           KADU      IFEQ 0
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,15
     C                     MOVELMSG,11    ERR
     C                     GOTO GMN2
E001 C                     END
     C*
B001 C*          KADU      IFGT 12
     C*                    MOVEA'1'       *IN,99
     C*                    MOVEA'1'       *IN,15
     C*                    MOVELMSG,12    ERR
     C*                    GOTO GMN2
E001 C*                    END
      **
     C           M1DEKI    IFNE 0
     C           M1MUHN    ORNE 0
     C           M1HURY    ORNE 0
     C           M1DEKG    IFNE 0
     C           M1MUHG    ORNE 0
     C           M1HURG    ORNE 0
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,13
     C                     MOVEA'11111'   *IN,17
     C                     MOVELMSG,21    ERR
     C                     GOTO GMN2
     C                     END
     C                     END
      **
     C           M1DEKG    IFNE 0
     C           M1MUHG    ORNE 0
     C           M1HURG    ORNE 0
     C           M1DEKI    IFNE 0
     C           M1MUHN    ORNE 0
     C           M1HURY    ORNE 0
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,13
     C                     MOVEA'11111'   *IN,17
     C                     MOVELMSG,21    ERR
     C                     GOTO GMN2
     C                     END
     C                     END
      **
     C           M1DEKG    IFNE 0
     C           M1DEKG    SUB  M1MUHG    @DEKI   61
     C           @DEKI     IFLT 0
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,19
     C                     MOVELMSG,35    ERR
     C                     GOTO STP3
     C                     END
     C                     END
      **
     C           M1MUHN    IFGT 1
     C           M1DEKI    SUB  M1MUHN    #DEKI   70
     C           #DEKI     IFLT 0
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,13
     C                     MOVELMSG,10    ERR
     C                     GOTO STP3
     C                     END
     C*          KAITEN    MULT KADU      AAA     80
     C*          AAA       IFLT #DEKI
     C*                    MOVEA'1'       *IN,99
     C*                    MOVEA'1'       *IN,13
     C*                    MOVELMSG,10    ERR
     C*                    GOTO STP3
     C*                    END
     C*                    ELSE
      *
     C*          KAITEN    MULT KADU      AAA     80
     C*          AAA       IFLT M1DEKI
     C*                    MOVEA'1'       *IN,99
     C*                    MOVEA'1'       *IN,13
     C*                    MOVELMSG,10    ERR
     C*                    GOTO STP3
     C*                    END
     C                     END
      **
B001 C*          M1DNKI    IFEQ 0
     C*                    Z-ADD1         M1DNKI
E001 C*                    END
     C*
B001 C*          M1BISU    IFEQ 0
     C*                    Z-ADD1         M1BISU
E001 C*                    END
     C*
     C*
     C*  ENTER
     C           LOP       TAG
     C*  配列にデータを入れる
     C           KEY1      SETLLMFBPL41
     C                     Z-ADD0         A       30
     C                     DO   *HIVAL
     C           LOOP3     TAG
     C           KEY1      READEMFBPL41                  91
     C           *IN91     IFEQ '1'
     C                     GOTO LOOP
     C                     END
     C           M2SKJY    IFEQ 'D'
     C           M2SKHZ    ANDLE*DATE
     C                     GOTO LOOP3
     C                     END
     C                     ADD  1         A
     C                     MOVE M2TAG1    TAG1,A
     C                     MOVE M2TAG2    TAG2,A
     C                     MOVE M2SYOR    SYO1,A
     C                     MOVE M2API1    API1,A
     C                     MOVE M2API2    API2,A
     C                     MOVE M2PAG1    PAG1,A
     C                     MOVE M2PAG2    PAG2,A
     C                     MOVE M2PAG3    PAG3,A
     C                     MOVE M2PAG4    PAG4,A
     C                     ENDDO
     C           LOOP      TAG
     C*
     C           STP4      TAG
     C                     SETOF                       49
     C                     Z-ADD1         X
     C                     Z-ADD1         B       10
     C           CONT      LOKUPTB3,B                    49
     C   49                Z-ADDTB4,B     C       30
     C                     DO   16        X
     C                     MOVELGYO1,C    @GY1,X
     C                     MOVELTAG1,C    @TA1,X
     C                     MOVELTAG2,C    @TA2,X
     C                     MOVELSYO1,C    @SY1,X
     C                     MOVELAPI1,C    @AP1,X
     C                     MOVELAPI2,C    @AP2,X
     C                     MOVELPAG1,C    @PA1,X
     C                     MOVELPAG2,C    @PA2,X
     C                     MOVELPAG3,C    @PA3,X
     C                     MOVELPAG4,C    @PA4,X
     C                     ADD  1         C
     C                     ENDDO
     C*
     C           GMN3      TAG
     C                     EXFMTMFBPW023
     C                     MOVEA'000000'  *IN,54
     C                     MOVEA'000000'  *IN,60
     C                     MOVEA'0000'    *IN,66
     C                     MOVEA'000000'  *IN,71
     C                     MOVEA'000000'  *IN,77
     C                     MOVEA'0000'    *IN,83
     C                     MOVEA'0'       *IN,99
     C* udfﾞx]
B001 C           *INKC     IFEQ '1'
     C                     EXSR CLR3
     C                     EXSR CLR4
     C                     Z-ADD1         CONT
     C                     GOTO STP3
E001 C                     END
     C**s]ﾃc lbfﾉﾌﾞab mﾞｰjbﾃc**
     C           KTYPE     IFEQ '1'
     C           KTYPE     OREQ '2'
     C                     Z-ADD1         X
     C                     Z-ADD1         B       10
     C           CONT      LOKUPTB3,B                    53
     C   53                Z-ADDTB4,B     C       30
     C                     DO   16        X
     C                     MOVEL@GY1,X    GYO1,C
     C                     MOVEL@TA1,X    TAG1,C
     C                     MOVEL@TA2,X    TAG2,C
     C                     MOVEL@SY1,X    SYO1,C
     C                     MOVEL@AP1,X    API1,C
     C                     MOVEL@AP2,X    API2,C
     C                     MOVEL@PA1,X    PAG1,C
     C                     MOVEL@PA2,X    PAG2,C
     C                     MOVEL@PA3,X    PAG3,C
     C                     MOVEL@PA4,X    PAG4,C
     C                     ADD  1         C
     C                     ENDDO
     C                     END
     C* ﾜｰﾓaｮﾎﾟ
     C           *IN97     IFEQ '1'
     C           CONT      IFEQ 1
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,22    ERR
     C                     GOTO GMN3
     C                     END
     C                     EXSR CLR3
     C                     SUB  1         CONT
     C                     GOTO STP4
     C                     END
     C* ﾜｰﾓjﾞc]
     C           *IN96     IFEQ '1'
     C           CONT      IFEQ 7
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,23    ERR
     C                     GOTO GMN3
     C                     END
     C                     EXSR CLR3
     C                     ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C*****  d[ｰkｩｮh *****
     C*          TAG1,1    IFEQ *BLANK
     C*                    MOVEA'1'       *IN,71
     C*                    MOVEA'1'       *IN,99
     C*                    MOVEA'1'       *IN,54
     C*                    MOVELMSG,27    ERR
     C*                    Z-ADD1         CONT
     C*                    GOTO STP4
     C*                    END
     C*
     C                     Z-ADD1         X
     C                     DO   112       X
   A C           TAG2,X    IFNE *BLANK
     C           SYO1,X    ORNE *BLANK
     C           API1,X    ORNE *BLANK
     C           API2,X    ORNE *BLANK
     C           PAG1,X    ORNE *BLANK
     C           PAG2,X    ORNE *BLANK
     C           PAG3,X    ORNE *BLANK
     C           PAG4,X    ORNE *BLANK
    BC           TAG1,X    IFEQ *BLANK
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,54
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,27    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
    BC                     END
   A C                     END
     C*
     C           API1,X    IFNE *BLANK
     C           API2,X    IFEQ *BLANK
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,58
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,28    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C                     END
     C*
     C           API2,X    IFNE *BLANK
     C           API1,X    IFEQ *BLANK
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,57
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,28    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C                     END
     C*
     C           PAG1,X    IFNE *BLANK
     C           PAG2,X    ORNE *BLANK
     C           PAG3,X    ORNE *BLANK
     C           PAG4,X    ORNE *BLANK
     C           API1,X    IFEQ *BLANK
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,57
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,28    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C                     END
     C*
     C           API1,X    IFNE *BLANK
     C           PAG1,X    IFEQ *BLANK
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,59
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,29    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C                     END
     C*
     C           PAG3,X    IFNE *BLANK
     C           PAG2,X    IFEQ *BLANK
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,60
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,30    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C                     END
     C*
     C           PAG4,X    IFNE *BLANK
     C           PAG3,X    IFEQ *BLANK
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,61
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,30    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C                     END
     C                     ENDDO
     C*
     C*                    Z-ADD1         X
     C*                    Z-ADD1         L       30
     C*                    Z-ADD1         K       30
     C*                    DO   112       X
     C*          1         ADD  X         K
     C*          K         DO   112       L
     C*          TAG1,X    IFNE *BLANK
     C*          TAG1,X    IFEQ TAG1,L
     C*          X         DIV  16        S       30
     C*                    MVR            Y       20
     C*                    MOVEA'1'       *IN,99
     C*          Y         ADD  70        Y
     C*                    MOVEA'1'       *IN,Y
     C*                    MOVELMSG,31    ERR
     C*          S         ADD  1         CONT
     C*                    GOTO STP4
     C*                    END
     C*                    END
     C*                    ENDDO
     C*                    ENDDO
     C*
     C                     Z-ADD1         X
     C                     DO   112       X
     C           TAG1,X    IFNE *BLANK
     C           TAG1,X    IFEQ TAG2,X
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'11'      *IN,54
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,33    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C                     END
     C                     ENDDO
     C*
     C                     Z-ADD1         X
     C                     DO   112       X
     C           SYO1,X    IFNE *BLANK
     C           SYO1,X    IFNE '1'
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,56
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,34    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C                     END
     C                     ENDDO
     C*
     C                     Z-ADD1         X
     C                     DO   112       X
     C           SYO1,X    IFNE *BLANK
     C           TAG1,X    IFEQ *BLANK
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,54
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,27    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C                     END
     C                     ENDDO
     C*
     C                     Z-ADD1         X
     C                     DO   112       X
     C           PAG1,X    IFNE *BLANK
     C           PAG1,X    IFEQ PAG2,X
     C           PAG1,X    OREQ PAG3,X
     C           PAG1,X    OREQ PAG4,X
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,59
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,32    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C                     END
     C                     ENDDO
     C*
     C                     Z-ADD1         X
     C                     DO   112       X
     C           PAG2,X    IFNE *BLANK
     C           PAG2,X    IFEQ PAG3,X
     C           PAG2,X    OREQ PAG4,X
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,60
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,32    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C                     END
     C                     ENDDO
     C*
     C                     Z-ADD1         X
     C                     DO   112       X
     C           PAG3,X    IFNE *BLANK
     C           PAG3,X    IFEQ PAG4,X
     C           X         DIV  16        S       30
     C                     MVR            Y       20
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,61
     C           Y         ADD  70        Y
     C                     MOVEA'1'       *IN,Y
     C                     MOVELMSG,32    ERR
     C           S         ADD  1         CONT
     C                     GOTO STP4
     C                     END
     C                     END
     C                     ENDDO
     C*******   ﾃcﾆ]   ******
B001 C           *INKE     IFEQ '0'
     C                     GOTO GMN3
E001 C                     END
     C*
     C   33                MOVEL'D'       M1SKJY
     C   33                Z-ADD*DATE     M1SKHZ
     C  N33                MOVE *BLANK    M1SKJY
     C  N33                Z-ADD0         M1SKHZ
     C                     Z-ADD*DATE     M1KOHZ
     C                     Z-ADD*DATE     M2KOHZ
     C                     TIME           WTIME
     C                     MOVELUS        M1KOME
     C                     MOVELUS        M2KOME
     C                     MOVE *BLANK    M1HNCD
     C**         KADU      MULT 60        M1KADU
     C                     Z-ADDKADU      M1KADU
     C                     Z-ADDTSTI      M1TSTI
      ******** lbf s]ﾃc ﾉ ﾌﾞab mﾞｰjbﾃc *******
     C  N33                MOVE KOJO      M1KJCD
     C  N33                MOVE YY        M1SAYY
     C  N33                MOVE MM        M1SAMM
     C  N33                MOVE DD        M1SADD
     C  N33                MOVE CHUYA     M1HYKU
     C  N33                MOVE KIB1      M1KIBN
     C  N33                MOVE KIB2      M1KIHS
     C  N33                MOVE KTCD      M1KTCD
     C  N33                MOVE KOJO      M2KJCD
     C  N33                MOVE YY        M2SAYY
     C  N33                MOVE MM        M2SAMM
     C  N33                MOVE DD        M2SADD
     C  N33                MOVE CHUYA     M2HYKU
     C  N33                MOVE KIB1      M2KIBN
     C  N33                MOVE KIB2      M2KIHS
     C  N33                MOVE KTCD      M2KTCD
     C******** CANCEL ******
     C           KTYPE     IFEQ '0'
     C                     Z-ADD1         X       30
     C           KEY1      SETLLMFBPL41
     C           X         DO   *HIVAL
     C           LOOP4     TAG
     C                     MOVE *BLANK    M2SKJY
     C                     Z-ADD0         M2SKHZ
     C           KEY1      READEMFBPL411                 92
     C           M2SKJY    IFEQ 'D'
     C           M2SKHZ    ANDLE*DATE
     C                     GOTO LOOP4
     C                     END
     C           *IN92     IFEQ '1'
     C                     GOTO CAN
     C                     END
     C                     MOVEL'D'       M2SKJY
     C                     Z-ADD*DATE     M2SKHZ
     C                     MOVE TAG1,X    M2TAG1
     C                     MOVE TAG2,X    M2TAG2
     C                     MOVE SYO1,X    M2SYOR
     C                     MOVE API1,X    M2API1
     C                     MOVE API2,X    M2API2
     C                     MOVE PAG1,X    M2PAG1
     C                     MOVE PAG2,X    M2PAG2
     C                     MOVE PAG3,X    M2PAG3
     C                     MOVE PAG4,X    M2PAG4
     C                     UPDATMFBPL411
     C                     ADD  1         X
     C                     ENDDO
     C                     END
     C           CAN       TAG
     C********* CHANGE ********
     C           KTYPE     IFEQ '1'
     C                     Z-ADD1         X
     C           KEY1      SETLLMFBPL41
     C           X         DO   *HIVAL
     C           LOOP5     TAG
     C                     MOVE *BLANK    M2SKJY
     C                     Z-ADD0         M2SKHZ
     C           KEY1      READEMFBPL411                 92
     C           M2SKJY    IFEQ 'D'
     C           M2SKHZ    ANDLE*DATE
     C                     GOTO LOOP5
     C                     END
     C           *IN92     IFEQ '1'
     C                     GOTO CHG
     C                     END
     C                     DELETMFBPL411
     C*                    MOVEL*BLANK    M2SKJY
     C*                    Z-ADD0         M2SKHZ
     C*                    MOVE TAG1,X    M2TAG1
     C*                    MOVE TAG2,X    M2TAG2
     C*                    MOVE SYO1,X    M2SYOR
     C*                    MOVE API1,X    M2API1
     C*                    MOVE API2,X    M2API2
     C*                    MOVE PAG1,X    M2PAG1
     C*                    MOVE PAG2,X    M2PAG2
     C*                    MOVE PAG3,X    M2PAG3
     C*                    MOVE PAG4,X    M2PAG4
     C*                    UPDATMFBPL411
     C                     ADD  1         X
     C                     ENDDO
     C           CHG       TAG
     C           1         DO   112       X
     C                     MOVEL*BLANK    M2SKJY
     C                     Z-ADD0         M2SKHZ
     C                     MOVE TAG1,X    M2TAG1
     C                     MOVE TAG2,X    M2TAG2
     C                     MOVE SYO1,X    M2SYOR
     C                     MOVE API1,X    M2API1
     C                     MOVE API2,X    M2API2
     C                     MOVE PAG1,X    M2PAG1
     C                     MOVE PAG2,X    M2PAG2
     C                     MOVE PAG3,X    M2PAG3
     C                     MOVE PAG4,X    M2PAG4
     C           TAG1,X    IFNE *BLANK
     C                     WRITEMFBPL411
     C                     END
     C                     ENDDO
     C                     END
     C********* ADD ********
     C           KTYPE     IFEQ '2'
     C*
     C                     Z-ADD1         X
     C                     DO   112       X
     C                     MOVEL*BLANK    M2SKJY
     C                     Z-ADD0         M2SKHZ
     C                     MOVE TAG1,X    M2TAG1
     C                     MOVE TAG2,X    M2TAG2
     C                     MOVE SYO1,X    M2SYOR
     C                     MOVE API1,X    M2API1
     C                     MOVE API2,X    M2API2
     C                     MOVE PAG1,X    M2PAG1
     C                     MOVE PAG2,X    M2PAG2
     C                     MOVE PAG3,X    M2PAG3
     C                     MOVE PAG4,X    M2PAG4
     C           TAG1,X    IFNE *BLANK
     C                     WRITEMFBPL411
     C                     END
     C                     ENDDO
     C                     END
     C**********************
     C           KTYPE     IFEQ '2'
     C           *IN48     IFEQ '0'
     C                     WRITEMFBPL081
     C                     ELSE
     C                     UPDATMFBPL081
     C                     END
     C                     ELSE
     C                     UPDATMFBPL081
     C                     END
     C*
     C                     EXSR CLR1
     C                     EXSR CLR2
     C                     EXSR CLR3
     C                     EXSR CLR4
     C                     GOTO STP1
     C*----------------------------------------*
     C*         ...サブルーチン...           *
     C*   ...画面－１　の　クリアー...       *
     C*----------------------------------------*
     C           CLR1      BEGSR
     C                     MOVE *BLANK    KTYPE
     C                     MOVE *BLANK    KNAM
     C                     MOVE *BLANK    KOJO
     C                     Z-ADD0         YMD
     C                     MOVE *BLANK    CHUYA
     C                     MOVE *BLANK    KIB1
     C                     MOVE *BLANK    KIB2
     C                     MOVE *BLANK    KTCD
     C                     ENDSR
     C*----------------------------------------*
     C*         ...サブルーチン...           *
     C*   ...画面－２　の　クリアー...       *
     C*----------------------------------------*
     C*
     C           CLR2      BEGSR
     C                     MOVE *BLANK    M1WKCD
     C                     MOVE *BLANK    CDNA
     C                     MOVE *BLANK    M1KACD
     C                     MOVE *BLANK    M1RICD
     C                     MOVE *BLANK    M1KIGN
     C                     MOVE *BLANK    KAITEN
     C                     MOVE *BLANK    M1DNTI
     C                     MOVE *BLANK    M1TYTI
     C                     MOVE *BLANK    M1DMTI
     C                     MOVE *BLANK    M1ZITI
     C                     MOVE *BLANK    M1ZMTI
     C                     MOVE *BLANK    M1KNTI
     C                     MOVE *BLANK    M1KTTI
     C                     MOVE *BLANK    M1KSTI
     C                     MOVE *BLANK    TSTI
     C                     MOVE *BLANK    M1DEKI
     C                     MOVE *BLANK    M1DNKI
     C                     MOVE *BLANK    KADU
     C                     MOVE *BLANK    M1MUHK
     C                     MOVE *BLANK    M1MUHN
     C                     MOVE *BLANK    M1HURY
     C                     MOVE *BLANK    M1DEKG
     C                     MOVE *BLANK    M1MUHG
     C                     MOVE *BLANK    M1HURG
     C                     ENDSR
     C*----------------------------------------*
     C*         ...サブルーチン...           *
     C*     ...画面－３　の　クリアー...     *
     C*----------------------------------------*
     C           CLR3      BEGSR
     C                     MOVE *BLANK    @GY1
     C                     MOVE *BLANK    @TA1
     C                     MOVE *BLANK    @TA2
     C                     MOVE *BLANK    @SY1
     C                     MOVE *BLANK    @AP1
     C                     MOVE *BLANK    @AP2
     C                     MOVE *BLANK    @PA1
     C                     MOVE *BLANK    @PA2
     C                     MOVE *BLANK    @PA3
     C                     MOVE *BLANK    @PA4
     C                     ENDSR
     C*----------------------------------------*
     C*         ...サブルーチン...           *
     C*     ...配列　の　クリアー...         *
     C*----------------------------------------*
     C           CLR4      BEGSR
     C                     MOVE *BLANK    TAG1
     C                     MOVE *BLANK    TAG2
     C                     MOVE *BLANK    SYO1
     C                     MOVE *BLANK    API1
     C                     MOVE *BLANK    API2
     C                     MOVE *BLANK    PAG1
     C                     MOVE *BLANK    PAG2
     C                     MOVE *BLANK    PAG3
     C                     MOVE *BLANK    PAG4
     C                     ENDSR
     C*----------------------------------------*
     C*         ...サブルーチン...           *
     C*   ...ALBPP40 の　クリアー...         *
     C*----------------------------------------*
     C           CLR5      BEGSR
     C                     MOVEL*BLANK    M2SKJY
     C                     Z-ADD0         M2SKYY
     C                     Z-ADD0         M2SKMM
     C                     Z-ADD0         M2SKDD
     C                     MOVEL*BLANK    M2KJCD
     C                     Z-ADD0         M2SAYY
     C                     Z-ADD0         M2SAMM
     C                     Z-ADD0         M2SADD
     C                     MOVEL*BLANK    M2HYKU
     C                     MOVEL*BLANK    M2KIBN
     C                     MOVEL*BLANK    M2KIHS
     C                     MOVEL*BLANK    M2KTCD
     C                     MOVEL*BLANK    M2TAG1
     C                     MOVEL*BLANK    M2TAG2
     C                     MOVEL*BLANK    M2SYOR
     C                     MOVEL*BLANK    M2API1
     C                     MOVEL*BLANK    M2API2
     C                     MOVEL*BLANK    M2PAG1
     C                     MOVEL*BLANK    M2PAG2
     C                     MOVEL*BLANK    M2PAG3
     C                     MOVEL*BLANK    M2PAG4
     C                     ENDSR
**  ERR
E-01 FACTORY ISN'T RIGHT.
E-02 A DATE AFTER TOMORROW IS NOT RIGHT.
E-03 DATE IS NOT RIGHT.
E-04 WORKING HOURS <SHIFT1-(1) SHIFT2-(2) SHIFT3-(3)>
E-05 INPUT MACHINE NO.
E-06 APPLICABLE DATA NO EXIST.
E-07 IT IS CANCELLED ALREADY.
E-08 MORE THAN 720 MINUTES ISN'T RIGHT.
E-09 INPUT FACT TURNOVER NUMBER OR WEIGHT.
E-10 FACT TURNOVER NUMBER IS TOO MANY.
E-11 INPUT OPERATION TIME.
E-12 OPERATION TIME ISN'T RIGHT.
E-13 UPDATE INSTRUCTION <0 1 2>.
E-14 THERE ISN'T MCH NO INPUT INTO IN FACILITY MANAGE M/F.
E-15 INPUT THE PROCESS.
E-16 NEITHER FACT VOLUME NUMBER NOR WEIGHT CANNOT BE INPUT.
E-17 INPUT UNINHABITED PRODUCTION NUMBER OR WEIGHT.
E-18 NEITHER PRODUCTION NUMBER NOR WEIGHT CANNOT BE INPUT.
E-19 INPUT DEFECTIVE NUMBER OR WEIGHT.
E-20 NEITHER DEFECTOVE NUMBER NOR WEIGHT CANNOT BE INPUT.
E-21 ALTERNATELY INPUTTING NUMBER AND WEIGHT DOES NOT COME.
E-22 IT IS THE FIRST DATA.
E-23 IT IS THE LAST DATA.
E-24 IT IS EXISTED ALREADY.
E-25 PLEASE INPUT THE WORKER CODE.
E-26 THE WORKER CODE IS DIFFERENT.
E-27 INPUT MATERIAL TAG NO.1 .
E-28 INPUT A-PICS LOT NO.
E-29 INPUT PAGE NO.1 .
E-30 THE ORDER OF PAGE NO. IS DIFFERENT.
E-31 THERE IS THE OVERLAPPING DATA.
E-32 PAGE NO. OVERLAPS.
E-33 TAG NO.1 AND TAG NO.2 ARE THE SAME.
E-34 THE PROCESSING DIVISION IS 1 OR A BLANK.
E-35 FACT TURNOVER WEIGHT IS TOO MANY.
**  <TB1/TB2>
0CANCEL
1CHANGE
2ADD
**  <TB3/TB4>
1001
2017
3033
4049
5065
6081
7097
