     H            Y.
     F** MFBR09 **********************************
     F* FACILITY TOTAL EFFICIENCY TOTALIZATION LIST DATA SELECT *
     F*                 IN ORDER OF PROCESS    *
     F*        A-IDOTA         1989.12.07        *
     F********************************** MFBR09 **
     FMFBPL03 IF  E           K        DISK
     FMFANL22 IF  E           K        DISK
     FMFANL26 IF  E           K        DISK
     FMFBWP09 O   F     100            DISK
      * 集計日付 *
     I            DS
     I                                        1   80SAHIZ
     I                                        1   40M1SAYY
     I                                        5   60M1SAMM
     I                                        7   80M1SADD
      * 削除日付 *
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
     I            DS
     I                                        1   80M@SKHZ
     I                                        1   40M@SKYY
     I                                        5   60M@SKMM
     I                                        7   80M@SKDD
      * 機番 *
     I            DS
     I                                        1   4 CKIBN
     I                                        1   3 M1KIBN
     I                                        4   4 M1KIHS
     I            DS
     I                                        1   4 KBN
     I                                        1   3 KBN1
     I                                        4   4 KBN2
      * ﾃﾇnﾈ]jｰ *
     I            DS
     I                                        1   6 COS
     I                                        1   2 COS1
     I                                        3   4 COS2
     I                                        5   6 COS3
     I            DS
     I                                        1   6 CCOS
     I                                        1   2 M@COS1
     I                                        3   4 M@COS2
     I                                        5   6 M@COS3
      * PARM *
     C           *ENTRY    PLIST
     C                     PARM           PKOJ    4
     C                     PARM           PKN1    8
     C                     PARM           PKN2    8
     C                     PARM           PKB1    3
     C                     PARM           PKB2    1
     C                     PARM           PKS1    2
     C                     PARM           PKS2    2
     C                     PARM           PKS3    2
      * KEY *
     C           KEY1      KLIST
     C                     KFLD           KJY
     C                     KFLD           M1KIBN
     C                     KFLD           M1KIHS
      *
     C                     MOVE PKOJ      KJY     40
     C                     MOVE PKN1      HIZ1    80
     C                     MOVE PKN2      HIZ2    80
     C                     MOVE PKB1      KBN1    3
     C                     MOVE PKB2      KBN2    1
     C                     MOVE PKS1      COS1    2
     C                     MOVE PKS2      COS2    2
     C                     MOVE PKS3      COS3    2
      ****************
      * リスト作成 *
      ****************
     C                     SETOF                     1011
     C           KJY       IFNE 9999
     C           KJY       SETLLMFBPL031
     C                     END
      *
     C           LOP10     TAG
B001 C                     DO   *HIVAL
     C           KJY       IFNE 9999
     C           KJY       READEMFBPL031                 10
     C                     ELSE
     C                     READ MFBPL031                 10
     C                     END
     C           *IN10     IFEQ '0'
      * 削除 *
     C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     GOTO LOP10
E003 C                     END
      * 集計期間 *
B003 C           HIZ1      IFLE SAHIZ
     C           HIZ2      ANDGESAHIZ
X003 C                     ELSE
     C                     GOTO LOP10
E003 C                     END
      * 設備管理マスター *
     C                     MOVE *BLANK    @COS1   2
     C                     MOVE *BLANK    @COS2   2
     C                     MOVE *BLANK    @COS3   2
     C                     SETOF                     7080
     C           KEY1      CHAINMFANL221             70
     C           *IN,70    IFEQ '0'
     C           M@SKJY    ANDEQ'D'
     C           M@SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,70
E003 C                     END
     C*
     C           *IN,70    IFEQ '0'
     C                     MOVELM@COS1    @COS1
     C                     MOVELM@COS2    @COS2
     C                     MOVELM@COS3    @COS3
E003 C                     END
     C*
     C           *IN,70    IFEQ '1'
     C           KEY1      CHAINMFANL261             80
     C           *IN,80    IFEQ '0'
     C           M@SKJY    ANDEQ'D'
     C           M@SKHZ    ANDLE*DATE
     C                     GOTO LOP10
E004 C                     END
     C*
     C           *IN,80    IFEQ '0'
     C                     MOVELM@QCS1    @COS1
     C                     MOVELM@QCS2    @COS2
     C                     MOVELM@QCS3    @COS3
E004 C                     END
E003 C                     END
      * 機番 *
B003 C           KBN       IFNE *BLANK
B004 C           KBN       IFNE CKIBN
     C                     GOTO LOP10
E004 C                     END
E003 C                     END
      * ﾃﾇnﾈ]jｰ *
B003 C           COS       IFNE *BLANK
B004 C           COS       IFNE CCOS
     C                     GOTO LOP10
E004 C                     END
E003 C                     END
      * MOVE *
     C                     Z-ADDM1KJCD    OKJCD   40
     C                     MOVE M1KTCD    OKTCD   3
     C                     MOVE M1KIBN    OKIBN   3
     C                     MOVE M1KIHS    OKIHS   1
     C                     Z-ADDM1SAYY    OSAYY   40
     C                     Z-ADDM1SAMM    OSAMM   20
     C                     Z-ADDM1SADD    OSADD   20
     C                     Z-ADDM1DNTI    ODNTI   30
     C                     Z-ADDM1TYTI    OTYTI   30
     C                     Z-ADDM1DMTI    ODMTI   30
     C                     Z-ADDM1ZITI    OZITI   30
     C                     Z-ADDM1ZMTI    OZMTI   30
     C                     Z-ADDM1KNTI    OKNTI   30
     C                     Z-ADDM1KTTI    OKTTI   30
     C                     Z-ADDM1KSTI    OKSTI   30
     C                     Z-ADDM1TSTI    OTSTI   30
     C                     Z-ADDM1DEKI    ODEKI   70
     C                     Z-ADDM1DNKI    ODNKI   30
     C                     Z-ADDM1KADU    OKADU   31
     C                     Z-ADDM1MUHN    OMUHN   70
     C                     MOVE M1KIGN    OKIGN   3
     C                     Z-ADDM1BISU    OBISU   10
     C                     MOVE @COS1     OCOS1   2
     C                     MOVE @COS2     OCOS2   2
     C                     MOVE @COS3     OCOS3   2
     C                     MOVE M1KACD    OKACD   1
     C                     MOVE M1RICD    ORICD   1
      * 96.03.07    段取回数      K.OKACHI
     C                     MOVE M1DNKI    ODNKI   30
     C                     EXCPTDT
     C                     SETON                     U1
E002 C                     END
E001 C  N10                END
     C                     SETON                     LR
     C                     RETRN
      ********************
      * 出力レイアウト *
      ********************
     OMFBWP09 E                DT
     O                         OKJCD      4
     O                         OKTCD      7
     O                         OKIBN     10
     O                         OKIHS     11
     O                         OSAYY     15
     O                         OSAMM     17
     O                         OSADD     19
     O                         ODNTI     22
     O                         OTYTI     25
     O                         ODMTI     28
     O                         OZITI     31
     O                         OZMTI     34
     O                         OKNTI     37
     O                         OKTTI     40
     O                         OKSTI     43
     O                         OTSTI     46
     O                         ODEKI     53
     O                         ODNKI     56
     O                         OKADU     59
     O                         OMUHN     66
     O                         OKIGN     69
     O                         OBISU     70
     O                         OCOS1     72
     O                         OCOS2     74
     O                         OCOS3     76
     O                         OKACD     77
     O                         ORICD     78
      * 96.03.07    段取回数      K.OKACHI
     O                         ODNKI     81
