     H            Y.
     F** MFBR04 ********************************
     F* WORK DAILY REPORT DATA TOTALIZATION LIST(CONDITION APPOINTED)
     F*             SCREEN CHECK             *
     F* A-IDOTA                1989.11.15      *
     F******************************** MFBR04 **
     FMFBPW04 CF  E                    WORKSTN
     FMFANL22 IF  E           K        DISK
     FMFAPL23 IF  E           K        DISK
     FMFANL26 IF  E           K        DISK
     FMFEPL40 IF  E           K        DISK
     E                    ER      1  10 60               ＭＳＧ
      * 集計日付 *
     I            DS
     I                                        1   80HIZ1
     I                                        1   40HI1Y
     I                                        5   60HI1M
     I                                        7   80HI1D
     I            DS
     I                                        1   80HIZ2
     I                                        1   40HI2Y
     I                                        5   60HI2M
     I                                        7   80HI2D
      * 機番 *
     I            DS
     I                                        1   4 KIBN
     I                                        1   3 @KIB1
     I                                        4   4 @KIB2
      * ﾃﾇnﾈ]jｰ *
     I            DS
     I                                        1   6 COST
     I                                        1   2 @COS1
     I                                        3   4 @COS2
     I                                        5   6 @COS3
      * 削除日付 *
     I            DS
     I                                        1   80M@SKHZ
     I                                        1   40M@SKYY
     I                                        5   60M@SKMM
     I                                        7   80M@SKDD
     I            DS
     I                                        1   80MHSKHZ
     I                                        1   40MHSKYY
     I                                        5   60MHSKMM
     I                                        7   80MHSKDD
      *
     C           *ENTRY    PLIST
     C                     PARM           PKOJ    4
     C                     PARM           PKN1    8
     C                     PARM           PKN2    8
     C                     PARM           PSYU    1
     C                     PARM           PKB1    3
     C                     PARM           PKB2    1
     C                     PARM           PKS1    2
     C                     PARM           PKS2    2
     C                     PARM           PKS3    2
      * ＫＥＹ *
     C           KEY1      KLIST
     C                     KFLD           KJYU
     C                     KFLD           @KIB1
     C                     KFLD           @KIB2
     C           KEY2      KLIST
     C                     KFLD           KJYU
     C                     KFLD           @COS1
     C                     KFLD           @COS2
     C                     KFLD           @COS3
      **************
      * 初期設定 *
      **************
     C                     MOVE *BLANK    @KJYU
     C                     MOVE *BLANK    @HIZ1
     C                     MOVE *BLANK    @HIZ2
     C                     MOVE *BLANK    @SYUR
     C                     MOVE *BLANK    @KIB1
     C                     MOVE *BLANK    @KIB2
     C                     MOVE *BLANK    @COS1
     C                     MOVE *BLANK    @COS2
     C                     MOVE *BLANK    @COS3
     C                     MOVEA'000000'  *IN,01
     C                     SETOF                     99
      **********
      * 画面 *
      **********
     C           LOP1      TAG
     C                     EXFMTMFBPW041
     C                     MOVEA'000000'  *IN,01
     C                     SETOF                     99
     C           *INKA     IFEQ '1'
     C                     SETON                     U1LR
     C                     RETRN
     C                     END
      *
     C           *INKL     IFEQ '1'
     C                     CALL 'MFEC20'
     C                     GOTO LOP1
     C                     END
      * 工場 *
     C                     MOVE @KJYU     KJYU    40
     C           KJYU      CABEQ9999      STEP01
     C           KJYU      CHAINMFEPL401             01
     C           *IN,01    IFEQ '0'
     C           MHSKJY    ANDEQ'D'
     C           MHSKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,01
     C                     END
     C*
     C           *IN,01    IFEQ '1'
     C                     MOVELER,1      MSG
     C                     SETON                     99
     C                     GOTO LOP1
     C                     END
     C           STEP01    TAG
      * 集計期間 *
     C                     MOVE @HIZ1     HIZ1    80
     C                     MOVE @HIZ2     HIZ2    80
     C           HI1Y      IFLT 1988
     C                     MOVE ER,2      MSG
     C                     SETON                     0299
     C                     GOTO LOP1
     C                     END
     C           HI1M      IFGE 1
     C           HI1M      ANDLE12
     C                     ELSE
     C                     MOVE ER,3      MSG
     C                     SETON                     0299
     C                     GOTO LOP1
     C                     END
     C           HI1D      IFGE 1
     C           HI1D      ANDLE31
     C                     ELSE
     C                     MOVE ER,4      MSG
     C                     SETON                     0299
     C                     GOTO LOP1
     C                     END
      *
     C           HI2Y      IFLT 1988
     C                     MOVE ER,2      MSG
     C                     SETON                     0399
     C                     GOTO LOP1
     C                     END
     C           HI2M      IFGE 1
     C           HI2M      ANDLE12
     C                     ELSE
     C                     MOVE ER,3      MSG
     C                     SETON                     0399
     C                     GOTO LOP1
     C                     END
     C           HI2D      IFGE 1
     C           HI2D      ANDLE31
     C                     ELSE
     C                     MOVE ER,4      MSG
     C                     SETON                     0399
     C                     GOTO LOP1
     C                     END
      *
     C           HIZ1      IFGT HIZ2
     C                     MOVE ER,5      MSG
     C                     SETON                     0299
     C                     GOTO LOP1
     C                     END
      *
     C           HIZ2      IFGT *DATE
     C                     MOVE ER,10     MSG
     C                     SETON                     0399
     C                     GOTO LOP1
     C                     END
      * 集計表種類 *
     C           @SYUR     IFNE 'A'
     C           @SYUR     ANDNE'B'
     C           @SYUR     ANDNE'C'
     C           @SYUR     ANDNE'D'
     C                     MOVE ER,6      MSG
     C                     SETON                     0499
     C                     GOTO LOP1
     C                     END
      * 機番 *
     C           KIBN      IFNE *BLANK
     C                     SETOF                     10
     C           KEY1      CHAINMFANL221             10
     C   10      KEY1      CHAINMFANL261             10
     C           *IN10     IFEQ '1'
     C                     MOVE ER,8      MSG
     C                     SETON                     0599
     C                     GOTO LOP1
     C                     ELSE
     C           M@SKJY    IFEQ 'D'
     C           M@SKHZ    ANDLE*DATE
     C                     MOVE ER,9      MSG
     C                     SETON                     0599
     C                     GOTO LOP1
     C                     END
     C                     END
     C                     END
      * ﾃﾇnﾈ]jｰ *
     C           COST      IFNE *BLANK
     C                     SETOF                     10
     C           KEY2      CHAINMFAPL231             10
     C           *IN10     IFEQ '1'
     C                     MOVE ER,8      MSG
     C                     SETON                     0699
     C                     GOTO LOP1
     C                     ELSE
     C           M@SKJY    IFEQ 'D'
     C           M@SKHZ    ANDLE*DATE
     C                     MOVE ER,9      MSG
     C                     SETON                     0699
     C                     GOTO LOP1
     C                     END
     C                     END
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO LOP1
     C                     END
      * ＭＯＶＥ *
     C                     MOVE @KJYU     PKOJ
     C                     MOVE @HIZ1     PKN1
     C                     MOVE @HIZ2     PKN2
     C                     MOVE @SYUR     PSYU
     C                     MOVE @KIB1     PKB1
     C                     MOVE @KIB2     PKB2
     C                     MOVE @COS1     PKS1
     C                     MOVE @COS2     PKS2
     C                     MOVE @COS3     PKS3
      *
     C                     SETON                     LR
     C                     RETRN
** MSG
E-01 THE INPUT OF FACTORY CODE IS WRONG
E-02 THE INPUT OF YEAR IS WRONG
E-03 THE INPUT OF MONTH IS WRONG
E-04 THE INPUT OF DAY IS WRONG
E-05 THIS DATE IS BIG
E-06 TOTALIZATION LIST KIND IS <A  B, C>
E-07 INPUT BOTH
E-08 THERE IS NOT IT IN FACILITY MANAGEMENT M/F
E-09 FACILITY MANAGEMENT M/F IS CANCELLED ALREADY
E-10 DATE IS BIGGER THAN TODAY
