     H            Y.
     F** MFBR14 ********************************
     F* WORKING DAILY REPORT DATA TOTALIZATION
     F*         <COST CENTER ORDER>          *
     F*        A-IDOTA 1993.02.04              *
     F******************************** MFBR14 **
     FMFBWP14 IP  F     100            DISK
     FMFAPL22 IF  E           K        DISK
     FMFAPL26 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     156     OF     PRINTER
     E                    TAB1    1   8  1 0 TAB2    2   倍数表示
     IMFBWP14 AA  88
     I                                        1   2 @COS1 L1
     I                                        3   4 @COS2 L1
     I                                        5   6 @COS3 L1
     I                                        7  100M1KJCD
     I                                       11  11 M1KACD
     I                                       12  12 M1RICD
     I                                       13  13 M1HNCD
     I                                       14  16 M1KTCD
     I                                       17  19 M1KIBN
     I                                       20  20 M1KIHS
     I                                       21  240M1SAYY
     I                                       25  260M1SAMM
     I                                       27  280M1SADD
     I                                       29  29 M1HYKU
     I                                       30  320M1DNTI
     I                                       33  350M1TYTI
     I                                       36  380M1DMTI
     I                                       39  410M1ZITI
     I                                       42  440M1ZMTI
     I                                       45  470M1KNTI
     I                                       48  500M1KTTI
     I                                       51  530M1KSTI
     I                                       54  560M1TKTI
     I                                       57  590M1TSTI
     I                                       60  660M1DEKI
     I                                       67  690M1DNKI
     I                                       70  721M1KADU
     I                                       73  750M1MUHK
     I                                       76  820M1MUHN
     I                                       83  85 M1KIGN
     I                                       86  860M1BISU
      * 機番 *
     I            DS
     I                                        1   3 M1KIBN
     I                                        1   1 KIB1
     I                                        2   3 KIB2
      * PARM *
     C           *ENTRY    PLIST
     C                     PARM           @KBN    1
     C                     PARM           @HIZU   8
      * KEY *
     C           KEY1      KLIST
     C                     KFLD           M1KJCD
     C                     KFLD           M1KIBN
     C                     KFLD           M1KIHS
      **************
      * 初期設定 *
      **************
     C           *IN11     IFEQ '0'
     C                     Z-ADD0         KITN1   95
     C                     Z-ADD0         KITN2   95
     C                     MOVEL@HIZU     HIZU    80
     C                     TIME           WTIME   60
     C                     MOVE *BLANK    KMEI   18
     C           M1KJCD    CHAINFGBPL011             30
     C           *IN30     IFEQ '0'
     C                     MOVELB2SMEI    KMEI
     C                     END
     C                     EXCPTMI
     C                     SETON                     11
     C                     END
      ****************
      * リスト作成 *
      ****************
      * 機番 *
     C                     SETOF                     20
     C           M1KIHS    IFEQ *BLANK
     C                     SETON                     20
     C                     END
      * 昼夜区分 *
     C                     MOVE *BLANK    HYK     6
     C           M1HYKU    IFEQ 'H'
     C                     MOVEL'DAY '    HYK
     C                     ELSE
     C                     MOVE 'NGHT'    HYK
     C                     END
      * 停止時間Ａ *
     C                     Z-ADD0         DAMI    40
     C                     ADD  M1KSTI    DAMI
     C                     ADD  M1DNTI    DAMI
     C                     ADD  M1TYTI    DAMI
     C                     ADD  M1ZITI    DAMI
     C           DAMI      DIV  60        TISA    85
      * 停止時間Ｂ *
     C                     Z-ADD0         DAMI
     C                     ADD  M1KTTI    DAMI
     C                     ADD  M1ZMTI    DAMI
     C                     ADD  M1DMTI    DAMI
     C                     ADD  M1KNTI    DAMI
     C           DAMI      DIV  60        TISB    85
      * 稼動時間－Ａ－Ｂ *
     C           M1KADU    SUB  TISA      TISC    85
     C                     SUB  TISB      TISC
      * 稼動時間－Ｂ *
     C           M1KADU    SUB  TISB      TISD    85
      * Ｆ *
     C                     SETOF                     70
     C                     Z-ADD0         FFFF    95
     C           KEY1      CHAINMFAPL221             70
     C   70      KEY1      CHAINMFAPL261             70
     C           *IN70     IFEQ '0'
     C           M1DEKI    SUB  M1MUHN    XX1     70
     C           XX1       DIV  M@RPMH    FFFF
     C                     ADD  FFFF      KITN1
     C                     ADD  FFFF      KITN2
     C                     END
      * 性能稼動率 *
     C                     Z-ADD0         SKRT    62
     C           TISC      IFEQ 0
     C                     Z-ADD0         XX2
     C                     ELSE
     C           FFFF      DIV  TISC      XX2     74H
     C                     END
     C           XX2       MULT 100       SKRT
      * 時間稼動率 *
     C                     Z-ADD0         JKRT    62
     C           TISD      IFEQ 0
     C                     Z-ADD0         TISE
     C                     Z-ADD0         XX3
     C                     ELSE
     C           TISC      DIV  TISD      TISE    85
     C           TISC      DIV  TISD      XX3     74H
     C                     END
     C           XX3       MULT 100       JKRT
      * 設備総合効率 *
     C                     Z-ADD0         KART    52
     C           TISE      MULT XX2       XX4     74H
     C           XX4       MULT 100       KART
     C           KART      COMP 0                      21
      * ？＊倍数 *
     C           M1DEKI    MULT M1BISU    DEKI    70
     C           M1MUHN    MULT M1BISU    MUHN    70
      * 倍数の表示
     C                     MOVE *BLANK    BIKO    2
     C           M1BISU    IFNE 1
     C           M1BISU    LOKUPTAB1      TAB2           70
     C   70                MOVELTAB2      BIKO
     C                     END
      * 課合計 *
     C                     ADD  M1DNTI    GK01    50
     C                     ADD  M1TYTI    GK02    50
     C                     ADD  M1DMTI    GK03    50
     C                     ADD  M1ZITI    GK04    50
     C                     ADD  M1ZMTI    GK05    50
     C                     ADD  M1KNTI    GK06    50
     C                     ADD  M1KTTI    GK07    50
     C                     ADD  M1KSTI    GK08    50
     C                     ADD  M1TSTI    GK09    40
     C                     ADD  M1KADU    GK10    51
     C                     ADD  DEKI      GK11    80
     C                     ADD  M1DNKI    GK12    30
     C                     ADD  MUHN      GK13    70
      * 係合計 *
     C                     ADD  M1DNTI    GR01    50
     C                     ADD  M1TYTI    GR02    50
     C                     ADD  M1DMTI    GR03    50
     C                     ADD  M1ZITI    GR04    50
     C                     ADD  M1ZMTI    GR05    50
     C                     ADD  M1KNTI    GR06    50
     C                     ADD  M1KTTI    GR07    50
     C                     ADD  M1KSTI    GR08    50
     C                     ADD  M1TSTI    GR09    40
     C                     ADD  M1KADU    GR10    51
     C                     ADD  DEKI      GR11    80
     C                     ADD  M1DNKI    GR12    30
     C                     ADD  MUHN      GR13    70
      *
     C           *INOF     IFEQ '1'
     C                     EXCPTMI
     C                     SETOF                     OF
     C                     END
     C                     EXCPTME
      ******
      ******
     CL1                   EXSR SUB2
     CL1                   EXCPTGK1
     CLR                   EXSR SUB1
     CLR                   EXCPTGK2
      ****************
      * ＳＵＢ－１ *
      ****************
     C           SUB1      BEGSR
      * 停止時間Ａ *
     C                     Z-ADD0         DAMI1   50
     C                     ADD  GR08      DAMI1
     C                     ADD  GR01      DAMI1
     C                     ADD  GR02      DAMI1
     C                     ADD  GR04      DAMI1
     C           DAMI1     DIV  60        TISA1  105
      * 停止時間Ｂ *
     C                     Z-ADD0         DAMI1
     C                     ADD  GR07      DAMI1
     C                     ADD  GR05      DAMI1
     C                     ADD  GR03      DAMI1
     C                     ADD  GR06      DAMI1
     C           DAMI1     DIV  60        TISB1  105
      * 稼動時間－Ａ－Ｂ *
     C           GR10      SUB  TISA1     TISC1  105
     C                     SUB  TISB1     TISC1
      * 稼動時間－Ｂ *
     C           GR10      SUB  TISB1     TISD1  105
      * 性能稼動率 *
     C           TISC1     IFEQ 0
     C                     Z-ADD0         ZZ1
     C                     ELSE
     C           KITN1     DIV  TISC1     ZZ1     94H
     C                     END
     C           ZZ1       MULT 100       GR14    52
      * 時間稼動率 *
     C           TISD1     IFEQ 0
     C                     Z-ADD0         TISE1
     C                     Z-ADD0         YY1
     C                     ELSE
     C           TISC1     DIV  TISD1     TISE1  105
     C           TISC1     DIV  TISD1     YY1     84H
     C                     END
     C           YY1       MULT 100       GR15    52
      * 設備総合効率 *
     C           TISE1     MULT ZZ1       ZZ2     94H
     C           ZZ2       MULT 100       GR16    52
      *
     C                     Z-ADD0         KITN1
     C                     ENDSR
      ****************
      * ＳＵＢ－２ *
      ****************
     C           SUB2      BEGSR
      * 停止時間Ａ *
     C                     Z-ADD0         DAMI1
     C                     ADD  GK08      DAMI1
     C                     ADD  GK01      DAMI1
     C                     ADD  GK02      DAMI1
     C                     ADD  GK04      DAMI1
     C           DAMI1     DIV  60        TISA1
      * 停止時間Ｂ *
     C                     Z-ADD0         DAMI1
     C                     ADD  GK07      DAMI1
     C                     ADD  GK05      DAMI1
     C                     ADD  GK03      DAMI1
     C                     ADD  GK06      DAMI1
     C           DAMI1     DIV  60        TISB1
      * 稼動時間－Ａ－Ｂ *
     C           GK10      SUB  TISA1     TISC1
     C                     SUB  TISB1     TISC1
      * 稼動時間－Ｂ *
     C           GK10      SUB  TISB1     TISD1
      * 性能稼動率 *
     C           TISC1     IFEQ 0
     C                     Z-ADD0         ZZ1
     C                     ELSE
     C           KITN2     DIV  TISC1     ZZ1       H
     C                     END
     C           ZZ1       MULT 100       GK14    52
      * 時間稼動率 *
     C           TISD1     IFEQ 0
     C                     Z-ADD0         TISE1
     C                     Z-ADD0         YY1
     C                     ELSE
     C           TISC1     DIV  TISD1     TISE1
     C           TISC1     DIV  TISD1     YY1       H
     C                     END
     C           YY1       MULT 100       GK15    52
      * 設備総合効率 *
     C           TISE1     MULT ZZ1       ZZ2       H
     C           ZZ2       MULT 100       GK16    52
      *
     C                     Z-ADD0         KITN2
     C                     ENDSR
      ********************
      * 出力レイアウト *
      ********************
     OQPRINT  E  101           MI
     O                                  150 '+-------------------+'
     O        E  1             MI
     O                                    8 'FACTORY'
     O                         M1KJCD    13
     O                         KMEI      32
     O                                  150 '|         |         |'
     O        E  1             MI
     O                                    8 'DATE'
     O                         HIZU      19 '    .  .  '
     O                                  103 'TIME'
     O                         WTIME    112 '  :  :  '
     O                                  150 '|         |         |'
     O        E  2             MI
     O                                    7 'SEC'
     O                                   37 'BY COST CENTER'
     O                                   62 'WORKING DAILY REPORT'
     O                                   85 'DATA TOTALIZATION LIST'
     O                                  103 'DATE'
     O                         UDATE Y  112
     O                                  120 'PAGE'
     O                         PAGE  Z  124
     O                                  150 '+-------------------+'
     O        E  1             MI
     O                                   10 'COST CENTR'
     O                                   16 'NIGHT'
     O                                   23 'MCH NO'
     O                                   29 'PROC'
     O                                   35 'SETUP'
     O                                   41 'AJST'
     O                                   47 'SETUP'
     O                                   52 'MTRL'
     O                                   58 'MTRL'
     O                                   65 'KANBAN'
     O                                   70 'DIE'
     O                                   76 'TRBL'
     O                                   81 'SHRT'
     O                                   88 'RSTRCT'
     O                                  100 'ACTUAL'
     O                                  105 'MULT'
     O                                  111 'SETUP'
     O                                  124 'UNIHABITED'
     O                                  134 'PRFOMCE'
     O                                  139 'TIME'
     O                                  156 'TOTAL FACLTY'
     O        E  2             MI
     O                                   16 '& DAY'
     O                                   29 'CODE'
     O                                   41 'TIME'
     O                                   47 'WAIT'
     O                                   52 'CHG'
     O                                   58 'WAIT'
     O                                   64 'WAIT'
     O                                   71 'WAIT'
     O                                   76 'TIME'
     O                                   80 'STP'
     O                                   88 'TIM'
     O                                  112 'FRQENCY'
     O                                  124 'PROD NBR'
     O                                  134 'OPE RATE'
     O                                  143 'OPE RATE'
     O                                  149 'RATE'
      *
     O        E  1             ME
     O                         @COS1      4
     O                                    5 '-'
     O                         @COS2      7
     O                                    8 '-'
     O                         @COS3     10
     O                         HYK       17
     O                         KIB1      18
     O                                   19 '-'
     O                         KIB2      21
     O                N20                22 '-'
     O                         M1KIHS    23
     O                         M1KTCD    28
     O                         M1DNTI3   34
     O                         M1TYTI3   40
     O                         M1DMTI3   46
     O                         M1ZITI3   52
     O                         M1ZMTI3   58
     O                         M1KNTI3   64
     O                         M1KTTI3   70
     O                         M1KSTI3   76
     O                         M1TSTI3   82
     O                         M1KADU1   89
     O                         DEKI  1  100
     O                         BIKO     104
     O                         M1DNKI3  110
     O                         MUHN  1  124
     O                         SKRT  3  133
     O                         JKRT  3  142
     O                 21               144 '-'
     O                         KART  3  151
      * 小計 *
     O        E  2             GK1
     O                                   27 '*** SUBTOTAL'
     O                         GK01  3B  34
     O                         GK02  3B  40
     O                         GK03  3B  46
     O                         GK04  3B  52
     O                         GK05  3B  58
     O                         GK06  3B  64
     O                         GK07  3B  70
     O                         GK08  3B  76
     O                         GK09  3B  82
     O                         GK10  3B  89
     O                         GK11  1B 100
     O                         GK12  1B 110
     O                         GK13  1B 124
     O                         GK14  3B 133
     O                         GK15  3B 142
     O                         GK16  3B 151
      * 総合計 *
     O        E  1             GK2
     O                                   27 '*** TOTAL'
     O                         GR01  3B  34
     O                         GR02  3B  40
     O                         GR03  3B  46
     O                         GR04  3B  52
     O                         GR05  3B  58
     O                         GR06  3B  64
     O                         GR07  3B  70
     O                         GR08  3B  76
     O                         GR09  3B  82
     O                         GR10  3B  89
     O                         GR11  1B 100
     O                         GR12  1B 110
     O                         GR13  1B 124
     O                         GR14  3B 133
     O                         GR15  3B 142
     O                         GR16  3B 151
**  MULTIPLE DISPLAY
2*2
3*3
4*4
5*5
6*6
7*7
8*8
9*9
