      *-- MFBR50 -------------------------------------------*
      *       INPUT OF  WORK DAILY BULLETIN DATA            *
      *               << PC TO AS400 >>                     *
      * CODING:K.OKACHI    2002.06.05                       *
      * NOTES:コンパイルはメニューから実施しない事        *
      *        CRTRPGPGM ALWNULLパラメータを*YESにする  *
      *        テスト環境でのコンパイルも実施する事       *
      *------------------------------------------- MFBR50 --*
     H            Y/                                    1
     FMFBPP50 IP  E                    DISK
     FMFAPL22 IF  E           K        DISK
     FMFBPL01 UF  E           K        DISK                      A
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     IWNULL       DS
     I                                        1   1 BIN1
      * MFBPP50
     I            DS
     I                                        1  50 M5COST
     I                                        1   1 M5NULL
     I            DS
     I                                        1  10 M5SAHZ
     I                                        1   2 M5SAMM
     I                                        4   5 M5SADD
     I                                        7  10 M5SAYY
     I            DS
     I                                        1   5 M5KIBN
     I                                        1   2 M5KIB1
     I                                        4   4 M5KIB2
     I                                        5   5 M5KIB3
      * MFBPL01
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
     I            DS
     I                                        1   60WTIME
     I                                        1   20WTIMJ
     I                                        3   40WTIMF
      * MFAPL22
     I            DS
     I                                        1   80M@SKHZ
     I                                        1   40M@SKYY
     I                                        5   60M@SKMM
     I                                        7   80M@SKDD
      *
     C           M5NULL    IFEQ WNULL
     C                     MOVE *BLANK    M5COST
     C                     END
     C                     EXSR #SB100
      *-----------------------------------------------------*
     C           *INZSR    BEGSR
     C                     BITOF'00000000'BIN1
     C                     TIME           WTIME
     C           EINZSR    ENDSR
      *-----------------------------------------------------*
     C           #SB100    BEGSR
     C                     Z-ADD0111      KKJCD   40
     C                     MOVE M5SAYY    KSAYY   40
     C                     MOVE M5SAMM    KSAMM   20
     C                     MOVE M5SADD    KSADD   20
     C                     MOVELM5SIFT    KHYKU   1
     C           M5KIB1    CAT  M5KIB2    KKIBN   3
     C                     MOVE M5KIB3    KKIHS   1
     C           KEY1      KLIST
     C                     KFLD           KKJCD
     C                     KFLD           KSAYY
     C                     KFLD           KSAMM
     C                     KFLD           KSADD
     C                     KFLD           KHYKU
     C                     KFLD           KKIBN
     C                     KFLD           KKIHS
     C                     MOVE *BLANK    CFLG    1
     C                     SETOF                     50
     C           KEY1      CHAINMFBPL011             50
     C           *IN50     IFEQ '0'
     C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVE '*'       CFLG
     C                     END
     C                     END
      *
     C           CFLG      IFEQ *BLANK
     C                     CLEARMFBPL011
     C                     Z-ADD*YEAR     M1KOYY
     C                     Z-ADDUMONTH    M1KOMM
     C                     Z-ADDUDAY      M1KODD
     C                     Z-ADDWTIMJ     M1KOHH
     C                     Z-ADDWTIMF     M1KOSS
     C                     MOVE #USER     M1KOME
     C                     Z-ADD0111      M1KJCD
     C                     EXSR #SB110
     C                     MOVE *BLANK    M1HNCD
     C                     MOVE KKIBN     M1KIBN
     C                     MOVE KKIHS     M1KIHS
     C                     MOVE *BLANK    M1SAGY
     C                     MOVE M5SAYY    M1SAYY
     C                     MOVE M5SAMM    M1SAMM
     C                     MOVE M5SADD    M1SADD
     C                     MOVE KHYKU     M1HYKU
     C                     Z-ADDM5DNTI    M1DNTI
     C                     Z-ADDM5TYTI    M1TYTI
     C                     Z-ADDM5DMTI    M1DMTI
     C                     Z-ADD0         M1ZITI
     C                     Z-ADDM5ZMTI    M1ZMTI
     C                     Z-ADDM5KNTI    M1KNTI
     C                     Z-ADDM5KTTI    M1KTTI
     C                     Z-ADDM5KSTI    M1KSTI
     C                     Z-ADD0         M1TKTI
     C                     Z-ADDM5TSTI    M1TSTI
     C                     Z-ADDM5DEKI    M1DEKI
     C                     Z-ADD0         M1DEKG
     C                     Z-ADDM5DNKI    M1DNKI
     C                     Z-ADDM5KADU    M1KADU
     C                     Z-ADD0         M1MUHK
     C                     Z-ADD0         M1MUHN
     C                     Z-ADD0         M1MUHG
     C                     Z-ADD0         M1HURY
     C                     Z-ADD0         M1HURG
     C                     Z-ADD0         M1BISU
     C                     MOVE M5WKCD    M1WKCD
     C           *IN50     IFEQ '0'
     C                     UPDATMFBPL011
     C                     ELSE
     C                     WRITEMFBPL011
     C                     END
     C                     END
     C           ESB100    ENDSR
      *-----------------------------------------------------*
     C           #SB110    BEGSR
     C           KEY2      KLIST
     C                     KFLD           KKJCD
     C                     KFLD           KKIBN
     C                     KFLD           KKIHS
     C                     SETOF                     51
     C           KEY2      CHAINMFAPL221             51
     C           *IN51     IFEQ '0'
     C           M@SKJY    IFEQ 'D'
     C           M@SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVE M@BUKA    M1KACD
     C                     MOVE M@KAKA    M1RICD
     C                     MOVE M@KOTE    M1KTCD
     C                     MOVE M@QKGN    M1KIGN
     C                     END
     C                     END
     C           ESB110    ENDSR
      *-----------------------------------------------------*
