     H            Y.
     F** MFBR70 ************************************/
     F* ..INQUERY OF WORK DAILY BULLETIN DATA..    */
     F*       CREATE DATE : 1997.11.25             */
     F*       CODING      : K.OKACHI.              */
     F**********************************************/
     FMFBPW70 CF  E                    WORKSTN
     FMFBPL08 IF  E           K        DISK
     FMFBPL42 IF  E           K        DISK
     FMFBPL43 IF  E           K        DISK
     FMFBPL44 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAJSPL28 IF  E           K        DISK
     FAJSPL29 IF  E           K        DISK
     FAJSPL25 IF  E           K        DISK
     FAJSPL68 IF  E           K        DISK
     FAJSPL69 IF  E           K        DISK
     FAJSPL65 IF  E           K        DISK
     FALDPL30 IF  E           K        DISK
     E                    ER      1  14 60               ERROR MESSAGE
     E                    TB1     1  13  3   TB2     2 0
     E                    KBNE       13 11
     E                    KBMN       13  4
     E                    KBAN       13  3
     E                    KBAR       13  1
     E                    KHOJ       13  1
     E                    HJYO       13  1
     E                    WDAY       13  8
     E                    WTIM       13  5
     I            DS
     I                                        1 143 KBNE
     I                                        1  11 KBNE1
     I                                       12  22 KBNE2
     I                                       23  33 KBNE3
     I                                       34  44 KBNE4
     I                                       45  55 KBNE5
     I                                       56  66 KBNE6
     I                                       67  77 KBNE7
     I                                       78  88 KBNE8
     I                                       89  99 KBNE9
     I                                      100 110 KBNE10
     I                                      111 121 KBNE11
     I                                      122 132 KBNE12
     I                                      133 143 KBNE13
     I            DS
     I                                        1  52 KBMN
     I                                        1   4 KBMN1
     I                                        5   8 KBMN2
     I                                        9  12 KBMN3
     I                                       13  16 KBMN4
     I                                       17  20 KBMN5
     I                                       21  24 KBMN6
     I                                       25  28 KBMN7
     I                                       29  32 KBMN8
     I                                       33  36 KBMN9
     I                                       37  40 KBMN10
     I                                       41  44 KBMN11
     I                                       45  48 KBMN12
     I                                       49  52 KBMN13
     I            DS
     I                                        1  39 KBAN
     I                                        1   3 KBAN1
     I                                        4   6 KBAN2
     I                                        7   9 KBAN3
     I                                       10  12 KBAN4
     I                                       13  15 KBAN5
     I                                       16  18 KBAN6
     I                                       19  21 KBAN7
     I                                       22  24 KBAN8
     I                                       25  27 KBAN9
     I                                       28  30 KBAN10
     I                                       31  33 KBAN11
     I                                       34  36 KBAN12
     I                                       37  39 KBAN13
     I            DS
     I                                        1  13 KBAR
     I                                        1   1 KBAR1
     I                                        2   2 KBAR2
     I                                        3   3 KBAR3
     I                                        4   4 KBAR4
     I                                        5   5 KBAR5
     I                                        6   6 KBAR6
     I                                        7   7 KBAR7
     I                                        8   8 KBAR8
     I                                        9   9 KBAR9
     I                                       10  10 KBAR10
     I                                       11  11 KBAR11
     I                                       12  12 KBAR12
     I                                       13  13 KBAR13
     I            DS
     I                                        1  13 KHOJ
     I                                        1   1 KHOJ1
     I                                        2   2 KHOJ2
     I                                        3   3 KHOJ3
     I                                        4   4 KHOJ4
     I                                        5   5 KHOJ5
     I                                        6   6 KHOJ6
     I                                        7   7 KHOJ7
     I                                        8   8 KHOJ8
     I                                        9   9 KHOJ9
     I                                       10  10 KHOJ10
     I                                       11  11 KHOJ11
     I                                       12  12 KHOJ12
     I                                       13  13 KHOJ13
     I            DS
     I                                        1  13 HJYO
     I                                        1   1 HJYO1
     I                                        2   2 HJYO2
     I                                        3   3 HJYO3
     I                                        4   4 HJYO4
     I                                        5   5 HJYO5
     I                                        6   6 HJYO6
     I                                        7   7 HJYO7
     I                                        8   8 HJYO8
     I                                        9   9 HJYO9
     I                                       10  10 HJYO10
     I                                       11  11 HJYO11
     I                                       12  12 HJYO12
     I                                       13  13 HJYO13
     I            DS
     I                                        1 104 WDAY
     I                                        1   8 WDAY1
     I                                        9  16 WDAY2
     I                                       17  24 WDAY3
     I                                       25  32 WDAY4
     I                                       33  40 WDAY5
     I                                       41  48 WDAY6
     I                                       49  56 WDAY7
     I                                       57  64 WDAY8
     I                                       65  72 WDAY9
     I                                       73  80 WDAY10
     I                                       81  88 WDAY11
     I                                       89  96 WDAY12
     I                                       97 104 WDAY13
     I            DS
     I                                        1  65 WTIM
     I                                        1   5 WTIM1
     I                                        6  10 WTIM2
     I                                       11  15 WTIM3
     I                                       16  20 WTIM4
     I                                       21  25 WTIM5
     I                                       26  30 WTIM6
     I                                       31  35 WTIM7
     I                                       36  40 WTIM8
     I                                       41  45 WTIM9
     I                                       46  50 WTIM10
     I                                       51  55 WTIM11
     I                                       56  60 WTIM12
     I                                       61  65 WTIM13
     I            DS
     I                                        1   80M2SKHZ
     I                                        1   40M2SKYY
     I                                        5   60M2SKMM
     I                                        7   80M2SKDD
     I            DS
     I                                        1   5 WJIFUN
     I                                        1   2 WJI
     I                                        3   3 WK
     I                                        4   5 WFU
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80M1SAHZ
     I                                        1   40M1SAYY
     I                                        5   60M1SAMM
     I                                        7   80M1SADD
     I            DS
     I                                        1   80J2SKHZ
     I                                        1   40J2SKYY
     I                                        5   60J2SKMM
     I                                        7   80J2SKDD
     I            DS
     I                                        1   80J2KEHZ
     I                                        1   40J2KEIY
     I                                        5   60J2KEIM
     I                                        7   80J2KEID
     I            DS
     I                                        1   8 WTAG
     I                                        1   7 TAGNO
     I                                        8   8 CHK
     I            DS
     I                                        1   80J6SKHZ
     I                                        1   40J6SKYY
     I                                        5   60J6SKMM
     I                                        7   80J6SKDD
     I            DS
     I                                        1   80J6KEHZ
     I                                        1   40J6KEIY
     I                                        5   60J6KEIM
     I                                        7   80J6KEID
     I            DS
     I                                        1  14 WSHIN
     I                                        1   5 WSHN1
     I                                        6   6 HBAR1
     I                                        7  11 WSHN2
     I                                       12  12 HBAR2
     I                                       13  14 WSHN3
     I            DS
     I                                        1   80A3SYHZ
     I                                        1   40A3SYYY
     I                                        5   60A3SYMM
     I                                        7   80A3SYDD
      **********************
      *  DISPLAY 1 SCREEN  *
      **********************
     C           STEP1     TAG
     C                     MOVE *BLANK    INNO
     C                     MOVE *BLANK    FFLG    1
     C                     MOVE *BLANK    KFLG    1
     C                     MOVE *BLANK    KBNE
     C                     MOVE *BLANK    KBMN
     C                     MOVE *BLANK    KBAN
     C                     MOVE *BLANK    KBAR
     C                     MOVE *BLANK    KHOJ
     C                     MOVE *BLANK    HJYO
     C                     MOVE *BLANK    WDAY
     C                     MOVE *BLANK    WTIM
     C                     Z-ADD0         WKJCD   40
     C                     Z-ADD0         WSAYY   40
     C                     Z-ADD0         WSAMM   20
     C                     Z-ADD0         WSADD   20
     C                     MOVE *BLANK    WHYKU   1
     C                     MOVE *BLANK    WKIBN   3
     C                     MOVE *BLANK    WKIHS   1
     C                     MOVE *BLANK    WKTCD   3
     C                     MOVE *BLANK    WSYOR   1
     C                     MOVE *BLANK    WJIFUN
     C                     MOVE *BLANK    NOU
     C                     MOVE *BLANK    KOJ
     C                     MOVE *BLANK    UKE
     C                     MOVE *BLANK    SHIN
     C                     EXFMTMFBPW701
     C                     SETOF                     0199
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
      *
     C           INNO      IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STEP1
     C                     ENDIF
      *
     C           INNO      IFLT '1'
     C           INNO      ORGT '2'
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     GOTO STEP1
     C                     ENDIF
      *
     C           INNO      IFEQ '1'
     C                     EXSR DSP2
     C           KFLG      IFEQ 'C'
     C                     GOTO STEP1
     C                     ENDIF
     C                     ENDIF
      *
     C           INNO      IFEQ '2'
     C                     EXSR DSP3
     C           KFLG      IFEQ 'C'
     C                     GOTO STEP1
     C                     ENDIF
     C                     ENDIF
     C                     GOTO STEP1
      *
      **********************
      *  DISPLAY 2 SCREEN  *
      **********************
     C           DSP2      BEGSR
     C                     MOVE *BLANK    TAGNO
     C           DSP21     TAG
     C                     EXFMTMFBPW702
     C                     SETOF                     0299
      *
     C           *INKC     IFEQ '1'
     C                     MOVE 'C'       KFLG
     C                     GOTO ENDDP2
     C                     ENDIF
      *
     C           TAGNO     IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     GOTO DSP21
     C                     ENDIF
      *
      *
     C           TAGNO     SETLLMFBPL421
     C                     DO   *HIVAL
     C                     SETOF                     30
     C           TAGNO     READEMFBPL421                 30
      *
     C           *IN30     IFEQ '0'
     C           M2SKJY    IFEQ 'D'
     C           M2SKHZ    ANDLE*DATE
     C                     GOTO NDAT1
     C                     ENDIF
     C                     Z-ADDM2KJCD    WKJCD
     C                     Z-ADDM2SAYY    WSAYY
     C                     Z-ADDM2SAMM    WSAMM
     C                     Z-ADDM2SADD    WSADD
     C                     MOVE M2HYKU    WHYKU
     C                     MOVE M2KIBN    WKIBN
     C                     MOVE M2KIHS    WKIHS
     C                     MOVE M2KTCD    WKTCD
     C                     MOVE M2SYOR    WSYOR
      *
     C           TAGNO     SETLLMFBPL431
     C                     DO   *HIVAL
     C                     SETOF                     50
     C           TAGNO     READEMFBPL431                 50
     C           *IN50     IFEQ '0'
     C           M2SKJY    IFEQ 'D'
     C           M2SKHZ    ANDLE*DATE
     C                     GOTO NDAT2
     C                     ENDIF
     C           M2KTCD    IFNE WKTCD
     C                     SETON                     50
     C                     GOTO NDAT2
     C                     ENDIF
     C           M2KTCD    IFEQ WKTCD
     C           M2SAYY    ANDGEWSAYY
     C           M2SAMM    ANDGEWSAMM
     C           M2SADD    ANDGEWSADD
     C           M2HYKU    ANDGEWHYKU
     C                     Z-ADDM2KJCD    WKJCD
     C                     Z-ADDM2SAYY    WSAYY
     C                     Z-ADDM2SAMM    WSAMM
     C                     Z-ADDM2SADD    WSADD
     C                     MOVE M2HYKU    WHYKU
     C                     MOVE M2KIBN    WKIBN
     C                     MOVE M2KIHS    WKIHS
     C                     MOVE M2KTCD    WKTCD
     C                     MOVE M2SYOR    WSYOR
     C                     MOVE '*'       FFLG
     C                     EXSR FILECH
     C                     ENDIF
     C                     ENDIF
     C           NDAT2     TAG
     C  N50                ENDDO
      *
     C                     MOVE '*'       FFLG
     C                     EXSR FILECH
     C                     ENDIF
     C           NDAT1     TAG
     C  N30                ENDDO
      *
     C           FFLG      IFEQ *BLANK
     C           TAGNO     SETLLMFBPL431
     C                     DO   *HIVAL
     C                     SETOF                     50
     C           TAGNO     READEMFBPL431                 50
     C           *IN50     IFEQ '0'
     C           M2SKJY    IFEQ 'D'
     C           M2SKHZ    ANDLE*DATE
     C                     GOTO NDAT21
     C                     ENDIF
     C                     Z-ADDM2KJCD    WKJCD
     C                     Z-ADDM2SAYY    WSAYY
     C                     Z-ADDM2SAMM    WSAMM
     C                     Z-ADDM2SADD    WSADD
     C                     MOVE M2HYKU    WHYKU
     C                     MOVE M2KIBN    WKIBN
     C                     MOVE M2KIHS    WKIHS
     C                     MOVE M2KTCD    WKTCD
     C                     MOVE M2SYOR    WSYOR
     C                     MOVE '*'       FFLG
     C                     EXSR FILECH
     C                     ENDIF
     C           NDAT21    TAG
     C  N50                ENDDO
     C                     ENDIF
      *
      *
     C           FFLG      IFNE '*'
     C                     SETON                     0299
     C                     MOVE ER,2      MSG
     C                     GOTO DSP21
     C                     ENDIF
      *
     C                     EXSR BZTAG
     C                     EXSR DCTAG
     C                     EXSR DSP4
     C           ENDDP2    TAG
     C                     ENDSR
      **********************
      *  DISPLAY 3 SCREEN  *
      **********************
     C           DSP3      BEGSR
     C                     MOVE *BLANK    ZETNO
     C                     MOVE *BLANK    LOTNO
     C                     MOVE *BLANK    PAGNO
     C           DSP31     TAG
     C                     EXFMTMFBPW703
     C                     SETOF                     030405
     C                     SETOF                     99
      *
     C           *INKC     IFEQ '1'
     C                     MOVE 'C'       KFLG
     C                     GOTO ENDDP3
     C                     ENDIF
      *
     C           ZETNO     IFEQ *BLANK
     C                     SETON                     0399
     C                     MOVE ER,4      MSG
     C                     GOTO DSP31
     C                     ENDIF
      *
     C           LOTNO     IFEQ *BLANK
     C                     SETON                     0499
     C                     MOVE ER,4      MSG
     C                     GOTO DSP31
     C                     ENDIF
      *
     C           PAGNO     IFEQ *BLANK
     C                     SETON                     0599
     C                     MOVE ER,4      MSG
     C                     GOTO DSP31
     C                     ENDIF
      *
     C           KEY1      KLIST
     C                     KFLD           ZETNO
     C                     KFLD           LOTNO
      *
     C           KEY1      SETLLMFBPL441
     C                     DO   *HIVAL
     C                     SETOF                     30
     C           KEY1      READEMFBPL441                 30
      *
     C           *IN30     IFEQ '0'
     C           M2SKJY    IFEQ 'D'
     C           M2SKHZ    ANDLE*DATE
     C                     GOTO NDAT3
     C                     ENDIF
     C           M2PAG1    IFNE PAGNO
     C           M2PAG2    ANDNEPAGNO
     C           M2PAG3    ANDNEPAGNO
     C           M2PAG4    ANDNEPAGNO
     C                     GOTO NDAT3
     C                     ENDIF
     C                     MOVE '*'       FFLG
     C                     Z-ADDM2KJCD    WKJCD
     C                     Z-ADDM2SAYY    WSAYY
     C                     Z-ADDM2SAMM    WSAMM
     C                     Z-ADDM2SADD    WSADD
     C                     MOVE M2HYKU    WHYKU
     C                     MOVE M2KIBN    WKIBN
     C                     MOVE M2KIHS    WKIHS
     C                     MOVE M2KTCD    WKTCD
     C                     MOVE M2SYOR    WSYOR
     C                     MOVE M2TAG1    TAGNO
     C                     EXSR FILECH
     C                     ENDIF
     C           NDAT3     TAG
     C  N30                ENDDO
      *
     C           FFLG      IFNE '*'
     C                     SETON                     030405
     C                     SETON                     99
     C                     MOVE ER,2      MSG
     C                     GOTO DSP31
     C                     ENDIF
      *
     C                     EXSR BZLOT
     C                     EXSR DCLOT
     C                     EXSR SIP
     C                     EXSR DSP4
     C           ENDDP3    TAG
     C                     ENDSR
      **********************
      *     FILE CHAIN     *
      **********************
     C           FILECH    BEGSR
      *
     C           KEY2      KLIST
     C                     KFLD           WKJCD
     C                     KFLD           WSAYY
     C                     KFLD           WSAMM
     C                     KFLD           WSADD
     C                     KFLD           WHYKU
     C                     KFLD           WKIBN
     C                     KFLD           WKIHS
     C                     KFLD           WKTCD
      *
     C                     MOVE *BLANK    FFLG
     C                     SETOF                     30
     C           KEY2      CHAINMFBPL08              30
      *
     C           *IN30     IFEQ '1'
     C                     GOTO NDAT4
     C                     ENDIF
      *
     C           *IN30     IFEQ '0'
     C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     GOTO NDAT4
     C                     ENDIF
      *
     C                     Z-ADD0         A       20
     C                     Z-ADD1         B       20
     C                     SETOF                     40
     C           M1KTCD    LOKUPTB1,B                    40
     C           *IN40     IFEQ '1'
     C                     Z-ADDTB2,B     A
     C                     EXSR FGB
     C                     MOVE M1KJCD    KBMN,A
     C                     MOVE M1KIBN    KBAN,A
     C                     MOVE M1KIHS    KHOJ,A
     C                     MOVE M1HYKU    HJYO,A
     C                     MOVE M1SAHZ    WDAY,A
     C           WSYOR     IFEQ '1'
     C           A         ADD  5         C       20
     C                     MOVEA'1'       *IN,C
     C                     ENDIF
     C           M1KIHS    IFNE *BLANK
     C                     MOVE '-'       KBAR,A
     C                     ENDIF
     C                     ELSE
     C                     GOTO NDAT4
     C                     ENDIF
      *
     C                     MOVE '*'       FFLG
     C                     ENDIF
      *
     C           NDAT4     TAG
     C                     ENDSR
      **********************
      *  DISPLAY 4 SCREEN  *
      **********************
     C           DSP4      BEGSR
     C                     MOVE TAGNO     TAG1
     C                     EXFMTMFBPW704
     C                     MOVEA'00000000'*IN,6
     C                     MOVEA'00000'   *IN,14
     C                     ENDSR
      **********************
      *  FACTORY NAME      *
      **********************
     C           FGB       BEGSR
     C                     SETOF                     50
     C           WKJCD     CHAINFGBPL011             50
     C           *IN50     IFEQ '1'
     C                     MOVE *BLANK    KBNE,A
     C                     ENDIF
     C           *IN50     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVE *BLANK    KBNE,A
     C                     ENDIF
     C                     MOVELB2SMEI    KBNE,A
     C                     ENDIF
     C                     ENDSR
      **********************
      *  BZ(AJSPP20)       *
      **********************
     C           BZTAG     BEGSR
     C                     MOVELTAGNO     PMAREA100
     C                     MOVEL'007'     PMBYTE  3
     C                     MOVEL*BLANK    PMCHK   1
     C                     MOVEL*BLANK    PMRTCD  1
     C                     Z-ADD0         WKEHZ   80
     C                     Z-ADD0         WKEIJ   20
     C                     Z-ADD0         WKEIF   20
     C                     MOVE *BLANK    WSAIK   1
     C                     MOVE *BLANK    WSHIN
     C                     MOVE *BLANK    FFLG
     C                     EXSR CDCAL
     C           WTAG      SETGTAJSPL281
     C                     DO   *HIVAL
     C                     SETOF                     30
     C           WTAG      REDPEAJSPL281                 30
      *
     C           *IN30     IFEQ '0'
     C           J2SKJY    IFEQ 'D'
     C           J2SKHZ    ANDLE*DATE
     C                     GOTO NDAT5
     C                     ENDIF
      *
     C                     MOVE J2KEHZ    WKEHZ
     C                     MOVE J2KEIJ    WKEIJ
     C                     MOVE J2KEIF    WKEIF
     C                     MOVE J2SAIK    WSAIK
     C                     MOVE J2HIN1    WSHN1
     C                     MOVE J2HIN2    WSHN2
     C                     MOVE J2HIN3    WSHN3
     C                     MOVE '-'       HBAR1
     C           WSHN3     IFNE *BLANK
     C                     MOVE '-'       HBAR2
     C                     ENDIF
      *
     C           WTAG      SETGTAJSPL291
     C                     DO   *HIVAL
     C                     SETOF                     50
     C           WTAG      REDPEAJSPL291                 50
     C           *IN50     IFEQ '0'
     C           J2SKJY    IFEQ 'D'
     C           J2SKHZ    ANDLE*DATE
     C                     GOTO NDAT51
     C                     ENDIF
      *
     C           J2KEHZ    IFGE WKEHZ
     C           J2KEIJ    ANDGEWKEIJ
     C           J2KEIF    ANDGEWKEIF
     C                     MOVE J2KEHZ    WKEHZ
     C                     MOVE J2KEIJ    WKEIJ
     C                     MOVE J2KEIF    WKEIF
     C                     MOVE J2SAIK    WSAIK
     C                     MOVE J2HIN1    WSHN1
     C                     MOVE J2HIN2    WSHN2
     C                     MOVE J2HIN3    WSHN3
     C                     MOVE '-'       HBAR1
     C           WSHN3     IFNE *BLANK
     C                     MOVE '-'       HBAR2
     C                     ENDIF
     C                     ENDIF
      *
     C                     SETON                     50
     C                     ENDIF
     C           NDAT51    TAG
     C  N50                ENDDO
      *
     C                     MOVE '*'       FFLG
     C                     SETON                     30
     C                     ENDIF
     C           NDAT5     TAG
     C  N30                ENDDO
      *
     C           FFLG      IFNE '*'
     C           WTAG      SETGTAJSPL291
     C                     DO   *HIVAL
     C                     SETOF                     50
     C           WTAG      REDPEAJSPL291                 50
     C           *IN50     IFEQ '0'
     C           J2SKJY    IFEQ 'D'
     C           J2SKHZ    ANDLE*DATE
     C                     GOTO NDAT52
     C                     ENDIF
      *
     C                     MOVE J2KEHZ    WKEHZ
     C                     MOVE J2KEIJ    WKEIJ
     C                     MOVE J2KEIF    WKEIF
     C                     MOVE J2SAIK    WSAIK
     C                     MOVE J2HIN1    WSHN1
     C                     MOVE J2HIN2    WSHN2
     C                     MOVE J2HIN3    WSHN3
     C                     MOVE '-'       HBAR1
     C           WSHN3     IFNE *BLANK
     C                     MOVE '-'       HBAR2
     C                     ENDIF
     C                     MOVE '*'       FFLG
      *
     C                     SETON                     50
     C                     ENDIF
     C           NDAT52    TAG
     C  N50                ENDDO
     C                     ENDIF
      *
     C           FFLG      IFEQ '*'
     C                     MOVEL'I A F'   KBNE8
     C                     MOVE '0111'    KBMN8
     C                     MOVE 'A01'     KBAN8
     C                     MOVE WKEHZ     WDAY8
     C                     MOVE WKEIJ     WJI
     C                     MOVE WKEIF     WFU
     C                     MOVE ':'       WK
     C                     MOVE WJIFUN    WTIM8
     C                     MOVE WSHIN     SHIN
     C           WSAIK     IFEQ '1'
     C                     SETON                     13
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
     C** CDCAL *****************
     C* CHECK DEGIT CALUCULATE *
     C**************************
     C           CDCAL     BEGSR
     C                     MOVE *BLANK    CHK     1
     C                     CALL 'ALBRCC'
     C                     PARM           PMAREA
     C                     PARM           PMBYTE
     C                     PARM           PMCHK
     C                     PARM           PMRTCD
     C                     MOVE PMCHK     CHK
     C                     ENDSR
      **********************
      *  BZ(AJSPL25)       *
      **********************
     C           BZLOT     BEGSR
     C                     Z-ADD0         WKEHZ
     C                     Z-ADD0         WKEIJ
     C                     Z-ADD0         WKEIF
     C                     MOVE *BLANK    WSAIK
     C                     MOVE *BLANK    WSHIN
     C                     MOVE *BLANK    FFLG
     C           KEY1      SETGTAJSPL251
     C                     DO   *HIVAL
     C                     SETOF                     30
     C           KEY1      REDPEAJSPL251                 30
      *
     C           *IN30     IFEQ '0'
     C           J2SKJY    IFEQ 'D'
     C           J2SKHZ    ANDLE*DATE
     C                     GOTO NDAT6
     C                     ENDIF
      *
     C           J2PAG1    IFNE PAGNO
     C           J2PAG2    ANDNEPAGNO
     C           J2PAG3    ANDNEPAGNO
     C           J2PAG4    ANDNEPAGNO
     C                     GOTO NDAT6
     C                     ENDIF
     C                     MOVEL'I A F'   KBNE8
     C                     MOVE '0111'    KBMN8
     C                     MOVE 'A01'     KBAN8
     C                     MOVE J2KEHZ    WDAY8
     C                     MOVE J2KEIJ    WJI
     C                     MOVE J2KEIF    WFU
     C                     MOVE ':'       WK
     C                     MOVE WJIFUN    WTIM8
     C                     MOVE J2SAIK    WSAIK
     C                     MOVE J2HIN1    WSHN1
     C                     MOVE J2HIN2    WSHN2
     C                     MOVE J2HIN3    WSHN3
     C                     MOVE '-'       HBAR1
     C           WSHN3     IFNE *BLANK
     C                     MOVE '-'       HBAR2
     C                     ENDIF
     C                     MOVE WSHIN     SHIN
      *
     C                     MOVE '*'       FFLG
     C                     SETON                     30
     C                     ENDIF
     C           NDAT6     TAG
     C  N30                ENDDO
      *
     C           WSAIK     IFEQ '1'
     C                     SETON                     13
     C                     ENDIF
     C                     ENDSR
      **********************
      *  DC(AJSPP60)       *
      **********************
     C           DCTAG     BEGSR
     C                     MOVELTAGNO     PMAREA
     C                     MOVEL'007'     PMBYTE
     C                     MOVEL*BLANK    PMCHK
     C                     MOVEL*BLANK    PMRTCD
     C                     Z-ADD0         WKEHZ
     C                     Z-ADD0         WKEIJ
     C                     Z-ADD0         WKEIF
     C                     MOVE *BLANK    WSAIK
     C                     MOVE *BLANK    WSHIN
     C                     MOVE *BLANK    FFLG
     C                     EXSR CDCAL
     C           WTAG      SETGTAJSPL681
     C                     DO   *HIVAL
     C                     SETOF                     30
     C           WTAG      REDPEAJSPL681                 30
      *
     C           *IN30     IFEQ '0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    ANDLE*DATE
     C                     GOTO NDAT7
     C                     ENDIF
      *
     C                     MOVE J6KEHZ    WKEHZ
     C                     MOVE J6KEIJ    WKEIJ
     C                     MOVE J6KEIF    WKEIF
     C                     MOVE J6SAIK    WSAIK
     C                     MOVE J6HIN1    WSHN1
     C                     MOVE J6HIN2    WSHN2
     C                     MOVE J6HIN3    WSHN3
     C                     MOVE '-'       HBAR1
     C           WSHN3     IFNE *BLANK
     C                     MOVE '-'       HBAR2
     C                     ENDIF
      *
     C           WTAG      SETGTAJSPL691
     C                     DO   *HIVAL
     C                     SETOF                     50
     C           WTAG      REDPEAJSPL691                 50
     C           *IN50     IFEQ '0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    ANDLE*DATE
     C                     GOTO NDAT71
     C                     ENDIF
      *
     C           J6KEHZ    IFGE WKEHZ
     C           J6KEIJ    ANDGEWKEIJ
     C           J6KEIF    ANDGEWKEIF
     C                     MOVE J6KEHZ    WKEHZ
     C                     MOVE J6KEIJ    WKEIJ
     C                     MOVE J6KEIF    WKEIF
     C                     MOVE J6SAIK    WSAIK
     C                     MOVE J6HIN1    WSHN1
     C                     MOVE J6HIN2    WSHN2
     C                     MOVE J6HIN3    WSHN3
     C                     MOVE '-'       HBAR1
     C           WSHN3     IFNE *BLANK
     C                     MOVE '-'       HBAR2
     C                     ENDIF
     C                     ENDIF
      *
     C                     SETON                     50
     C                     ENDIF
     C           NDAT71    TAG
     C  N50                ENDDO
      *
     C                     MOVE '*'       FFLG
     C                     SETON                     30
     C                     ENDIF
     C           NDAT7     TAG
     C  N30                ENDDO
      *
     C           FFLG      IFNE '*'
     C           WTAG      SETGTAJSPL691
     C                     DO   *HIVAL
     C                     SETOF                     50
     C           WTAG      REDPEAJSPL691                 50
     C           *IN50     IFEQ '0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    ANDLE*DATE
     C                     GOTO NDAT72
     C                     ENDIF
      *
     C                     MOVE J6KEHZ    WKEHZ
     C                     MOVE J6KEIJ    WKEIJ
     C                     MOVE J6KEIF    WKEIF
     C                     MOVE J6SAIK    WSAIK
     C                     MOVE J6HIN1    WSHN1
     C                     MOVE J6HIN2    WSHN2
     C                     MOVE J6HIN3    WSHN3
     C                     MOVE '-'       HBAR1
     C           WSHN3     IFNE *BLANK
     C                     MOVE '-'       HBAR2
     C                     ENDIF
     C                     MOVE '*'       FFLG
      *
     C                     SETON                     50
     C                     ENDIF
     C           NDAT72    TAG
     C  N50                ENDDO
     C                     ENDIF
      *
     C           FFLG      IFEQ '*'
     C                     MOVEL'I A F'   KBNE9
     C                     MOVE '0111'    KBMN9
     C                     MOVE 'D01'     KBAN9
     C                     MOVE WKEHZ     WDAY9
     C                     MOVE WKEIJ     WJI
     C                     MOVE WKEIF     WFU
     C                     MOVE ':'       WK
     C                     MOVE WJIFUN    WTIM9
     C                     MOVE WSHIN     SHIN
     C           WSAIK     IFEQ '1'
     C                     SETON                     14
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
      **********************
      *  DZ(AJSPL65)       *
      **********************
     C           DCLOT     BEGSR
     C                     Z-ADD0         WKEHZ
     C                     Z-ADD0         WKEIJ
     C                     Z-ADD0         WKEIF
     C                     MOVE *BLANK    WSAIK
     C                     MOVE *BLANK    WSHIN
     C                     MOVE *BLANK    FFLG
      *
     C           KEY1      SETGTAJSPL651
     C                     DO   *HIVAL
     C                     SETOF                     30
     C           KEY1      REDPEAJSPL651                 30
      *
     C           *IN30     IFEQ '0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    ANDLE*DATE
     C                     GOTO NDAT8
     C                     ENDIF
      *
     C           J6PAG1    IFNE PAGNO
     C           J6PAG2    ANDNEPAGNO
     C           J6PAG3    ANDNEPAGNO
     C           J6PAG4    ANDNEPAGNO
     C                     GOTO NDAT8
     C                     ENDIF
     C                     MOVEL'I A F'   KBNE9
     C                     MOVE '0111'    KBMN9
     C                     MOVE 'D01'     KBAN9
     C                     MOVE J6KEHZ    WDAY9
     C                     MOVE J6KEIJ    WJI
     C                     MOVE J6KEIF    WFU
     C                     MOVE ':'       WK
     C                     MOVE WJIFUN    WTIM9
     C                     MOVE J6SAIK    WSAIK
     C                     MOVE J6HIN1    WSHN1
     C                     MOVE J6HIN2    WSHN2
     C                     MOVE J6HIN3    WSHN3
     C                     MOVE '-'       HBAR1
     C           WSHN3     IFNE *BLANK
     C                     MOVE '-'       HBAR2
     C                     ENDIF
     C                     MOVE WSHIN     SHIN
     C                     MOVE '*'       FFLG
     C                     SETON                     30
     C                     ENDIF
     C           NDAT8     TAG
     C  N30                ENDDO
      *
     C           WSAIK     IFEQ '1'
     C                     SETON                     13
     C                     ENDIF
     C                     ENDSR
      **********************
      *  SIP(ALDPP30)      *
      **********************
     C           SIP       BEGSR
     C           KEY3      KLIST
     C                     KFLD           ZETNO
     C                     KFLD           LOTNO
     C                     KFLD           PAGNO
     C                     SETOF                     30
     C           KEY3      CHAINALDPL301             30
     C           *IN30     IFEQ '0'
     C                     MOVEL'I A F'   KBNE13
     C                     MOVE A3NONY    NOU
     C                     MOVE A3NKOJ    KOJ
     C                     MOVE A3NUKE    UKE
     C                     MOVE A3SYHZ    WDAY13
     C                     MOVE A3SYJI    WJI
     C                     MOVE A3SYFN    WFU
     C                     MOVE ':'       WK
     C                     MOVE WJIFUN    WTIM13
     C                     MOVE A3SHN1    WSHN1
     C                     MOVE A3SHN2    WSHN2
     C                     MOVE A3SHN3    WSHN3
     C                     MOVE '-'       HBAR1
     C           WSHN3     IFNE *BLANK
     C                     MOVE '-'       HBAR2
     C                     ENDIF
     C                     MOVE WSHIN     SHIN
     C                     ENDIF
     C                     ENDSR
**  ER
E-01 NO. ISN'T IT. INPUT IT.
E-02 THE INPUT VALUE IS DIFFERENT.
E-03 MATERIAL TAG NO. ISN'T IT. INPUT IT.
E-04 A-PICS LOT NO. ISN'T IT. INPUT IT.
**  TB1(PROCESS NO.) TB2(PROCESS CODE)
WD 01
HD 02
LAN03
RL 04
AOQ05
OQ 06
SK 07
BZ 08
DC 09
JC 10
KRO11
KW 12
SIP13
