     H            Y.
     F** MFBR81 *********************************/
     F* ..LIST OF WORK DAILY BULLETIN DATA..    */
     F*       CREATE DATE : 1998.01.14          */
     F*       CODING      : K.OKACHI.           */
     F*******************************************/
     FMFBWP81 IP  F     200            DISK
     FFGBPL01 IF  E           K        DISK
     FMFAPL22 IF  E           K        DISK
     FMFAPL26 IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
     E                    TITLE   1   1 60
      *
     IMFBWP81 AA
     I                                        1   40WKJCD
     I                                        5   5 WKACD
     I                                        6   6 WRICD
     I                                        7   7 WHNCD
     I                                        8  10 WKTCD
     I                                       11  13 WKIBN L1
     I                                       14  14 WKIHS L1
     I                                       15  18 WSAGY
     I                                       19  22 WSAYY
     I                                       23  24 WSAMM
     I                                       25  26 WSADD
     I                                       27  27 WHYKU
     I                                       28  300WDNTI
     I                                       31  330WTYTI
     I                                       34  360WDMTI
     I                                       37  390WZITI
     I                                       40  420WZMTI
     I                                       43  450WKNTI
     I                                       46  480WKTTI
     I                                       49  510WKSTI
     I                                       52  540WTKTI
     I                                       55  570WTSTI
     I                                       58  640WDEKI
     I                                       65  701WDEKG
     I                                       71  730WDNKI
     I                                       74  761WKADU
     I                                       77  790WMUHK
     I                                       80  860WMUHN
     I                                       87  921WMUHG
     I                                       93  990WHURY
     I                                      100 1051WHURG
     I                                      106 108 WKIGN
     I                                      109 1090WBISU
     I                                      110 115 WWKCD
     I                                      116 1230WSDAT
     I                                      124 1310WEDAT
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
      *
     C           *IN77     IFEQ '0'
     C                     Z-ADD0         SA      42
     C                     Z-ADD0         SB      42
     C                     Z-ADD0         SC      42
     C                     Z-ADD0         SE      42
     C                     Z-ADD0         SF      42
     C                     Z-ADD0         SG      42
     C                     Z-ADD0         SH      42
     C                     Z-ADD0         SDEKI   90
     C                     Z-ADD0         SDEKG   81
     C                     Z-ADD0         SDNKI   50
     C                     Z-ADD0         SMUHN   90
     C                     Z-ADD0         SMUHG   81
     C                     Z-ADD0         SHURY   90
     C                     Z-ADD0         SHURG   81
     C                     Z-ADD0         WSBEKI 102
     C                     Z-ADD0         WSKADO  62
     C                     Z-ADD0         WSSETU 112
     C                     Z-ADD0         SBEKI   52
     C                     Z-ADD0         SKADO   52
     C                     Z-ADD0         SSETU   52
     C                     Z-ADD0         SKADU   51
     C                     Z-ADD0         CNT     50
     C                     MOVE *BLANK    WKJNM  15
     C                     SETOF                     70
     C           WKJCD     CHAINFGBPL011             70
     C           *IN70     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     70
     C                     ENDIF
     C           *IN70     IFEQ '0'
     C                     MOVE B2SMEI    WKJNM
     C                     ENDIF
     C                     TIME           WTIME   60
     C                     EXCPTHD
     C                     SETON                     77
     C                     ENDIF
      *
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     ENDIF
      *
     C                     SETOF                     808182
      *
     C           WHYKU     IFEQ '1'
     C                     SETON                     80
     C                     ENDIF
     C           WHYKU     IFEQ '2'
     C                     SETON                     81
     C                     ENDIF
     C           WHYKU     IFEQ '3'
     C                     SETON                     82
     C                     ENDIF
      *
     C                     Z-ADD0         W       60
     C           KEY1      KLIST
     C                     KFLD           WKJCD
     C                     KFLD           WKIBN
     C                     KFLD           WKIHS
     C                     SETOF                     70
     C           KEY1      CHAINMFAPL22              70
     C           *IN70     IFEQ '1'
     C           KEY1      CHAINMFAPL26              70
     C           *IN70     IFEQ '0'
     C                     Z-ADDM@RPMH    W
     C                     ELSE
     C                     Z-ADD1         W
     C                     ENDIF
     C                     ELSE
     C                     Z-ADDM@RPMH    W
     C                     ENDIF
      *
     C                     Z-ADD0         Z       81
     C           WHURY     IFEQ 0
     C                     Z-ADDWHURG     Z
     C                     ELSE
     C                     Z-ADDWHURY     Z
     C                     ENDIF
      *
     C                     Z-ADD0         Y       81
     C           WDEKI     IFEQ 0
     C                     Z-ADDWDEKG     Y
     C                     ELSE
     C                     Z-ADDWDEKI     Y
     C                     ENDIF
      *
     C                     Z-ADD0         BEKI1   81
     C           Y         SUB  Z         BEKI1
     C                     Z-ADD0         A       42
     C                     Z-ADD0         B       42
     C                     Z-ADD0         C       42
     C                     Z-ADD0         D       42
     C                     Z-ADD0         E       42
     C                     Z-ADD0         F       42
     C                     Z-ADD0         G       42
     C                     Z-ADD0         H       42
     C           WDNTI     DIV  60        A
     C           WTYTI     DIV  60        B
     C           WDMTI     DIV  60        C
     C           WZITI     DIV  60        D
     C           WZMTI     DIV  60        E
     C           WKNTI     DIV  60        F
     C           WKTTI     DIV  60        G
     C           WKSTI     DIV  60        H
     C                     Z-ADD0         X       31
     C                     Z-ADDWKADU     X
     C                     Z-ADD0         BEKI2   82
     C           X         SUB  F         BEKI2
     C                     SUB  C         BEKI2
     C                     SUB  E         BEKI2
     C                     SUB  G         BEKI2
     C                     SUB  A         BEKI2
     C                     SUB  B         BEKI2
     C                     SUB  D         BEKI2
     C                     SUB  H         BEKI2
     C                     MULT W         BEKI2
     C                     Z-ADD0         XX     104
     C*                    Z-ADD0         BEKI    82
     C                     Z-ADD0         BEKI    52
     C           BEKI2     IFNE 0
     C           BEKI1     DIV  BEKI2     XX
     C           XX        MULT 100       BEKI
     C                     ELSE
     C                     Z-ADD0         BEKI
     C                     END
      *
     C                     Z-ADD0         KADO    52
     C                     Z-ADD0         KADO1   42
     C                     Z-ADD0         KADO2   42
     C                     Z-ADD0         YY      64
     C           X         SUB  F         KADO1
     C                     SUB  C         KADO1
     C                     SUB  E         KADO1
     C                     SUB  G         KADO1
     C                     SUB  A         KADO1
     C                     SUB  B         KADO1
     C                     SUB  D         KADO1
     C                     SUB  H         KADO1
     C           X         SUB  F         KADO2
     C                     SUB  C         KADO2
     C                     SUB  E         KADO2
     C                     SUB  G         KADO2
     C           KADO2     IFNE 0
     C           KADO1     DIV  KADO2     YY
     C           YY        MULT 100       KADO
     C                     ELSE
     C                     Z-ADD0         KADO
     C                     END
      *
     C                     Z-ADD0         ZZ     114
     C                     Z-ADD0         SETU    52
     C                     Z-ADD0         SETU1   82
     C           X         SUB  F         SETU1
     C                     MULT W         SETU1
     C           SETU1     IFNE 0
     C           BEKI1     DIV  SETU1     ZZ
     C           ZZ        MULT 100       SETU
     C                     ELSE
     C                     Z-ADD0         SETU
     C                     END
      *
     C                     EXCPTMEI
     C                     ADD  1         CNT
      *
     C                     ADD  A         SA
     C                     ADD  B         SB
     C                     ADD  C         SC
     C                     ADD  E         SE
     C                     ADD  F         SF
     C                     ADD  G         SG
     C                     ADD  H         SH
     C                     ADD  WDEKI     SDEKI
     C                     ADD  WDEKG     SDEKG
     C                     ADD  WDNKI     SDNKI
     C                     ADD  WMUHN     SMUHN
     C                     ADD  WMUHG     SMUHG
     C                     ADD  WHURY     SHURY
     C                     ADD  WHURG     SHURG
     C                     ADD  BEKI      WSBEKI
     C                     ADD  KADO      WSKADO
     C                     ADD  SETU      WSSETU
     C                     ADD  WKADU     SKADU
     CL1         WSBEKI    DIV  CNT       SBEKI
     CL1         WSKADO    DIV  CNT       SKADO
     CL1         WSSETU    DIV  CNT       SSETU
     CL1                   EXCPTGOU
     CL1                   Z-ADD0         SA
     CL1                   Z-ADD0         SB
     CL1                   Z-ADD0         SC
     CL1                   Z-ADD0         SE
     CL1                   Z-ADD0         SF
     CL1                   Z-ADD0         SG
     CL1                   Z-ADD0         SH
     CL1                   Z-ADD0         SDEKI
     CL1                   Z-ADD0         SDEKG
     CL1                   Z-ADD0         SDNKI
     CL1                   Z-ADD0         SMUHN
     CL1                   Z-ADD0         SMUHG
     CL1                   Z-ADD0         SHURY
     CL1                   Z-ADD0         SHURG
     CL1                   Z-ADD0         SBEKI
     CL1                   Z-ADD0         SKADO
     CL1                   Z-ADD0         SSETU
     CL1                   Z-ADD0         SKADU
     CL1                   Z-ADD0         WSBEKI
     CL1                   Z-ADD0         WSKADO
     CL1                   Z-ADD0         WSSETU
     CL1                   Z-ADD0         CNT
      *
     OQPRINT  E  102           HD
     O                                   12 'PGM-MFBR81'
     O                                  191 '.....................'
     O        E  1             HD
     O                                    9 'FACTORY'
     O                         WKJCD     15
     O                         WKJNM     34
     O                                  191 '.         .         .'
     O        E  1             HD
     O                                    9 'SECTION'
     O                         WKACD     12
     O                                   18 'TEAM'
     O                         WRICD     21
     O                         TITLE    110
     O                                  139 'TIME'
     O                         WTIME    148 '  :  :  '
     O                                  191 '.         .         .'
     O        E  2             HD
     O                                    8 'PERIOD'
     O                         WSDAT     21 '    .  .  '
     O                                   24 '-'
     O                         WEDAT     36 '    .  .  '
     O                                  139 'DATE'
     O                         UDATE Y  148
     O                                  157 'PAGE'
     O                         PAGE1 Z  161
     O                                  191 '.....................'
     O        E  1             HD
     O                                    5 'MAC.'
     O                                   12 'PROC.'
     O                                   17 'DATE'
     O                                   24 'SHIFT'
     O                                   32 'KANBAN'
     O                                   42 'WAIT.'
     O                                   52 'MATER.'
     O                                   59 'DIE'
     O                                   69 'SETUP'
     O                                   78 'ADJU.'
     O                                   88 'TROUB.'
     O                                   94 'FACT'
     O                                  103 'FACT'
     O                                  112 'SET.'
     O                                  121 'UNINHA.'
     O                                  130 'UNINHA.'
     O                                  139 'DEFECT.'
     O                                  148 'DEFECT.'
     O                                  162 'PERFORMANCE'
     O                                  173 'OPERATION'
     O                                  185 'EQUIPMENT'
     O                                  196 'ACTUAL'
     O        E  1             HD
     O                                    4 'NO.'
     O                                   33 'WAITING'
     O                                   41 'TIME'
     O                                   51 'WAIT.'
     O                                   61 'WAIT.'
     O                                   68 'TIME'
     O                                   77 'TIME'
     O                                   86 'TIME'
     O                                   96 'VOLUME'
     O                                  105 'VOLUME'
     O                                  112 'FRE.'
     O                                  121 'PRODUC.'
     O                                  130 'PRODUC.'
     O                                  138 'NUMBER'
     O                                  147 'WEIGHT'
     O                                  160 'OPERATION'
     O                                  168 'RATE'
     O                                  185 'SYNTHESIS'
     O                                  197 'WORKING'
     O        E  2             HD
     O                                   30 'TIME'
     O                                   50 'TIME'
     O                                   60 'TIME'
     O                                   96 'NUMBER'
     O                                  105 'WEIGHT'
     O                                  120 'NUMBER'
     O                                  129 'WEIGHT'
     O                                  155 'RATE'
     O                                  171 'OF TIME'
     O                                  186 'EFFICIENCY'
     O                                  198 'HOURS(H)'
     O        E  1             MEI
     O                 L1      WKIBN      4
     O                 L1                 5 '-'
     O                 L1      WKIHS      6
     O                         WKTCD     11
     O                         WSAMM     15
     O                                   16 '.'
     O                         WSADD     18
     O                 80      WHYKU     21
     O                 81      WHYKU     22
     O                 82      WHYKU     23
     O                         F         31 '0 .  '
     O                         C         42 '0 .  '
     O                         E         51 '0 .  '
     O                         G         60 '0 .  '
     O                         A         69 '0 .  '
     O                         B         78 '0 .  '
     O                         H         87 '0 .  '
     O                         WDEKI Z   97
     O                         WDEKG M  107
     O                         WDNKI Z  111
     O                         WMUHN Z  121
     O                         WMUHG M  131
     O                         WHURY Z  139
     O                         WHURG M  149
     O                         BEKI  N  162
     O                         KADO  N  172
     O                         SETU  N  189
     O                         WKADU N  198
     O        E  2             GOU
     O                                   23 'MACHINE TOTAL'
     O                         SF        31 ' 0 .  '
     O                         SC        42 ' 0 .  '
     O                         SE        51 ' 0 .  '
     O                         SG        60 ' 0 .  '
     O                         SA        69 ' 0 .  '
     O                         SB        78 ' 0 .  '
     O                         SH        87 ' 0 .  '
     O                         SDEKI Z   97
     O                         SDEKG M  107
     O                         SDNKI Z  111
     O                         SMUHN Z  121
     O                         SMUHG M  131
     O                         SHURY Z  139
     O                         SHURG M  149
     O                         SBEKI N  162
     O                         SKADO N  172
     O                         SSETU N  189
     O                         SKADU N  198
**  TITLE
  ***  WORK DAILY BULLETIN DATA LIST  ***
