     H            Y.
     F** MFER40 **********************************
     F* ...INQUIRY OF WORKING DAILY REPORT STATISTIC FILE    *.
     F* PROGRAM ID. : MFER40. <RPG> *
     F* CREATE DATE. : APR.23,'91.               *
     F* AUTHOR.         : M...                   *
     F********************************** MFER40 **
     FMFEPW40 CF  E                    WORKSTN
     F                                        RRN   KSFILE DSP2R
     FMFBPL20 IF  E           K        DISK
     FMFAPL22 IF  E           K        DISK
     I            DS
     I                                        1   8 KOST
     I                                        1   2 KOST1
     I                                        3   3 KOSTA
     I                                        4   5 KOST2
     I                                        6   6 KOSTB
     I                                        7   8 KOST3
     I            DS
     I                                        1   60$$STHZ
     I                                        1   40$$STYY
     I                                        5   60$$STMM
     I            DS
     I                                        1   60$$ENHZ
     I                                        1   40$$ENYY
     I                                        5   60$$ENMM
     I            DS
     I                                        1   5 KBN
     I                                        1   3 KBN1
     I                                        4   4 KBNA
     I                                        5   5 KBN2
     I            DS
     I                                        1   80M2SKHZ
     I                                        1   40M2SKYY
     I                                        5   60M2SKMM
     I                                        7   80M2SKDD
     I            DS
     I                                        1   60M2DTHZ
     I                                        1   40M2DTYY
     I                                        5   60M2DTMM
     I            DS
     I                                        1   60$$YM
     I                                        1   40$$YY
     I                                        5   60$$MM
     C******************************************************
     C*  START  PROGRAM <MFER40>                           *
     C******************************************************
     C           KEY1      KLIST
     C                     KFLD           $$KOJO
     C                     KFLD           $$YY
     C                     KFLD           $$MM
     C*
     C           KEY2      KLIST
     C                     KFLD           $$KOJO
     C                     KFLD           M2KIBN
     C                     KFLD           M2KIHS
     C*
     C           *ENTRY    PLIST
     C                     PARM           $KOJO   4
     C                     PARM           $KBN    3
     C                     PARM           $YY     4
     C                     PARM           $MM     2
     C                     PARM           $KST1   2
     C                     PARM           $KST2   2
     C                     PARM           $KST3   2
     C*
     C                     MOVEL$KOJO     $$KOJO  40
     C                     MOVEL$KBN      $$KBN   3
     C                     MOVEL$YY       $$YY    40
     C                     MOVEL$MM       $$MM    20
     C                     MOVEL$KST1     $$KST1  2
     C                     MOVEL$KST2     $$KST2  2
     C                     MOVEL$KST3     $$KST3  2
     C*
     C                     MOVE *BLANK    KOST
     C                     MOVEL$$KST1    KOST1
     C                     MOVEL$$KST2    KOST2
     C                     MOVEL$$KST3    KOST3
     C           KOST2     IFNE *BLANK
     C                     MOVEL'-'       KOSTA
     C                     END
     C*
     C           KOST3     IFNE *BLANK
     C                     MOVEL'-'       KOSTB
     C                     END
     C*
     C                     Z-ADD0         YY
     C                     Z-ADD0         MM
     C                     MOVEL$$YY      YY
     C                     MOVEL$$MM      MM
     C*
     C*
     C           STP1      TAG
     C                     Z-ADD0         RRN     50
     C*  ﾅﾎﾞﾎｦbﾓ ﾃ]nﾜｰﾓ
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
     C*  ﾅﾎﾞﾎｦbﾓ ﾈｮn
     C           @LOOP     TAG
     C                     Z-ADD0         CNT     50
     C                     EXSR #SET
     C*  ﾅﾎﾞﾎｦbﾓ ﾛﾃｰnﾞ NO ﾈｮn
     C                     Z-ADD1         RCDNBR
     C******************************************************
     C*  EXFMT  (fﾞx] 2)                                   *
     C******************************************************
     C           STP2      TAG
     C                     WRITEDSP2X
     C                     MOVEA'1'       *IN,91
     C                     EXFMTDSP2C
     C                     MOVEA'0'       *IN,91
     C*
     C                     MOVEA'0'       *IN,44
     C                     MOVEA'0'       *IN,99
     C*
B001 C           *INKC     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
E001 C                     END
     C*  ﾜｰﾓ aｮﾎﾟ
B001 C           *IN,81    IFEQ '1'
     C                     Z-ADD0         CNT
     C                     EXSR ROLUP2
     C                     Z-ADDRRN       RCDNBR
B002 C           *IN,44    IFEQ '1'
     C                     MOVEA'1'       *IN,99
E002 C                     END
     C                     GOTO STP2
E001 C                     END
     C*  ﾅﾎﾞﾎｦbﾓ ﾛﾃｰnﾞ NO ﾈｮn
     C                     Z-ADD1         RCDNBR
     C*
     C                     GOTO STP2
     C******************************************************
     C           #SET      BEGSR                           *
     C******************************************************
     C*  ﾅﾎﾞﾎｦbﾓ ﾈｮn
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
     C*
     C           KEY1      SETLLMFBPL201
     C                     MOVE *BLANK    KBN
     C                     MOVE *BLANK    KOTE
     C                     Z-ADD0         RIT1
     C                     Z-ADD0         RIT2
     C                     Z-ADD0         RIT3
     C                     Z-ADD0         SRY1
     C                     Z-ADD0         SRY2
B001 C                     DO   *HIVAL
     C           KEY1      READEMFBPL201                 40
B002 C           *IN,40    IFEQ '0'
B003 C           M2SKJY    IFEQ 'D'
     C           M2SKHZ    ANDLEUDATE
     C                     GOTO @END
E003 C                     END
     C*
     C           M2DTHZ    CABNE$$YM      @END
     C*
     C           KEY2      CHAINMFAPL221             46
     C           *IN,46    CABEQ'1'       @END
     C*
     C           $KST1     CABNEM@COS1    @END
     C           $KST2     CABNEM@COS2    @END
     C           $KST3     CABNEM@COS3    @END
     C*
     C                     MOVELM2KIBN    KBN1
     C                     MOVELM2KIHS    KBN2
     C           KBN2      IFNE *BLANK
     C                     MOVEL'-'       KBNA
     C                     END
     C*
     C                     MOVELM2KTCD    KOTE
     C                     Z-ADDM2SIRT    RIT1
     C                     Z-ADDM2JIKA    RIT2
     C                     Z-ADDM2SOUG    RIT3
     C                     Z-ADDM2DKBI    SRY1
     C                     Z-ADDM2MHBI    SRY2
     C                     ADD  1         RRN
     C                     ADD  1         CNT
     C                     WRITEDSP2R
     C* MAX mﾞｰj <14>
     C           CNT       CABEQ14        @@@2
E002 C                     END
     C           @END      TAG
E001 C  N40                END
     C*
     C           @@@2      TAG
     C*  fﾞbnc mﾞｰj oﾆ
B001 C           RRN       IFEQ 0
     C                     MOVE 'DATA'    KBN
     C                     MOVEL'NO'      KOTE
     C                     Z-ADD0         RIT1
     C                     Z-ADD0         RIT2
     C                     Z-ADD0         RIT3
     C                     Z-ADD0         SRY1
     C                     Z-ADD0         SRY2
     C                     ADD  1         RRN
     C                     ADD  1         CNT
     C                     WRITEDSP2R
E001 C                     END
     C*
     C                     ENDSR
     C******************************************************
     C           ROLUP2    BEGSR                           *
     C******************************************************
     C                     MOVE *BLANK    KBN
     C                     MOVE *BLANK    KOTE
     C                     Z-ADD0         RIT1
     C                     Z-ADD0         RIT2
     C                     Z-ADD0         RIT3
     C                     Z-ADD0         SRY1
     C                     Z-ADD0         SRY2
     C                     Z-ADD0         CNT
     C                     MOVE *BLANK    SW      1
B001 C                     DO   *HIVAL
     C           KEY1      READEMFBPL201                 40
B002 C           *IN,40    IFEQ '0'
B003 C           M2SKJY    IFEQ 'D'
     C           M2SKHZ    ANDLEUDATE
     C                     GOTO @END2
E003 C                     END
     C*
     C           M2DTHZ    CABNE$$YM      @END2
     C*
     C           KEY2      CHAINMFAPL221             46
     C           *IN,46    CABEQ'1'       @END2
     C*
     C           $KST1     CABNEM@COS1    @END2
     C           $KST2     CABNEM@COS2    @END2
     C           $KST3     CABNEM@COS3    @END2
     C*
     C                     MOVELM2KIBN    KBN1
     C                     MOVELM2KIHS    KBN2
     C           KBN2      IFNE *BLANK
     C                     MOVEL'-'       KBNA
     C                     END
     C*
     C                     MOVEL'*'       SW
     C                     MOVELM2KTCD    KOTE
     C                     Z-ADDM2SIRT    RIT1
     C                     Z-ADDM2JIKA    RIT2
     C                     Z-ADDM2SOUG    RIT3
     C                     Z-ADDM2DKBI    SRY1
     C                     Z-ADDM2MHBI    SRY2
     C                     ADD  1         RRN
     C                     ADD  1         CNT
     C                     WRITEDSP2R
     C* MAX mﾞｰj <14>
     C           CNT       CABEQ14        @@@3
E002 C                     END
     C           @END2     TAG
E001 C  N40                END
     C*
     C           @@@3      TAG
     C*  fﾞbnc mﾞｰj oﾆ
B001 C           RRN       IFEQ 0
     C                     MOVE 'DATA'    KBN
     C                     MOVEL'NO'      KOTE
     C                     Z-ADD0         RIT1
     C                     Z-ADD0         RIT2
     C                     Z-ADD0         RIT3
     C                     Z-ADD0         SRY1
     C                     Z-ADD0         SRY2
     C                     ADD  1         RRN
     C                     ADD  1         CNT
     C                     WRITEDSP2R
E001 C                     END
     C*
     C           @ROLE2    TAG
     C*  ﾃﾛbﾆﾞｭc mﾞｰj oﾆ
B001 C           SW        IFEQ *BLANK
     C                     MOVEA'1'       *IN,44
E001 C                     END
     C*
     C                     ENDSR
