     H            Y.
     F** MRAR03 ************************************************
     F* PRINT PRODUCTION LIST                                  *
     F*    ITS.           2012.10.03                           *
     F**********************************************************
     FMRAWP01 IF  E                    DISK
     FFCEPL01 IF  E           K        DISK
     FAEBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OB     PRINTER
      *
     E                    KH          4 14
     E                    KK          4  7
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1   80W1PTA
     I                                        1   40W1PTAY
     I                                        5   60W1PTAM
     I                                        7   80W1PTAD
      *
     I            DS
     I                                        1   80W1TLHZ
     I                                        1   40W1TLYY
     I                                        5   60W1TLMM
     I                                        7   80W1TLDD
      *
     I            DS
     I                                        1   80W1PIHZ
     I                                        1   40W1PIYY
     I                                        5   60W1PIMM
     I                                        7   80W1PIDD
      *
     I            DS
     I                                        1   80W1STHZ
     I                                        1   40W1STYY
     I                                        5   60W1STMM
     I                                        7   80W1STDD
      *
     I            DS
     I                                        1   7 A2MEKI
     I                                        1   4 A2MEK1
     I                                        5   6 A2MEK2
     I                                        7   7 A2MEK3
      *
     I            DS
     I                                        1  14 WFKHN
     I                                        1   5 WFKHN1
     I                                        6   6 WFKF1
     I                                        7  11 WFKHN2
     I                                       12  12 WFKF2
     I                                       13  14 WFKHN3
      *
     I              'LOCAL PRODUCT'       C         PRKB1
     I              'PATH-THRU'           C         PRKB2
     I              'BLANK PATH-THRU'     C         PRKB3
     I              'LOCAL PURCHASE'      C         PRKB4
     I              'TOOL ARRIVAL DATE'   C         CMT01
     I              'PILOT INFORMATION'   C         CMT02
      *
      *----------------------------------------------------*
      *   KEY LIST        *
      *----------------------------------------------------*
      *
     C                     MOVEL*BLANK    INI     1
     C                     READ MRAWP011                 80
     C           *IN80     DOWEQ'0'
     C           INI       IFEQ *BLANK
     C                     EXCPTMCHK2
     C                     MOVEL'1'       INI
     C                     ENDIF
     C                     EXSR #SB500
     C                     READ MRAWP011                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     MOVEL*BLANK    O1TMEI  8
     C                     MOVELW1TMEI    O1TMEI
      *
     C                     MOVEL'-'       W1SF1   1
     C                     MOVEL'-'       W1SF2   1
     C           W1SHN3    IFEQ *BLANK
     C                     MOVEL*BLANK    W1SF2   1
     C                     ENDIF
      *
     C                     MOVEL'-'       W1MF1   1
     C                     MOVEL'-'       W1MF2   1
     C           W1MHN3    IFEQ *BLANK
     C                     MOVEL*BLANK    W1MF2   1
     C                     ENDIF
      *
     C                     MOVEL*BLANK    O1FACD  3
     C                     SELEC
     C           W1FACD    WHEQ '0111'
     C                     MOVEL'IAF'     O1FACD
     C           W1FACD    WHEQ '0094'
     C                     MOVEL'ATC'     O1FACD
     C           W1FACD    WHEQ '0170'
     C                     MOVEL'ACZ'     O1FACD
     C           W1FACD    WHEQ '0755'
     C                     MOVEL'AFS'     O1FACD
     C           W1FACD    WHEQ '0831'
     C                     MOVEL'AFD'     O1FACD
     C                     ENDSL
      *
     C                     MOVEL*BLANK    O1PRKB 15
     C                     MOVEL*BLANK    O1KT    7
     C                     SELEC
     C           W1PRKB    WHEQ '1'
     C                     MOVELPRKB1     O1PRKB
     C                     MOVEL*BLANK    O1KT
     C           W1PRKB    WHEQ '2'
     C                     MOVELPRKB2     O1PRKB
     C                     MOVEL'KN-8990' O1KT
     C           W1PRKB    WHEQ '3'
     C                     MOVELPRKB3     O1PRKB
     C                     MOVEL'KN-8990' O1KT
     C           W1PRKB    WHEQ '4'
     C                     MOVELPRKB4     O1PRKB
     C                     MOVEL*BLANK    O1KT
     C                     ENDSL
      *
     C                     MOVEL*BLANK    O1TL   17
     C           W1TLHZ    IFEQ 0
     C                     MOVEL*BLANK    O1TL
     C                     ELSE
     C                     MOVELCMT01     O1TL
     C                     ENDIF
     C                     MOVEL*BLANK    O1PI   17
     C           W1PIHZ    IFEQ 0
     C                     MOVEL*BLANK    O1PI
     C                     ELSE
     C                     MOVELCMT02     O1PI
     C                     ENDIF
      *
     C           KEYEA1    KLIST
     C                     KFLD           W1SHN1  5
     C                     KFLD           W1SHN2  5
     C                     KFLD           W1SHN3  2
     C           KEYEA1    CHAINFCEPL011             20
     C           *IN20     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     20
     C                     ENDIF
      *
     C                     CLEARKH
     C                     CLEARKK
     C           *IN20     IFEQ '0'
     C                     EXSR #SB510
     C                     ELSE
     C                     EXSR #SB520
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
      *-----------------------------------*
      *部品Ｍあり                       *
      *-----------------------------------*
     CSR         #SB510    BEGSR
      *構成品
     C           KEYAF1    KLIST
     C                     KFLD           W1SHN1  5
     C                     KFLD           W1SHN2  5
     C                     KFLD           W1SHN3  2
     C                     CLEARKH
     C                     CLEARKK
     C                     Z-ADD1         X       30
     C           KEYAF1    SETLLAEBPL011
     C           KEYAF1    READEAEBPL011                 82
     C           *IN82     DOWEQ'0'
     C           X         ANDLE4
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #SB511
     C                     ADD  1         X
     C                     ENDIF
     C           KEYAF1    READEAEBPL011                 82
     C                     ENDDO
      *
     C                     EXCPTDT2
      *
     CSR         ESB510    ENDSR
      *-----------------------------------*
      *構成品                           *
      *-----------------------------------*
     CSR         #SB511    BEGSR
      *
     C                     MOVELAFKHN1    WFKHN1
     C                     MOVEL'-'       WFKF1
     C                     MOVELAFKHN2    WFKHN2
     C                     MOVEL'-'       WFKF2
     C                     MOVELAFKHN3    WFKHN3
     C           WFKHN3    IFEQ *BLANK
     C                     MOVEL*BLANK    WFKF2
     C                     ENDIF
     C                     MOVELWFKHN     KH,X
     C                     MOVEL'KN 8990' KK,X
      *
     CSR         ESB511    ENDSR
      *-----------------------------------*
      *部品Ｍなし                       *
      *-----------------------------------*
     CSR         #SB520    BEGSR
      *
     C                     EXCPTDT3
      *
     CSR         ESB520    ENDSR
      *----------------------------*
      *手配書                    *
      *----------------------------*
     OQPRINT  E   0366         MCHK2
     O                                   27 '**'
     O                                   30 '**'
     O                                   33 '**'
     O                                   62 '****************'
     O                                   77 '*************'
      *部品Ｍあり
     O        E   03           DT2
     O                         UYEAR     27
     O                         UMONTHZ   30
     O                         UDAY  Z   33
     O        E   04           DT2
     O                                   13 '********'
     O                                   33 '********'
     O        E   05           DT2
     O                                   13 '********'
     O                                   33 '********'
     O        E   09           DT2
     O                         O1TMEI    13
     O                         W1SHN1   115
     O                         W1SF1    116
     O                         W1SHN2   121
     O                         W1SF2    122
     O                         W1SHN3   124
     O        E   12           DT2
     O                         W1MHN1   115
     O                         W1MF1    116
     O                         W1MHN2   121
     O                         W1MF2    122
     O                         W1MHN3   124
     O        E   14           DT2
     O                         O1TL      95
     O                         O1FACD   112
     O                         O1PRKB   128
      *
     O        E   15           DT2
     O                         W1SYKI    48
     O                         W1TLHZ    95 '    /  /  '
     O                         W1KENO   124
     O                         W1KENA   125
     O        E   16           DT2
     O                         O1PI      95
     O        E   17           DT2
     O                         W1PIHZ    95 '    /  /  '
     O                         W1PISR   103 '   , 0 '
      *
     O        E   22           DT2
     O                         W1PTA     26 '    /  /  '
     O                         W1STHZ    45 '    /  /  '
      *
     O        E   24           DT2
     O                         W1SRYO    45 ' ,   ,   , 0 '
      *
     O        E   28           DT2
     O                         A2KUBIZ   27
     O                         A2SOZI2   38
     O                         A2KASI2   50
     O        E   31           DT2
     O                                    5 '999'
     O                                   19 'ASJ SUPPLY'
     O                         A2MEKI    32
     O***                      A2MMEI    65
     O        E   34           DT2
     O***                      A2BHIN     4
     O***                      A2BTIU     8
     O***                      A2BDAI    12
     O***                      A2SMEI    30
     O***                      A2TMEI    50
     O***                      A2DMEI    70
     O        E   37           DT2
     O                         A2TUSZZ   33
     O                         A2KIKI    38
     O        E   46           DT2
     O                         KH,1      20
     O                         KK,1      34
     O                         KH,2      54
     O                         KK,2      70
     O        E   48           DT2
     O                         KH,3      20
     O                         KK,3      34
     O                         KH,4      54
     O                         KK,4      70
     O        E   52           DT2
     O                         O1KT      15
     O        E   54           DT2
     O                                   11 'ASJ'
      *部品Ｍなし
     O        E   03           DT3
     O                         UYEAR     27
     O                         UMONTHZ   30
     O                         UDAY  Z   33
     O        E   04           DT3
     O                                   13 '********'
     O                                   33 '********'
     O        E   05           DT3
     O                                   13 '********'
     O                                   33 '********'
     O        E   09           DT3
     O                         O1TMEI    13
     O                         W1SHN1   115
     O                         W1SF1    116
     O                         W1SHN2   121
     O                         W1SF2    122
     O                         W1SHN3   124
     O        E   12           DT3
     O                         W1MHN1   115
     O                         W1MF1    116
     O                         W1MHN2   121
     O                         W1MF2    122
     O                         W1MHN3   124
     O        E   14           DT3
     O                         O1TL      95
     O                         O1FACD   112
     O                         O1PRKB   128
     O        E   15           DT3
     O                         W1SYKI    48
     O                         W1TLHZ    95 '    /  /  '
     O                         W1KENO   124
     O                         W1KENA   125
     O        E   16           DT3
     O                         O1PI      95
     O        E   17           DT3
     O                         W1PIHZ    95 '    /  /  '
     O                         W1PISR   103 '   , 0 '
      *
     O        E   22           DT3
     O                         W1PTA     26 '    /  /  '
     O                         W1STHZ    45 '    /  /  '
      *
     O        E   24           DT3
     O                         W1SRYO    45 ' ,   ,   , 0 '
      *
     O        E   28           DT3
     O***                      A2KUBIZ   27
     O***                      A2SOZI2   38
     O***                      A2KASI2   50
     O        E   31           DT3
     O                                    5 '999'
     O                                   19 'ASJ SUPPLY'
     O***                      A2MEKI    32
     O***                      A2MMEI    65
     O        E   34           DT3
     O***                      A2BHIN     4
     O***                      A2BTIU     8
     O***                      A2BDAI    12
     O***                      A2SMEI    30
     O***                      A2TMEI    50
     O***                      A2DMEI    70
     O        E   37           DT3
     O***                      A2TUSZZ   33
     O***                      A2KIKI    38 '0 . '
     O        E   46           DT3
     O***                      KH,1      20
     O***                      KK,1      34
     O***                      KH,2      54
     O***                      KK,2      70
     O        E   48           DT3
     O***                      KH,3      20
     O***                      KK,3      34
     O***                      KH,4      54
     O***                      KK,4      70
     O        E   52           DT3
     O                         O1KT      15
     O        E   54           DT3
     O                                   11 'ASJ'
