     H            Y.
     F** MRAR04 *********************************************
     F* MODIFY INFORMATION                                  *
     F*     TRANCOM ITS.           2012.09.12               *
     F*******************************************************
     FMRAPP01 IF  E                    DISK
     FMRAPL11 IF  E           K        DISK
     FMRAWP05 O   E                    DISK                      A
      *
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
      *
     I            DS
     I                                        1  10 M1KEN
     I                                        1   9 M1KENO
     I                                       10  10 M1KENA
      *
     I            DS
     I                                        1  12 M1SHN
     I                                        1   5 M1SHN1
     I                                        6  10 M1SHN2
     I                                       11  12 M1SHN3
      *
     I            DS
     I                                        1  20 M1MHN
     I                                        1   5 M1MHN1
     I                                        6  10 M1MHN2
     I                                       11  15 M1MHN3
     I                                       16  20 M1MHN4
      *
     I            DS
     I                                        1  12 M1BHN
     I                                        1   5 M1BHN1
     I                                        6  10 M1BHN2
     I                                       11  12 M1BHN3
      *
     I            DS
     I                                        1   80M1STDT
     I                                        1   40M1STYY
     I                                        5   60M1STMM
     I                                        7   80M1STDD
      *
     I            DS
     I                                        1  12 D1SHN
     I                                        1   5 D1SHN1
     I                                        6  10 D1SHN2
     I                                       11  12 D1SHN3
      *
     I            DS
     I                                        1  20 D1MHN
     I                                        1   5 D1MHN1
     I                                        6  10 D1MHN2
     I                                       11  15 D1MHN3
     I                                       16  20 D1MHN4
      *
     I            DS
     I                                        1  12 D1BHN
     I                                        1   5 D1BHN1
     I                                        6  10 D1BHN2
     I                                       11  12 D1BHN3
      *
     I            DS
     I                                        1   80MASKHZ
     I                                        1   40MASKYY
     I                                        5   60MASKMM
     I                                        7   80MASKDD
      *
     C           *ENTRY    PLIST
     C                     PARM           P1TYPE  1
     C                     PARM           P1KEN  10
     C                     PARM           P1SHN1  5
     C                     PARM           P1SHN2  5
     C                     PARM           P1SHN3  2
     C                     PARM           P1TMEI 10
     C                     PARM           P1MHN1  5
     C                     PARM           P1MHN2  5
     C                     PARM           P1MHN3  5
     C                     PARM           P1MHN4  5
     C                     PARM           P1BHN1  5
     C                     PARM           P1BHN2  5
     C                     PARM           P1BHN3  2
     C                     PARM           P1IPD1  8
     C                     PARM           P1IPD2  8
     C                     PARM           P1STD1  8
     C                     PARM           P1STD2  8
     C                     PARM           P1SYKI  4
     C                     PARM           P1CRAT 10
     C                     PARM           PCMD    2
      *
     C                     MOVELP1KEN     D1KEN  10
     C                     MOVELP1SHN1    D1SHN1  5
     C                     MOVELP1SHN2    D1SHN2  5
     C                     MOVELP1SHN3    D1SHN3  2
     C                     MOVELP1TMEI    D1TMEI 10
     C                     MOVELP1MHN1    D1MHN1  5
     C                     MOVELP1MHN2    D1MHN2  5
     C                     MOVELP1MHN3    D1MHN3  5
     C                     MOVELP1MHN4    D1MHN4  5
     C                     MOVELP1BHN1    D1BHN1  5
     C                     MOVELP1BHN2    D1BHN2  5
     C                     MOVELP1BHN3    D1BHN3  2
     C                     MOVELP1IPD1    D1IPD1  80
     C                     MOVELP1IPD2    D1IPD2  80
     C                     MOVELP1STD1    D1STD1  80
     C                     MOVELP1STD2    D1STD2  80
     C                     MOVELP1SYKI    D1SYKI  4
     C                     MOVELP1CRAT    D1CRAT 10
      *
     C                     Z-ADD0         WKSEQ   60
     C           1         SETLLMRAPP011
     C                     READ MRAPP011                 20
     C           *IN20     DOWEQ'0'
     C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #SB400
     C           GET       IFEQ '1'
     C                     EXSR #SB500
     C                     ENDIF
     C                     ENDIF
     C                     READ MRAPP011                 20
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C                     MOVEL'0'       GET     1
      *
     C           KEYMA1    KLIST
     C                     KFLD           M1KENO
     C                     KFLD           M1KENA
     C                     MOVEL'0'       GET11   1
     C                     MOVEL*BLANK    WKSTAT  2
     C                     Z-ADD0         WKSNDT  80
     C                     Z-ADD0         WKSNTI  60
     C                     Z-ADD0         WKSBDT  80
     C                     Z-ADD0         WKSBTI  60
     C                     Z-ADD0         WKLIDT  80
     C                     Z-ADD0         WKLITI  60
     C           KEYMA1    SETGTMRAPL111
     C           KEYMA1    REDPEMRAPL111                 80
     C           *IN80     DOWEQ'0'
     C           GET11     ANDEQ'0'
     C           MASKJY    IFEQ 'D'
     C           MASKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'1'       GET11
     C                     MOVELMASTAT    WKSTAT
     C                     Z-ADDMASNDT    WKSNDT
     C                     Z-ADDMASNTI    WKSNTI
     C                     Z-ADDMASBDT    WKSBDT
     C                     Z-ADDMASBTI    WKSBTI
     C                     Z-ADDMALIDT    WKLIDT
     C                     Z-ADDMALITI    WKLITI
     C                     ENDIF
     C           KEYMA1    REDPEMRAPL111                 80
     C                     ENDDO
      * P1TYPE = '1':MODIFY
      * P1TYPE = '2':QUERY
      * P1TYPE = '3':TRANSMIT TO ASJ
     C           P1TYPE    IFEQ '1'
     C           WKSTAT    IFEQ '01'
     C           WKSTAT    OREQ '03'
     C                     ELSE
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           P1TYPE    IFEQ '3'
     C           WKSTAT    IFEQ '01'
     C           WKSTAT    OREQ '03'
     C                     ELSE
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           D1KEN     IFNE *BLANK
     C           D1KEN     IFNE M1KEN
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           D1SHN     IFNE *BLANK
     C           D1SHN     IFNE M1SHN
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           D1BHN     IFNE *BLANK
     C           D1BHN     IFNE M1BHN
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           D1MHN     IFNE *BLANK
     C           D1MHN     IFNE M1MHN
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           D1BHN     IFNE *BLANK
     C           D1BHN     IFNE M1BHN
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           D1TMEI    IFNE *BLANK
     C           D1TMEI    IFNE M1TMEI
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           D1IPD1    IFNE 0
     C           M1IPDT    IFLT D1IPD1
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           D1IPD2    IFNE 0
     C           M1IPDT    IFGT D1IPD2
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           D1STD1    IFNE 0
     C           M1STDT    IFLT D1STD1
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           D1STD2    IFNE 0
     C           M1STDT    IFGT D1STD2
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           D1SYKI    IFNE *BLANK
     C           D1SYKI    IFNE M1SYKI
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C           D1CRAT    IFNE *BLANK
     C           D1CRAT    IFNE M1CRAT
     C                     GOTO ESB400
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVEL'1'       GET
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARMRAWP051
     C                     MOVELM1KENO    W5KENO
     C                     MOVELM1KENA    W5KENA
     C                     MOVELM1KEED    W5KEED
     C                     MOVELM1CHID    W5CHID
     C                     MOVELM1PRKB    W5PRKB
     C                     MOVELM1SEKB    W5SEKB
     C                     MOVELM1HANO    W5HANO
     C                     MOVELM1FACD    W5FACD
     C                     MOVELM1VERN    W5VERN
     C                     MOVELM1SENO    W5SENO
     C                     MOVELM1SKBN    W5SKBN
     C                     MOVELM1SPNA    W5SPNA
     C                     MOVELM1TOKU    W5TOKU
     C                     MOVELM1TMEI    W5TMEI
     C                     MOVELM1NONY    W5NONY
     C                     MOVELM1NMEI    W5NMEI
     C                     MOVELM1NKOJ    W5NKOJ
     C                     MOVELM1NKME    W5NKME
     C                     MOVELM1NUKE    W5NUKE
     C                     MOVELM1MHN1    W5MHN1
     C                     MOVELM1MHN2    W5MHN2
     C                     MOVELM1MHN3    W5MHN3
     C                     MOVELM1MHN4    W5MHN4
     C                     MOVELM1SHN1    W5SHN1
     C                     MOVELM1SHN2    W5SHN2
     C                     MOVELM1SHN3    W5SHN3
     C                     MOVELM1SEHI    W5SEHI
     C                     MOVELM1TEHA    W5TEHA
     C                     MOVELM1BHN1    W5BHN1
     C                     MOVELM1BHN2    W5BHN2
     C                     MOVELM1BHN3    W5BHN3
     C                     Z-ADDM1BTYY    W5BTYY
     C                     Z-ADDM1BTMM    W5BTMM
     C                     Z-ADDM1BTDD    W5BTDD
     C                     Z-ADDM1STYY    W5STYY
     C                     Z-ADDM1STMM    W5STMM
     C                     Z-ADDM1STDD    W5STDD
     C                     Z-ADDM1PTAY    W5PTAY
     C                     Z-ADDM1PTAM    W5PTAM
     C                     Z-ADDM1PTAD    W5PTAD
     C                     Z-ADDM1OSYY    W5OSYY
     C                     Z-ADDM1OSMM    W5OSMM
     C                     Z-ADDM1OSDD    W5OSDD
     C                     Z-ADDM1ABYY    W5ABYY
     C                     Z-ADDM1ABMM    W5ABMM
     C                     Z-ADDM1ABDD    W5ABDD
     C                     MOVELM1ABRI    W5ABRI
     C                     MOVELM1KANA    W5KANA
     C                     Z-ADDM1SRYO    W5SRYO
     C                     MOVELM1SYKI    W5SYKI
     C                     MOVELM1JHN1    W5JHN1
     C                     MOVELM1JHN2    W5JHN2
     C                     MOVELM1JHN3    W5JHN3
     C                     MOVELM1KHN1    W5KHN1
     C                     MOVELM1KHN2    W5KHN2
     C                     MOVELM1KHN3    W5KHN3
     C                     MOVELM1CHN1    W5CHN1
     C                     MOVELM1CHN2    W5CHN2
     C                     MOVELM1CHN3    W5CHN3
     C                     MOVELM1CM11    W5CM11
     C                     MOVELM1CM12    W5CM12
     C                     MOVELM1CM13    W5CM13
     C                     MOVELM1CM21    W5CM21
     C                     MOVELM1CM22    W5CM22
     C                     MOVELM1CM23    W5CM23
     C                     MOVELM1CM31    W5CM31
     C                     MOVELM1CM32    W5CM32
     C                     MOVELM1CM33    W5CM33
     C                     MOVELM1CM41    W5CM41
     C                     MOVELM1CM42    W5CM42
     C                     MOVELM1CM43    W5CM43
     C                     MOVELM1CM51    W5CM51
     C                     MOVELM1CM52    W5CM52
     C                     MOVELM1CM53    W5CM53
     C                     MOVELM1CM61    W5CM61
     C                     MOVELM1CM62    W5CM62
     C                     MOVELM1CM63    W5CM63
     C                     Z-ADDM1CMS1    W5CMS1
     C                     Z-ADDM1CMS2    W5CMS2
     C                     Z-ADDM1CMS3    W5CMS3
     C                     Z-ADDM1CMS4    W5CMS4
     C                     Z-ADDM1CMS5    W5CMS5
     C                     Z-ADDM1CMS6    W5CMS6
     C                     MOVELM1BIKO    W5BIKO
     C                     MOVELM1UPCL    W5UPCL
     C                     MOVELM1CARM    W5CARM
     C                     MOVELM1DPCL    W5DPCL
     C                     MOVELM1PRDE    W5PRDE
     C                     MOVELM1COTH    W5COTH
     C                     MOVELM1HURC    W5HURC
     C                     Z-ADDM1CSYY    W5CSYY
     C                     Z-ADDM1CSMM    W5CSMM
     C                     Z-ADDM1CSDD    W5CSDD
     C                     MOVELM1LOMA    W5LOMA
     C                     MOVELM1BFH1    W5BFH1
     C                     MOVELM1BFH2    W5BFH2
     C                     MOVELM1BFH3    W5BFH3
     C                     Z-ADDM1IPDT    W5IPDT
     C                     Z-ADDM1IPTI    W5IPTI
     C                     MOVELM1CRAT    W5CRAT
     C                     Z-ADDM1TLYY    W5TLYY
     C                     Z-ADDM1TLMM    W5TLMM
     C                     Z-ADDM1TLDD    W5TLDD
     C                     Z-ADDM1PIYY    W5PIYY
     C                     Z-ADDM1PIMM    W5PIMM
     C                     Z-ADDM1PIDD    W5PIDD
     C                     Z-ADDM1PISR    W5PISR
     C                     MOVELWKSTAT    W5STAT
     C                     Z-ADDWKSNDT    W5SNDT
     C                     Z-ADDWKSNTI    W5SNTI
     C                     Z-ADDWKSBDT    W5SBDT
     C                     Z-ADDWKSBTI    W5SBTI
     C                     Z-ADDWKLIDT    W5LIDT
     C                     Z-ADDWKLITI    W5LITI
     C                     ADD  1         WKSEQ
     C                     Z-ADDWKSEQ     W5SEQ
     C                     WRITEMRAWP051
      *
     CSR         ESB500    ENDSR
