     H            Y.
     F** MRAR84 *********************************************
     F* RECEIVE SEND BACK DATA FROM ASJ                     *
     F*     TRANCOM-ITS            2012.10.18               *
     F*******************************************************
     FMRAPLA1 UF  E           K        DISK
     FMRAPL02 IF  E           K        DISK
      *
     FMRAPL60 UF  E           K        DISK                      A
     FMRAPP50 O   E                    DISK                      A
      *
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
      *
     I            DS
     I                                        1  10 W@MEKI
     I                                        1   4 W@MEK1
     I                                        5   6 W@MEK2
     I                                        7   7 W@MEK3
      *
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *--------------------------------------*
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------------------
      *  KEY LIST
      *----------------------------------------------------------------
     C           KEYKR1    KLIST
     C                     KFLD           #KGTDT  80
     C                     KFLD           #KGTTI  60
      *
     C           KEYHIN    KLIST
     C                     KFLD           #KHIN1  5
     C                     KFLD           #KHIN2  5
     C                     KFLD           #KHIN3  2
      * MRAPL02
     C           KEYM11    KLIST
     C                     KFLD           #KKENO  9
     C                     KFLD           #KKENA  1
      *----------------------------------------------------------------
      * SEND BACK DATA FROM ASJ  (PART INFORMATION) READ
      *----------------------------------------------------------------
     C                     Z-ADD0         #KGTDT
     C                     Z-ADD0         #KGTTI
     C           KEYKR1    SETLLMRAPLA11
     C           KEYKR1    READEMRAPLA11                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB500
     C                     EXSR #SB510
     C                     Z-ADDWTIHZ     KRGTDT
     C                     Z-ADDWJFB      KRGTTI
     C                     UPDATMRAPLA11
     C           KEYKR1    READEMRAPLA11                 80
     C                     ENDDO
      *----------------------------------------------------------------
      * EXIT
      *----------------------------------------------------------------
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------------------
     A* PROGRESS DATA (TEMPORARY)  CREATION  MRAPP50
      *----------------------------------------------------------------
     CSR         #SB500    BEGSR
     C                     MOVE KRKENO    #KKENO  9
     C                     MOVE KRKENA    #KKENA  1
     C           KEYM11    SETGTMRAPL021
     C                     SETOF                     81
     C                     DO   *HIVAL
     C           KEYM11    REDPEMRAPL021                 81
     C   81                LEAVE
      *
     C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
      *
     C                     EXSR #SB501
      *              ------------------------
     C                     WRITEMRAPP501
      *              ------------------------
     C                     LEAVE
     C                     ENDDO
     CSR         ESB500    ENDSR
      *----------------------------------------------------------------
      * ITEM EDITING
      *----------------------------------------------------------------
     CSR         #SB501    BEGSR
     C                     CLEARMRAPP501
      *
     C                     MOVE WTIYY     M5KOYY
     C                     MOVE WTIMM     M5KOMM
     C                     MOVE WTIDD     M5KODD
     C                     MOVE TIMHH     M5KOHH
     C                     MOVE TIMMM     M5KOSS
     C                     MOVELW#USER    M5KOME    P
     C                     MOVE M1KENO    M5KENO
     C                     MOVE M1KENA    M5KENA
     C                     MOVE M1KEED    M5KEED
     C                     MOVE M1CHID    M5CHID
     C                     MOVE M1PRKB    M5PRKB
     C                     MOVE M1SEKB    M5SEKB
     C                     MOVE M1HANO    M5HANO
     C                     MOVE M1FACD    M5FACD
     C                     MOVE M1VERN    M5VERN
     C                     MOVE M1SENO    M5SENO
     C                     MOVE M1SKBN    M5SKBN
     C                     MOVE M1SPNA    M5SPNA
     C                     MOVE M1TOKU    M5TOKU
     C                     MOVE M1TMEI    M5TMEI
     C                     MOVE M1NONY    M5NONY
     C                     MOVE M1NMEI    M5NMEI
     C                     MOVE M1NKOJ    M5NKOJ
     C                     MOVE M1NKME    M5NKME
     C                     MOVE M1NUKE    M5NUKE
     C                     MOVE M1MHN1    M5MHN1
     C                     MOVE M1MHN2    M5MHN2
     C                     MOVE M1MHN3    M5MHN3
     C                     MOVE M1MHN4    M5MHN4
     C                     MOVE M1SHN1    M5SHN1
     C                     MOVE M1SHN2    M5SHN2
     C                     MOVE M1SHN3    M5SHN3
     C                     MOVE M1SEHI    M5SEHI
     C                     MOVE M1TEHA    M5TEHA
     C                     MOVE M1BHN1    M5BHN1
     C                     MOVE M1BHN2    M5BHN2
     C                     MOVE M1BHN3    M5BHN3
     C                     MOVE M1BTYY    M5BTYY
     C                     MOVE M1BTMM    M5BTMM
     C                     MOVE M1BTDD    M5BTDD
     C                     MOVE M1STYY    M5STYY
     C                     MOVE M1STMM    M5STMM
     C                     MOVE M1STDD    M5STDD
     C                     MOVE M1PTAY    M5PTAY
     C                     MOVE M1PTAM    M5PTAM
     C                     MOVE M1PTAD    M5PTAD
     C                     MOVE M1OSYY    M5OSYY
     C                     MOVE M1OSMM    M5OSMM
     C                     MOVE M1OSDD    M5OSDD
     C                     MOVE M1ABYY    M5ABYY
     C                     MOVE M1ABMM    M5ABMM
     C                     MOVE M1ABDD    M5ABDD
     C                     MOVE M1ABRI    M5ABRI
     C                     MOVE M1KANA    M5KANA
     C                     MOVE M1SRYO    M5SRYO
     C                     MOVE M1SYKI    M5SYKI
     C                     MOVE M1JHN1    M5JHN1
     C                     MOVE M1JHN2    M5JHN2
     C                     MOVE M1JHN3    M5JHN3
     C                     MOVE M1KHN1    M5KHN1
     C                     MOVE M1KHN2    M5KHN2
     C                     MOVE M1KHN3    M5KHN3
     C                     MOVE M1CHN1    M5CHN1
     C                     MOVE M1CHN2    M5CHN2
     C                     MOVE M1CHN3    M5CHN3
     C                     MOVE M1CM11    M5CM11
     C                     MOVE M1CM12    M5CM12
     C                     MOVE M1CM13    M5CM13
     C                     MOVE M1CM21    M5CM21
     C                     MOVE M1CM22    M5CM22
     C                     MOVE M1CM23    M5CM23
     C                     MOVE M1CM31    M5CM31
     C                     MOVE M1CM32    M5CM32
     C                     MOVE M1CM33    M5CM33
     C                     MOVE M1CM41    M5CM41
     C                     MOVE M1CM42    M5CM42
     C                     MOVE M1CM43    M5CM43
     C                     MOVE M1CM51    M5CM51
     C                     MOVE M1CM52    M5CM52
     C                     MOVE M1CM53    M5CM53
     C                     MOVE M1CM61    M5CM61
     C                     MOVE M1CM62    M5CM62
     C                     MOVE M1CM63    M5CM63
     C                     MOVE M1CMS1    M5CMS1
     C                     MOVE M1CMS2    M5CMS2
     C                     MOVE M1CMS3    M5CMS3
     C                     MOVE M1CMS4    M5CMS4
     C                     MOVE M1CMS5    M5CMS5
     C                     MOVE M1CMS6    M5CMS6
     C                     MOVE M1BIKO    M5BIKO
     C                     MOVE M1UPCL    M5UPCL
     C                     MOVE M1CARM    M5CARM
     C                     MOVE M1DPCL    M5DPCL
     C                     MOVE M1PRDE    M5PRDE
     C                     MOVE M1COTH    M5COTH
     C                     MOVE M1HURC    M5HURC
     C                     MOVE M1CSYY    M5CSYY
     C                     MOVE M1CSMM    M5CSMM
     C                     MOVE M1CSDD    M5CSDD
     C                     MOVE M1LOMA    M5LOMA
     C                     MOVE M1BFH1    M5BFH1
     C                     MOVE M1BFH2    M5BFH2
     C                     MOVE M1BFH3    M5BFH3
     C                     MOVE M1IPDT    M5IPDT
     C                     MOVE M1IPTI    M5IPTI
     C                     MOVE M1CRAT    M5CRAT
     C                     MOVE M1RIYU    M5RIYU
     C                     MOVE '07'      M5STAT
     C                     Z-ADD0         M5LSDT
     C                     Z-ADD0         M5LSTI
     C                     Z-ADDWTIHZ     M5GTDT
     C                     Z-ADDWJFB      M5GTTI
     C                     Z-ADDM1TLYY    M5TLYY
     C                     Z-ADDM1TLMM    M5TLMM
     C                     Z-ADDM1TLDD    M5TLDD
     C                     Z-ADDM1PIYY    M5PIYY
     C                     Z-ADDM1PIMM    M5PIMM
     C                     Z-ADDM1PIDD    M5PIDD
     C                     Z-ADDM1PISR    M5PISR
     CSR         ESB501    ENDSR
      *----------------------------------------------------------------
      * PART MASTER CREATION                 MRAPP60
      *----------------------------------------------------------------
     CSR         #SB510    BEGSR
     C                     MOVE KRSHN1    #KHIN1  5
     C                     MOVE KRSHN2    #KHIN2  5
     C                     MOVE KRSHN3    #KHIN3  2
     C                     SETOF                     2122
     C           KEYHIN    CHAINMRAPL601             21
      *
     C                     CLEARMRAPL601
      *
     C                     EXSR #SB511
     C   21                WRITEMRAPL601
     C  N21                UPDATMRAPL601
     CSR         ESB510    ENDSR
      *----------------------------------------------------------------
      * ITEM EDITING
      *----------------------------------------------------------------
     CSR         #SB511    BEGSR
     C                     MOVE KRGKYY    A2GKYY
     C                     MOVE A2GKMM    A2GKMM
     C                     MOVE A2GKDD    A2GKDD
     C                     MOVE A2GKJI    A2GKJI
     C                     MOVE A2GKHU    A2GKHU
     C                     MOVELA2GKNM    A2GKNM    P
     C                     MOVE KRSHN1    A2BHB1
     C                     MOVE KRSHN2    A2BHB2
     C                     MOVE KRSHN3    A2BHB3
     C                     MOVELKRMEKI    W@MEKI
     C                     MOVE W@MEK1    A2MEK1
     C                     MOVE W@MEK2    A2MEK2
     C                     MOVE W@MEK3    A2MEK3
     C                     MOVELKRMMEI    A2MMEI
     C                     Z-ADDKRSOZI    A2SOZI
     C                     MOVE KRSOZT    A2SOZT
     C                     Z-ADDKRKASI    A2KASI
     C                     MOVE KRKAST    A2KAST
     C                     Z-ADDKRSAIZ    A2SAIZ
     C                     MOVE KRZATA    A2ZATA
     C                     MOVE KRKIKI    A2KIKI
     C                     MOVE KRZAIR    A2ZAIR
     C                     MOVE KRZAIC    A2ZAIC
     C                     MOVELKRZANM    A2ZANM
     C                     Z-ADDKRKAZI    A2KAZI
     C                     MOVE KRKONU    A2KONU
     C                     MOVE KRSIRE    A2SIRE
     C                     MOVE KRUKER    A2UKER
     C                     Z-ADDKRTUSZ    A2TUSZ
     C                     MOVE KRBDAI    A2BDAI
     C                     MOVE KRBTIU    A2BTIU
     C                     MOVE KRBHIN    A2BHIN
     C                     MOVELKRSMEI    A2SMEI
     C                     MOVELKRTMEI    A2TMEI
     C                     MOVELKRDMEI    A2DMEI
     C                     Z-ADDKRKUBI    A2KUBI
     C                     Z-ADDKRKSYS    A2KSYS
     C                     MOVE KRKSYT    A2KSYT
     C                     Z-ADDKRSSYS    A2SSYS
     C                     MOVE KRSSYT    A2SSYT
     C                     Z-ADDKRSYYY    A2SYYY
     C                     Z-ADDKRSYMM    A2SYMM
     C                     Z-ADDKRSYDD    A2SYDD
     C                     MOVE KRKTRK    A2KTRK
     C                     MOVE KRKTRT    A2KTRT
     C                     MOVE KRKTRR    A2KTRR
     C                     MOVE KRKTRD    A2KTRD
     C                     MOVE KRSTRK    A2STRK
     C                     MOVE KRSTRT    A2STRT
     C                     MOVE KRSTRR    A2STRR
     C                     MOVE KRSTRD    A2STRD
     C                     Z-ADDKRTRYY    A2TRYY
     C                     Z-ADDKRTRMM    A2TRMM
     C                     Z-ADDKRTRDD    A2TRDD
     C                     Z-ADDKRGEKN    A2GEKN
     C                     MOVE KRTEHI    A2TEHI
     C                     MOVE KRSEHI    A2SEHI
     C                     MOVE KRTAYY    A2TAYY
     C                     MOVE KRTAMM    A2TAMM
     C                     MOVE KRTADD    A2TADD
     C                     MOVE KRUTYY    A2UTYY
     C                     MOVE KRUTMM    A2UTMM
     C                     MOVE KRUTDD    A2UTDD
     C                     MOVE KRSHYY    A2SHYY
     C                     MOVE KRSHMM    A2SHMM
     C                     MOVE KRSHDD    A2SHDD
     C                     MOVE KRKTYY    A2KTYY
     C                     MOVE KRKTMM    A2KTMM
     C                     MOVE KRKTDD    A2KTDD
     C                     MOVE KRBOYY    A2BOYY
     C                     MOVE KRBOMM    A2BOMM
     C                     MOVE KRBODD    A2BODD
     C                     MOVE KRGEYY    A2GEYY
     C                     MOVE KRGEMM    A2GEMM
     C                     MOVE KRGEDD    A2GEDD
     C                     MOVE KRZAYY    A2ZAYY
     C                     MOVE KRZAMM    A2ZAMM
     C                     MOVE KRZADD    A2ZADD
     C                     MOVE KRKZYY    A2KZYY
     C                     MOVE KRKZMM    A2KZMM
     C                     MOVE KRKZDD    A2KZDD
     CSR         ESB511    ENDSR
      *----------------------------------------------------------------
      *画面項目の初期化
      *----------------------------------------------------------------
     CSR         *INZSR    BEGSR
     C                     TIME           WTIME
     CSR                   ENDSR
