     H            Y.
     F** MRAR84 *********************************************
     F* RECEIVE SEND BACK DATA FROM ASJ                     *
     F*     TRANCOM-ITS            2012.10.18               *
     F*******************************************************
     FMRAPLK1 UF  E           K        DISK
      *
     FMRAPL61 UF  E           K        DISK                      A
      *
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------------------
      *  KEY LIST
      *----------------------------------------------------------------
     C           KEYKR1    KLIST
     C                     KFLD           #KGTDT  80
     C                     KFLD           #KGTTI  60
      *
      * MRAPL61
     C           KEYAF1    KLIST
     C                     KFLD           #KSHN1  5
     C                     KFLD           #KSHN2  5
     C                     KFLD           #KSHN3  2
     C                     KFLD           #KKHN1  5
     C                     KFLD           #KKHN2  5
     C                     KFLD           #KKHN3  2
     C                     KFLD           #KKBMN  40
     C                     KFLD           #KUKER  4
      *----------------------------------------------------------------
      * SEND BACK DATA FROM ASJ  (COMPOSITION INFORMATION) READ
      *----------------------------------------------------------------
     C                     Z-ADD0         #KGTDT
     C                     Z-ADD0         #KGTTI
     C           KEYKR1    SETLLMRAPLK11
     C           KEYKR1    READEMRAPLK11                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB520
     C                     Z-ADDWTIHZ     KSGTDT
     C                     Z-ADDWJFB      KSGTTI
     C                     UPDATMRAPLK11
     C           KEYKR1    READEMRAPLK11                 80
     C                     ENDDO
      *----------------------------------------------------------------
      * EXIT
      *----------------------------------------------------------------
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------------------
      * COMPORNENTS PART NUMBER M/F CREATION       MRAPP61
      *----------------------------------------------------------------
     CSR         #SB520    BEGSR
     C                     MOVE KSSHN1    #KSIN1  5
     C                     MOVE KSSHN2    #KSIN2  5
     C                     MOVE KSSHN3    #KSIN3  2
     C                     MOVE KSKHN1    #KKHN1  5
     C                     MOVE KSKHN2    #KKHN2  5
     C                     MOVE KSKHN3    #KKHN3  2
     C                     MOVE KSKBMN    #KKBMN  40
     C                     MOVE KSUKER    #KUKER  4
     C                     SETOF                     2122
     C           KEYAF1    CHAINMRAPL611             21
      *
     C                     CLEARMRAPL611
      *
     C                     EXSR #SB521
     C   21                WRITEMRAPL611
     C  N21                UPDATMRAPL611
     CSR         ESB520    ENDSR
      *----------------------------------------------------------------
      * ITEM EDITING
      *----------------------------------------------------------------
     CSR         #SB521    BEGSR
     C                     MOVE KSGKYY    AFKOYY
     C                     MOVE KSGKMM    AFKOMM
     C                     MOVE KSGKDD    AFKODD
     C                     MOVE KSGKJI    AFKOHH
     C                     MOVE KSGKHU    AFKOSS
     C                     MOVELKSGKNM    AFKOME    P
     C                     MOVE KSSHN1    AFSHN1
     C                     MOVE KSSHN2    AFSHN2
     C                     MOVE KSSHN3    AFSHN3
     C                     MOVE KSKHN1    AFKHN1
     C                     MOVE KSKHN2    AFKHN2
     C                     MOVE KSKHN3    AFKHN3
     C                     Z-ADDKSSKSU    AFSKSU
     C                     MOVE KSKOTI    AFKOTI
     C                     Z-ADDKSKBMN    AFKBMN
     C                     MOVE KSUKER    AFUKER
     CSR         ESB521    ENDSR
      *----------------------------------------------------------------
      *画面項目の初期化
      *----------------------------------------------------------------
     CSR         *INZSR    BEGSR
     C                     TIME           WTIME
     CSR                   ENDSR
