     H            Y.
     F** MRARZ1 *********************************************
     F* RECEIVE NETWORK FILE                                *
     F*     TRANCOM ITS.           2012.10.05               *
     F*******************************************************
     FMRAWPZ1 IF  F     147            DISK
     FMRAPPZ1 O   E                    DISK                      A
      *
     IMRAWPZ1 AA  01
     I                                        1  10 NFDUSR
     I                                       11  18 NFDUID
     I                                       19  26 NFDIDQ
     I                                       27  36 NFDFIL
     I                                       37  46 NFDMBR
     I                                       47  52 NFDNBR
     I                                       53  60 NFDFUD
     I                                       61  68 NFDFSQ
     I                                       69  75 NFDFT
     I                                       76  83 NFNBRR
     I                                       84  88 NFDRCL
     I                                       89  94 NFDSDT
     I                                       95 100 NFDSTM
     I                                      101 106 NFDADT
     I                                      107 112 NFDATM
     I                                      113 113 NFSYSC
     I                                      114 119 NFSYSD
     I                                      120 125 NFSYST
     I                                      126 133 NFSYSN
     I                                      134 145 NFNBR1
     I                                      146 146 NFDSCD
     I                                      147 147 NFDACD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C                     TIME           WTIME
     C                     READ MRAWPZ1                  80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB500
     C                     READ MRAWPZ1                  80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARMRAPPZ11
     C                     Z-ADD*YEAR     ZZKOYY
     C                     Z-ADDUMONTH    ZZKOMM
     C                     Z-ADDUDAY      ZZKODD
     C                     Z-ADDTIMHH     ZZKOHH
     C                     Z-ADDTIMMM     ZZKOSS
     C                     MOVELW#USER    ZZKOME
     C                     MOVELNFDUSR    ZZDUSR
     C                     MOVELNFDUID    ZZDUID
     C                     MOVELNFDIDQ    ZZDIDQ
     C                     MOVELNFDFIL    ZZDFIL
     C                     MOVELNFDMBR    ZZDMBR
     C                     MOVELNFDNBR    ZZDNBR
     C                     MOVELNFDFUD    ZZDFUD
     C                     MOVELNFDFSQ    ZZDFSQ
     C                     MOVELNFDFT     ZZDFT
     C                     MOVELNFNBRR    ZZNBRR
     C                     MOVELNFDRCL    ZZDRCL
     C                     MOVELNFDSDT    ZZDSDT
     C                     MOVELNFDSTM    ZZDSTM
     C                     MOVELNFDADT    ZZDADT
     C                     MOVELNFDATM    ZZDATM
     C                     MOVELNFSYSC    ZZSYSC
     C                     MOVELNFSYSD    ZZSYSD
     C                     MOVELNFSYST    ZZSYST
     C                     MOVELNFSYSN    ZZSYSN
     C                     MOVELNFNBR1    ZZNBR1
     C                     MOVELNFDSCD    ZZDSCD
     C                     MOVELNFDACD    ZZDACD
     C                     Z-ADD0         ZZRCDT
     C                     Z-ADD0         ZZRCTI
     C                     MOVEL*BLANK    ZZERR
     C                     WRITEMRAPPZ11
      *
     CSR         ESB500    ENDSR
