     H            Y.
     F** MRAR84 *********************************************
     F* RECEIVE SEND BACK DATA FROM ASJ                     *
     F*     TRANCOM-ITS            2012.10.18               *
     F*******************************************************
     FMRAPLT1 UF  E           K        DISK
      *
     FMRAPL65 UF  E           K        DISK                      A
      * INPUT
     E                    KOT        15  3               工程
     E                    KBM        15  4               部門
     E                    KBN        15  3               機番
     E                    TKR        15  6               番地
     E                    KID        15  1               種類
      * FILE
     E                    DKOT       15  3               工程
     E                    XKBM       15  4               部門
     E                    DKBM       15  4 0             部門
     E                    DKBN       15  3               機番
     E                    DTKR       15  6               番地
     E                    DKID       15  1               種類
      *
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
      *
     I            DS
     I                                        1   6 W@TKR
     I                                        1   1 W@TKR1
     I                                        2   3 W@TKR2
     I                                        4   5 W@TKR3
     I                                        6   6 W@TKR4
      *
     I            DS
     I                                        1  12 KTSHIN
     I                                        1   5 KTSHN1
     I                                        6  10 KTSHN2
     I                                       11  12 KTSHN3
      *
     I            DS
     I                                        1  12 @@SHIN
     I                                        1   5 @@SHN1
     I                                        6  10 @@SHN2
     I                                       11  12 @@SHN3
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *--------------------------------------*
      * MRAPP65
      * PROCESS CODE
     I            DS
     I                                        1  45 DKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
      * DEPARTMENT CODE
     I            DS
     I                                        1  60 XKBM
     I                                        1  600DKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
      * MACHINE NO
     I            DS
     I                                        1  45 DKBN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
      * LOCATION CODE
     I            DS
     I                                        1  90 DTKR
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
      * KANBAN KIND
     I                                        1  15 DKID
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------------------
      *  KEY LIST
      *----------------------------------------------------------------
     C           KEYKR1    KLIST
     C                     KFLD           #KGTDT  80
     C                     KFLD           #KGTTI  60
      *
     C           KEYHIN    KLIST
     C                     KFLD           #KHIN1  5
     C                     KFLD           #KHIN2  5
     C                     KFLD           #KHIN3  2
      *----------------------------------------------------------------
      * SEND BACK DATA FROM ASJ  (PROCESS INFORMATION) READ
      *----------------------------------------------------------------
     C                     Z-ADD0         #KGTDT
     C                     Z-ADD0         #KGTTI
     C           KEYKR1    SETLLMRAPLT11
     C           KEYKR1    READEMRAPLT11                 80
     C  N80                EXSR #SB531
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB530
     C                     Z-ADDWTIHZ     KTGTDT
     C                     Z-ADDWJFB      KTGTTI
     C                     UPDATMRAPLT11
     C           KEYKR1    READEMRAPLT11                 80
     C           @X        IFGT 15
     C                     SETON                         80
     C                     END
     C                     ENDDO
      *
     C           KOT,1     IFNE *BLANK
     C                     EXSR #SB532
     C                     END
      *----------------------------------------------------------------
      * EXIT
      *----------------------------------------------------------------
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------------------
      * INTRA COMPANY KANBAN CHANGE M/F CREATION
      *----------------------------------------------------------------
     CSR         #SB530    BEGSR
     C           KTSHIN    IFEQ W@SHIN
     C                     CLEARW@TKR
     C                     MOVE KTMBN1    W@TKR1
     C                     MOVE KTMBN2    W@TKR2
     C                     MOVE KTMBN3    W@TKR3
     C                     MOVE KTMBN4    W@TKR4
     C                     MOVE KTMKTE    KOT,@X
     C                     MOVE KTMBMN    KBM,@X
     C                     MOVE KTMSNO    KBN,@X
     C                     MOVE W@TKR     TKR,@X
     C                     MOVE KTKDAI    KID,@X
     C                     ADD  1         @X
     C                     MOVE KTSHIN    W@SHIN
     C                     ELSE
      *
     C                     EXSR #SB532
     C                     EXSR #SB531
     C                     END
     CSR         ESB530    ENDSR
      *----------------------------------------------------------------
      * ITEM INITIALIZATION
      *----------------------------------------------------------------
     CSR         #SB531    BEGSR
     C                     MOVE *ALL' '   KOT
     C                     MOVE *ALL'0'   KBM
     C                     MOVE *ALL' '   KBN
     C                     MOVE *ALL' '   TKR
     C                     MOVE *ALL' '   KID
     C                     MOVE KTSHIN    W@SHIN 12
     C                     Z-ADD1         @X      20
     CSR         ESB531    ENDSR
      *----------------------------------------------------------------
      * INTRA COMPANY KANBAN CHANGE M/F (TEMPORARY) CREATION
      *----------------------------------------------------------------
     CSR         #SB532    BEGSR
     C                     MOVE W@SHIN    @@SHIN
     C                     MOVE @@SHN1    #KHIN1  5
     C                     MOVE @@SHN2    #KHIN2  5
     C                     MOVE @@SHN3    #KHIN3  2
     C                     SETOF                     21
     C           KEYHIN    CHAINMRAPL651             21
     C                     CLEARMRAPL651
      *
     C                     MOVE KTGKYY    CKKOYY
     C                     MOVE KTGKMM    CKKOMM
     C                     MOVE KTGKDD    CKKODD
     C                     MOVE KTGKJI    CKKOHH
     C                     MOVE KTGKHU    CKKOSS
     C                     MOVELKTGKNM    CKKOME
     C                     MOVE @@SHN1    CKHIN1
     C                     MOVE @@SHN2    CKHIN2
     C                     MOVE @@SHN3    CKHIN3
      *
     C                     MOVEAKOT       DKOT
     C                     MOVEAKBM       XKBM
     C                     MOVEAKBN       DKBN
     C                     MOVEATKR       DTKR
     C                     MOVEAKID       DKID
      *
     C  N21                UPDATMRAPL651
     C   21                WRITEMRAPL651
      *
     CSR         ESB532    ENDSR
      *----------------------------------------------------------------
      *画面項目の初期化
      *----------------------------------------------------------------
     CSR         *INZSR    BEGSR
     C                     TIME           WTIME
     CSR                   ENDSR
