     H            Y.
     F** MRARZ2 *********************************************
     F* RECEIVE NETWORK FILE                                *
     F*     TRANCOM ITS.           2012.10.05               *
     F*******************************************************
     FMRAPPZ1 UF  E                    DISK
     FMRAPPZ2 IF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C                     TIME           WTIME
     C                     READ MRAPPZ11                 80
     C           *IN80     DOWEQ'0'
     C           ZZRCDT    IFEQ 0
     C                     EXSR #SB400
     C                     Z-ADD*DATE     ZZRCDT
     C                     TIME           ZZRCTI
     C                     MOVELP9ERR     ZZERR
     C                     UPDATMRAPPZ11
     C                     ENDIF
     C                     READ MRAPPZ11                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C                     MOVEL'0'       P9ERR
     C           ZZDFIL    CHAINMRAPPZ21             20
     C           *IN20     IFEQ '0'
     C           Z2SKJY    ANDEQ'D'
     C           Z2SKHZ    ANDLE*DATE
     C                     SETON                     20
     C                     ENDIF
     C           *IN20     IFEQ '0'
     C           ZZDUSR    ANDEQZ2USR
     C***                  EXSR #SB500
     C                     Z-ADDZZDNBR    P1DNBR
     C                     MOVELZZDUID    P1USID
     C                     MOVEL'0'       P9ERR
     C                     CALL Z2PGM
     C                     PARM           P1DNBR  60
     C                     PARM           P1USID  8
     C                     PARM           P9ERR   1
     C                     ENDIF
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      * RCVNETF                                            *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     MOVELZZDFIL    P1FILE
     C                     MOVELZ2LIB     P1LIBL
     C                     Z-ADDZZDNBR    P1DNBR
     C                     MOVELZZDUID    P1USID
     C                     MOVEL'0'       P9ERR
     C                     CALL 'MRACZ2'
     C                     PARM           P1FILE 10
     C                     PARM           P1LIBL 10
     C                     PARM           P1DNBR  60
     C                     PARM           P1USID  8
     C                     PARM           P9ERR   1
      *
     CSR         ESB500    ENDSR
