     H            Y.
     F** MRHR47 *********************************************
     F*数字を頭ゼロ消去する２                             *
     F*       QY.LIU               2024.06.24               *
     F*******************************************************
     E                    SUU       100  1
     E                    SU2       100  1
      *
     I* FOR文字編集
     I            DS
     I                                        1 100 SUU
     I                                        1 100 @@SUJI
     I            DS
     I                                        1 100 SU2
     I                                        1 100 @OMOJI
      *----------------------------------------------------*
      *   PARAMETER  TRANCFER                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           INSUJI100
     C                     PARM           OTMOJI100
     C                     PARM           CHKFLG  1
     C*
     C                     MOVELINSUJI    @@SUJI
     C           1         DO   100       ZZ      40
     C*
     C           SUU,ZZ    IFEQ ','
     C                     MOVEL'.'       SU2,ZZ
     C                     ELSE
     C                     MOVELSUU,ZZ    SU2,ZZ
     C                     ENDIF
     C*
     C                     ENDDO
     C*
     C                     MOVEL@OMOJI    OTMOJI
     C*
     C                     SETON                     LR
     C                     RETRN
