     ******************************************************************
     **  プログラム名   : 生産遅れ判定  　　　　　　　　　     **
     **  プログラムＩＤ :  MRHR67     <RPG>                        **
     **  作成年月日     :  2014/05/21                              **
     **  作成者         :  TR-ITS                                  **
     **  プログラム概要 : 生産遅れの判定を行う              　 **
     **--------------------------------------------------------------**
     **  変更年月日     :  YYYY/MM/DD                              **
     **  変更者         :                                          **
     **  変更内容       :                                          **
     ******************************************************************
     ******************************************************************
     H            Y/                                    1
     **==============================================================**
     **  ファイル
     **==============================================================**
     FMRHPL51 IF  E           K        DISK
      *
     **==============================================================**
     **  配列
     **==============================================================**
     E*
     **==============================================================**
     **  ＤＳ
     **==============================================================**
     I*<<システム日時>>
     I            DS
     I                                        1  140S@TIME
     I                                        1   60S@HMS
     I                                        1   20S@TMHH
     I                                        3   40S@TMMM
     I                                        5   60S@TMSS
     I                                        7  140S@YYMD
     I                                        7  100S@DYYY
     I                                       11  120S@DYMM
     I                                       13  140S@DYDD
     **--------------------------------------------------------------**
     I* <<共通>>
     I            DS
     I                                        1   80W@SYMD
     I                                        1   20W@SMM
     I                                        3   40W@SDD
     I                                        5   80W@SYY4
     I*
     **==============================================================**
     **  パラメータ
     **==============================================================**
     C*
     C           *ENTRY    PLIST
     C                     PARM           PPTHI1  4
     C                     PARM           PPTHI2  3
     C                     PARM           PPGRHZ  8
     C                     PARM           PPGRTM  6
     C                     PARM           PPCPNO  2
     C                     PARM           PPCPRC  4
     C                     PARM           PPHNTE  1
     **==============================================================**
     **  ＫＥＹ
     **==============================================================**
     C*
     **==============================================================**
     **  メインルーチン
     **==============================================================**
      *
     C           KEYST     KLIST
     C                     KFLD           KKTHI1  4
     C                     KFLD           KKTHI2  3
     C                     KFLD           KKGRHZ  80
     C                     KFLD           KKGRTM  60
     C                     KFLD           KKKTNO  20
     C                     MOVELPPTHI1    KKTHI1
     C                     MOVELPPTHI2    KKTHI2
     C                     MOVELPPGRHZ    KKGRHZ
     C                     MOVELPPGRTM    KKGRTM
      *
     C           PPCPNO    IFEQ '0'
     C                     MOVEL'1'       KKKTNO
     C                     ELSE
     C                     MOVELPPCPNO    KKKTNO
     C                     ENDIF
      *
     C                     MOVEL'0'       PPHNTE
     C                     MOVEL'0'       GET     1
     C                     Z-ADD0         WKKNHZ  80
     C           KEYST     SETGTMRHPL511
     C           KEYST     REDPEMRHPL511                 80
     C           *IN80     DOWEQ'0'
     C           GET       ANDEQ'0'
     C           STGSJY    IFEQ 'D'
     C           STGSHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'1'       GET     1
     C                     Z-ADDSTKNHZ    WKKNHZ  80
     C                     ENDIF
     C           KEYST     REDPEMRHPL511                 80
     C                     ENDDO
      *
     C           WKKNHZ    IFLT *DATE
     C                     MOVEL'9'       PPHNTE
     C                     ENDIF
     C*
     C*---<終了処理>---*
     C                     SETON                     LR
     C                     RETRN
     C*
