     H            Y.
     F** MRHR85 *******************************************
     F* UPDATE 2ND TREATMENT INPUT CHECK MASTER
     F*    SAKAKI.           2018.11.05                   *
     F*****************************************************
     FMRHPW85 CF  E                    WORKSTN
     FMRHPP81 IF  E           K        DISK
     FMRHPP82 UF  E           K        DISK                      A
      *
     E                    SN         20  3
     E                    ER      1   7 60
      *
     I            DS
     I                                        1  60 SN
     I                                        1   3 D1SN01
     I                                        4   6 D1SN02
     I                                        7   9 D1SN03
     I                                       10  12 D1SN04
     I                                       13  15 D1SN05
     I                                       16  18 D1SN06
     I                                       19  21 D1SN07
     I                                       22  24 D1SN08
     I                                       25  27 D1SN09
     I                                       28  30 D1SN10
     I                                       31  33 D1SN11
     I                                       34  36 D1SN12
     I                                       37  39 D1SN13
     I                                       40  42 D1SN14
     I                                       43  45 D1SN15
     I                                       46  48 D1SN16
     I                                       49  51 D1SN17
     I                                       52  54 D1SN18
     I                                       55  57 D1SN19
     I                                       58  60 D1SN20
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60WTIME
     I                                        7  140WDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *---------------------------------------------------*
      *パラメーター
      *---------------------------------------------------*
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     TIME           SDATE
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     MOVEL'01'      DSPSW   2
     C****                 MOVEL*BLANK    D1UPD
     C                     MOVEL*BLANK    D1STID
     C                     MOVEL*BLANK    D1STNM
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTMRHPW851
     C                     SETOF                     313299
     C                     MOVEL*BLANK    D1ERR
      *
     C           *IN01     IFEQ '1'
     C                     MOVEL'99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           *IN10     IFEQ '1'
     C                     CALL 'MRHR82'
     C                     GOTO ESB210
     C                     ENDIF
      *
     C****       D1UPD     IFEQ '0'
     C****       D1UPD     OREQ '1'
     C****       D1UPD     OREQ '2'
     C****                 ELSE
     C****                 SETON                     3199
     C****                 MOVELER,1      D1ERR
     C****                 GOTO ESB210
     C****                 ENDIF
      *
     C           D1STID    CHAINMRHPP81              88
     C           *IN88     IFEQ *OFF
     C           SBSKJY    IFEQ 'D'
     C                     ELSE
     C                     MOVELSBSTNM    D1STNM
     C                     ENDIF
     C                     ENDIF
      *
     C           D1STNM    IFEQ *BLANK
     C                     SETON                     3299
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     CLEARSN
     C                     Z-ADD0         A       30
     C           D1STID    SETLLMRHPP821
     C           D1STID    READEMRHPP821                 80
     C           *IN80     DOWEQ'0'
     C           SBSKJY    IFEQ 'D'
     C           SBSKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  1         A
     C                     MOVELSBMSNO    SN,A
     C                     ENDIF
     C           D1STID    READEMRHPP821                 80
     C                     ENDDO
      *
     C                     MOVEL'02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C                     EXFMTMRHPW852
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     373839
     C                     SETOF                     304142
     C                     SETOF                     434445
     C                     SETOF                     99
     C                     MOVEL*BLANK    D1ERR
      *
     C           *IN03     IFEQ '1'
     C****                 MOVEL*BLANK    D1UPD
     C                     MOVEL*BLANK    D1STID
     C                     MOVEL*BLANK    D1STNM
     C                     MOVEL'01'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     C                     EXSR #CHK
     C           *IN99     IFEQ '1'
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           *IN05     IFEQ '1'
     C                     EXSR #SB500
     C                     EXSR #SB510
     C****                 MOVEL*BLANK    D1UPD
     C                     MOVELD1STID    Z1STID
     C                     MOVEL*BLANK    D1STID
     C                     MOVEL'01'      DSPSW
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * チェック                                         *
      *----------------------------------------------------*
     CSR         #CHK      BEGSR
      *
     C                     Z-ADD1         A
     C           A         DOWLE20
     C           *IN99     ANDEQ'0'
     C           SN,A      IFNE *BLANK
     C                     MOVELSN,A      W@SKNO  3
     C                     EXSR #CHK1
     C                     ENDIF
     C                     ADD  1         A
     C                     ENDDO
      *
     CSR         ECHK      ENDSR
      *----------------------------------------------------*
      * チェック                                         *
      *----------------------------------------------------*
     CSR         #CHK1     BEGSR
      *
     C                     Z-ADD1         B       30
     C           B         DOWLE20
     C           *IN99     ANDEQ'0'
     C           SN,B      IFEQ W@SKNO
     C           B         ANDNEA
     C                     SETON                     99
     C                     MOVELER,3      D1ERR
     C                     Z-ADDB         I       20
     C                     EXSR #ERR
     C                     ENDIF
     C                     ADD  1         B
     C                     ENDDO
      *
     CSR         ECHK1     ENDSR
      *----------------------------------------------------*
      * エラー標識                                       *
      *----------------------------------------------------*
     CSR         #ERR      BEGSR
      *
     C           I         DIV  10        C       20
     C                     MVR            AM      20
     C                     ADD  30        AM
     C                     MOVEL'1'       *IN,AM
     C                     SELEC
     C           I         WHLE 10
     C                     SETON                     41
     C           I         WHLE 20
     C                     SETON                     42
     C                     ENDSL
      *
     CSR         EERR      ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      *全部消してから出力                                *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C           D1STID    SETLLMRHPP821
     C           D1STID    READEMRHPP821                 80
     C           *IN80     DOWEQ'0'
     C           SBSKJY    IFEQ 'D'
     C           SBSKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'D'       SBSKJY
     C                     Z-ADD*DATE     SBSKHZ
     C                     UPDATMRHPP821
     C                     ENDIF
     C           D1STID    READEMRHPP821                 80
     C                     ENDDO
      *
     CSR         ESB500    ENDSR
      *----------------------------------------------------*
      *出力                                *
      *----------------------------------------------------*
     CSR         #SB510    BEGSR
      *
     C           KEYB3     KLIST
     C                     KFLD           D1STID
     C                     KFLD           K1SKNO  3
     C                     Z-ADD1         A
     C           A         DOWLE20
     C           SN,A      IFNE *BLANK
     C                     MOVELSN,A      K1SKNO
     C           KEYB3     CHAINMRHPP821             80
     C                     CLEARMRHPP821
     C                     Z-ADD*DATE     SBKOHZ
     C                     TIME           SBKOTM
     C                     MOVELW#PGM     SBKOPG
     C                     MOVELW#USER    SBKOME
     C                     MOVELD1STID    SBSTID
     C                     MOVELK1SKNO    SBMSNO
     C           *IN80     IFEQ '0'
     C                     UPDATMRHPP821
     C                     ELSE
     C                     WRITEMRHPP821
     C                     ENDIF
     C                     ENDIF
     C                     ADD  1         A
     C                     ENDDO
      *
     CSR         ESB510    ENDSR
** ER
ER-1 INPUT 0,1,2.
ER-2 INCORRECT ID.
ER-3 DUPULICATE MACHINE#.
ER-4
ER-5
