     ******************************************************************
     **  プログラム名   : 進捗確認                               **
     **                   : （エントリー画面）　　　　　　　　     **
     **  プログラムＩＤ :  MRHR61     <RPG>                        **
     **  作成年月日     :  2014/01/22                              **
     **  作成者         :  TR-ITS                                  **
     **  プログラム概要 : 進捗確認のため、指定情報を出力する。   **
     **--------------------------------------------------------------**
     **  変更年月日     :  YYYY/MM/DD                              **
     **  変更者         :                                          **
     **  変更内容       :                                          **
     ******************************************************************
     ** <<使用標識説明>>
     **        01       :プログラム終了 <F01>
     **        41       :画面共通エラー標識（全画面共通）
     **        99       :代表エラー標識
     ******************************************************************
     H            Y/                                    1
     **==============================================================**
     **  ファイル
     **==============================================================**
     F*<<進捗確認　エントリー画面>>
     FMRHPW61 CF  E                    WORKSTN
     F                                              KINFDS WSDS
     **==============================================================**
     **  配列
     **==============================================================**
     E                    @MS     1   1 53                ERR MSG
     **==============================================================**
     **  ＤＳ
     **==============================================================**
     I*<<システム情報>>
     I           SDS
     I                                     *PROGRAM S@PGID
     I                                      244 253 S@WSID
     I                                      254 263 S@USID
     I                                      264 269 S@JBID
     I*<<システム日時>>
     I            DS
     I                                        1  140S@TIME
     I                                        1   60S@HMS
     I                                        1   20S@TMHH
     I                                        3   40S@TMMM
     I                                        5   60S@TMSS
     I                                        7  140S@YYMD
     I                                        7  100S@DYYY
     I                                       11  120S@DYMM
     I                                       13  140S@DYDD
     I*<<カーソル制御>>
     IWSDS        DS
     I                                    B 370 3710S@CUR
     I                                      370 370 S@LIN
     I                                      371 371 S@COL
     I                                    B 378 3790S@POS
     **--------------------------------------------------------------**
     I* <<共通>>
     I            DS
     I                                        1   80W@SYMD
     I                                        1   20W@SMM
     I                                        3   40W@SDD
     I                                        5   80W@SYY4
     I            DS
     I                                        1   8 W@SEL
     I                                        1   1 W@SEL1
     I                                        2   2 W@HF
     I                                        3   8 W@SEL2
     **==============================================================**
     **  パラメータ
     **==============================================================**
     C*（使用無し）
     **==============================================================**
     **  ＫＥＹ
     **==============================================================**
     C*（使用無し）
     **==============================================================**
     **  メインルーチン
     **==============================================================**
      *
      *---<初期処理>---*
     C                     EXSR #INIT
      *
      *---<主処理>---*
     C           W@NEXT    DOUEQ'END  '                    ¬DO_01
      * G1
     C           W@NEXT    CASEQ'SET10'   #SET10           ~¬CAS
     C           W@NEXT    CASEQ'PNL10'   #PNL10            |
     C           W@NEXT    CASEQ'CHK10'   #CHK10            |
      *
     C           W@NEXT    CASEQ'CAL10'   #CAL10            |
     C                     END                             _｢CAS
      *
     C                     END                             ｢DO_01
      *
      *---<終了処理>---*
     C                     SETON                     LR
     C                     RETRN
      *
      **************************************************************************
      *         Ｓ　Ｕ　Ｂ　－　Ｒ　Ｏ　Ｕ　Ｔ　Ｉ　Ｎ　Ｅ
      **************************************************************************
      *-------------------------------------------------------------------------
      *          #INIT    初期処理
      *-------------------------------------------------------------------------
     C           #INIT     BEGSR
      *
     C                     TIME           S@TIME
     C                     Z-ADDS@DYMM    W@SMM
     C                     Z-ADDS@DYDD    W@SDD
     C                     Z-ADDS@DYYY    W@SYY4
     C                     Z-ADDW@SYMD    D1SYMD           * SYSTEM DATE
      *
     C                     MOVEL*BLANK    W@SELC  1        *更新区分
      *
      * NEXT-CONTROL
     C                     MOVEL'SET10'   W@NEXT  5
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #SET10   第一画面(G1) 項目セット処理
      *-------------------------------------------------------------------------
     C           #SET10    BEGSR
      *
     C                     SETOF                     41
     C                     SETOF                     99
      *
     C                     MOVELW@SELC    D1SELC           *更新区分
      *
      * NEXT-CONTROL
     C                     MOVEL'PNL10'   W@NEXT           G1-PNL
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #PNL10   第一画面(G1) 表示処理
      *-------------------------------------------------------------------------
     C           #PNL10    BEGSR
      *
     C                     EXFMTMRHPW611
      *
     C                     SETOF                     41
     C                     SETOF                     99
     C                     MOVEL*BLANK    D1EMSG           * ERR MSG
      *
      * NEXT-CONTROL
     C                     MOVEL'CHK10'   W@NEXT
      * CF01
     C           *IN01     IFEQ '1'                        ¬IF_01
     C                     MOVEL'END  '   W@NEXT
     C                     END                             ｢IF_01
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #CHK10   第一画面(G1) チェック処理
      *-------------------------------------------------------------------------
     C           #CHK10    BEGSR
      *更新区分
     C           D1SELC    IFNE '1'                        ¬IF_01
     C           D1SELC    ANDNE'2'
     C           D1SELC    ANDNE'3'
     C  N99                MOVEL@MS,01    D1EMSG    P      * ERR MSG
     C  N99                SETON                     4199
     C                     END                             ｢IF_01
      *
      * NEXT-CONTROL
     C                     MOVEL'CAL10'   W@NEXT
      *エラーあり
     C           *IN99     IFEQ '1'                        ¬IF_01
     C                     MOVEL'PNL10'   W@NEXT
     C                     END                             ｢IF_01
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #CAL10   プログラム呼出処理
      *-------------------------------------------------------------------------
     C           #CAL10    BEGSR
      *
     C                     SETOF                     99
      *進捗確認　品番検索(MRHR62)
     C           D1SELC    IFEQ '1'                        ¬IF_01
     C                     CALL 'MRHR62'
     C                     PARM           P1HIN1  5
     C                     PARM           P1HIN2  5
     C                     PARM           P1HIN3  2
     C                     PARM           P1FLG   1
     C                     END                             ｢IF_01
      *
      *進捗確認　各種キー検索(MRHR63)
     C           D1SELC    IFEQ '2'                        ¬IF_01
     C                     CALL 'MRHR63'
     C                     END                             ｢IF_01
      *
      *生産遅れリスト　発行指示(MRHR65)
     C           D1SELC    IFEQ '3'                        ¬IF_01
     C                     CALL 'MRHR65'
     C                     END                             ｢IF_01
      *
      * NEXT-CONTROL
     C                     MOVEL*BLANK    W@SELC           *更新区分
     C                     MOVEL'PNL10'   W@NEXT
     C           D1SELC    IFEQ '3'                        ¬IF_01
     C                     MOVEL'END  '   W@NEXT
     C                     END                             ｢IF_01
      *
     C                     ENDSR
      *----------------------------------------------------------------
**  @MS  ( ERR MSG )
ER01 SELECT "1" OR "2" OR "3"
