     ******************************************************************
     **  プログラム名   : 進捗確認　検索詳細                     **
     **  プログラムＩＤ :  MRHR64     <RPG>                        **
     **  作成年月日     :  2014/01/23                              **
     **  作成者         :  TR-ITS                                  **
     **  プログラム概要 : 進捗確認のため、指定情報を出力する。　 **
     **--------------------------------------------------------------**
     **  変更年月日     :  YYYY/MM/DD                              **
     **  変更者         :                                          **
     **  変更内容       :                                          **
     ******************************************************************
     ** <<使用標識説明>>
     **        03       :
     **        08       :
     **     31～33    :
     **     41～44    :
     **     51～51    :
     **        80       :
     **        89       :
     **        97       :
     **        99       :
     ******************************************************************
     H            Y/                                    1
     **==============================================================**
     **
     **==============================================================**
     F*
     FMRHPW64 CF  E                    WORKSTN
     F                                              KINFDS WSDS
     F                                        RRN02 KSFILE SFL01
     F*
     FMRHPL51 IF  E           K        DISK
     F*
     F*
     FMRHPL11 IF  E           K        DISK
     F*
     **==============================================================**
     **
     **==============================================================**
     E                    @MI     1   2 10                MIDASHI
     E*
     **==============================================================**
     **  ＤＳ
     **==============================================================**
     I*<<システム情報>>
     I           SDS
     I                                     *PROGRAM S@PGID
     I                                      244 253 S@WSID
     I                                      254 263 S@USID
     I                                      264 269 S@JBID
     I*<<システム日時>>
     I            DS
     I                                        1  140S@TIME
     I                                        1   60S@HMS
     I                                        1   20S@TMHH
     I                                        3   40S@TMMM
     I                                        5   60S@TMSS
     I                                        7  140S@YYMD
     I                                        9  140S@DYMD
     I                                        7  100S@DYYY
     I                                       11  120S@DYMM
     I                                       13  140S@DYDD
     I*<<カーソル制御>>
     IWSDS        DS
     I                                    B 370 3710S@CUR
     I                                      370 370 S@LIN
     I                                      371 371 S@COL
     I                                    B 378 3790S@POS
     **--------------------------------------------------------------**
     I* <<共通>>
     I            DS
     I                                        1   80W@SYMD
     I                                        1   20W@SMM
     I                                        3   40W@SDD
     I                                        5   80W@SYY4
     I*   手配番号
     I            DS
     I                                        1   8 W@THI
     I                                        1   4 W@THI1
     I                                        5   5 W@HF1
     I                                        6   8 W@THI2
     I*   番地／構成情報（番地）
     I            DS
     I                                        1   9 W@BAN
     I                                        1   1 W@BAN1
     I                                        2   2 W@HF2
     I                                        3   4 W@BAN2
     I                                        5   5 W@HF3
     I                                        6   7 W@BAN3
     I                                        8   8 W@HF4
     I                                        9   9 W@BAN4
     I*   社内品番／ブランク品番／構成情報（品番）
     I            DS
     I                                        1  14 W@HIN
     I                                        1   5 W@HIN1
     I                                        6   6 W@HF5
     I                                        7  11 W@HIN2
     I                                       12  12 W@HF6
     I                                       13  14 W@HIN3
     I            DS
     I                                        1  14 STSHIN
     I                                        1   5 STSHN1
     I                                        6  10 STSHN2
     I                                       11  12 STSHN3
     I            DS
     I                                        1  14 SBHINB
     I                                        1   5 SBHIN1
     I                                        6  10 SBHIN2
     I                                       11  12 SBHIN3
     I*   ユーザー品番
     I            DS
     I                                        1  23 W@MHN
     I                                        1   5 W@MHN1
     I                                        6   6 W@HF7
     I                                        7  11 W@MHN2
     I                                       12  12 W@HF8
     I                                       13  17 W@MHN3
     I                                       18  18 W@HF9
     I                                       19  23 W@MHN4
     I*   構成情報
     I            DS
     I                                        1  24 W@KH
     I                                        1  14 W@KHIN
     I                                       15  15 W@CLN
     I                                       16  24 W@KBAN
     I*   構成情報・日付
     I            DS
     I                                        1  15 W@KHZ
     I                                        1  10 W@KMI
     I                                       11  11 W@KM1
     I                                       12  120W@KM2
     I                                       13  13 W@SLA
     I                                       14  150W@KDD
     I*   日付表示変更用
     I            DS
     I                                        1   80W@YMD
     I                                        1   40W@YY1
     I                                        5   80W@MD1
     I                                        5   50W@MMX
     I                                        5   60W@MM1
     I                                        7   80W@DD1
     I            DS
     I                                        1   80W@MDY
     I                                        1   40W@YY2
     I                                        5   80W@MD2
     I*
     **==============================================================**
     **  パラメータ
     **==============================================================**
     C           *ENTRY    PLIST
     C                     PARM           P@THI1  4        *手配番号1
     C                     PARM           P@THI2  3        *手配番号2
     C                     PARM           P@GRHZ  80       *登録日
     C                     PARM           P@GRTM  60       *登録時間
     C* <<チェックゲート(MRHR51) >>
     C           P1MR51    PLIST
     C                     PARM           P1THI1  4        *手配番号1
     C                     PARM           P1THI2  3        *手配番号2
     C                     PARM           P1GRHZ  80       *登録日
     C                     PARM           P1GRTM  60       *登録時間
     C*
     **==============================================================**
     **  ＫＥＹ
     **==============================================================**
     C* <<試作手配データファイル(MRHPL51)>>
     C           STKEY1    KLIST
     C                     KFLD           STTHI1
     C                     KFLD           STTHI2
     C                     KFLD           STGRHZ
     C                     KFLD           STGRTM
     C*
     C           STKEY2    KLIST
     C                     KFLD           STTHI1
     C                     KFLD           STTHI2
     C*
     C           STKEY3    KLIST
     C                     KFLD           STBAN1           * LOCATION CODE 1
     C                     KFLD           STBAN2           * LOCATION CODE 2
     C                     KFLD           STBAN3           * LOCATION CODE 3
     C                     KFLD           STBAN4           * LOCATION CODE 4
     **==============================================================**
     **  メインルーチン
     **==============================================================**
      *
      *---<初期処理>---*
     C                     EXSR #INIT
      *
      *---<主処理>---*
     C           W@NEXT    DOUEQ'END  '                    ¬DO_01
      * D1/S2/D2
     C           W@NEXT    CASEQ'INZ10'   #INZ10           ~¬CAS
     C           W@NEXT    CASEQ'SET10'   #SET10            |
     C           W@NEXT    CASEQ'PNL10'   #PNL10            |
     C           W@NEXT    CASEQ'CHK10'   #CHK10            |
      *
     C           W@NEXT    CASEQ'CAL10'   #CAL10            |
     C                     END                             _｢CAS
      *
     C                     END                             ｢DO_01
      *
      *---<終了処理>---*
     C                     SETON                     LR
     C                     RETRN
      *
      **************************************************************************
      *         Ｓ　Ｕ　Ｂ　－　Ｒ　Ｏ　Ｕ　Ｔ　Ｉ　Ｎ　Ｅ
      **************************************************************************
      *-------------------------------------------------------------------------
      *          #INIT    初期処理
      *-------------------------------------------------------------------------
     C           #INIT     BEGSR
      *
     C                     TIME           S@TIME
     C                     Z-ADDS@DYMM    W@SMM
     C                     Z-ADDS@DYDD    W@SDD
     C                     Z-ADDS@DYYY    W@SYY4
     C                     Z-ADDW@SYMD    D1SYMD           * SYSTEM DATE
      *
      * NEXT-CONTROL
     C                     MOVEL'INZ10'   W@NEXT  5        S2/D2-INZ
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #INZ10   第一画面(S2/D2) 項目初期化処理
      *-------------------------------------------------------------------------
     C           #INZ10    BEGSR
      * CTL
     C                     SETON                         33
     C                     WRITECTL01
     C                     SETOF                         33
      *
     C                     Z-ADD*ZERO     RRN02   40
     C                     Z-ADD*ZERO     D2RRN
     C                     Z-ADD*ZERO     W@LAST  40
      *
     C                     Z-ADD*ZERO     W@COHZ  80
      *
      * NEXT-CONTROL
     C                     MOVEL'SET10'   W@NEXT           D1/S2/D2-SET
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #SET10   第一画面(D1/S2/D2) 項目セット処理
      *-------------------------------------------------------------------------
     C           #SET10    BEGSR
      *
     C                     SETOF                     99
     C                     SETOF                     51    CMD-8 CHECK
      * D1-SET
     C                     Z-ADDD1SYMD    D1SYMD           * SYSTEM DATE
     C*試作手配データファイル(MRHPL51)
     C                     MOVELP@THI1    STTHI1
     C                     MOVELP@THI2    STTHI2
     C                     Z-ADDP@GRHZ    STGRHZ
     C                     Z-ADDP@GRTM    STGRTM
     C           STKEY1    SETLLMRHPL511
     C                     EXSR #RED10
      *
     C           *IN80     IFEQ '0'                        ¬IF_01
     C                     MOVEL'-'       W@HF1
     C                     MOVEL'-'       W@HF2
     C                     MOVEL'-'       W@HF3
     C                     MOVEL'-'       W@HF4
     C                     MOVEL'-'       W@HF5
     C                     MOVEL'-'       W@HF6
     C                     MOVEL'-'       W@HF7
     C                     MOVEL'-'       W@HF8
     C                     MOVEL'-'       W@HF9
     C                     MOVEL':'       W@CLN
      *   D1-SET
     C                     MOVELSTDVKB    D1DVKB           *発行部署
     C                     MOVELSTDVNM    D1DVNM           *発行部署名
     C                     MOVELSTDPNM    D1DPNM           *発行依頼者
      *
     C                     MOVELSTTHI1    W@THI1
     C                     MOVELSTTHI2    W@THI2
     C                     MOVELW@THI     D1THI            *手配番号
      *
     C                     MOVELSTBAN1    W@BAN1
     C                     MOVELSTBAN2    W@BAN2
     C                     MOVELSTBAN3    W@BAN3
     C                     MOVELSTBAN4    W@BAN4
      *
     C                     MOVELW@BAN     D1BAN            *番地
      *
     C           W@BAN2    IFEQ 'QD'                       IF
     C           W@BAN2    OREQ 'PC'                       OR
     C                     ELSE                            ELSE
     C                     SETOF                     56    |
     C           STKEY3    CHAINMRHPL11              56    |
     C           *IN56     IFEQ '0'                        |IF
     C           SBHINB    IFNE STSHIN                     ||IF
     C                     SETON                     56    |||
     C                     ENDIF                           ||END
     C           SBLNO1    IFNE STTHI1                     ||IF
     C           SBLNO2    ORNE STTHI2                     ||OR
     C                     SETON                     56    |||
     C                     ENDIF                           ||END
     C                     ENDIF                           |END
     C                     ENDIF                           END
      *
     C                     MOVELSTSHN1    W@HIN1
     C                     MOVELSTSHN2    W@HIN2
     C                     MOVELSTSHN3    W@HIN3
     C                     MOVELW@HIN     D1SHN            *社内品番
      *
     C                     MOVELSTMHN1    W@MHN1
     C                     MOVELSTMHN2    W@MHN2
     C                     MOVELSTMHN3    W@MHN3
     C                     MOVELSTMHN4    W@MHN4
     C                     MOVELW@MHN     D1MHN            *ユーザー品番
      *
     C                     MOVELSTBHN1    W@HIN1
     C                     MOVELSTBHN2    W@HIN2
     C                     MOVELSTBHN3    W@HIN3
     C                     MOVELW@HIN     D1BHN
      *
     C                     Z-ADDSTTOKU    D1TOKU
     C                     MOVELSTTKNM    D1TKNM
     C                     Z-ADDSTSISU    D1SISU
     C                     Z-ADDSTTHSU    D1THSU
      *
     C                     Z-ADDSTSSYS    D4CONQ
     C                     Z-ADDSTHKSU    D4BOXQ
      *
      *
     C                     Z-ADDSTNOHZ    W@YMD
     C                     Z-ADDW@YY1     W@YY2
     C                     Z-ADDW@MD1     W@MD2
     C                     Z-ADDW@MDY     D1NOHZ
      *
     C                     MOVELSTTHMK    D1THMK
     C                     MOVELSTINSP    D2INSP
     C                     Z-ADDSTBRHZ    D2BRHZ
     C                     MOVELSTBRMK    D2BRMK
     C                     Z-ADDSTPCHZ    D2PCHZ
      *   D2-SET
      *   構成情報１
     C                     MOVELSTKH11    W@HIN1
     C                     MOVELSTKH12    W@HIN2
     C                     MOVELSTKH13    W@HIN3
     C                     MOVELW@HIN     W@KHIN
     C                     MOVELSTKB11    W@BAN1
     C                     MOVELSTKB12    W@BAN2
     C                     MOVELSTKB13    W@BAN3
     C                     MOVELSTKB14    W@BAN4
     C                     MOVELW@BAN     W@KBAN
     C                     MOVELW@KH      D2KH1
      *
     C                     Z-ADDSTWHZ1    D2WHZ1
      *   構成情報２
     C                     MOVELSTKH21    W@HIN1
     C                     MOVELSTKH22    W@HIN2
     C                     MOVELSTKH23    W@HIN3
     C                     MOVELW@HIN     W@KHIN
     C                     MOVELSTKB21    W@BAN1
     C                     MOVELSTKB22    W@BAN2
     C                     MOVELSTKB23    W@BAN3
     C                     MOVELSTKB24    W@BAN4
     C                     MOVELW@BAN     W@KBAN
     C                     MOVELW@KH      D2KH2
      *
     C                     Z-ADDSTWHZ2    D2WHZ2
      *   構成情報３
     C                     MOVELSTKH31    W@HIN1
     C                     MOVELSTKH32    W@HIN2
     C                     MOVELSTKH33    W@HIN3
     C                     MOVELW@HIN     W@KHIN
     C                     MOVELSTKB31    W@BAN1
     C                     MOVELSTKB32    W@BAN2
     C                     MOVELSTKB33    W@BAN3
     C                     MOVELSTKB34    W@BAN4
     C                     MOVELW@BAN     W@KBAN
     C                     MOVELW@KH      D2KH3
      *
     C                     Z-ADDSTWHZ3    D2WHZ3
      *   構成情報４
     C                     MOVELSTKH41    W@HIN1
     C                     MOVELSTKH42    W@HIN2
     C                     MOVELSTKH43    W@HIN3
     C                     MOVELW@HIN     W@KHIN
     C                     MOVELSTKB41    W@BAN1
     C                     MOVELSTKB42    W@BAN2
     C                     MOVELSTKB43    W@BAN3
     C                     MOVELSTKB44    W@BAN4
     C                     MOVELW@BAN     W@KBAN
     C                     MOVELW@KH      D2KH4
      *
     C                     Z-ADDSTWHZ4    D2WHZ4
      *
     C                     MOVEL@MI,1     W@KMI
     C                     Z-ADDSTKTHZ    W@YMD
     C           W@MMX     IFEQ *ZERO                      ~¬IF_02
     C                     MOVEL*BLANK    W@KM1
     C                     ELSE                            -+ELSE_02
     C                     MOVELW@MMX     W@KM1
     C                     END                             _｢IF_02
     C                     Z-ADDW@MM1     W@KM2
     C                     MOVEL'/'       W@SLA
     C                     Z-ADDW@DD1     W@KDD
     C                     MOVELW@KHZ     D2KTHZ           *型納期
      *
     C                     MOVEL@MI,2     W@KMI
     C                     Z-ADDSTZRHZ    W@YMD
     C           W@MMX     IFEQ *ZERO                      ~¬IF_02
     C                     MOVEL*BLANK    W@KM1
     C                     ELSE                            -+ELSE_02
     C                     MOVELW@MMX     W@KM1
     C                     END                             _｢IF_02
     C                     Z-ADDW@MM1     W@KM2
     C                     MOVEL'/'       W@SLA
     C                     Z-ADDW@DD1     W@KDD
     C                     MOVELW@KHZ     D2ZRHZ           *材料納期
      *
     C                     MOVEL*BLANK    D2EMSG           * d[ｰxｮﾈｰﾆﾞ
      *
     C                     Z-ADD*ZERO     I       20
     C                     Z-ADDW@LAST    RRN02
     C                     Z-ADD*ZERO     W@RCNO  40
      *
     C           *IN80     DOWEQ'0'                        ~¬DO_01
     C           RRN02     ANDLT20
     C           I         ANDLT15
     C           I         ADD  1         S2SEQ            *行№
     C                     MOVELSTKTEI    S2KTEI           *工程
     C                     Z-ADDSTKBMN    S2KBMN
     C                     MOVELSTKBNM    S2KBNM
     C                     MOVELSTMSNO    S2MSNO
     C                     Z-ADDSTKNHZ    S2KNHZ
     C                     Z-ADDSTCIHZ    S2CIHZ
     C                     Z-ADDSTCOHZ    S2COHZ
     C                     Z-ADDSTCOHZ    W@COHZ
     C                     MOVELSTKVIK    S2KVIK           *備考
      *
     C                     SETOF                     55
     C           S2COHZ    IFEQ *ZERO                      ~~¬IF_02
     C           STKNHZ    IFLT S@YYMD                     ~~¬IF_02
     C                     SETON                     55
     C                     END                             __｢IF_02
     C                     ELSE
     C           STCOHZ    IFGT STKNHZ                     ~~¬IF_02
     C                     SETON                     55
     C                     END                             __｢IF_02
     C                     END                             __｢IF_02
      *
     C                     ADD  1         I
     C                     ADD  1         RRN02
     C                     WRITESFL01
      *
     C           S2SEQ     IFEQ 1                          ~~¬IF_02
     C                     Z-ADDRRN02     W@RCNO           * PAGE 1ST RRN
     C                     END                             __｢IF_02
      *試作手配データファイル(MRHPL51)
     C                     EXSR #RED10
     C                     END                             _｢DO_01
      *
     C                     Z-ADDRRN02     W@LAST           * LAST RRN
      *
     C           W@LAST    IFNE *ZERO                      ~¬IF_02
     C                     SETON                     31
     C                     END                             _｢IF_02
      *
     C           W@COHZ    IFEQ *ZERO                      ~¬IF_02
     C                     SETON                     51
     C                     END                             _｢IF_02
      *
      *
      * (MRHPL51)
     C                     MOVELP@THI1    STTHI1
     C                     MOVELP@THI2    STTHI2
     C           STKEY2    SETGTMRHPL511
     C           STKEY2    REDPEMRHPL511                 81
     C           *IN81     IFEQ '0'                        ¬IF_01
     C           STGSJY    IFEQ 'D'                        ~¬IF_02
     C           STGSHZ    ANDLES@YYMD
      *(処理無し)
     C                     ELSE                            -+ELSE_02
     C           STGRHZ    IFNE P@GRHZ                     ~~¬IF_03
     C           STGRTM    ORNE P@GRTM
     C                     SETOF                     51
     C                     END                             __｢IF_03
     C                     END                             _｢IF_02
     C                     END                             ｢IF_01
      *
     C                     END                             ｢IF_01
      *
      * NEXT-CONTROL
     C           W@RCNO    IFNE *ZERO                      ¬IF_01
     C                     Z-ADDW@RCNO    RRN02
     C                     Z-ADDRRN02     D2RRN
     C                     END                             ｢IF_01
     C                     MOVEL'PNL10'   W@NEXT           D1/S2/D2-PNL
      *データ無
     C           W@LAST    IFEQ *ZERO                      ¬IF_01
     C                     MOVEL'END  '   W@NEXT           END
     C                     END                             ｢IF_01
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #PNL10
      *-------------------------------------------------------------------------
     C           #PNL10    BEGSR
      *
     C                     SETON                     32
     C                     WRITEDSP01
     C                     EXFMTCTL01
     C                     SETOF                     32
      *
     C                     SETOF                     99
     C                     MOVEL*BLANK    D2EMSG           * ERR MSG
     C                     Z-ADDS@POS     W@RRNW  40
      *
      * NEXT-CONTROL
     C                     MOVEL'CHK10'   W@NEXT
      * CF03
     C           *IN03     IFEQ '1'                        ¬IF_01
     C                     MOVEL'END  '   W@NEXT           END
     C                     END                             ｢IF_01
      * CF08
     C           *IN08     IFEQ '1'                        ¬IF_01
     C                     MOVEL'CAL10'   W@NEXT           CALL
     C                     END                             ｢IF_01
      * ROLLDOWN
     C***        *IN39     IFEQ '1'
     C***                  MOVEL'PNL10'   W@NEXT           D1/S2/D2-PNL
     C***                  END
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #CHK10   第一画面(D1/S2/D2) チェック処理
      *-------------------------------------------------------------------------
     C           #CHK10    BEGSR
      *
      * NO CHECK
      *
      * NEXT-CONTROL
     C                     MOVEL'PNL10'   W@NEXT           D1/S2/D2-PNL
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #RED10   試作かんばん情報ファイル　読込
      *-------------------------------------------------------------------------
     C           #RED10    BEGSR
      *
     C                     DO   *HIVAL                     ¬DO_01
     C           STKEY1    READEMRHPL51                9780
     C   80                LEAVE
     C   97                ITER
      *<対象範囲データ抽出>
      *削除データ
     C           STGSJY    IFEQ 'D'                        ~¬IF_01
     C           STGSHZ    ANDLES@YYMD
     C                     ITER
     C                     ENDIF                           _｢IF_01
      *
     C                     LEAVE
     C                     ENDDO                           ｢DO_01
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #CAL10   プログラム呼出処理
      *-------------------------------------------------------------------------
     C           #CAL10    BEGSR
      *
      *仮に試作手配データファイルが変更された場合を鑑み、
      *再度、最新の登録日を確認する
      *（削除の場合は、画面に戻る）
     C                     MOVEL*BLANK    W@RDFL  1
      *
      *試作手配データファイル(MRHPL51)
     C                     MOVELP@THI1    STTHI1
     C                     MOVELP@THI2    STTHI2
     C           STKEY2    SETGTMRHPL511
     C           STKEY2    REDPEMRHPL511                 80
     C           *IN80     IFEQ '0'                        ¬IF_01
     C           STGSJY    IFEQ 'D'                        ~¬IF_02
     C           STGSHZ    ANDLES@YYMD
      *(処理無し)
     C                     ELSE                            -+ELSE_02
     C                     MOVEL'1'       W@RDFL
     C           STGRHZ    IFNE P@GRHZ                     ~~¬IF_03
     C           STGRTM    ORNE P@GRTM
     C                     Z-ADDSTGRHZ    P@GRHZ
     C                     Z-ADDSTGRTM    P@GRTM
     C                     END                             __｢IF_03
     C                     END                             _｢IF_02
     C                     END                             ｢IF_01
      * <<チェックゲート(MRHR51) >>
     C           W@RDFL    IFEQ '1'                        ¬IF_01
     C                     MOVELP@THI1    P1THI1
     C                     MOVELP@THI2    P1THI2
     C                     Z-ADDP@GRHZ    P1GRHZ
     C                     Z-ADDP@GRTM    P1GRTM
     C                     CALL 'MRHR51'  P1MR51
     C                     END                             ｢IF_01
      *
      * NEXT-CONTROL
     C           W@RDFL    IFEQ '1'                        ¬IF_01
     C                     MOVEL'INZ10'   W@NEXT           S2/D2-INZ
     C                     ELSE                            +ELSE_01
     C                     MOVEL'PNL10'   W@NEXT           D1/S2/D2-PNL
     C                     END                             ｢IF_01
      *
     C                     ENDSR
      *----------------------------------------------------------------
**  @MI  ( MIDASHI )
TOOL DATE:
MATERIAL :
