     H            Y/                                    1
     *** MRHR37 *******************************************************
     **  EXSUB: GET BOX COLOR/NAME                                   **
     **  TR-ITS    2014.01.29                                        **
     ** !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!    **
     **  WHEN CHANGING LOGIC, ABMRFD SHOULD BE SYNCHRONIZED          **
     ** !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!    **
     **--------------------------------------------------------------**
     ** JW         2023.03.07 CHANGE JAPANESE TEXT TO ENGLISH        **
     ******************************************************************
     E                    CMT3    1  17  1   CMT4    6   NAME
     **==============================================================**
     I           SDS
     I                                     *PROGRAM S@PGID
     I                                      244 253 S@WSID
     I                                      254 263 S@USID
     I                                      264 269 S@JBID
      * SYSTEM DATE
     I            DS
     I                                        1  140S@TIME
TIME I                                        1   60S@HMS
     I                                        1   20S@TMHH
     I                                        3   40S@TMMM
     I                                        5   60S@TMSS
TODAYI                                        7  140S@YYMD
     I                                        7  100S@DYYY
     I                                       11  120S@DYMM
     I                                       13  140S@DYDD
     **==============================================================**
     ** PARAMETER
     **==============================================================**
     C           *ENTRY    PLIST
     C                     PARM           P@SKBN  1        I TYPE
     C                     PARM           P@BKNO  20       I PROC(N-1)NUMBER
     C                     PARM           P@BKTI  3        I PROC(N-1)
     C                     PARM           P@JKTI  3        I PROC(N)
     C                     PARM           P@JBMN  4        I DEPT(N)
     C                     PARM           P@AKTI  3        I PROC(N+1)
     C                     PARM           P@CKTI  3        I PROC(N+2)
     C                     PARM           P@AKKB  3        I MCN(N+1)
     C                     PARM           P@BCCD  1        O COLOR CODE
     C                     PARM           P@BCNM  6        O COLOR NAME
     C                     PARM           P@RTCD  1        O RETURN CODE
      ** NOTE
      *          P@SKBN  1   I  : TYPE: BLANK=GET COLOR CODE AND NAME
      *                                 1    =GET NAME ONLY
      *          P@BKNO  2S0 I  : PROC(N-1)NUMBER
      *          P@BKTI  3   I  : PROC(N-1)
      *                           *NOTE: IF 4TH DIGITS NOT BLANK --> ERROR
      *          P@JKTI  3   I  : PROC(N)
      *                           *NOTE: IF 4TH DIGITS NOT BLANK --> ERROR
      *          P@AKTI  3   I  : PROC(N+1)
      *                           *NOTE: IF 4TH DIGITS NOT BLANK --> ERROR
      *          P@AKKB  3   I  : MCN(N+1)
      *          P@BCCD  1   I/O: COLOR CODE
      *          P@BCNM  6   O  : COLOR NAME
      *          P@RTCD  1   O  : RETURN CODE  BLANK: NO ERROR
      *                                        E    : ERROR
     **==============================================================**
     **          MAIN ROUTINE
     **==============================================================**
     C                     EXSR #INIT
      * GET COLOR CODE
     C           P@SKBN    IFEQ *BLANK
     C                     EXSR #SET10
     C                     END
      * GET COLOR NAME
     C           P@BCCD    IFNE *BLANK
     C                     EXSR #SET20
     C                     END
      * SET RETURN CODE
     C           *IN91     IFEQ '1'
     C           *IN92     OREQ '1'
     C                     MOVEL*BLANK    P@RTCD           *RETURN
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *-------------------------------------------------------------------------
      *          GET COLOR CODE
      *-------------------------------------------------------------------------
     C           #SET10    BEGSR
      *-----------------------------*
      *  P@BKNO  2S0 I  : PROC(N-1)NUMBER
      *  P@BKTI  3   I  : PROC(N-1)
      *  P@JKTI  3   I  : PROC(N)
      *  P@JBMN  4   I  : DEPT(N)
      *  P@AKTI  3   I  : PROC(N+1)
      *  P@AKKB  3   I  : MCN(N+1)
      *-----------------------------*
      *
     C           P@JBMN    IFNE '0111'                     * DEPT(N)
     C           P@AKTI    IFEQ 'TC '                      * PROC(N+1)
     C  N91                MOVE ' '       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
     C                     END
      *
     C           P@AKKB    IFEQ 'JC6'                      * MCN(N+1)
     C  N91                MOVE 'E'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@AKTI    IFEQ 'GF '                      * PROC(N+1)
     C  N91                MOVE 'D'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@JKTI    IFEQ 'NF '                      * PROC(N)
     C  N91                MOVE 'B'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@BKNO    IFGE 1                          * PROC(N-1)NUMBER
     C           P@BKTI    IFEQ 'TP '                      * PROC(N-1)
     C           P@JKTI    ANDEQ'HT '                      * PROC(N)
      * COLOR=BLANK
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
     C                     END
      *
     C           P@JKTI    IFEQ 'BZ '                      * PROC(N)
     C           P@AKTI    ANDEQ'DS '                      * PROC(N+1)
     C  N91                MOVE 'H'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@JKTI    IFEQ 'TN '                      * PROC(N)
     C           P@AKTI    ANDEQ'OQ '                      * PROC(N+1)
     C  N91                MOVE *BLANK    P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@AKTI    IFEQ 'OQ '                      * PROC(N+1)
     C           P@AKTI    OREQ 'LOQ'
     C           P@AKTI    OREQ 'TN '
     C           P@AKTI    OREQ 'AS '
     C  N91                MOVE 'P'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@AKTI    IFEQ 'AOQ'                      * PROC(N+1)
     C  N91                MOVE 'Y'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@AKTI    IFEQ 'LAN'                      * PROC(N+1)
     C           P@AKTI    OREQ 'HAN'
     C  N91                MOVE 'G'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@AKTI    IFEQ 'SK '                      * PROC(N+1)
     C  N91                MOVE 'W'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@AKTI    IFEQ 'RL '                      * PROC(N+1)
     C           P@AKTI    OREQ 'FRL'
     C           P@AKTI    OREQ 'CUB'
     C           P@AKTI    OREQ 'TP '
     C           P@AKTI    OREQ 'RRT'
     C  N91                MOVE 'B'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@AKTI    IFEQ 'KRO'                      * PROC(N+1)
     C           P@JKTI    IFEQ 'BZ '                      * PROC(N)
     C  N91                MOVE 'Y'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@JKTI    IFEQ 'RL '                      * PROC(N)
     C           P@JKTI    OREQ 'FRL'
     C           P@JKTI    OREQ 'TP '
     C           P@JKTI    OREQ 'RRT'
     C           P@JKTI    OREQ 'SB '
     C  N91                MOVE *BLANK    P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
     C                     END
      *
     C           P@AKTI    IFEQ 'KRO'                      * PROC(N+1)
     C           P@AKTI    OREQ 'SB '
     C           P@AKTI    OREQ 'CZ '
     C  N91                MOVE 'K'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@AKTI    IFEQ 'BZ '                      * PROC(N+1)
     C           P@AKTI    OREQ 'DS '
     C*
     C           P@JKTI    IFEQ 'RL '                      * PROC(N)
     C           P@JKTI    OREQ 'FRL'
     C           P@JKTI    OREQ 'CUB'
     C           P@JKTI    OREQ 'TP '
     C           P@JKTI    OREQ 'RRT'
     C                     ELSE
     C  N91                MOVE 'K'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C                     END
      *
     C           P@AKTI    IFEQ 'JC '                      * PROC(N+1)
     C           P@AKTI    OREQ 'TC '
     C           P@AKTI    OREQ 'SL '
     C  N91                MOVE 'Y'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@AKTI    IFEQ 'HK '                      * PROC(N+1)
     C           P@CKTI    ANDEQ'PRS'                      * PROC(N+2)
     C  N91                MOVE 'Z'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@JKTI    IFNE 'HK '                      * PROC(N)
     C           P@AKTI    IFEQ 'PRS'                      * PROC(N+1)
     C  N91                MOVE 'Z'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
     C                     END
      *
     C*****      P@AKTI    IFEQ 'JC6'                      * PROC(N+1)
     C**N91                MOVE 'E'       P@BCCD           * COLOR CODE
     C**N91                SETON                     91    * COLOR FLG *ON
     C*****                END
      *
     C           P@AKTI    IFEQ 'DT '                      * PROC(N+1)
     C  N91                MOVE 'F'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@AKTI    IFEQ 'SD '                      * PROC(N+1)
     C           P@AKTI    OREQ 'NP '
     C  N91                MOVE 'O'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@JKTI    IFEQ 'OQ '                      * PROC(N)
     C  N91                MOVE 'K'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C           P@JKTI    IFEQ 'LOQ'                      * PROC(N)
     C  N91                MOVE 'C'       P@BCCD           * COLOR CODE
     C  N91                SETON                     91    * COLOR FLG *ON
     C                     END
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          GET COLOR NAME (*IN92=*ON)
      *-------------------------------------------------------------------------
     C           #SET20    BEGSR
      *
     C                     Z-ADD1         Y       20
     C           P@BCCD    LOKUPCMT3,Y                   50
     C   50                MOVELCMT4,Y    P@BCNM
     C   50                SETON                     92    * COLOR NAME FLG *ON
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          INITIAL SETTING
      *-------------------------------------------------------------------------
     C           #INIT     BEGSR
      *
     C                     TIME           S@TIME
      *
     C                     SETOF                     91    * COLOR FLG *OFF
     C                     SETOF                     92    * COLOR NAME *OFF
     C                     MOVEL'E'       P@RTCD           * RETURN
     C                     MOVEL*BLANK    P@BCNM           * COLOR NAME
      *
     C           P@SKBN    IFEQ *BLANK
     C                     MOVEL*BLANK    P@BCCD           COLOR CODE
     C                     END
      *
     C                     ENDSR
      *----------------------------------------------------------------
**  CMT3/CMT4 (BOX COLOR NAME)
PPINK
YYELLOW
GLIME
AR-BRWN
KBLACK
RRED
CBROWN
BBLUE
ZYE/BL
MGREEN
WWHITE
OORANGE
JASJ
DBL/WH
EYE/BK
FOR/BK
HPURPLE
