     ******************************************************************
     **  プログラム名   : 絶対№管理ファイル　コンバート　　     **
     **  プログラムＩＤ :  MRHR29     <RPG>                        **
     **  作成年月日     :  2014/01/20                              **
     **  作成者         :  TR-ITS                                  **
     **  プログラム概要 : 絶対№を作成しセットする(Z001-ZZZZ)    **
     **--------------------------------------------------------------**
     **  変更年月日     :  YYYY/MM/DD                              **
     **  変更者         :                                          **
     **  変更内容       :                                          **
     ******************************************************************
     ** <<使用標識説明>>
     **        90       :初回OFF
     ******************************************************************
     H            Y/                                    1
     **==============================================================**
     **  ファイル
     **==============================================================**
     F*<<絶対№管理ファイル>>
     FMRHPL41 O   E           K        DISK
     **==============================================================**
     **  配列
     **==============================================================**
     E                    @CH    36  36  1                CHARACTER
     E                    @ZE         4  1               絶対№
     **==============================================================**
     **  ＤＳ
     **==============================================================**
     I*<<システム情報>>
     I           SDS
     I                                     *PROGRAM S@PGID
     I                                      244 253 S@WSID
     I                                      254 263 S@USID
     I                                      264 269 S@JBID
     I*<<システム日時>>
     I            DS
     I                                        1  140S@TIME
     I                                        1   60S@HMS
     I                                        1   20S@TMHH
     I                                        3   40S@TMMM
     I                                        5   60S@TMSS
     I                                        7  140S@YYMD
     I                                        7  100S@DYYY
     I                                       11  120S@DYMM
     I                                       13  140S@DYDD
     **--------------------------------------------------------------**
     I* <<共通>>
     I            DS
     I                                        1   4 @ZE
     I                                        1   4 W@ZETI
     I                                        1   1 W@ZE1
     I                                        2   2 W@ZE2
     I                                        3   3 W@ZE3
     I                                        4   4 W@ZE4
     **==============================================================**
     **  パラメータ
     **==============================================================**
      *
     **==============================================================**
     **  ＫＥＹ
     **==============================================================**
      *
     **==============================================================**
     **  メインルーチン
     **==============================================================**
      *
      *---<初期処理>---*
     C                     EXSR #INIT
      *
      *---<主処理>---*
     C                     EXSR #MAIN
      *
      *---<終了処理>---*
     C                     SETON                     LR
     C                     RETRN
      *
      **************************************************************************
      *         Ｓ　Ｕ　Ｂ　－　Ｒ　Ｏ　Ｕ　Ｔ　Ｉ　Ｎ　Ｅ
      **************************************************************************
      *-------------------------------------------------------------------------
      *          #INIT    初期処理
      *-------------------------------------------------------------------------
     C           #INIT     BEGSR
      *
     C                     TIME           S@TIME
     C                     SETOF                     90
      *
     C                     MOVEL*BLANK    @ZE              *絶対№
     C                     MOVEL'Z'       W@ZE1
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #MAIN    メイン処理
      *-------------------------------------------------------------------------
     C           #MAIN     BEGSR
      *
     C                     Z-ADD*ZERO     I       30
      * 2桁目セット
     C           I         DOWLT36                         ¬DO_01
     C                     ADD  1         I
     C                     MOVEL@CH,I     W@ZE2
      *
     C                     Z-ADD*ZERO     J       30
      * 3桁目セット
     C           J         DOWLT36                         ~¬DO_02
     C                     ADD  1         J
     C                     MOVEL@CH,J     W@ZE3
      *
     C  N90                Z-ADD1         K       30
     C   90                Z-ADD*ZERO     K
      * 4桁目セット
     C           K         DOWLT36                         ~~¬DO_03
     C                     ADD  1         K
     C                     MOVEL@CH,K     W@ZE4
      *出力処理
     C                     EXSR #WRT10
     C                     END                             __｢DO_03
      *
     C                     END                             _｢DO_02
      *
     C                     END                             ｢DO_01
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #WRT10   絶対№管理ファイル(MRHPL41)追加処理(WRITE)
      *-------------------------------------------------------------------------
     C           #WRT10    BEGSR
      *
     C                     CLEARMRHPL411
      *
     C                     MOVELW@ZETI    EIZETI           * ID NUMBER
     C                     MOVEL'S'       EISEHI           *製品区分
     C                     MOVEL'S'       EITEHI           *手配区分
     C                     Z-ADDS@YYMD    EIAKHZ           * FREE DATE
      *
     C                     WRITEMRHPL411
     C  N90                SETON                     90
      *
     C                     ENDSR
      *----------------------------------------------------------------
**  @CH  ( CHARACTER )
0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ
