     ******************************************************************
     **  プログラム名   : 部品情報マスタ保守　　　　　　　　     **
     **                   : （絶対№取得）　　　　　　　　　　     **
     **  プログラムＩＤ :  MRHR29     <RPG>                        **
     **  作成年月日     :  2014/01/24                              **
     **  作成者         :  TR-ITS                                  **
     **  プログラム概要 : 絶対№を取得しパラメータに返却する　   **
     **--------------------------------------------------------------**
     **  変更年月日     :  YYYY/MM/DD                              **
     **  変更者         :                                          **
     **  変更内容       :                                          **
     ******************************************************************
     ** <<使用標識説明>>
     **        80       :絶対№管理ファイル
     **        81       :部品情報マスタ
     **        82       :号口部品マスタ
     ******************************************************************
     H            Y/                                    1
     **==============================================================**
     **  ファイル
     **==============================================================**
     F*<<部品情報マスタ>>
     FMRHPL21 IF  E           K        DISK
     F*<<号口部品マスタ>>
     FFCEPL01 IF  E           K        DISK
     F*<<絶対№管理ファイル(L1) >>
     FMRHPL41 IF  E           K        DISK
     F*<<絶対№管理ファイル(L2) >>
     FMRHPL42 IF  E           K        DISK
     **==============================================================**
     **  配列
     **==============================================================**
      *
     **==============================================================**
     **  ＤＳ
     **==============================================================**
     I*<<システム情報>>
     I           SDS
     I                                     *PROGRAM S@PGID
     I                                      244 253 S@WSID
     I                                      254 263 S@USID
     I                                      264 269 S@JBID
     I*<<システム日時>>
     I            DS
     I                                        1  140S@TIME
     I                                        1   60S@HMS
     I                                        1   20S@TMHH
     I                                        3   40S@TMMM
     I                                        5   60S@TMSS
     I                                        7  140S@YYMD
     I                                        7  100S@DYYY
     I                                       11  120S@DYMM
     I                                       13  140S@DYDD
     **--------------------------------------------------------------**
     I* <<共通>>
     I            DS
     I                                        1   80W@A2HZ
     I                                        1   40W@A2YY
     I                                        5   60W@A2MM
     I                                        7   80W@A2DD
     **==============================================================**
     **  パラメータ
     **==============================================================**
     C           *ENTRY    PLIST
     C                     PARM           P@KKBN  1        *更新区分
     C                     PARM           P@SHN1  5        *社内品番１
     C                     PARM           P@SHN2  5        *社内品番２
     C                     PARM           P@SHN3  2        *社内品番３
     C                     PARM           P@ZETI  4        *絶対№
     C                     PARM           P@KNKB  1        *取得内容区分
     C                     PARM           P@RTCD  1        *リターンコード
     **==============================================================**
     **  ＫＥＹ
     **==============================================================**
     C* <<部品情報マスタ(MRHPL21) >>
     C           EAKEY     KLIST
     C                     KFLD           EASHN1           *社内品番１
     C                     KFLD           EASHN2           *社内品番２
     C                     KFLD           EASHN3           *社内品番３
     C                     KFLD           EASEHI           *製品区分
     C                     KFLD           EATEHI           *手配区分
     C* <<号口部品マスタ(FCEPL01) >>
     C           A2KEY     KLIST
     C                     KFLD           A2BHB1           *社内品番１
     C                     KFLD           A2BHB2           *社内品番２
     C                     KFLD           A2BHB3           *社内品番３
     C* <<絶対№管理ファイル(MRHPL41) >>
     C           EIKEY1    KLIST
     C                     KFLD           EIZETI           *絶対№
     C* <<絶対№管理ファイル(MRHPL42) >>
     C           EIKEY2    KLIST
     C                     KFLD           EISEHI           *製品区分
     C                     KFLD           EITEHI           *手配区分
     **==============================================================**
     **  メインルーチン
     **==============================================================**
      *
      *---<初期処理>---*
     C                     EXSR #INIT
      *
      *---<主処理>---*
     C                     EXSR #MAIN
      *
      *---<終了処理>---*
     C                     SETON                     LR
     C                     RETRN
      *
      **************************************************************************
      *         Ｓ　Ｕ　Ｂ　－　Ｒ　Ｏ　Ｕ　Ｔ　Ｉ　Ｎ　Ｅ
      **************************************************************************
      *-------------------------------------------------------------------------
      *          #INIT    初期処理
      *-------------------------------------------------------------------------
     C           #INIT     BEGSR
      *
     C                     TIME           S@TIME
      *
     C                     MOVEL*BLANK    P@ZETI           *絶対№
     C                     MOVEL*BLANK    P@KNKB           *取得内容区分
     C                     MOVEL*BLANK    P@RTCD           *リターンコード
      *
     C                     MOVEL'S'       W@SEHI  1        *製品区分
     C                     MOVEL'S'       W@TEHI  1        *手配区分
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #MAIN    メイン処理
      *-------------------------------------------------------------------------
     C           #MAIN     BEGSR
      *
     C                     MOVEL*BLANK    W@ZETI  4        *絶対№
     C                     MOVEL*BLANK    W@KNKB  1        *取得内容区分
      *部品情報マスタの既存値取得
     C                     EXSR #SET10
      *
     C           W@ZETI    IFEQ *BLANK                     ¬IF_01
      *号口部品マスタの既存値取得
     C                     EXSR #SET20
     C                     END                             ｢IF_01
      *
     C           W@ZETI    IFEQ *BLANK                     ¬IF_01
      *新規取得
     C                     EXSR #SET30
     C                     END                             ｢IF_01
      *
     C           W@ZETI    IFEQ *BLANK                     ¬IF_01
     C                     MOVEL'E'       P@RTCD           *リターンコード
     C                     ELSE                            +ELSE_01
      *パラメータセット
     C                     MOVELW@ZETI    P@ZETI           *絶対№
     C                     MOVELW@KNKB    P@KNKB           *取得内容区分
     C                     END                             ｢IF_01
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #SET10   部品情報マスタの既存値取得
      *-------------------------------------------------------------------------
     C           #SET10    BEGSR
      *部品情報マスタ(MRHPL21)
     C                     MOVELP@SHN1    EASHN1           *社内品番１
     C                     MOVELP@SHN2    EASHN2           *社内品番２
     C                     MOVELP@SHN3    EASHN3           *社内品番３
     C                     MOVELW@SEHI    EASEHI           *製品区分
     C                     MOVELW@TEHI    EATEHI           *手配区分
     C           EAKEY     CHAINMRHPL211             81
     C           *IN81     IFEQ '0'                        ¬IF_01
     C           EAGSJY    IFEQ 'D'                        ~¬IF_02
     C           EAGSHZ    ANDLES@YYMD
      *
     C                     ELSE                            -+ELSE_02
     C                     MOVELEAZETI    W@ZETI           *絶対№
     C                     MOVEL'1'       W@KNKB           *取得内容区分
      *
     C           W@ZETI    IFEQ '0000'                     ~~¬IF_03
     C                     MOVEL*BLANK    W@ZETI           *絶対№
     C                     MOVEL*BLANK    W@KNKB           *取得内容区分
     C                     END                             __｢IF_03
      *
     C           W@ZETI    IFNE *BLANK                     ~~¬IF_03
      *絶対№管理ファイル(MRHPL41)
     C                     MOVELW@ZETI    EIZETI           *絶対№
     C           EIKEY1    CHAINMRHPL411             80
     C           *IN80     IFEQ '1'                        ~~~¬IF_04
     C           *IN80     OREQ '0'
     C           EIGSKD    ANDEQ'D'
     C           EIGSHZ    ANDLES@YYMD
     C                     MOVEL*BLANK    W@ZETI           *絶対№
     C                     MOVEL*BLANK    W@KNKB           *取得内容区分
      *
     C                     ELSE                            ---+ELSE_04
      *　社内品番が異なるとき
     C           EASHN1    IFNE EISHN1                     ~~~~¬IF_05
     C           EASHN2    ORNE EISHN2
     C           EASHN3    ORNE EISHN3
     C                     MOVEL*BLANK    W@ZETI           *絶対№
     C                     MOVEL*BLANK    W@KNKB           *取得内容区分
     C                     END                             ____｢IF_05
     C                     END                             ___｢IF_04
      *
     C                     END                             __｢IF_03
      *
     C                     END                             _｢IF_02
     C                     END                             ｢IF_01
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #SET20   号口部品マスタの既存値取得
      *-------------------------------------------------------------------------
     C           #SET20    BEGSR
      *号口部品マスタ(FCEPL01)
     C                     MOVELP@SHN1    A2BHB1           *社内品番１
     C                     MOVELP@SHN2    A2BHB2           *社内品番２
     C                     MOVELP@SHN3    A2BHB3           *社内品番３
     C           A2KEY     CHAINFCEPL011             82
     C           *IN82     IFEQ '0'                        ¬IF_01
     C                     Z-ADDA2GSYY    W@A2YY           *削除予定年
     C                     Z-ADDA2GSMM    W@A2MM           *削除予定月
     C                     Z-ADDA2GSDD    W@A2DD           *削除予定日
     C           A2GSKD    IFEQ 'D'                        ~¬IF_02
     C           W@A2HZ    ANDLES@YYMD
      *
     C                     ELSE                            -+ELSE_02
     C                     MOVELA2ZETI    W@ZETI           *絶対№
     C                     MOVEL'2'       W@KNKB           *取得内容区分
     C                     END                             _｢IF_02
     C                     END                             ｢IF_01
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #SET30   絶対№新規取得
      *-------------------------------------------------------------------------
     C           #SET30    BEGSR
      *絶対№管理ファイル(MRHPL42)
     C                     MOVELW@SEHI    EISEHI           *製品区分
     C                     MOVELW@TEHI    EITEHI           *手配区分
     C           EIKEY2    SETLLMRHPL421
     C                     EXSR #RED30                     * UPDAT
     C           *IN80     IFEQ '0'                        ¬IF_01
     C                     MOVELEIZETI    W@ZETI           *絶対№
     C                     MOVEL'0'       W@KNKB           *取得内容区分
     C                     END                             ｢IF_01
      *
     C                     ENDSR
      *-------------------------------------------------------------------------
      *          #RED30   絶対№管理ファイル(MRHPL42)読込処理
      *-------------------------------------------------------------------------
     C           #RED30    BEGSR
      *
     C                     DO   *HIVAL                     ¬DO_01
     C           EIKEY2    READEMRHPL421                 80
     C   80                LEAVE
      *
     C           EIGSKD    IFEQ 'D'                        ~¬IF_01
     C           EIGSHZ    ANDLES@YYMD
     C                     ITER
     C                     END                             _｢IF_01
      *既に取得されていたら対象外
     C           EISHN1    IFNE *BLANK                     ~¬IF_01
     C           EISHN2    ORNE *BLANK
     C           EISHN3    ORNE *BLANK
     C                     ITER
     C                     END                             _｢IF_01
      *
     C                     LEAVE
     C                     END                             ｢DO_01
      *
     C                     ENDSR
      *----------------------------------------------------------------
