     H            Y.
      ** MYAR31 **********************************
      *  NO3. FACILITIES LOAD GRAPH DATA MAKING  *
      * 設備負荷グラフ№３データ作成           *
      *      I-HASADA            2013/03/11      *
      ********************************** MYAR31 **
     FMYAPW31 CF  E                    WORKSTN
     FFCEPP01 IF  E                    DISK
     FAAMPL11 IF  E           K        DISK
     FGHCPL22 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FFCETL03 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FMBDPL12 IF  E           K        DISK
     FABBPL21 IF  E           K        DISK
     FMFAPL22 IF  E           K        DISK
     F*MDAPL29 IF  E           K        DISK
     FAEBPL01 IF  E           K        DISK
     FAEBPL02 IF  E           K        DISK
     FABHPL03 IF  E           K        DISK
     FAAOPL03 IF  E           K        DISK
     FAAYPL03 IF  E           K        DISK
     FAANPL03 IF  E           K        DISK
     FAAXPL10 IF  E           K        DISK
     FADHPL03 IF  E           K        DISK
     FAAFPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FCADPL03 IF  E           K        DISK
     FMYAPL11 IF  E           K        DISK
     FMYAPL01 IF  E           K        DISK
     FMYANP31 IF  E           K        DISK                      A
     FMYANP32 IF  E           K        DISK                      A
      *
     E                    HKT        15  3               工程
     E                    HBM        15  4 0             部門
     E                    HKI        15  3               機番
     E                    HMB        15  6               工程所番地
     E                    HDH        15 12               工程品番
     E                    HKD        15  1               かんばん種類大
     E                    HSU        15  9 0             工程設定数
      *
      *====================================
      * 社内かんばん切替えマスター旧工程
     E                    OKT        15  3               工程
     E                    OBM        15  4 0             部門
     E                    OKI        15  3               機番
     E                    OMB        15  6               工程所番地
     E                    ODH        15 12               工程品番
     E                    OKD        15  1               かんばん種類大
      *
      *====================================
      * 社内かんばん切替えマスター新工程
     E                    SKT        15  3               工程
     E                    SBM        15  4 0             部門
     E                    SKI        15  3               機番
     E                    SMB        15  6               工程所番地
     E                    SDH        15 12               工程品番
     E                    SKD        15  1               かんばん種類大
     E                    SSU        15  9 0             工程設定数
     E                    SUK        15 10 0             かんばん切替日
      *
     E                    IKT        10  3               工程／画面
     E                    HSJ         4  1               数字検索
     E                    HHZ         5  6 0             稼働日数日付
     E                    HCD         5  3 1             稼働日数
      *
     E                    U1NS        3  9 0             内示数量N-N+2
     E                    U1SS        3  9 0             内示数量N-N+2
     E                    W0KH        4 12               構成品番
     E                    F4TS       12  7 0             実績数量01-12
      *
     E                    TSU    10  10  1               数字0-9
     E                    ER      1  14 70               d[ｰxｮﾈｰﾆﾞ
      *
     I            DS
     I                                        1  45 OKT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600OBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  45 OKI
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN00
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I            DS
     I                                        1  90 OMB
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1 180 ODH
     I                                        1  12 CKQH01
     I                                       13  24 CKQH02
     I                                       25  36 CKQH03
     I                                       37  48 CKQH04
     I                                       49  60 CKQH05
     I                                       61  72 CKQH06
     I                                       73  84 CKQH07
     I                                       85  96 CKQH08
     I                                       97 108 CKQH09
     I                                      109 120 CKQH10
     I                                      121 132 CKQH11
     I                                      133 144 CKQH12
     I                                      145 156 CKQH13
     I                                      157 168 CKQH14
     I                                      169 180 CKQH15
     I            DS
     I                                        1  15 OKD
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I            DS
     I                                        1  45 SKT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600SBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  45 SKI
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  90 SMB
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1 180 SDH
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1  15 SKD
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1 1350SSU
     I                                        1   90CKSU01
     I                                       10  180CKSU02
     I                                       19  270CKSU03
     I                                       28  360CKSU04
     I                                       37  450CKSU05
     I                                       46  540CKSU06
     I                                       55  630CKSU07
     I                                       64  720CKSU08
     I                                       73  810CKSU09
     I                                       82  900CKSU10
     I                                       91  990CKSU11
     I                                      100 1080CKSU12
     I                                      109 1170CKSU13
     I                                      118 1260CKSU14
     I                                      127 1350CKSU15
     I            DS
     I                                        1 1500SUK
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
      *
     I            DS
     I                                        1  30 IKT
     I                                        1   3 IKO01
     I                                        4   6 IKO02
     I                                        7   9 IKO03
     I                                       10  12 IKO04
     I                                       13  15 IKO05
     I                                       16  18 IKO06
     I                                       19  21 IKO07
     I                                       22  24 IKO08
     I                                       25  27 IKO09
     I                                       28  30 IKO10
      *
     I            DS
     I                                        1  270U1NS
     I                                        1   90U1NNNM
     I                                       10  180U1N1NM
     I                                       19  270U1N2NM
     I            DS
     I                                        1  270U1SS
     I                                        1   90U1SNNM
     I                                       10  180U1S1NM
     I                                       19  270U1S2NM
     I            DS
     I                                        1  48 W0KH
     I                                        1  12 W0KHN1
     I                                       13  24 W0KHN2
     I                                       25  36 W0KHN3
     I                                       37  48 W0KHN4
     I            DS
     I                                        1  840F4TS
     I                                        1   70F4TS01
     I                                        8  140F4TS02
     I                                       15  210F4TS03
     I                                       22  280F4TS04
     I                                       29  350F4TS05
     I                                       36  420F4TS06
     I                                       43  490F4TS07
     I                                       50  560F4TS08
     I                                       57  630F4TS09
     I                                       64  700F4TS10
     I                                       71  770F4TS11
     I                                       78  840F4TS12
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   80CKSKHZ
     I                                        1   40CKSKYY
     I                                        5   60CKSKMM
     I                                        7   80CKSKDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80A6GSHZ
     I                                        1   40A6GSYY
     I                                        5   60A6GSMM
     I                                        7   80A6GSDD
     I            DS
     I                                        1   80F4SKHZ
     I                                        1   40F4SKYY
     I                                        5   60F4SKMM
     I                                        7   80F4SKDD
     I            DS
     I                                        1   80M2SKHZ
     I                                        1   40M2SKYY
     I                                        5   60M2SKMM
     I                                        7   80M2SKDD
     I            DS
     I                                        1  12 W0DHIN
     I                                        1   5 W0DHI1
     I                                        6  10 W0DHI2
     I                                       11  12 W0DHI3
     I            DS
     I                                        1   6 W0JTKR
     I                                        1   1 W0JTK1
     I                                        2   3 W0JTK2
     I                                        4   5 W0JTK3
     I                                        6   6 W0JTK4
     I            DS
     I                                        1   80W1SKHZ
     I                                        1   40W1SKYY
     I                                        5   60W1SKMM
     I                                        7   80W1SKDD
     I            DS
     I                                        1   80W2SKHZ
     I                                        1   40W2SKYY
     I                                        5   60W2SKMM
     I                                        7   80W2SKDD
     I            DS
     I                                        1   60INJYM
     I                                        1   40INJYY
     I                                        5   60INJMM
     I            DS
     I                                        1   60IJIYM
     I                                        1   40IJIYY
     I                                        5   60IJIMM
     I            DS
     I                                        1   60WSTYM
     I                                        1   40WSTYY
     I                                        5   60WSTMM
     I            DS
     I                                        1   60WJSYM
     I                                        1   40WJSYY
     I                                        5   60WJSMM
     I            DS
     I                                        1   6 WOMBN
     I                                        1   1 WOMBN1
     I                                        2   3 WOMBN2
     I                                        4   5 WOMBN3
     I                                        6   6 WOMBN4
     I            DS
     I                                        1  12 WOMHN
     I                                        1   5 WOMHN1
     I                                        6  10 WOMHN2
     I                                       11  12 WOMHN3
     I            DS
     I                                        1   6 @MBN
     I                                        1   1 @MBN1
     I                                        2   3 @MBN2
     I                                        4   5 @MBN3
     I                                        6   6 @MBN4
     I            DS
     I                                        1  12 @MHN
     I                                        1   5 @MHN1
     I                                        6  10 @MHN2
     I                                       11  12 @MHN3
     I            DS
     I                                        1   60@NJYM
     I                                        1   40@NJYY
     I                                        5   60@NJMM
     I            DS
     I                                        1   80WYMD
     I                                        1   60WYM
     I                                        1   40WYY
     I                                        5   60WMM
     I            DS
     I                                        1  70 WER
     I                                        6  11 WER1
     I            DS
     I                                        1   60WNYM
     I                                        1   40WNYY
     I                                        5   60WNMM
      *
     C           KEY1      KLIST
     C                     KFLD           WYY
     C                     KFLD           WMM
      *
     C           KEY2      KLIST
     C                     KFLD           W0KOJO
     C                     KFLD           W0KOTI
     C                     KFLD           W0KIBG
     C                     KFLD           W0DHIN
      *
     C           KEY3      KLIST
     C                     KFLD           @MHN1
     C                     KFLD           @MHN2
     C                     KFLD           @MHN3
     C                     KFLD           @MKTE
     C                     KFLD           @MBMN
     C                     KFLD           @MBN1
     C                     KFLD           @MBN2
     C                     KFLD           @MBN3
     C                     KFLD           @MBN4
      *
     C           KEY4      KLIST
     C                     KFLD           IJIYY
     C                     KFLD           MMJHN1
     C                     KFLD           MMJHN2
     C                     KFLD           MMJHN3
      *
     C           KEY5      KLIST
     C                     KFLD           MMJHN1
     C                     KFLD           MMJHN2
     C                     KFLD           MMJHN3
     C                     KFLD           @NJYM
      *
     C           KEY6      KLIST
     C                     KFLD           @MBMN
     C                     KFLD           @MSNO
      *
     C           KEY7      KLIST
     C                     KFLD           @MBMN
     C                     KFLD           @MSNO
     C                     KFLD           IJIYY
     C                     KFLD           IJIMM
      *
     C           KEY8      KLIST
     C                     KFLD           W0DHI1
     C                     KFLD           W0DHI2
     C                     KFLD           W0DHI3
      *
     C           KEY9      KLIST
     C                     KFLD           WKOJO
     C                     KFLD           W0KOTI
     C                     KFLD           W0DHI1
     C                     KFLD           W0DHI2
     C                     KFLD           W0DHI3
      *
     C           KEYA      KLIST
     C                     KFLD           WNYY
     C                     KFLD           WNMM
      *
     C           KEYB      KLIST
     C                     KFLD           @MBMN
     C                     KFLD           W1KIBN
      *
     C           KEYC      KLIST
     C                     KFLD           @MBMN
     C                     KFLD           W1KIBN
     C                     KFLD           IJIYY
     C                     KFLD           IJIMM
      *
     C           KEYD      KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *
     C           KEYE      KLIST
     C                     KFLD           W0JTK1
     C                     KFLD           W0JTK2
     C                     KFLD           W0JTK3
     C                     KFLD           W0JTK4
      *
     C           KEYF      KLIST
     C                     KFLD           MMJHN1
     C                     KFLD           MMJHN2
     C                     KFLD           MMJHN3
      *
     C           KEYG      KLIST
     C                     KFLD           AFSHN1
     C                     KFLD           AFSHN2
     C                     KFLD           AFSHN3
     C                     KFLD           @NJYM
      *
     C           KEYH      KLIST
     C                     KFLD           IJIYY
     C                     KFLD           AFSHN1
     C                     KFLD           AFSHN2
     C                     KFLD           AFSHN3
      *
     C           KEYI      KLIST
     C                     KFLD           W0KOTI
     C                     KFLD           W0KINO
     C                     KFLD           W0KIBG
      *
      *---------------------------------*
      *  PSTYM:設定数自動処理当月日付 *
      *  PJSYM:実績日付               *
      *---------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PSTYM   6
     C                     PARM           PJSYM   6
     C                     PARM           PNJH1   6
     C                     PARM           PNJH2   6
     C                     PARM           PNJH3   6
     C                     PARM           PJIYM   6
     C                     PARM           PTOYM   6
     C                     PARM           PKOJO   4
     C                     PARM           PKOTI  30
      *
      *------------*
      * 内示日付 *
      *------------*
     C                     Z-ADD0         WSTYM
     C                     MOVELPSTYM     WSTYM
      *
      *------------*
      * 実績日付 *
      *------------*
     C                     Z-ADD0         WJSYM
     C                     MOVELPJSYM     WJSYM
      *
     C                     Z-ADD0         INJYM
     C                     Z-ADD0         IJIYM
      *
      *------------*
      * 画面－１ *
      *------------*
     C           STP1      TAG
     C                     EXFMTMYAPW311
     C                     SETOF                     515253
     C                     SETOF                     545556
     C                     SETOF                     575859
     C                     SETOF                     606162
     C                     SETOF                     636499
      *
      *======
      *  F1
     C           *INKA     IFEQ '1'
     C                     SETON                     U2LR
     C                     RETRN
     C                     END
      *
      *------------*
      * 内示日付 *
      *------------*
     C           INJYM     IFEQ 0
     C                     SETON                     5199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C           INJYY     IFGE 2006
     C           INJMM     ANDGE01
     C           INJMM     ANDLE12
     C                     ELSE
     C                     SETON                     5199
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
      *
     C           INJYM     IFGT WSTYM
     C                     SETON                     5199
     C                     MOVELER,3      MSG
     C                     GOTO STP1
     C                     END
      *
      *------------*
      * 実績日付 *
      *------------*
     C           IJIYM     IFEQ 0
     C                     SETON                     5299
     C                     MOVE ER,4      MSG
     C                     GOTO STP1
     C                     END
      *
     C           IJIYY     IFGE 2006
     C           IJIMM     ANDGE01
     C           IJIMM     ANDLE12
     C                     ELSE
     C                     SETON                     5299
     C                     MOVE ER,5      MSG
     C                     GOTO STP1
     C                     END
      *
     C           IJIYM     IFGT WJSYM
     C                     SETON                     5299
     C                     MOVELER,6      MSG
     C                     GOTO STP1
     C                     END
      *
      *--------------*
      * 工場コード *
      *--------------*
     C           IKOJO     IFEQ *BLANK
     C                     SETON                     5399
     C                     MOVELER,7      MSG
     C                     GOTO STP1
     C                     END
      *
      *============
      * 数字検索
     C                     MOVEAIKOJO     HSJ
      *
     C                     Z-ADD1         A       20
     C           1         DO   4         A
     C                     SETOF                     01
     C           HSJ,A     LOKUPTSU                      01
     C           *IN01     IFEQ '0'
     C                     SETON                     5399
     C                     MOVELER,8      MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
      *====================
      * 細目マスター検索
     C                     MOVELIKOJO     WKOJO   40
      *
     C                     SETOF                     01
     C           WKOJO     CHAINFGBPL011             01
     C           *IN01     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
     C           *IN01     IFEQ '1'
     C                     SETON                     5399
     C                     MOVELER,9      MSG
     C                     GOTO STP1
     C                     END
      *
      *--------------*
      * 工程コード *
      *------------------------*
      * 工程名称マスター検索 *
      *------------------------*
     C                     SETOF                     02
     C                     Z-ADD1         X       20
     C                     Z-ADD53        Y       20
     C           1         DO   10        X
     C                     ADD  1         Y
     C           IKT,X     IFNE *BLANK
     C                     SETON                     02
     C                     MOVELIKT,X     WKOTI   3
      *
     C                     SETOF                     01
     C           WKOTI     CHAINFCETL031             01
     C           *IN01     IFEQ '0'
     C           A6GSKD    ANDEQ'D'
     C           A6GSHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
     C           *IN01     IFEQ '1'
     C                     SETON                     99
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,10     MSG
     C                     GOTO STP1
     C                     END
      *
     C                     END
     C                     END
      *
     C           *IN02     IFEQ '0'
     C                     SETON                     545556
     C                     SETON                     575859
     C                     SETON                     606162
     C                     SETON                     6399
     C                     MOVELER,11     MSG
     C                     GOTO STP1
     C                     END
      *
      *----------------*
      * 新旧工程判断 *
      *----------------*
     C           IKUBN     IFEQ *BLANK
     C                     SETON                     6499
     C                     MOVELER,12     MSG
     C                     GOTO STP1
     C                     END
      *
     C           IKUBN     IFNE '1'
     C           IKUBN     ANDNE'2'
     C                     SETON                     6499
     C                     MOVELER,13     MSG
     C                     GOTO STP1
     C                     END
      *
      *======
      *  F5
     C           *INKE     IFEQ '0'
     C                     GOTO STP1
     C                     END
      *
      *----------------------------*
      * 内示日付　Ｎ月～Ｎ＋２月 *
      *----------------------------*
     C                     Z-ADD0         HHZ
     C                     Z-ADDINJYM     HHZ,1
      *
     C                     Z-ADD1         A
     C                     Z-ADDINJYM     WYM
     C           2         DO   3         A
     C           WMM       IFEQ 12
     C                     ADD  1         WYY
     C                     Z-ADD01        WMM
     C                     ELSE
     C                     ADD  1         WMM
     C                     END
     C                     Z-ADDWYM       HHZ,A
     C                     END
      *
      *----------------------*
      * 実績日付・当月日付 *
      *----------------------*
     C                     Z-ADDIJIYM     HHZ,4
      *
     C                     Z-ADD*DATE     WYMD
     C                     Z-ADDWYM       HHZ,5
      *
      *--------------------------------------------*
      * 稼働日数（内示日付・実績日付・当月日付） *
      * カレンダーマスター検索                   *
      *--------------------------------------------*
     C                     Z-ADD1         A
     C                     Z-ADD0         HCD
     C           1         DO   5         A
     C                     Z-ADD0         WKAD    31
     C                     Z-ADDHHZ,A     WYM
      *
     C           KEY1      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     01
     C           KEY1      READEAGDPL121                 01
     C           *IN01     IFEQ '0'
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         WKAD
     C                     ELSE
     C                     ADD  0.5       WKAD
     C                     END
      *
     C                     END
     C                     END
     C  N01                END
      *
     C           WKAD      IFEQ 0
     C                     SETON                     99
     C                     MOVELER,14     WER
     C                     MOVELWYM       WER1
     C                     MOVELWER       MSG
     C                     GOTO STP1
     C                     END
      *
     C                     Z-ADDWKAD      HCD,A
     C                     END
      *
     C                     MOVELHHZ,1     PNJH1
     C                     MOVELHHZ,2     PNJH2
     C                     MOVELHHZ,3     PNJH3
     C                     MOVELIJIYM     PJIYM
     C                     MOVELHHZ,5     PTOYM
     C                     MOVELIKOJO     PKOJO
     C                     MOVEAIKT       PKOTI
      *
      *========================*
      * 部品情報マスター検索 *
      *========================*
     C                     DO   *HIVAL
     C                     SETOF                     10
     C                     READ FCEPP011                 10
     C           *IN10     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     ELSE
     C           A2TEHI    IFEQ 'G'
      *
     C                     CLEARHKT
     C                     CLEARHBM
     C                     CLEARHKI
     C                     CLEARHMB
     C                     CLEARHDH
     C                     CLEARHSU
     C                     CLEARHKD
      *
     C                     SETOF                     11
     C           KEYD      CHAINAAMPL111             11
     C           *IN11     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     11
     C                     END
     C           *IN11     IFEQ '0'
      *
     C           IKUBN     IFEQ '1'
     C                     Z-ADD1         X
     C                     Z-ADD0         Y
     C           1         DO   15        X
     C           SKT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVELSKT,X     HKT,Y
     C                     Z-ADDSBM,X     HBM,Y
     C                     MOVELSKI,X     HKI,Y
     C                     MOVELSMB,X     HMB,Y
     C                     MOVELSDH,X     HDH,Y
     C                     MOVELSKD,X     HKD,Y
     C                     Z-ADDSSU,X     HSU,Y
     C                     END
     C                     END
     C                     ELSE
      *
     C                     Z-ADD1         X
     C                     Z-ADD0         Y
     C           1         DO   15        X
     C                     MOVELSUK,X     WUKH    80
     C           WUKH      IFGT *DATE
     C           OKT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVELOKT,X     HKT,Y
     C                     Z-ADDOBM,X     HBM,Y
     C                     MOVELOKI,X     HKI,Y
     C                     MOVELOMB,X     HMB,Y
     C                     MOVELODH,X     HDH,Y
     C                     MOVELOKD,X     HKD,Y
     C                     Z-ADDSSU,X     HSU,Y
     C                     END
     C                     ELSE
      *
     C           SKT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVELSKT,X     HKT,Y
     C                     Z-ADDSBM,X     HBM,Y
     C                     MOVELSKI,X     HKI,Y
     C                     MOVELSMB,X     HMB,Y
     C                     MOVELSDH,X     HDH,Y
     C                     MOVELSKD,X     HKD,Y
     C                     Z-ADDSSU,X     HSU,Y
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
      *
      *----------------------------------------------*
      * 工場コード・工程コード検索（画面入力項目） *
      *----------------------------------------------*
     C                     SETOF                     11
     C                     Z-ADD1         C       20
     C           1         DO   15        C
      *
     C                     CLEARMYANP311
      *
     C                     MOVE *BLANK    @MKTE   3
     C                     Z-ADD0         @MBMN   40
     C                     MOVE *BLANK    @MSNO   3
     C                     MOVE *BLANK    @MBN
     C                     MOVE *BLANK    @MHN
     C                     Z-ADD0         @SRYO  100
      *
     C           HKT,C     IFNE *BLANK
      *
     C                     SETOF                     12
     C                     MOVELHKT,C     WKOTI
     C           WKOTI     LOKUPIKT                      12
     C           *IN12     IFEQ '1'
     C           WKOJO     ANDEQHBM,C
      *
     C                     MOVELHKT,C     @MKTE
     C                     Z-ADDHBM,C     @MBMN
     C                     MOVELHKI,C     @MSNO
     C                     MOVELHMB,C     @MBN
     C                     MOVELHDH,C     @MHN
     C                     Z-ADDHSU,C     @SRYO
      *
     C                     MOVEL@MKTE     W0KOTI
     C                     Z-ADD@MBMN     W0KOJO
     C                     MOVEL@MHN1     W0DHI1
     C                     MOVEL@MHN2     W0DHI2
     C                     MOVEL@MHN3     W0DHI3
     C                     MOVEL@MSNO     W0KIBG
     C                     MOVEL@MSNO     W0KIBS
     C                     Z-ADD@SRYO     W0KTSU
      *
      *--------------------*
      * 工程マスター検索 *
      *--------------------*
     C                     Z-ADD0         @RECD   50
      *
     C           KEY3      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     14
     C           KEY3      READEGHCPL221                 14
     C           *IN14     IFEQ '0'
     C                     ADD  1         @RECD
      *
      *----------------*
      * 内示数量算出 *
      *----------------*
     C                     Z-ADDINJYM     @NJYM
      *
     C                     SETOF                     15
     C           KEY5      CHAINABBPL211             15
     C           *IN15     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1NS,1    W0NJS0
     C                     ADD  U1NS,2    W0NJS1
     C                     ADD  U1NS,3    W0NJS2
     C                     ELSE
     C                     ADD  U1SS,1    W0NJS0
     C                     ADD  U1SS,2    W0NJS1
     C                     ADD  U1SS,3    W0NJS2
     C                     END
     C                     END
      *
      *----------------*
      * 実績数量算出 *
      *----------------*
     C           KEY4      SETLLMBDPL121
     C                     DO   *HIVAL
     C                     SETOF                     15
     C                     Z-ADDIJIMM     D       20
     C           KEY4      READEMBDPL121                 15
     C           *IN15     IFEQ '0'
     C           F4SKJY    IFEQ 'D'
     C           F4SKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  F4TS,D    W0JISU
     C                     END
     C                     END
     C  N15                END
      *
     C                     END
     C  N14                END
      *
     C                     MOVEL'N'       W0KTYN
     C           @RECD     IFGT 1
     C                     MOVEL'Y'       W0KTYN
     C                     END
      *
      *--------------------------------------*
      * 内示数量・実績数量がゼロの場合、   *
      * 構成品番から内示数量・実績数量算出 *
      *--------------------------------------*
     C           W0NJS0    IFEQ 0
     C                     EXSR SBKHN
     C                     END
      *
      *---------------------------------------*
      * 各かんばんマスター:ロット箱数     *
      * 工程内かんばんマスター:生産回転数 *
      *---------------------------------------*
     C                     EXSR SBKAB
      *
     C           W0SYOS    IFEQ 0
     C           A2SYHZ    IFGT *DATE
     C                     Z-ADDA2KSYS    W0SYOS
     C                     MOVELA2KSYT    W0SYOT
     C                     ELSE
     C                     Z-ADDA2SSYS    W0SYOS
     C                     MOVELA2SSYT    W0SYOT
     C                     END
     C                     END
      *
      *--------------------*
      * 設備管理マスター *
      *--------------------*
     C           KEY6      SETLLMFAPL221
     C                     DO   *HIVAL
     C                     SETOF                     16
     C           KEY6      READEMFAPL221                 16
     C           *IN16     IFEQ '0'
     C                     SETON                     16
     C                     MOVELM@KEIS    W0KINO
     C                     Z-ADDM@RPMH    W0KITN
     C                     END
     C  N16                END
      *
      *------------------------*
      * 品番別回転数マスター *
      *------------------------*
     C                     SETOF                     16
     C           KEY9      CHAINMYAPL011             16
     C           *IN16     IFEQ '0'
     C           W2SKJY    ANDEQ'D'
     C           W2SKHZ    ANDLE*DATE
     C                     SETON                     16
     C                     END
     C           *IN16     IFEQ '0'
     C                     Z-ADDW2KITN    W0KITN
     C                     END
      *
      *----------------------------------*
      * 作業日報月別設備総合効率データ *
      *----------------------------------*
     C*                    SETOF                     16
     C*          KEY7      CHAINMDAPP201             16
     C*          *IN16     IFEQ '0'
     C*          M2SKJY    IFEQ 'D'
     C*          M2SKHZ    ANDLE*DATE
     C*                    ELSE
     C*                    Z-ADDM2BRIT    W0BRIT
     C*                    Z-ADDM2SOUG    W0SOUG
     C*                    Z-ADDM2DNKI    W0DNKI
     C*                    Z-ADDM2DNTI    W0DNTI
     C*                    END
     C*                    END
      *
      *--------------------*
      * 構成品番マスター *
      *--------------------*
     C                     Z-ADD0         E       20
     C           KEY8      SETLLAEBPL011
     C                     DO   *HIVAL
     C                     SETOF                     16
     C           KEY8      READEAEBPL011                 16
     C           *IN16     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  1         E
     C                     MOVELAFKHIN    W0KH,E
     C           E         IFEQ 4
     C                     SETON                     16
     C                     END
     C                     END
     C                     END
     C  N16                END
      *
     C                     MOVELA2ZANM    W0ZANM
     C                     Z-ADDA2KAZI    W0KAZI
     C                     Z-ADDA2KASI    W0KASI
     C                     Z-ADDA2SOZI    W0SOZI
     C                     Z-ADDA2KUBI    W0KUBI
     C                     Z-ADDA2SAIZ    W0SAIZ
     C                     MOVELA2KIKI    W0KIKI
     C                     Z-ADDA2TUSZ    W0TUSZ
     C*                    Z-ADDA2ITAA    W0ITAA
     C                     MOVELA2SMEI    W0SMEI
      *
      *============
      * 稼働日数
     C                     Z-ADDHCD,1     W0KDN0
     C                     Z-ADDHCD,2     W0KDN1
     C                     Z-ADDHCD,3     W0KDN2
     C                     Z-ADDHCD,4     W0KDJS
     C                     Z-ADDHCD,5     W0KDKT
      *
      *==============
      * 日当り数量
     C           W0NJS0    DIV  HCD,1     W0NHS0    H
     C           W0NJS1    DIV  HCD,2     W0NHS1    H
     C           W0NJS2    DIV  HCD,3     W0NHS2    H
     C           W0JISU    DIV  HCD,4     W0JHSU    H
     C           W0KTSU    DIV  HCD,5     W0KHSU    H
      *
      *=============
      * 箱数/日
     C           W0NHS0    DIV  W0SYOS    W0NJH0    H
     C           W0NHS1    DIV  W0SYOS    W0NJH1    H
     C           W0NHS2    DIV  W0SYOS    W0NJH2    H
     C           W0JHSU    DIV  W0SYOS    W0JIHS    H
     C           W0KHSU    DIV  W0SYOS    W0KTHS    H
      *
      *------------------------------------------*
      * 複数機番比率マスター有り処理（比率％） *
      *------------------------------------------*
     C                     SETOF                     18
     C                     Z-ADDW0NJS0    @NJS0   90
     C                     Z-ADDW0NJS1    @NJS1   90
     C                     Z-ADDW0NJS2    @NJS2   90
     C                     Z-ADDW0JISU    @JISU   90
     C                     Z-ADDW0KTSU    @KTSU  100
      *
     C           KEY9      SETLLMYAPL111
     C                     DO   *HIVAL
     C                     SETOF                     17
     C           KEY9      READEMYAPL111                 17
     C           *IN17     IFEQ '0'
     C           W1SKJY    IFEQ 'D'
     C           W1SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     18
      *
     C                     MOVELW1KIBN    W0KIBG
     C                     MOVE W1KIBH    W0KIBG
     C                     MOVELW1KIBN    W0KIBS
     C                     MOVE W1KIBH    W0KIBS
     C           W1PAST    DIV  100       @PAST   32
      *
      *============
      * 月間数量
     C           @NJS0     MULT @PAST     W0NJS0    H
     C           @NJS1     MULT @PAST     W0NJS1    H
     C           @NJS2     MULT @PAST     W0NJS2    H
     C           @JISU     MULT @PAST     W0JISU    H
     C           @KTSU     MULT @PAST     W0KTSU    H
      *
      *==============
      * 日当り数量
     C           W0NJS0    DIV  HCD,1     W0NHS0    H
     C           W0NJS1    DIV  HCD,2     W0NHS1    H
     C           W0NJS2    DIV  HCD,3     W0NHS2    H
     C           W0JISU    DIV  HCD,4     W0JHSU    H
     C           W0KTSU    DIV  HCD,5     W0KHSU    H
      *
      *=============
      * 箱数/日
     C           W0NHS0    DIV  W0SYOS    W0NJH0    H
     C           W0NHS1    DIV  W0SYOS    W0NJH1    H
     C           W0NHS2    DIV  W0SYOS    W0NJH2    H
     C           W0JHSU    DIV  W0SYOS    W0JIHS    H
     C           W0KHSU    DIV  W0SYOS    W0KTHS    H
      *
      *--------------------*
      * 設備管理マスター *
      *--------------------*
     C                     MOVE *BLANK    W0KINO
     C                     Z-ADD0         W0KITN
      *
     C           KEYB      SETLLMFAPL221
     C                     DO   *HIVAL
     C                     SETOF                     19
     C           KEYB      READEMFAPL221                 19
     C           *IN19     IFEQ '0'
     C                     SETON                     19
     C                     MOVELM@KEIS    W0KINO
     C                     Z-ADDM@RPMH    W0KITN
     C                     END
     C  N19                END
      *
      *------------------------*
      * 品番別回転数マスター *
      *------------------------*
     C                     SETOF                     19
     C           KEY9      CHAINMYAPL011             19
     C           *IN19     IFEQ '0'
     C           W2SKJY    ANDEQ'D'
     C           W2SKHZ    ANDLE*DATE
     C                     SETON                     19
     C                     END
     C           *IN19     IFEQ '0'
     C                     Z-ADDW2KITN    W0KITN
     C                     END
      *
      *----------------------------------*
      * 作業日報月別設備総合効率データ *
      *----------------------------------*
     C                     Z-ADD0         W0BRIT
     C                     Z-ADD0         W0SOUG
     C                     Z-ADD0         W0DNKI
     C                     Z-ADD0         W0DNTI
      *
     C*                    SETOF                     19
     C*          KEYC      CHAINMDAPP201             19
     C*          *IN19     IFEQ '0'
     C*          M2SKJY    IFEQ 'D'
     C*          M2SKHZ    ANDLE*DATE
     C*                    ELSE
     C*                    Z-ADDM2BRIT    W0BRIT
     C*                    Z-ADDM2SOUG    W0SOUG
     C*                    Z-ADDM2DNKI    W0DNKI
     C*                    Z-ADDM2DNTI    W0DNTI
     C*                    END
     C*                    END
      *
      *----------------------------*
      * 設備負荷グラフ№３データ *
      *----------------------------*
     C                     SETOF                     13
     C           KEY2      CHAINMYANP311             13
     C           *IN13     IFEQ '1'
     C                     SETON                     U1
     C                     WRITEMYANP311
     C                     END
      *
      *----------------------------------------*
      * 設備負荷グラフ№３機種設備台数データ *
      *----------------------------------------*
     C                     SETOF                     20
     C           KEYI      CHAINMYANP321             20
     C           *IN20     IFEQ '1'
     C                     MOVELW0KOTI    W0KKTI
     C                     MOVELW0KINO    W0KKIN
     C                     MOVELW0KIBG    W0KKBN
     C                     WRITEMYANP321
     C                     END
      *
     C                     END
     C                     END
     C  N17                END
      *
      *--------------------------------*
      * 複数機番比率マスター無し処理 *
      *--------------------------------*
     C           *IN18     IFEQ '0'
      *
      *----------------------------*
      * 設備負荷グラフ№３データ *
      *----------------------------*
     C                     SETOF                     13
     C           KEY2      CHAINMYANP311             13
     C           *IN13     IFEQ '1'
     C                     SETON                     U1
     C                     WRITEMYANP311
     C                     END
      *
      *----------------------------------------*
      * 設備負荷グラフ№３機種設備台数データ *
      *----------------------------------------*
     C                     SETOF                     20
     C           KEYI      CHAINMYANP321             20
     C           *IN20     IFEQ '1'
     C                     MOVELW0KOTI    W0KKTI
     C                     MOVELW0KINO    W0KKIN
     C                     MOVELW0KIBG    W0KKBN
     C                     WRITEMYANP321
     C                     END
     C                     END
      *
     C                     END
     C                     ELSE
     C                     SETON                     11
     C                     END
     C  N11                END
      *
     C                     END
     C                     END
     C                     END
     C  N10                END
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
      *  ﾅﾎﾞﾓｰk]                              *
      * 各かんばんマスター:ロット箱数     *
      * 工程内かんばんマスター:生産回転数 *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
     C           SBKAB     BEGSR
      *
     C                     Z-ADDC         Z       20
     C                     MOVE *BLANK    @KDAI   1
     C                     MOVE *BLANK    @KTKR   6
      *
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           HKD,Z     IFEQ *BLANK
     C                     ADD  1         Z
     C           Z         IFEQ 15
     C                     SETON                     21
     C                     END
     C                     ELSE
      *
     C                     SETON                     21
     C                     MOVELHKD,Z     @KDAI
     C                     MOVELHMB,Z     @KTKR
     C                     END
     C  N21                END
      *
     C                     MOVEL@KDAI     W0KDAI
     C                     MOVEL@KTKR     W0JTKR
      *
     C           W0KDAI    IFEQ '1'
     C           KEYE      SETGTAAOPL031
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPEAAOPL031                 22
     C           *IN22     IFEQ '0'
     C           T1SKJY    IFEQ *BLANK
     C           *DATE     IFGE T1UKHZ
     C           *DATE     ANDLTT1STHZ
     C                     SETON                     22
     C                     Z-ADDT1HKSU    W0LTSU
     C                     Z-ADDT1SYOS    W0SYOS
     C                     MOVELT1SYOT    W0SYOT
     C                     END
     C                     END
     C                     END
     C  N22                END
     C                     END
      *
     C           W0KDAI    IFEQ '2'
     C           KEYE      SETGTAAYPL031
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPEAAYPL031                 22
     C           *IN22     IFEQ '0'
     C           L8SKJY    IFEQ *BLANK
     C           *DATE     IFGE L8UKHZ
     C           *DATE     ANDLTL8STHZ
     C                     SETON                     22
     C                     Z-ADDL8HKSU    W0LTSU
     C                     Z-ADDL8SYOS    W0SYOS
     C                     MOVELL8SYOT    W0SYOT
     C                     END
     C                     END
     C                     END
     C  N22                END
     C                     END
      *
     C           W0KDAI    IFEQ '6'
     C           KEYE      SETGTAANPL031
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPEAANPL031                 22
     C           *IN22     IFEQ '0'
     C           L7SKJY    IFEQ *BLANK
     C           *DATE     IFGE L7UKHZ
     C           *DATE     ANDLTL7STHZ
     C                     SETON                     22
     C                     Z-ADDL7HKSU    W0LTSU
     C                     Z-ADDL7SYOS    W0SYOS
     C                     MOVELL7SYOT    W0SYOT
     C                     END
     C                     END
     C                     END
     C  N22                END
     C                     END
      *
     C           W0KDAI    IFEQ '7'
     C           KEYE      SETGTAAXPL101
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPEAAXPL101                 22
     C           *IN22     IFEQ '0'
     C           L9SKJY    IFEQ *BLANK
     C           *DATE     IFGE L9UKHZ
     C           *DATE     ANDLTL9STHZ
     C                     SETON                     22
     C                     Z-ADDL9BARA    W0LTSU
     C                     Z-ADDL9SYOS    W0SYOS
     C                     MOVELL9SYOT    W0SYOT
     C                     END
     C                     END
     C                     END
     C  N22                END
     C                     END
      *
     C           W0KDAI    IFEQ 'A'
     C           KEYE      SETGTABHPL031
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPEABHPL031                 22
     C           *IN22     IFEQ '0'
     C           M6SKJY    IFEQ *BLANK
     C           *DATE     IFGE M6UKHZ
     C           *DATE     ANDLTM6STHZ
     C                     SETON                     22
     C                     Z-ADDM6LOTK    W0LTSU
     C                     Z-ADDM6SYUY    W0SYOS
     C                     MOVELM6HSYU    W0SYOT
     C                     END
     C                     END
     C                     END
     C  N22                END
     C                     END
      *
     C           W0KDAI    IFEQ 'B'
     C           KEYE      SETGTADHPL031
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPEADHPL031                 22
     C           *IN22     IFEQ '0'
     C           J6SKJY    IFEQ *BLANK
     C           *DATE     IFGE J6UKHZ
     C           *DATE     ANDLTJ6STHZ
     C                     SETON                     22
     C                     Z-ADDJ6LOTO    W0LTSU
     C                     Z-ADDJ6SYOS    W0SYOS
     C                     MOVELJ6SYOT    W0SYOT
     C                     END
     C                     END
     C                     END
     C  N22                END
     C                     END
      *
     C           W0KDAI    IFEQ 'C'
     C           KEYE      SETGTAAFPL031
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPEAAFPL031                 22
     C           *IN22     IFEQ '0'
     C           A3SKJY    IFEQ *BLANK
     C           *DATE     IFGE A3UKHZ
     C           *DATE     ANDLTA3STHZ
     C                     SETON                     22
     C                     Z-ADDA3BARA    W0LTSU
     C                     Z-ADDA3SSYS    W0SYOS
     C                     MOVELA3SSYT    W0SYOT
     C                     END
     C                     END
     C                     END
     C  N22                END
     C                     END
      *
     C           W0KDAI    IFEQ 'D'
     C           KEYE      SETGTAAGPL031
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPEAAGPL031                 22
     C           *IN22     IFEQ '0'
     C           O4SKJY    IFEQ *BLANK
     C           *DATE     IFGE O4UKHZ
     C           *DATE     ANDLTO4STHZ
     C                     SETON                     22
     C                     Z-ADDO4BARA    W0LTSU
     C                     Z-ADDO4SYOS    W0SYOS
     C                     MOVELO4SYOT    W0SYOT
     C                     END
     C                     END
     C                     END
     C  N22                END
     C                     END
      *
     C           W0KDAI    IFEQ 'E'
     C           KEYE      SETGTAAHPL031
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPEAAHPL031                 22
     C           *IN22     IFEQ '0'
     C           L6SKJY    IFEQ *BLANK
     C           *DATE     IFGE L6UKHZ
     C           *DATE     ANDLTL6STHZ
     C                     SETON                     22
     C                     Z-ADDL6LOTO    W0LTSU
     C                     Z-ADDL6SYOS    W0SYOS
     C                     MOVELL6SYOT    W0SYOT
     C                     END
     C                     END
     C                     END
     C  N22                END
     C                     END
      *
     C           W0KDAI    IFEQ 'F'
     C           KEYE      SETGTCADPL031
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPECADPL031                 22
     C           *IN22     IFEQ '0'
     C           C2SKJY    IFEQ *BLANK
     C           *DATE     IFGE C2UKHZ
     C           *DATE     ANDLTC2STHZ
     C                     SETON                     22
     C                     Z-ADDC2BARA    W0LTSU
     C                     Z-ADDC2SYOS    W0SYOS
     C                     MOVELC2SYOT    W0SYOT
     C                     END
     C                     END
     C                     END
     C  N22                END
     C                     END
      *
     C                     ENDSR
      *
      *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
      *  ﾅﾎﾞﾓｰk]                             *
      * 構成品番から内示数量・実績数量算出 *
      * 構成品番→社内品番→数量算出       *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
     C           SBKHN     BEGSR
      *
      *--------------------*
      * 工程マスター検索 *
      *--------------------*
     C           KEY3      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     31
     C           KEY3      READEGHCPL221                 31
     C           *IN31     IFEQ '0'
      *
      *--------------------------------------*
      * 構成品番から内示数量・実績数量算出 *
      *--------------------------------------*
     C           KEYF      SETLLAEBPL021
     C                     DO   *HIVAL
     C                     SETOF                     32
     C           KEYF      READEAEBPL021                 32
     C           *IN32     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
      *
      *----------------*
      * 内示数量算出 *
      *----------------*
     C                     Z-ADDINJYM     @NJYM
      *
     C                     SETOF                     33
     C           KEYG      CHAINABBPL211             33
     C           *IN33     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C           U1NS,1    MULT AFSKSU    ZNJS0   90
     C           U1NS,2    MULT AFSKSU    ZNJS1   90
     C           U1NS,3    MULT AFSKSU    ZNJS2   90
     C                     ADD  ZNJS0     W0NJS0
     C                     ADD  ZNJS1     W0NJS1
     C                     ADD  ZNJS2     W0NJS2
     C                     ELSE
     C           U1SS,1    MULT AFSKSU    ZNJS0
     C           U1SS,2    MULT AFSKSU    ZNJS1
     C           U1SS,3    MULT AFSKSU    ZNJS2
     C                     ADD  ZNJS0     W0NJS0
     C                     ADD  ZNJS1     W0NJS1
     C                     ADD  ZNJS2     W0NJS2
     C                     END
     C                     END
      *
      *----------------*
      * 実績数量算出 *
      *----------------*
     C           KEYH      SETLLMBDPL121
     C                     DO   *HIVAL
     C                     SETOF                     35
     C                     Z-ADDIJIMM     D
     C           KEYH      READEMBDPL121                 35
     C           *IN35     IFEQ '0'
     C           F4SKJY    IFEQ 'D'
     C           F4SKHZ    ANDLE*DATE
     C                     ELSE
     C           F4TS,D    MULT AFSKSU    ZJISU   90
     C                     ADD  ZJISU     W0JISU
     C                     END
     C                     END
     C  N35                END
      *
     C                     END
     C                     END
     C  N32                END
      *
     C                     END
     C  N31                END
      *
     C                     ENDSR
      *
** TSU
0123456789
** ER
E-01 A PRIVATE NOTIFICATION DATA IS NOT INPUT
E-02 A PRIVATE NOTIFICATION DATA IS NOT INPUT DEFINITELY
E-03 ON THIS PRIVATE NOTIFICATION DATE,DATA ARE NOT YET MADE
E-04 RESUITS DATE IS NOT INPUT
E-05 RESUITS DATE IS NOT INPUT DEFINITELY
E-06 ON THERE RESUITS DATE,DATA ARE NOT YET MADE
E-07 A FACTORY CORD IS NOT INPUT
E-08 THE FACTORY CORD PLEASE INPUT A NUMBER
E-09 A RATHER THIN MASTER DOES NOT HAVE A FACTORY CORD
E-10 A PROCESS NAME MASTER DOES NOT HAVE THIS PROCESS CORD
E-11 A PROCESS CORD IN NOT INPUT
E-12 THE OLD AND THE NEW PROCESS JUDGMENT IS NOT INPUT
E-13 THE OLD AND THE NEW PROCESS JUDGMENT IS 1.2
E-14        ON A DATE, IT IS NOT REGISTERED BY A CALENDAR MASTER
