     H            Y.
      ** MYAR11 *******************************
      * PLURA PLANES TURN RATIO MASTER UPDATE *
      *複数機番比率マスター更新             *
      *負荷グラフデータ                     *
      *   I-HASADA               2013/03/11   *
      ******************************* MYAR11 **
     FMYAPW11 CF  E                    WORKSTN
     FMYAPL11 UF  E           K        DISK                      A
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FFCETL03 IF  E           K        DISK
      *
     E                    HKB        10  4               機番
     E                    HPS        10  3 0             比率
     E                    HSJ         4  1               数字検索
     E                    TSU    10  10  1               数字0-9
     E                    TB1     1   3  1   TN1     6   更新区分
     E                    ER      1  20 70               d[ｰxｮﾈｰﾆﾞ
      *
     I            DS
     I                                        1  40 HKB
     I                                        1   3 IKB01
     I                                        4   4 IKH01
     I                                        5   7 IKB02
     I                                        8   8 IKH02
     I                                        9  11 IKB03
     I                                       12  12 IKH03
     I                                       13  15 IKB04
     I                                       16  16 IKH04
     I                                       17  19 IKB05
     I                                       20  20 IKH05
     I                                       21  23 IKB06
     I                                       24  24 IKH06
     I                                       25  27 IKB07
     I                                       28  28 IKH07
     I                                       29  31 IKB08
     I                                       32  32 IKH08
     I                                       33  35 IKB09
     I                                       36  36 IKH09
     I                                       37  39 IKB10
     I                                       40  40 IKH10
     I            DS
     I                                        1  300HPS
     I                                        1   30IPS01
     I                                        4   60IPS02
     I                                        7   90IPS03
     I                                       10  120IPS04
     I                                       13  150IPS05
     I                                       16  180IPS06
     I                                       19  210IPS07
     I                                       22  240IPS08
     I                                       25  270IPS09
     I                                       28  300IPS10
      *
     I            DS
     I                                        1   80W1SKHZ
     I                                        1   40W1SKYY
     I                                        5   60W1SKMM
     I                                        7   80W1SKDD
     I            DS
     I                                        1   80W1KOHZ
     I                                        1   40W1KOYY
     I                                        5   60W1KOMM
     I                                        7   80W1KODD
     I            DS
     I                                        1   60W1TIME
     I                                        1   20W1KOHH
     I                                        3   40W1KOSS
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80A6GSHZ
     I                                        1   40A6GSYY
     I                                        5   60A6GSMM
     I                                        7   80A6GSDD
     I            DS
     I                                        1  12 IDHNB
     I                                        1   5 IDHN1
     I                                        6  10 IDHN2
     I                                       11  12 IDHN3
     I            DS
     I                                        1  14 ODHNB
     I                                        1   5 ODHN1
     I                                        6   6 ODH1
     I                                        7  11 ODHN2
     I                                       12  12 ODH2
     I                                       13  14 ODHN3
     I            DS
     I                                        1   4 WKBCD
     I                                        1   3 WKBC1
     I                                        4   4 WKBC2
      *
     C           KEY1      KLIST
     C                     KFLD           WKOJO
     C                     KFLD           IKOTI
     C                     KFLD           IDHN1
     C                     KFLD           IDHN2
     C                     KFLD           IDHN3
      *
     C           KEY2      KLIST
     C                     KFLD           IDHN1
     C                     KFLD           IDHN2
     C                     KFLD           IDHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PUSCD  10
      *
      *------------*
      * 画面－１ *
      *------------*
     C           STP1      TAG
     C                     EXFMTMYAPW111
     C                     SETOF                     515253
     C                     SETOF                     5499
      *
      *======
      *  F1
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
      *----------------------------*
      *  F12                       *
      * 複数機番比率マスター照会 *
      *----------------------------*
     C           *INKL     IFEQ '1'
     C                     CALL 'MYAC12'
     C                     GOTO STP1
     C                     END
      *
      *--------*
      * 更新 *
      *--------*
     C           IKOSN     IFEQ *BLANK
     C                     SETON                     5199
     C                     MOVELER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C                     SETOF                     01
     C                     Z-ADD1         A       20
     C                     MOVE *BLANK    OKSNM
     C           IKOSN     LOKUPTB1,A                    01
     C           *IN01     IFEQ '1'
     C                     MOVELTN1,A     OKSNM
     C                     ELSE
     C                     SETON                     5199
     C                     MOVELER,2      MSG
     C                     GOTO STP1
     C                     END
      *
      *--------*
      * 工場 *
      *--------*
     C           IKOJO     IFEQ *BLANK
     C                     SETON                     5299
     C                     MOVELER,3      MSG
     C                     GOTO STP1
     C                     END
      *
      *============
      * 数字検索
     C                     MOVEAIKOJO     HSJ
      *
     C                     Z-ADD1         A
     C           1         DO   4         A
     C                     SETOF                     01
     C           HSJ,A     LOKUPTSU                      01
     C           *IN01     IFEQ '0'
     C                     SETON                     5299
     C                     MOVELER,4      MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
      *====================
      * 細目マスター検索
     C                     MOVELIKOJO     WKOJO   40
      *
     C                     SETOF                     01
     C                     MOVE *BLANK    OKJNM
     C           WKOJO     CHAINFGBPL011             01
     C           *IN01     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
     C           *IN01     IFEQ '0'
     C                     MOVELB2SMEI    OKJNM
     C                     ELSE
     C                     SETON                     5299
     C                     MOVELER,5      MSG
     C                     GOTO STP1
     C                     END
      *
      *--------*
      * 工程 *
      *--------*
     C           IKOTI     IFEQ *BLANK
     C                     SETON                     5399
     C                     MOVELER,6      MSG
     C                     GOTO STP1
     C                     END
      *
      *========================
      * 工程名称マスター検索
     C                     SETOF                     01
     C           IKOTI     CHAINFCETL031             01
     C           *IN01     IFEQ '0'
     C           A6GSKD    ANDEQ'D'
     C           A6GSHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
     C           *IN01     IFEQ '1'
     C                     SETON                     5399
     C                     MOVELER,7      MSG
     C                     GOTO STP1
     C                     END
      *
      *------------*
      * 代表品番 *
      *------------*
     C           IDHNB     IFEQ *BLANK
     C                     SETON                     5499
     C                     MOVELER,8      MSG
     C                     GOTO STP1
     C                     END
      *
      *========================
      * 部品情報マスター検索
     C                     SETOF                     01
     C           KEY2      CHAINFCEPL011             01
     C           *IN01     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
     C           *IN01     IFEQ '1'
     C                     SETON                     5499
     C                     MOVELER,9      MSG
     C                     GOTO STP1
     C                     END
      *
      *=========================*
      * 複数機番比率マスター  *
      *  WDATA : 0=データ無し *
      *  WDATA : 1=データ有り *
      *  WDATA : 2=データ取消 *
      *=========================*
     C                     MOVEL'0'       WDATA   1
      *
     C           KEY1      SETLLMYAPL111
     C                     DO   *HIVAL
     C                     SETOF                     11
     C           KEY1      READEMYAPL111                 11
     C           *IN11     IFEQ '0'
     C                     SETON                     11
     C           W1SKJY    IFEQ 'D'
     C           W1SKHZ    ANDLE*DATE
     C                     MOVEL'2'       WDATA
     C                     ELSE
     C                     MOVEL'1'       WDATA
     C                     END
     C                     END
     C  N11                END
      *
      *--------*
      * 取消 *
      *--------*
     C           IKOSN     IFEQ '0'
     C           WDATA     IFEQ '0'
     C                     SETON                     515253
     C                     SETON                     5499
     C                     MOVELER,10     MSG
     C                     GOTO STP1
     C                     END
      *
     C           WDATA     IFEQ '2'
     C                     SETON                     515253
     C                     SETON                     5499
     C                     MOVELER,11     MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
      *--------*
      * 変更 *
      *--------*
     C           IKOSN     IFEQ '1'
     C           WDATA     IFEQ '0'
     C                     SETON                     515253
     C                     SETON                     5499
     C                     MOVELER,12     MSG
     C                     GOTO STP1
     C                     END
      *
     C           WDATA     IFEQ '2'
     C                     SETON                     515253
     C                     SETON                     5499
     C                     MOVELER,13     MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
      *--------*
      * 追加 *
      *--------*
     C           IKOSN     IFEQ '2'
     C           WDATA     IFEQ '1'
     C                     SETON                     515253
     C                     SETON                     5499
     C                     MOVELER,14     MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C                     MOVE *BLANK    HKB
     C                     Z-ADD0         HPS
     C                     Z-ADD0         TPAST
      *
      *--------------*
      * 取消・変更 *
      *--------------*
     C           IKOSN     IFEQ '0'
     C           IKOSN     OREQ '1'
      *
     C                     Z-ADD0         A
      *
     C           KEY1      SETLLMYAPL111
     C                     DO   *HIVAL
     C                     SETOF                     11
     C           KEY1      READEMYAPL111                 11
     C           *IN11     IFEQ '0'
     C           W1SKJY    IFEQ 'D'
     C           W1SKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  1         A
     C                     MOVELW1KIBN    HKB,A
     C                     MOVE W1KIBH    HKB,A
     C                     Z-ADDW1PAST    HPS,A
     C                     END
     C                     END
     C  N11                END
      *
     C                     XFOOTHPS       TPAST
     C                     END
      *
     C                     MOVELIDHN1     ODHN1
     C                     MOVELIDHN2     ODHN2
     C                     MOVELIDHN3     ODHN3
     C                     MOVEL'-'       ODH1
     C                     MOVEL'-'       ODH2
      *
      *------------*
      * 画面－２ *
      *------------*
     C           STP2      TAG
     C                     EXFMTMYAPW112
     C                     SETOF                     99
     C                     MOVEA'00000000'*IN,61
     C                     MOVEA'00'      *IN,69
     C                     MOVEA'00000000'*IN,71
     C                     MOVEA'00'      *IN,79
     C                     MOVEA'00000000'*IN,81
     C                     MOVEA'00'      *IN,89
      *
      *======
      *  F3
     C           *INKC     IFEQ '1'
     C                     EXSR SUBCLR
     C                     GOTO STP1
     C                     END
      *
      *--------------*
      * 機番・比率 *
      *--------------*
     C                     Z-ADD1         A
     C                     Z-ADD60        B       20
     C                     Z-ADD70        C       20
     C                     Z-ADD80        Z       20
     C           1         DO   10        A
     C                     ADD  1         B
     C                     ADD  1         C
     C                     ADD  1         Z
      *
     C                     MOVELHKB,A     WKBCD
      *
     C           WKBC2     IFNE *BLANK
     C           WKBC1     IFEQ *BLANK
     C                     SETON                     99
     C                     MOVEL'1'       *IN,B
     C                     MOVELER,20     MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           HKB,A     IFEQ *BLANK
     C           HPS,A     IFNE 0
     C                     SETON                     99
     C                     MOVEL'1'       *IN,B
     C                     MOVEL'1'       *IN,Z
     C                     MOVELER,15     MSG
     C                     GOTO STP2
     C                     END
     C                     ELSE
      *
     C           HPS,A     IFEQ 0
     C                     SETON                     99
     C                     MOVEL'1'       *IN,C
     C                     MOVELER,16     MSG
     C                     GOTO STP2
     C                     END
     C                     END
     C                     END
      *
      *------------------*
      * データ有無検索 *
      *------------------*
     C                     SETOF                     01
     C                     Z-ADD1         A
     C           1         DO   10        A
     C           HKB,A     IFNE *BLANK
     C                     SETON                     01
     C                     END
     C  N01                END
      *
     C           *IN01     IFEQ '0'
     C                     SETON                     99
     C                     MOVEA'11111111'*IN,61
     C                     MOVEA'11'      *IN,69
     C                     MOVEA'11111111'*IN,71
     C                     MOVEA'11'      *IN,79
     C                     MOVEA'11111111'*IN,81
     C                     MOVEA'11'      *IN,89
     C                     MOVELER,17     MSG
     C                     GOTO STP2
     C                     END
      *
      *----------------*
      * 機番重複検索 *
      *----------------*
     C                     Z-ADD1         A
     C                     Z-ADD60        B
     C                     Z-ADD70        C
     C                     Z-ADD80        Z
     C           1         DO   10        A
     C                     ADD  1         B
     C                     ADD  1         C
     C                     ADD  1         Z
      *
     C           A         IFLT 10
     C           HKB,A     IFNE *BLANK
     C           A         ADD  1         D       20
      *
     C                     SETOF                     01
     C           HKB,A     LOKUPHKB,D                    01
     C           *IN01     IFEQ '1'
     C                     SETON                     99
     C                     MOVEL'1'       *IN,B
     C                     MOVEL'1'       *IN,C
     C                     MOVEL'1'       *IN,Z
     C                     MOVELER,18     MSG
     C                     GOTO STP2
     C                     END
      *
     C                     END
     C                     END
     C                     END
      *
      *--------------*
      * 比率％検索 *
      *--------------*
     C                     XFOOTHPS       TPAST   40
     C           TPAST     IFNE 100
     C                     SETON                     99
     C                     MOVELER,19     MSG
     C                     GOTO STP2
     C                     END
      *
      *======
      *  F5
     C           *INKE     IFEQ '0'
     C                     GOTO STP2
     C                     END
      *
      *========================*
      * 複数機番比率マスター *
      *========================*
      *--------*
      * 取消 *
      *--------*
     C           IKOSN     IFEQ '0'
      *
     C           KEY1      SETLLMYAPL111
     C                     DO   *HIVAL
     C                     SETOF                     11
     C           KEY1      READEMYAPL111                 11
     C           *IN11     IFEQ '0'
     C                     MOVEL'D'       W1SKJY
     C                     Z-ADD*DATE     W1SKHZ
     C                     Z-ADD*DATE     W1KOHZ
     C                     TIME           W1TIME
     C                     MOVELPUSCD     W1KOME
     C                     UPDATMYAPL111
     C                     END
     C  N11                END
      *
     C                     END
      *
      *--------------*
      * 変更・追加 *
      *--------------*
     C           IKOSN     IFEQ '1'
     C           IKOSN     OREQ '2'
      *
      *----------------------------*
      * 複数機番比率マスター取消 *
      *----------------------------*
     C           KEY1      SETLLMYAPL111
     C                     DO   *HIVAL
     C                     SETOF                     11
     C           KEY1      READEMYAPL111                 11
     C           *IN11     IFEQ '0'
     C                     DELETMYAPL111
     C                     END
     C  N11                END
      *
      *----------------------------*
      * 複数機番比率マスター追加 *
      *----------------------------*
     C                     Z-ADD1         A
     C           1         DO   10        A
     C           HKB,A     IFNE *BLANK
     C                     MOVE *BLANK    W1SKJY
     C                     Z-ADD0         W1SKHZ
     C                     Z-ADD*DATE     W1KOHZ
     C                     TIME           W1TIME
     C                     MOVELPUSCD     W1KOME
     C                     Z-ADDWKOJO     W1KOJO
     C                     MOVELIKOTI     W1KOTI
     C                     MOVELIDHN1     W1DHN1
     C                     MOVELIDHN2     W1DHN2
     C                     MOVELIDHN3     W1DHN3
     C                     MOVELHKB,A     W1KIBN
     C                     MOVE HKB,A     W1KIBH
     C                     Z-ADDHPS,A     W1PAST
     C                     WRITEMYAPL111
     C                     END
     C                     END
      *
     C                     END
      *
     C                     MOVELIKOSN     HKOSN
     C                     MOVELOKSNM     HKSNM
     C                     MOVELIKOJO     HKOJO
     C                     MOVELIKOTI     HKOTI
     C                     MOVELIDHN1     HDHN1
     C                     MOVELIDHN2     HDHN2
     C                     MOVELIDHN3     HDHN3
      *
     C                     EXSR SUBCLR
     C                     GOTO STP1
      *
      *
      *@@@@@@@@@@@@@@@@@@@@*
      * サブルーチン     *
      * 画面－１クリアー *
      *@@@@@@@@@@@@@@@@@@@@*
     C           SUBCLR    BEGSR
      *
     C                     MOVE *BLANK    IKOSN
     C                     MOVE *BLANK    IKOJO
     C                     MOVE *BLANK    IKOTI
     C                     MOVE *BLANK    IDHN1
     C                     MOVE *BLANK    IDHN2
     C                     MOVE *BLANK    IDHN3
      *
     C                     ENDSR
      *
** TSU
0123456789
** TB1､TN1
0CANCEL
1CHANGE
2ADD
** ER
E-01 UPDATE DIVISION IS NOT INPUT
E-02 THE UPDATE DIVISION IS 0,1,2
E-03 A FACTORY CORD IS NOT INPUT
E-04 PLEASE INPUT THE FACTORY CORD WITH A NUMBER
E-05 A RATHER THIN MASTER DOES NOT HAVE A FACTORY CORD
E-06 A PROCESS CORD IS NOT INPUT
E-07 A PROCESS NAME MASTER DOES NOT HAVE A PROCESS CORD
E-08 A REPRESENTATIVE ARTICLE NUMBER IS NOT INPUT
E-09 A PART MASTER DOES NOT HAVE A REPRESENTATIVE ARTICLE NUMBER
E-10 CANCELLATION WAS APPOINTED,BUT THE MASTER DATA DO NOT EXIST
E-11 CANCELLATION WAS APPOINTED,BUT MASTER DATA HAVE AIREADY DELETED
E-12 A CHANGE WAS APPOINTED,BUT THE MASTER DATA DO NOT EXIST
E-13 A CHANGE WAS APPOINTED,BUT MASTER DATA HAVE AIREADY DELETED
E-14 ADDITION WAS APPOINTED,BUT THE MASTER DATA HAVE ALREADY ADDED
E-15 A PLANE TURN TURNING OVER IS NOT INPUT
E-16 THE RATIO TURNING OVER IS NOT INPUT
E-17 A PLANE TURN,THE RATIO IS INPUT INTO NOTHING
E-18 A PLANE TURN TURNING OVER REPEATS
E-19 PLEASE INPUT SO THAT THE TOTAL RATIO BECOMES 100%
E-20 THERE COLUMNS OF PLANE CLERKS TURNING OVER ARE NON-INPUT
