     H            Y.
      ** MYAR33 ******************************************************
      * NO3 FACILITIES LOAD GRAPH FACILITIES INFORMATION DATA MAKING *
      *設備負荷グラフ№３設備情報データ作成                        *
      *      I-HASADA                        2013/03/11              *
      ****************************************************** MYAR33 **
     FMFAPL33 IF  E           K        DISK
     F*MDAPL28 IF  E           K        DISK
     FMYAWP33 O   F     200            DISK
     FMYAWP3A O   F     100            DISK
      *
     E                    HKT        10  3  A            工程
      *
     I            DS
     I                                        1   6 M@COST
     I                                        1   2 M@COS1
     I                                        3   4 M@COS2
     I                                        5   6 M@COS3
     I            DS
     I                                        1   80M2SKHZ
     I                                        1   40M2SKYY
     I                                        5   60M2SKMM
     I                                        7   80M2SKDD
     I            DS
     I                                        1   60WJIYM
     I                                        1   40WJIYY
     I                                        5   60WJIMM
     I            DS
     I                                        1   5 WKBCD
     I                                        1   3 WKBC1
     I                                        4   4 WKB
     I                                        5   5 WKBC2
      *
     C           KEY1      KLIST
     C                     KFLD           WKOJO
     C                     KFLD           WKOTI
      *
     C           KEY2      KLIST
     C                     KFLD           M@KOJY
     C                     KFLD           M@KOTE
     C                     KFLD           M@KBN1
     C                     KFLD           WJIYY
     C                     KFLD           WJIMM
      *
     C           *ENTRY    PLIST
     C                     PARM           PJIYM   6
     C                     PARM           PKOJO   4
     C                     PARM           PKOTI  30
      *
     C                     MOVELPJIYM     WJIYM
     C                     MOVELPKOJO     WKOJO   40
     C                     MOVEAPKOTI     HKT
      *
     C                     SORTAHKT
      *
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C                     EXCPTHD
     C                     END
      *
      *--------------------*
      * 設備管理マスター *
      *--------------------*
     C                     Z-ADD1         A       20
     C           1         DO   10        A
     C           HKT,A     IFNE *BLANK
     C                     MOVELHKT,A     WKOTI   3
      *
     C           KEY1      SETLLMFAPL331
     C                     DO   *HIVAL
     C                     SETOF                     12
     C           KEY1      READEMFAPL331                 12
     C           *IN12     IFEQ '0'
     C           M@KBN1    IFNE *BLANK
      *
      *----------------------------------*
      * 作業日報月別設備総合効率データ *
      *----------------------------------*
     C*                    SETOF                     13
     C                     Z-ADD0         WBRIT   52
     C                     Z-ADD0         WDNKI   30
     C                     Z-ADD0         WDNTI   60
     C                     Z-ADD0         WDNT    51
     C*          KEY2      CHAINMDAPP201             13
     C*          *IN13     IFEQ '0'
     C*          M2SKJY    IFEQ 'D'
     C*          M2SKHZ    ANDLE*DATE
     C*                    ELSE
     C*                    Z-ADDM2BRIT    WBRIT
     C*                    Z-ADDM2DNKI    WDNKI
     C*                    Z-ADDM2DNTI    WDNTI
     C*          M2DNTI    DIV  60        WDNT      H
     C*                    END
     C*                    END
      *
     C                     MOVE *BLANK    WKBCD
     C                     MOVELM@KBN1    WKBC1
     C                     MOVE *BLANK    WKBC2
      *
     C           WKBC2     IFNE *BLANK
     C                     MOVEL'-'       WKB
     C                     END
      *
     C                     EXCPTDT
      *
     C                     END
     C                     END
     C  N12                END
      *
     C                     END
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
     OMYAWP33 E                HD
     O                                      'PROCESS CORD'
     O                                      ','
     O                                      'PLANE TURN'
     O                                      ','
     O                                      'PLANE GROUP'
     O                                      ','
     O                                      'COST CENTER'
     O                                      ','
     O                                      'MACHINE FORM NUMBER'
     O                                      ','
     O                                      'MACHINE NUMBER '
     O                                      'REVOLUTIONS'
     O                                      ','
     O                                      'MOVABLE RATE('
     O                         WJIYM        '    /  '
     O                                      ')'
     O                                      ','
     O                                      'MAKING ARRANGEMENT '
     O                                      'NUMBER TIMES'
     O                                      ','
     O                                      'MAKING ARRANGEMENTS '
     O                                      'TIME(H)'
      *
     O        E                DT
     O                                      '="'
     O                         M@KOTE
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKBCD
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         M@KGUN
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         M@COST
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         M@KEIS
     O                                      '"'
     O                                      ','
     O                         M@RPMH3
     O                                      ','
     O                         WBRIT 3
     O                                      ','
     O                         WDNKI 3
     O                                      ','
     O                         WDNT  3
      *
     OMYAWP3A E                DT
     O                         M@KOTE     3
     O                         M@KEIS    13
     O                         M@RPMH    19
     O                         WBRIT     24
     O                         WDNKI     27
     O                         WDNTI     33
