     H            Y.
      ** MYBR01 ************************************
      *  ..熱処理引当品リスト作成（ＣＳＶ）..  *
      *       MSK                 2008.06.05       *
      *MSK 2008.11.13------------------------------*
      *Ｎ－１の実績が０の場合                    *
      *構成部品使用実績ファイルより参照          *
      *MSK 2009.01.08------------------------------*
      *構成品　機番へのラインセット              *
      * 現在                                     *
      *  構成品切り替えマスターの所番地から      *
      *  各かんばんマスターへの参照            *
      * 変更後                                   *
      *  製造工程情報の照会と同じ様に            *
      *  構成品工程別月間必要数ファイル(AEBPP11) *
      *  を経由して各かんばんマスターへの参照    *
      *  （該当のかんばんが複数存在の場合　      *
      *    最初に該当したものを使用）            *
      *                                            *
      *  I-HASADA 2013/04/02                       *
      *   COPY RPG(IAFAYM):CA035R                  *
      *
      * TCHK1 06/14/13 CHG A2GEKN --> W@SNNM & @SNNM
      * TCHK2 07/19/13 CHG JAPANESE --> ENGLISH
      ************************************ MYBR01 **
     FFCEPP01 IF  E                    DISK
     FAKCPP01 IF  E                    DISK
      *
     FAAMPL11 IF  E           K        DISK
     FAKEPL01 IF  E           K        DISK
     FABBPL21 IF  E           K        DISK
      *
TCHK1FFCEPL01 IF  E           K        DISK
      *
     FABHPL03 IF  E           K        DISK
     FAAFPL03 IF  E           K        DISK
     FADHPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FAAPPL03 IF  E           K        DISK
     FAAOPL03 IF  E           K        DISK
     FAAYPL03 IF  E           K        DISK
     FAANPL03 IF  E           K        DISK
     FAAXPL10 IF  E           K        DISK
     FAEAPL03 IF  E           K        DISK
     FCADPL03 IF  E           K        DISK
      *
     FFGBPL01 IF  E           K        DISK
      *
     FAGDPL12 IF  E           K        DISK
     FMBDPL01 IF  E           K        DISK
     F*GSTPL1S IF  E           K        DISK
      *
     FAKBPL03 IF  E           K        DISK
     FAKGPL03 IF  E           K        DISK
     FAKIPL03 IF  E           K        DISK
      *構成品番マスター
     FAEBPL07 IF  E           K        DISK
      *MSK 2008.11.13
     FMCENP13 IF  E           K        DISK
      *MSK 2009.01.08
     FAEBPL12 IF  E           K        DISK
     FAKHPL05 IF  E           K        DISK
      *
     FAJSPL01 IF  E           K        DISK
      *
     FMYBWP01 O   F    2048            DISK
      *
      *==================
      * 表示用テーブル
TCHK2E*                   #TXT    1   1 20
TCHK2E*                   @2      1  20  1   #2     20
TCHK2E*                   @3      1  12  1   #3     20
TCHK2E*                   @4      1  15  1   #4     30
      *
      *============
      * 工程決定
     E                    HKT        15  3               工程
     E                    HBM        15  4 0             部門
     E                    HKI        15  3               機番
     E                    HMB        15  6               工程所番地
     E                    HDH        15 12               工程品番
     E                    HKD        15  1               かんばん種類大
     E                    HSU        15  9 0             工程設定数
      *
      *====================================
      * 社内かんばん切替えマスター旧工程
     E                    OKT        15  3               工程
     E                    OBM        15  4 0             部門
     E                    OKI        15  3               機番
     E                    OMB        15  6               工程所番地
     E                    ODH        15 12               工程品番
     E                    OKD        15  1               かんばん種類大
      *
      *====================================
      * 社内かんばん切替えマスター新工程
     E                    SKT        15  3               工程
     E                    SBM        15  4 0             部門
     E                    SKI        15  3               機番
     E                    SMB        15  6               工程所番地
     E                    SDH        15 12               工程品番
     E                    SKD        15  1               かんばん種類大
     E                    SSU        15  9 0             工程設定数
     E                    SUK        15 10 0             かんばん切替日
      *
      *======================================
      * 構成品かんばん切替えマスター旧工程
     E                    QKT        15  3               工程
     E                    QBM        15  4 0             部門
     E                    QMB        15  6               工程所番地
     E                    QDH        15 12               工程品番
     E                    QKD        15  1               かんばん種類大
      *
     E                    U1NS        3  9 0             内示数量N-N+2
     E                    U1SS        3  9 0             内示数量N-N+2
      *
      *======================================
      * 構成品かんばん切替えマスター新工程
     E                    NKT        15  3               工程
     E                    NBM        15  4 0             部門
     E                    NMB        15  6               工程所番地
     E                    NDH        15 12               工程品番
     E                    NKD        15  1               かんばん種類大
     E                    NSU        15  9 0             工程設定数
     E                    NUK        15 10 0             かんばん切替日
      *
     E                    HSM        15  1               品名
      *
      *=============================
      * 社内かんばん切り替えuﾇjｰ
     I            DS
     I                                        1  45 OKT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600OBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  45 OKI
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN00
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I            DS
     I                                        1  90 OMB
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1 180 ODH
     I                                        1  12 CKQH01
     I                                       13  24 CKQH02
     I                                       25  36 CKQH03
     I                                       37  48 CKQH04
     I                                       49  60 CKQH05
     I                                       61  72 CKQH06
     I                                       73  84 CKQH07
     I                                       85  96 CKQH08
     I                                       97 108 CKQH09
     I                                      109 120 CKQH10
     I                                      121 132 CKQH11
     I                                      133 144 CKQH12
     I                                      145 156 CKQH13
     I                                      157 168 CKQH14
     I                                      169 180 CKQH15
     I            DS
     I                                        1  15 OKD
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I            DS
     I                                        1  45 SKT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600SBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  45 SKI
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  90 SMB
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1 180 SDH
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1  15 SKD
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1 1350SSU
     I                                        1   90CKSU01
     I                                       10  180CKSU02
     I                                       19  270CKSU03
     I                                       28  360CKSU04
     I                                       37  450CKSU05
     I                                       46  540CKSU06
     I                                       55  630CKSU07
     I                                       64  720CKSU08
     I                                       73  810CKSU09
     I                                       82  900CKSU10
     I                                       91  990CKSU11
     I                                      100 1080CKSU12
     I                                      109 1170CKSU13
     I                                      118 1260CKSU14
     I                                      127 1350CKSU15
     I            DS
     I                                        1 1500SUK
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
      *
      *===============================
      * 構成品かんばん切り替えuﾇjｰ
     I            DS
     I                                        1  45 QKT
     I                                        1   3 M3QK01
     I                                        4   6 M3QK02
     I                                        7   9 M3QK03
     I                                       10  12 M3QK04
     I                                       13  15 M3QK05
     I                                       16  18 M3QK06
     I                                       19  21 M3QK07
     I                                       22  24 M3QK08
     I                                       25  27 M3QK09
     I                                       28  30 M3QK10
     I                                       31  33 M3QK11
     I                                       34  36 M3QK12
     I                                       37  39 M3QK13
     I                                       40  42 M3QK14
     I                                       43  45 M3QK15
     I            DS
     I                                        1  600QBM
     I                                        1   40M3QB01
     I                                        5   80M3QB02
     I                                        9  120M3QB03
     I                                       13  160M3QB04
     I                                       17  200M3QB05
     I                                       21  240M3QB06
     I                                       25  280M3QB07
     I                                       29  320M3QB08
     I                                       33  360M3QB09
     I                                       37  400M3QB10
     I                                       41  440M3QB11
     I                                       45  480M3QB12
     I                                       49  520M3QB13
     I                                       53  560M3QB14
     I                                       57  600M3QB15
     I            DS
     I                                        1  90 QMB
     I                                        1   6 M3QT01
     I                                        7  12 M3QT02
     I                                       13  18 M3QT03
     I                                       19  24 M3QT04
     I                                       25  30 M3QT05
     I                                       31  36 M3QT06
     I                                       37  42 M3QT07
     I                                       43  48 M3QT08
     I                                       49  54 M3QT09
     I                                       55  60 M3QT10
     I                                       61  66 M3QT11
     I                                       67  72 M3QT12
     I                                       73  78 M3QT13
     I                                       79  84 M3QT14
     I                                       85  90 M3QT15
     I            DS
     I                                        1 180 QDH
     I                                        1  12 M3QH01
     I                                       13  24 M3QH02
     I                                       25  36 M3QH03
     I                                       37  48 M3QH04
     I                                       49  60 M3QH05
     I                                       61  72 M3QH06
     I                                       73  84 M3QH07
     I                                       85  96 M3QH08
     I                                       97 108 M3QH09
     I                                      109 120 M3QH10
     I                                      121 132 M3QH11
     I                                      133 144 M3QH12
     I                                      145 156 M3QH13
     I                                      157 168 M3QH14
     I                                      169 180 M3QH15
     I            DS
     I                                        1  15 QKD
     I                                        1   1 M3QS01
     I                                        2   2 M3QS02
     I                                        3   3 M3QS03
     I                                        4   4 M3QS04
     I                                        5   5 M3QS05
     I                                        6   6 M3QS06
     I                                        7   7 M3QS07
     I                                        8   8 M3QS08
     I                                        9   9 M3QS09
     I                                       10  10 M3QS10
     I                                       11  11 M3QS11
     I                                       12  12 M3QS12
     I                                       13  13 M3QS13
     I                                       14  14 M3QS14
     I                                       15  15 M3QS15
     I            DS
     I                                        1  45 NKT
     I                                        1   3 M3KO01
     I                                        4   6 M3KO02
     I                                        7   9 M3KO03
     I                                       10  12 M3KO04
     I                                       13  15 M3KO05
     I                                       16  18 M3KO06
     I                                       19  21 M3KO07
     I                                       22  24 M3KO08
     I                                       25  27 M3KO09
     I                                       28  30 M3KO10
     I                                       31  33 M3KO11
     I                                       34  36 M3KO12
     I                                       37  39 M3KO13
     I                                       40  42 M3KO14
     I                                       43  45 M3KO15
     I            DS
     I                                        1  600NBM
     I                                        1   40M3BM01
     I                                        5   80M3BM02
     I                                        9  120M3BM03
     I                                       13  160M3BM04
     I                                       17  200M3BM05
     I                                       21  240M3BM06
     I                                       25  280M3BM07
     I                                       29  320M3BM08
     I                                       33  360M3BM09
     I                                       37  400M3BM10
     I                                       41  440M3BM11
     I                                       45  480M3BM12
     I                                       49  520M3BM13
     I                                       53  560M3BM14
     I                                       57  600M3BM15
     I            DS
     I                                        1  90 NMB
     I                                        1   6 M3NB01
     I                                        7  12 M3NB02
     I                                       13  18 M3NB03
     I                                       19  24 M3NB04
     I                                       25  30 M3NB05
     I                                       31  36 M3NB06
     I                                       37  42 M3NB07
     I                                       43  48 M3NB08
     I                                       49  54 M3NB09
     I                                       55  60 M3NB10
     I                                       61  66 M3NB11
     I                                       67  72 M3NB12
     I                                       73  78 M3NB13
     I                                       79  84 M3NB14
     I                                       85  90 M3NB15
     I            DS
     I                                        1 180 NDH
     I                                        1  12 M3HB01
     I                                       13  24 M3HB02
     I                                       25  36 M3HB03
     I                                       37  48 M3HB04
     I                                       49  60 M3HB05
     I                                       61  72 M3HB06
     I                                       73  84 M3HB07
     I                                       85  96 M3HB08
     I                                       97 108 M3HB09
     I                                      109 120 M3HB10
     I                                      121 132 M3HB11
     I                                      133 144 M3HB12
     I                                      145 156 M3HB13
     I                                      157 168 M3HB14
     I                                      169 180 M3HB15
     I            DS
     I                                        1  15 NKD
     I                                        1   1 M3TY01
     I                                        2   2 M3TY02
     I                                        3   3 M3TY03
     I                                        4   4 M3TY04
     I                                        5   5 M3TY05
     I                                        6   6 M3TY06
     I                                        7   7 M3TY07
     I                                        8   8 M3TY08
     I                                        9   9 M3TY09
     I                                       10  10 M3TY10
     I                                       11  11 M3TY11
     I                                       12  12 M3TY12
     I                                       13  13 M3TY13
     I                                       14  14 M3TY14
     I                                       15  15 M3TY15
     I            DS
     I                                        1 1350NSU
     I                                        1   90M3SU01
     I                                       10  180M3SU02
     I                                       19  270M3SU03
     I                                       28  360M3SU04
     I                                       37  450M3SU05
     I                                       46  540M3SU06
     I                                       55  630M3SU07
     I                                       64  720M3SU08
     I                                       73  810M3SU09
     I                                       82  900M3SU10
     I                                       91  990M3SU11
     I                                      100 1080M3SU12
     I                                      109 1170M3SU13
     I                                      118 1260M3SU14
     I                                      127 1350M3SU15
     I            DS
     I                                        1 1500NUK
     I                                        1  100M3HZ01
     I                                       11  200M3HZ02
     I                                       21  300M3HZ03
     I                                       31  400M3HZ04
     I                                       41  500M3HZ05
     I                                       51  600M3HZ06
     I                                       61  700M3HZ07
     I                                       71  800M3HZ08
     I                                       81  900M3HZ09
     I                                       91 1000M3HZ10
     I                                      101 1100M3HZ11
     I                                      111 1200M3HZ12
     I                                      121 1300M3HZ13
     I                                      131 1400M3HZ14
     I                                      141 1500M3HZ15
      *
     I            DS
     I                                        1  270U1NS
     I                                        1   90U1NNNM
     I                                       10  180U1N1NM
     I                                       19  270U1N2NM
     I            DS
     I                                        1  270U1SS
     I                                        1   90U1SNNM
     I                                       10  180U1S1NM
     I                                       19  270U1S2NM
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
     I            DS
     I                                        1   80G2SKHZ
     I                                        1   40G2SKYY
     I                                        5   60G2SKMM
     I                                        7   80G2SKDD
     I            DS
     I                                        1   80G2JSKZ
     I                                        1   60G2JSK6
     I                                        1   40G2JSKY
     I                                        5   60G2JSKM
     I                                        7   80G2JSKD
     I            DS
     I                                        1   6 WTKRO
     I                                        1   1 WTKR1
     I                                        2   3 WTKR2
     I                                        4   5 WTKR3
     I                                        6   6 WTKR4
      *
     I            DS
     I                                        1  48 UDS
     I                                        1   1 UKBN
     I                                        2   50UYM
     I                                        6  110UHZ1
     I                                       12  170UHZ2
     I                                       18  201UCD
     I                                       21  21 UIO
     I                                       22  241UN1DD
     I                                       25  271UN2DD
     I                                       28  301UN3DD
     I                                       31  331UN4DD
     I                                       34  361UN5DD
     I                                       37  391UJ1DD
     I                                       40  421UJ2DD
     I                                       43  451UJ3DD
     I                                       46  481UJ4DD
      *
     I            DS
     I                                        1   7 MEK
     I                                        1   4 MEK1
     I                                        5   6 MEK2
     I                                        7   7 MEK3
     I            DS
     I                                        1   60W@UYM
     I                                        1   40W@UYY
     I                                        5   60W@UMM
     I            DS
     I                                        1   60W@UYMA
     I                                        1   40W@UYYA
     I                                        5   60W@UMMA
     I                                        5   60W@NA
     I            DS
     I                                        1   60W@UYM0
     I                                        1   40W@UYY0
     I                                        5   60W@UMM0
     I                                        5   60W@N0
     I            DS
     I                                        1   60W@UYM1
     I                                        1   40W@UYY1
     I                                        5   60W@UMM1
     I                                        5   60W@N1
     I            DS
     I                                        1   60W@UYM2
     I                                        1   40W@UYY2
     I                                        5   60W@UMM2
     I                                        5   60W@N2
     I            DS
     I                                        1   4 W@MEK
     I                                        1   1 W@MEK1
     I                                        2   2 W@MEK2
     I                                        3   3 W@MEK3
     I                                        4   4 W@MEK4
     I            DS
     I                                        1  12 K@HINA
     I                                        1   5 K@HIN1
     I                                        6  10 K@HIN2
     I                                       11  12 K@HIN3
      *
     I            DS
     I                                        1   7 A2MEKI
     I                                        1   4 A2MEK1
     I                                        5   6 A2MEK2
     I                                        7   7 A2MEK3
      *
     I            DS
     I                                        1   6 P#MBN
     I                                        1   1 P#MBN1
     I                                        2   3 P#MBN2
     I                                        4   5 P#MBN3
     I                                        6   6 P#MBN4
      *
     I            DS
     I                                        1  12 P#MHN
     I                                        1   5 P#MHN1
     I                                        6  10 P#MHN2
     I                                       11  12 P#MHN3
      *
      *****************************************************************
      *パラメータ
      *****************************************************************
     C           *ENTRY    PLIST
     C                     PARM           PYY     40
     C                     PARM           PMM     20
     C                     PARM           PKT     3
     C                     PARM           PKT2    3
     C                     PARM           PKT3    3
     C                     PARM           PBM     4
     C                     PARM           PHOSEI  30
      *
      *****************************************************************
      *キーリスト
      *****************************************************************
     C           HINKEY    KLIST
     C                     KFLD           W@HIN1  5
     C                     KFLD           W@HIN2  5
     C                     KFLD           W@HIN3  2
      *
     C           KEYAF1    KLIST
     C                     KFLD           W@HIN1  5
     C                     KFLD           W@HIN2  5
     C                     KFLD           W@HIN3  2
      *
     C           HN2KEY    KLIST
     C                     KFLD           W2HIN1  5
     C                     KFLD           W2HIN2  5
     C                     KFLD           W2HIN3  2
      *
     C           KEYF81    KLIST
     C                     KFLD           #KYY    40
     C                     KFLD           #KMM    20
      *
      *MSK 2008.11.13
     C           KEYMC1    KLIST
     C                     KFLD           W@HIN1
     C                     KFLD           W@HIN2
     C                     KFLD           W@HIN3
      *
     C           KEYMC2    KLIST
     C                     KFLD           W2HIN1
     C                     KFLD           W2HIN2
     C                     KFLD           W2HIN3
      *
      *MSK 2009.01.08
     C           KEYAG1    KLIST
     C                     KFLD           #GKHN1  5
     C                     KFLD           #GKHN2  5
     C                     KFLD           #GKHN3  2
      *
     C           KEYM51    KLIST
     C                     KFLD           #MKHN1  5
     C                     KFLD           #MKHN2  5
     C                     KFLD           #MKHN3  2
     C                     KFLD           #MKBMJ  40
     C                     KFLD           #MUKRJ  4
     C                     KFLD           #MKDAI  1
      *
     C           TR2KEY    KLIST
     C                     KFLD           WTR21   1
     C                     KFLD           WTR22   2
     C                     KFLD           WTR23   2
     C                     KFLD           WTR24   1
      *
     C           KEY1      KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *
     C           KEY2      KLIST
     C                     KFLD           M1KHN1
     C                     KFLD           M1KHN2
     C                     KFLD           M1KHN3
      *
     C           KEY3      KLIST
     C                     KFLD           W@HIN1
     C                     KFLD           W@HIN2
     C                     KFLD           W@HIN3
     C                     KFLD           W@UYM
      *
     C           KEY4      KLIST
     C                     KFLD           W2HIN1
     C                     KFLD           W2HIN2
     C                     KFLD           W2HIN3
     C                     KFLD           W@UYM
      *
      *****************************************************************
      *初期処理
      *****************************************************************
     C                     MOVE PBM       WBM     40
     C                     MOVEL'1'       OPNCLS  1
      **現在の設定月
     C                     Z-ADD*ZERO     W@UYM
     C                     MOVELPYY       W@UYM
     C                     MOVE PMM       W@UYM
     C                     MOVE W@UYM     UYM
      **１月前
     C           W@UMM     IFEQ 1
     C           W@UYY     SUB  1         W@UYYA
     C                     Z-ADD12        W@UMMA
     C                     ELSE
     C           W@UYM     SUB  1         W@UYMA
     C                     END
     C                     Z-ADDW@UYYA    #KYY
     C                     Z-ADDW@UMMA    #KMM
     C                     Z-ADD*ZERO     W@KDO   31
     C                     EXSR $SB900
     C                     Z-ADDW@KDO     W@KDOA  31
      **当月
     C                     Z-ADDW@UYM     W@UYM0
     C                     Z-ADDW@UYY0    #KYY
     C                     Z-ADDW@UMM0    #KMM
     C                     Z-ADD*ZERO     W@KDO
     C                     EXSR $SB900
     C                     Z-ADDW@KDO     W@KDO0  31
      **１月後
     C           W@UMM0    IFEQ 12
     C           W@UYY0    ADD  1         W@UYY1
     C                     Z-ADD01        W@UMM1
     C                     ELSE
     C           W@UYM0    ADD  1         W@UYM1
     C                     END
     C                     Z-ADDW@UYY1    #KYY
     C                     Z-ADDW@UMM1    #KMM
     C                     Z-ADD*ZERO     W@KDO
     C                     EXSR $SB900
     C                     Z-ADDW@KDO     W@KDO1  31
      **２月後
     C           W@UMM1    IFEQ 12
     C           W@UYY1    ADD  1         W@UYY2
     C                     Z-ADD01        W@UMM2
     C                     ELSE
     C           W@UYM1    ADD  1         W@UYM2
     C                     END
     C                     Z-ADDW@UYY2    #KYY
     C                     Z-ADDW@UMM2    #KMM
     C                     Z-ADD*ZERO     W@KDO
     C                     EXSR $SB900
     C                     Z-ADDW@KDO     W@KDO2  31
      **ヘッダー印刷
     C                     EXCPTHD
      **
      *****************************************************************
      *メイン
      *****************************************************************
      ******************
      * 部品情報uﾇjｰ
     C                     DO   *HIVAL
     C                     READ FCEPP011                 91
     C         91          LEAVE
      **削除
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
     C           A2TEHI    IFNE 'G'
     C                     ITER
     C                     ENDIF
      **現在工程
     C                     EXSR #SB011
      **対象工程
     C                     Z-ADD1         A       30
     C                     MOVE *BLANK    WOUT1   1
     C           1         DO   15        A
     C           HKT,A     IFEQ *BLANK
     C                     LEAVE
     C                     ELSE
     C                     EXSR $HANTE
     C           @OK       IFEQ 'OK'
     C                     EXSR OUTPUT
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      **
     C                     ENDDO
      *
      *
      *===================
      * 構成品情報uﾇjｰ
     C                     DO   *HIVAL
     C                     READ AKCPP011                 91
     C         91          LEAVE
      **削除
     C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
      **現在工程
     C                     EXSR #SB012
     C                     Z-ADD1         A       30
     C                     Z-ADD0         B       30
      **対象工程
     C                     Z-ADD1         A
     C                     MOVE *BLANK    WOUT2   1
     C           1         DO   99        A
     C           HKT,A     IFEQ *BLANK
     C                     LEAVE
     C                     ELSE
     C                     EXSR $HANTE
     C           @OK       IFEQ 'OK'
     C                     EXSR OUTPU2
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      **
     C                     ENDDO
      *
      *終了
     C*                    MOVEL'9'       OPNCLS  1
     C*                    CALL 'FCKRB1'
     C*                    PARM           PYM     4
     C*                    PARM           PHIN1   5
     C*                    PARM           PHIN2   5
     C*                    PARM           PHIN3   2
     C*                    PARM           OPNCLS  1
     C*                    PARM           PSN0    90
     C*                    PARM           PSN1    90
     C*                    PARM           PSN2    90
     C*                    PARM           PSTS    1
     C*                    EXSR #SB019
      *
     C                     SETON                     LR
     C                     RETRN
      *****************************************************************
      *
      *
      *@@@@@@@@@@@@@*
      *判定       *
      *@@@@@@@@@@@@@*
     CSR         $HANTE    BEGSR
      *
     C                     MOVEL*BLANK    @OK     2
     C           HKT,A     IFEQ PKT
     C           HKT,A     OREQ PKT2
     C           HKT,A     OREQ PKT3
     C           PBM       IFEQ *BLANK
     C                     MOVEL'OK'      @OK     2
     C                     ELSE
     C           HBM,A     IFEQ WBM
     C                     MOVEL'OK'      @OK     2
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C           HBM,A     IFEQ WBM
     C           PKT       IFEQ *BLANK
     C           PKT2      ANDEQ*BLANK
     C           PKT3      ANDEQ*BLANK
     C                     MOVEL'OK'      @OK     2
     C                     ELSE
     C           HKT,A     IFEQ PKT
     C           HKT,A     OREQ PKT2
     C           HKT,A     OREQ PKT3
     C                     MOVEL'OK'      @OK     2
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     CSR                   ENDSR
      *
      *
      *@@@@@@@@@@*
      *  OUTPUT  *
      *@@@@@@@@@@*
     C           OUTPUT    BEGSR
      *
     C           WOUT1     IFEQ *BLANK
     C                     MOVEL'*'       WOUT1
      *
     C                     MOVE *BLANK    ZANM   15
     C                     Z-ADD0         KAZI    52
     C                     MOVE *BLANK    STRK    1
     C                     MOVE *BLANK    STRT    2
     C                     MOVE *BLANK    STRR    2
     C                     MOVE *BLANK    STRD    1
     C                     MOVE *BLANK    KIKI    2
     C                     Z-ADD0         KUBI    30
     C                     Z-ADD0         TUSZ    20
     C                     Z-ADD0         GEKN    90
     C                     Z-ADD0         JURYO  140
      *部門名称
     C                     MOVE *BLANK    BBFKO  15
     C                     MOVE *BLANK    BFKO   15
     C                     MOVE *BLANK    JIKO   15
     C                     MOVE *BLANK    NXKO   15
     C                     MOVE *BLANK    NNXKO  15
      *
     C                     Z-ADD0         ONDO    30
     C                     Z-ADD0         WCO2
      *工程コード
     C                     MOVEL*BLANK    HKTBB   3
     C                     MOVEL*BLANK    HKTBF   3
     C                     MOVEL*BLANK    HKTNX   3
     C                     MOVEL*BLANK    HKTNN   3
      *
     C                     Z-ADD0         SYSS    70
     C                     Z-ADD1         CBKO    20       Ｃ箱比率
     C                     Z-ADD0         BARA    20       xｮgﾌﾞﾛﾓA
     C                     Z-ADD0         BARB    31        xｮgﾌﾞﾛﾓB
     C                     Z-ADD0         LOTO    20       生産ロット
     C                     Z-ADD0         MKSU    31       めっき係数
     C                     MOVEL*BLANK    MEK1    4
     C                     MOVEL*BLANK    MEK2    2
     C                     MOVEL*BLANK    MEK3    1
     C                     Z-ADD0         KASI    72
     C                     MOVEL*BLANK    SSYT    1
     C                     MOVEL*BLANK    SMEI   15
TCHK2C*                    MOVEL*BLANK    E@ME   30
TCHK2C*                    MOVEL*BLANK    E@CL   30
TCHK2C*                    MOVEL*BLANK    E@H    20
     C                     Z-ADD*ZERO     W@ZSNA 100
     C                     Z-ADD*ZERO     W@SNNM  90
     C                     Z-ADD*ZERO     W@S1NM  90
     C                     Z-ADD*ZERO     W@S2NM  90
     C                     Z-ADD*ZERO     W@DDHA 123
     C                     Z-ADD*ZERO     W@DDH0 113
     C                     Z-ADD*ZERO     W@DDH1 113
     C                     Z-ADD*ZERO     W@DDH2 113
     C                     Z-ADD*ZERO     W@KASI 153
     C                     Z-ADD*ZERO     W@DDKA 153
     C                     Z-ADD*ZERO     W@DDK0 153
     C                     Z-ADD*ZERO     W@DDK1 153
     C                     Z-ADD*ZERO     W@DDK2 153
     C                     Z-ADD*ZERO     W@BARA
     C                     Z-ADD*ZERO     W@BAR0
     C                     Z-ADD*ZERO     W@BAR1
     C                     Z-ADD*ZERO     W@BAR2
      *機番
     C                     MOVE *BLANK    BBKBN   3
     C                     MOVE *BLANK    BKBN    3
     C                     MOVE *BLANK    JKBN    3
     C                     MOVE *BLANK    NKBN    3
     C                     MOVE *BLANK    NNKBN   3
      *所番地
     C                     MOVEL*BLANK    HTRBB   6
     C                     MOVEL*BLANK    HTRBF   6
     C                     MOVEL*BLANK    HTRJI   6
     C                     MOVEL*BLANK    HTRNX   6
     C                     MOVEL*BLANK    HTRNN   6
      *
      *--------------------------------*
      *  ..     部品マスター     ..  *
      *--------------------------------*
      *
     C                     MOVELA2BHB1    W@HIN1
     C                     MOVELA2BHB2    W@HIN2
     C                     MOVELA2BHB3    W@HIN3
     C                     SETOF                     56
     C*
   56C           *IN56     IFEQ '0'
     C           A2KASI    MULT A2GEKN    JURYO
     C           JURYO     DIV  1000      @JURYO 153
     C                     MOVE A2ZANM    ZANM
     C                     Z-ADDA2KAZI    KAZI
     C                     MOVELA2KIKI    KIKI
     C                     Z-ADDA2KUBI    KUBI
     C                     Z-ADDA2TUSZ    TUSZ
     C                     Z-ADDA2GEKN    GEKN
     C                     MOVE A2STRK    STRK
     C                     MOVE A2STRT    STRT
     C                     MOVE A2STRR    STRR
     C                     MOVE A2STRD    STRD
     C******               Z-ADDA2SSYS    SYSS
     C                     MOVE A2MEK1    MEK1
     C                     MOVE A2MEK2    MEK2
     C                     MOVE A2MEK3    MEK3
     C                     MOVE A2KASI    KASI
     C                     MOVELA2SSYT    SSYT
     C                     MOVELA2SMEI    SMEI
     C*自工程部門
     C                     SETOF                     57
     C           HBM,A     CHAINFGBPL011             57
     C           *IN57     IFEQ '0'
     C                     MOVELB2SMEI    JIKO
     C                     ENDIF
     C                     MOVELHKI,A     JKBN
     C                     MOVELHMB,A     HTRJI
     C*前々工程部門
     C                     SETOF                     60
     C           A         IFGE 3
     C                     SETON                     60
     C           A         SUB  2         BB      30
     C           BB        IFGT 0
     C                     MOVELHKT,BB    HKTBB   3
     C                     MOVELHMB,BB    HTRBB
     C                     MOVELHKI,BB    BBKBN
     C           HBM,BB    CHAINFGBPL011             57
     C           *IN57     IFEQ '0'
     C                     MOVELB2SMEI    BBFKO
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*前工程部門
     C           A         SUB  1         BF      30
     C           BF        IFGT 0
     C                     MOVELHKT,BF    HKTBF   3
     C                     MOVELHMB,BF    HTRBF
     C                     MOVELHKI,BF    BKBN
     C           HBM,BF    CHAINFGBPL011             57
     C           *IN57     IFEQ '0'
     C                     MOVELB2SMEI    BFKO
     C                     ENDIF
     C                     ENDIF
     C*後工程部門
     C           A         ADD  1         NX      30
     C           NX        IFLE 99
     C                     MOVELHKT,NX    HKTNX   3
     C                     MOVELHMB,NX    HTRNX
     C                     MOVELHKI,NX    NKBN
     C           HBM,NX    CHAINFGBPL011             57
     C           *IN57     IFEQ '0'
     C                     MOVELB2SMEI    NXKO
     C                     ENDIF
     C                     ENDIF
     C*
     C*後々工程部門
     C           A         ADD  2         NN      30
     C           NN        IFLE 99
     C                     MOVELHKT,NN    HKTNN   3
     C                     MOVELHKI,NN    NNKBN
     C                     MOVELHMB,NN    HTRNN
     C           HBM,NN    CHAINFGBPL011             57
     C           *IN57     IFEQ '0'
     C                     MOVELB2SMEI    NNXKO
     C                     ENDIF
     C                     ENDIF
     C*
   56C                     ENDIF
     C*
     C                     SETOF                     88
     C                     MOVE *BLANK    WKACD   1
     C           A         DO   99        ZZ      30
     C           HKD,ZZ    IFNE *BLANK
     C                     MOVE HKD,ZZ    WKACD
     C                     MOVE HMB,ZZ    WTKRO
     C                     SETON                     88
     C                     ENDIF
     C  N88                ENDDO
     C*
     C*          W@HIN1    IFEQ '90105'
     C*          W@HIN2    ANDEQ'06025'
     C*          W@HIN3    ANDEQ'  '
     C*                    Z-ADDSAKA      SAKA    40
     C*          WKACD     IFEQ 'B'
     C*                    Z-ADDSAKA      SAKA    40
     C*                    END
     C*                    END
     C*
     C                     EXSR $SBSYU
     C*手書きかんばん対応　０の時は部品Ｍの収容数を使用する。
     C*生産企画Ｔ　小田氏依頼対応T.SAKASHITA 2008.08.04
     C           SYSS      IFEQ 0
     C                     Z-ADDA2SSYS    SYSS
     C                     END
     C*
     C           TKRKEY    KLIST
     C                     KFLD           WTKR1
     C                     KFLD           WTKR2
     C                     KFLD           WTKR3
     C                     KFLD           WTKR4
      *
      *--------------------------------*
      *  ..工程内かんばんマスター..  *
      *--------------------------------*
    AC           WKACD     IFEQ 'A'
      *
     C           TKRKEY    SETLLABHPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEABHPL031                 21
   21C           *IN21     IFEQ '0'
    DC           M6SKJY    IFEQ 'D'
     C           M6SKHZ    ANDLE*DATE
    DC                     ELSE
      *
    9C           M6STHZ    IFEQ *ALL'9'
     C                     Z-ADDM6ONDO    ONDO
    9C                     ELSE
      *
    *C           *DATE     IFGE M6UKHZ
     C           *DATE     ANDLTM6STHZ
     C                     SETON                     21
     C                     Z-ADDM6ONDO    ONDO
    *C                     END
    9C                     END
      *
    DC                     END
   21C                     END
     C  N21                ENDDO
    AC                     END
      *
      *------------------------------*
      *  ..焼入かんばんマスター..  *
      *------------------------------*
     C           WKACD     IFEQ 'B'
     C                     Z-ADD0         WCO2
      *
     C           TKRKEY    SETLLADHPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEADHPL031                 21
     C           *IN21     IFEQ '0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           J6STHZ    IFEQ *ALL'9'
     C                     Z-ADDJ6ONDO    ONDO
     C                     Z-ADDJ6CO2P    WCO2    32
     C                     Z-ADDJ6ONDO    ONDO
     C                     ELSE
      *
     C           *DATE     IFGE J6UKHZ
     C           *DATE     ANDLTJ6STHZ
     C                     SETON                     21
     C                     Z-ADDJ6ONDO    ONDO
     C                     Z-ADDJ6CO2P    WCO2
     C                     Z-ADDJ6ONDO    ONDO
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
      *
      *--------------------------------*
      *  ..指示かんばん　マスター..  *
      *--------------------------------*
     C           WKACD     IFEQ 'F'
      *
     C           TKRKEY    SETLLCADPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READECADPL031                 21
     C           *IN21     IFEQ '0'
     C           C2SKJY    IFEQ 'D'
     C           C2SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           C2STHZ    IFEQ *ALL'9'
     C                     Z-ADDC2ONDO    ONDO
     C                     ELSE
      *
     C           *DATE     IFGE C2UKHZ
     C           *DATE     ANDLTC2STHZ
     C                     SETON                     21
     C                     Z-ADDC2ONDO    ONDO
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
     C*工程内品番
     C                     SETOF                     77
     C                     MOVELHDH,A     K@HINA
     C           K@HIN3    IFNE *BLANK
     C                     SETON                     77
     C                     END
     C*
     C                     SETOF                     30
     C           W@HIN3    IFNE *BLANK
     C                     SETON                     30
     C                     END
      **メッキ種類
TCHK2C*                    MOVELMEK1      W@MEK
TCHK2C*                    Z-ADD1         @M      20
TCHK2C*          W@MEK2    LOKUP@2,@M                    75
TCHK2C*          *IN75     IFEQ '1'
TCHK2C*                    MOVEL#2,@M     E@ME
TCHK2C*                    END
TCHK2C*          W@MEK2    IFEQ 'D'
TCHK2C*          W@MEK4    ANDEQ'B'
TCHK2C*                    MOVEL#TXT,1    E@ME
TCHK2C*                    END
TCHK2C**カラー
TCHK2C*                    Z-ADD1         @M
TCHK2C*          W@MEK4    LOKUP@4,@M                    75
TCHK2C*          *IN75     IFEQ '1'
TCHK2C*                    MOVE #4,@M     E@CL
TAHK2C*                    END
TCHK2C**                   MOVELA2MMEI    E@ME
CCHK2C*
      **脱水素
     C                     Z-ADD1         @M      20
TCHK2C*          W@MEK3    LOKUP@3,@M                    75
TCHK2C*          *IN75     IFEQ '1'
TCHK2C*                    MOVE #3,@M     E@H
TCHK2C*                    END
      **Ｎ－１の実績
     C                     EXSR $SB910
     C                     EXSR $SB912
     C                     ADD  W@JCHU    W@ZSNA
     C           W@ZSNA    IFEQ 0
     C                     EXSR $SB914
     C                     ADD  W@SRO     W@ZSNA
     C                     END
      **内示数
      *
     C                     SETOF                     01
     C           KEY3      CHAINABBPL211             01
     C           *IN01     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
TCHK1C***                  Z-ADDU1NS,1    W@SNNM
     C                     Z-ADDU1NS,2    W@S1NM
     C                     Z-ADDU1NS,3    W@S2NM
     C                     ELSE
TCHK1C***                  Z-ADDU1SS,1    W@SNNM
     C                     Z-ADDU1SS,2    W@S1NM
     C                     Z-ADDU1SS,3    W@S2NM
     C                     END
     C                     END
TCHK1C*
TCHK1C                     Z-ADDA2GEKN    W@SNNM
TCHK1C*
      *
      **日当り箱数
     C           SYSS      IFNE 0
     C           W@ZSNA    DIV  W@KDOA    W@DDHA
     C                     DIV  SYSS      W@DDHA
     C           W@SNNM    DIV  W@KDO0    W@DDH0
     C                     DIV  SYSS      W@DDH0
     C                     MULT PHOSEI    W@DDH0
     C                     DIV  100       W@DDH0 113H
     C           W@S1NM    DIV  W@KDO1    W@DDH1
     C                     DIV  SYSS      W@DDH1
     C                     MULT PHOSEI    W@DDH1
     C                     DIV  100       W@DDH1 113H
     C           W@S2NM    DIV  W@KDO2    W@DDH2
     C                     DIV  SYSS      W@DDH2
     C                     MULT PHOSEI    W@DDH2
     C                     DIV  100       W@DDH2 113H
     C                     END
      **完成重量が０の場合
     C           KASI      IFEQ 0
     C           SYSS      ANDNE0
     C           10000     DIV  SYSS      KASI      H
     C                     END
      **日当りｋｇ
      ***完成重量　／　１０００
      ***完成重量が無い場合は１０とする
     C           KASI      IFEQ 0
     C                     Z-ADD10        W@KASI
     C                     ELSE
     C                     Z-ADDKASI      W@KASI
     C                     END
     C                     DIV  1000      W@KASI
      ***Ｘ　収容数
     C                     MULT SYSS      W@KASI
      ***Ｘ　日当り箱数
     C*          W@KASI    MULT W@DDHA    W@DDKA
     C*          W@KASI    MULT W@DDH0    W@DDK0
     C*          W@KASI    MULT W@DDH1    W@DDK1
     C*          W@KASI    MULT W@DDH2    W@DDK2
      *単重×実績／１０００／稼働日
     C           KASI      MULT W@ZSNA    WWDDKA 153
     C           WWDDKA    DIV  1000      WWDDKA 153
     C           WWDDKA    DIV  W@KDOA    W@DDKA 153
      *
     C           KASI      MULT W@SNNM    WWDDK0 153
     C           WWDDK0    DIV  1000      WWDDK0 153
     C           WWDDK0    DIV  W@KDO0    W@DDK0 153
     C                     MULT PHOSEI    W@DDK0 153
     C                     DIV  100       W@DDK0 153H
      *
     C           KASI      MULT W@S1NM    WWDDK1 153
     C           WWDDK1    DIV  1000      WWDDK1 153
     C           WWDDK1    DIV  W@KDO1    W@DDK1 153
     C                     MULT PHOSEI    W@DDK1 153
     C                     DIV  100       W@DDK1 153H
      *
     C           KASI      MULT W@S2NM    WWDDK2 153
     C           WWDDK2    DIV  1000      WWDDK2 153
     C           WWDDK2    DIV  W@KDO2    W@DDK2 153
     C                     MULT PHOSEI    W@DDK2 153
     C                     DIV  100       W@DDK2 153H
      *-----------------------------------------------------------------*
      *日当りバレル計算                                               *
      *月間必要数×補正値÷稼働日÷Ｃ箱比率÷収容数÷バレルＢ÷１００ *
      *-----------------------------------------------------------------*
     C                     Z-ADD0         KAI12
     C                     Z-ADD0         KAI13
     C                     Z-ADD0         KAI14
     C                     Z-ADD0         KAI21
     C                     Z-ADD0         KAI22
     C                     Z-ADD0         KAI23
     C                     Z-ADD0         KAI24
     C                     Z-ADD0         KAI25
     C                     Z-ADD0         KAI31
     C                     Z-ADD0         KAI32
     C                     Z-ADD0         KAI33
     C                     Z-ADD0         KAI34
     C                     Z-ADD0         KAI35
     C                     Z-ADD0         KAI41
     C                     Z-ADD0         KAI42
     C                     Z-ADD0         KAI43
     C                     Z-ADD0         KAI44
     C                     Z-ADD0         KAI45
      *Ｎ－１月分（実績分には補正値は掛けない）
     C           W@ZSNA    IFNE 0
     C           W@KDOA    ANDNE0
     C           CBKO      ANDNE0
     C           SYSS      ANDNE0
     C           BARB      ANDNE0
     C           W@ZSNA    DIV  W@KDOA    KAI12  155
     C           KAI12     DIV  CBKO      KAI13  155
     C           KAI13     DIV  SYSS      KAI14  155
     C           KAI14     DIV  BARB      W@BARA 152H
     C                     END
      *Ｎ月分
     C           W@SNNM    IFNE 0
     C           PHOSEI    ANDNE0
     C           W@KDO0    ANDNE0
     C           CBKO      ANDNE0
     C           SYSS      ANDNE0
     C           BARB      ANDNE0
     C           W@SNNM    MULT PHOSEI    KAI21  150
     C           KAI21     DIV  W@KDO0    KAI22  155
     C           KAI22     DIV  CBKO      KAI23  155
     C           KAI23     DIV  SYSS      KAI24  155
     C           KAI24     DIV  BARB      KAI25  155
     C           KAI25     DIV  100       W@BAR0 152H
     C                     END
      *Ｎ＋１月分
     C           W@S1NM    IFNE 0
     C           PHOSEI    ANDNE0
     C           W@KDO1    ANDNE0
     C           CBKO      ANDNE0
     C           SYSS      ANDNE0
     C           BARB      ANDNE0
     C           W@S1NM    MULT PHOSEI    KAI31  150
     C           KAI31     DIV  W@KDO1    KAI32  155
     C           KAI32     DIV  CBKO      KAI33  155
     C           KAI33     DIV  SYSS      KAI34  155
     C           KAI34     DIV  BARB      KAI35  155
     C           KAI35     DIV  100       W@BAR1 152H
     C                     END
      *Ｎ＋２月分
     C           W@S2NM    IFNE 0
     C           PHOSEI    ANDNE0
     C           W@KDO2    ANDNE0
     C           CBKO      ANDNE0
     C           SYSS      ANDNE0
     C           BARB      ANDNE0
     C           W@S2NM    MULT PHOSEI    KAI41  150
     C           KAI41     DIV  W@KDO2    KAI42  155
     C           KAI42     DIV  CBKO      KAI43  155
     C           KAI43     DIV  SYSS      KAI44  155
     C           KAI44     DIV  BARB      KAI45  155
     C           KAI45     DIV  100       W@BAR2 152H
     C                     END
      **発行種類
     C                     MOVEL'1'       E@SYU   1
      **
     C           HINKEY    CHAINAJSPL01              78
     C           *IN78     IFEQ '0'
     C           J1SKJY    IFEQ 'D'
     C                     SETON                     78
     C                     END
     C                     END
     C           *IN78     IFEQ '0'
     C           J1MKSK    IFEQ '0'
     C                     Z-ADD0         MKSU
     C                     END
     C           J1MKSK    IFEQ '1'
     C                     Z-ADDJ1MKRI    MKSU
     C                     END
     C           J1MKSK    IFEQ '2'
     C                     Z-ADDJ1MKJI    MKSU
     C                     END
     C                     END
      *
      *========
      * 品名
     C                     MOVEASMEI      HSM
      *
     C                     Z-ADD1         Z       20
     C           1         DO   15        Z
     C           HSM,Z     IFEQ ','
     C                     MOVE *BLANK    HSM,Z
     C                     END
     C                     END
      *
     C                     MOVEAHSM       SMEI
      **
     C                     EXCPTDAT
      *
     C                     END
      *
     C                     ENDSR
      *
      *
      *@@@@@@@@@@*
      *  OUTPU2  *
      *@@@@@@@@@@*
     C           OUTPU2    BEGSR
      *
     C           WOUT2     IFEQ *BLANK
     C                     MOVEL'*'       WOUT2
      *
     C                     MOVE *BLANK    K@HINA
     C                     MOVE *BLANK    ZANM   15
     C                     Z-ADD0         KAZI    52
     C                     MOVE *BLANK    STRK    1
     C                     MOVE *BLANK    STRT    2
     C                     MOVE *BLANK    STRR    2
     C                     MOVE *BLANK    STRD    1
     C                     MOVE *BLANK    KIKI
     C                     Z-ADD0         KUBI    30
     C                     Z-ADD0         TUSZ    20
     C                     Z-ADD0         GEKN    90
     C                     Z-ADD0         JURYO  140
      *部門名称
     C                     MOVE *BLANK    BBFKO  15
     C                     MOVE *BLANK    BFKO   15
     C                     MOVE *BLANK    JIKO   15
     C                     MOVE *BLANK    NXKO   15
     C                     MOVE *BLANK    NNXKO  15
      *
     C                     Z-ADD0         ONDO    30
     C                     Z-ADD0         WCO2
      *工程コード
     C                     MOVEL*BLANK    HKTBB   3
     C                     MOVEL*BLANK    HKTBF   3
     C                     MOVEL*BLANK    HKTNX   3
     C                     MOVEL*BLANK    HKTNN   3
      *
     C                     Z-ADD0         SYSS    70
     C                     Z-ADD1         CBKO    20       Ｃ箱比率
     C                     Z-ADD0         BARA    20       xｮgﾌﾞﾛﾓA
     C                     Z-ADD0         BARB    31        xｮgﾌﾞﾛﾓB
     C                     Z-ADD0         LOTO    20       生産ロット
     C                     Z-ADD0         MKSU    31       めっき係数
     C                     MOVEL*BLANK    MEK1    4
     C                     MOVEL*BLANK    MEK2    2
     C                     MOVEL*BLANK    MEK3    1
     C                     Z-ADD0         KASI    72
     C                     MOVEL*BLANK    SSYT    1
     C                     MOVEL*BLANK    SMEI   15
TCHK2C*                    MOVEL*BLANK    E@ME   30
TCHK2C*                    MOVEL*BLANK    E@CL   30
TCHK2C*                    MOVEL*BLANK    E@H    20
     C                     Z-ADD*ZERO     W@ZSNA 100
     C                     Z-ADD*ZERO     W@SNNM  90
     C                     Z-ADD*ZERO     W@S1NM  90
     C                     Z-ADD*ZERO     W@S2NM  90
     C                     Z-ADD*ZERO     W@DDHA 123
     C                     Z-ADD*ZERO     W@DDH0 113
     C                     Z-ADD*ZERO     W@DDH1 113
     C                     Z-ADD*ZERO     W@DDH2 113
     C                     Z-ADD*ZERO     W@KASI 153
     C                     Z-ADD*ZERO     W@DDKA 153
     C                     Z-ADD*ZERO     W@DDK0 153
     C                     Z-ADD*ZERO     W@DDK1 153
     C                     Z-ADD*ZERO     W@DDK2 153
     C                     Z-ADD*ZERO     W@BARA
     C                     Z-ADD*ZERO     W@BAR0
     C                     Z-ADD*ZERO     W@BAR1
     C                     Z-ADD*ZERO     W@BAR2
      *機番
     C                     MOVE *BLANK    BBKBN   3
     C                     MOVE *BLANK    BKBN    3
     C                     MOVE *BLANK    JKBN    3
     C                     MOVE *BLANK    NKBN    3
     C                     MOVE *BLANK    NNKBN   3
      *所番地
     C                     MOVEL*BLANK    HTRBB   6
     C                     MOVEL*BLANK    HTRBF   6
     C                     MOVEL*BLANK    HTRJI   6
     C                     MOVEL*BLANK    HTRNX   6
     C                     MOVEL*BLANK    HTRNN   6
      *
      *--------------------------------*
      *  ..構成品部品マスター    ..  *
      *--------------------------------*
      *
     C                     MOVELM1KHN1    W@HIN1
     C                     MOVELM1KHN2    W@HIN2
     C                     MOVELM1KHN3    W@HIN3
     C*
     C*          W@HIN1    IFEQ 'A0612'
     C*          W@HIN2    ANDEQ'63403'
     C*          W@HIN3    ANDEQ'K '
     C*                    Z-ADD0         SAKA    40
     C*                    END
      *
     C                     SETOF                     56
   56C           *IN56     IFEQ '0'
     C                     MOVE *BLANK    ZANM
     C                     Z-ADD*ZERO     KAZI
     C                     MOVE *BLANK    KIKI
     C                     Z-ADD*ZERO     KUBI
     C                     Z-ADD*ZERO     TUSZ
     C                     Z-ADDM1GEKN    GEKN
     C                     MOVE *BLANK    STRK
     C                     MOVE *BLANK    STRT
     C                     MOVE *BLANK    STRR
     C                     MOVE *BLANK    STRD
     C****                 Z-ADDM1SSYS    SYSS
     C                     MOVELM1MEKI    MEK
     C                     MOVE M1KASI    KASI
     C                     MOVELM1SSYT    SSYT
     C                     MOVEL'構成品'SMEI
     C*自工程部門
     C                     SETOF                     57
     C           HBM,A     CHAINFGBPL011             57
     C           *IN57     IFEQ '0'
     C                     MOVELB2SMEI    JIKO
     C                     ENDIF
     C                     MOVELHMB,A     WTKRO
     C                     MOVELHKD,A     WKACD
     C                     MOVELHMB,A     HTRJI
     C                     EXSR $SB920
     C                     EXSR $SBSYK
     C*手書きかんばん対応　０の時は部品Ｍの収容数を使用する。
     C*生産企画Ｔ　小田氏依頼対応T.SAKASHITA 2008.08.04
     C           SYSS      IFEQ 0
     C                     Z-ADDM1SSYS    SYSS
     C                     END
     C                     MOVELW@KBN     JKBN
     C*前々工程部門
     C                     SETOF                     60
     C           A         IFGE 3
     C                     SETON                     60
     C           A         SUB  2         BB      30
     C           BB        IFGT 0
     C                     MOVELHKT,BB    HKTBB   3
     C                     MOVELHMB,BB    WTKRO
     C                     MOVELHMB,BB    HTRBB
     C                     MOVELHKD,BB    WKACD
     C                     EXSR $SB920
     C                     MOVELW@KBN     BBKBN
     C           HBM,BB    CHAINFGBPL011             57
     C           *IN57     IFEQ '0'
     C                     MOVELB2SMEI    BBFKO
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*前工程部門
     C           A         SUB  1         BF      30
     C           BF        IFGT 0
     C                     MOVELHKT,BF    HKTBF   3
     C                     MOVELHMB,BF    WTKRO
     C                     MOVELHMB,BF    HTRBF
     C                     MOVELHKD,BF    WKACD
     C                     EXSR $SB920
     C                     MOVELW@KBN     BKBN
     C           HBM,BF    CHAINFGBPL011             57
     C           *IN57     IFEQ '0'
     C                     MOVELB2SMEI    BFKO
     C                     ENDIF
     C                     ENDIF
     C*後工程部門
     C           A         ADD  1         NX      30
     C           NX        IFLE 99
     C                     MOVELHKT,NX    HKTNX   3
     C                     MOVELHMB,NX    WTKRO
     C                     MOVELHMB,NX    HTRNX
     C                     MOVELHKD,NX    WKACD
     C                     EXSR $SB920
     C                     MOVELW@KBN     NKBN
     C           HBM,NX    CHAINFGBPL011             57
     C           *IN57     IFEQ '0'
     C                     MOVELB2SMEI    NXKO
     C                     ENDIF
     C                     ENDIF
     C*
     C*後々工程部門
     C           A         ADD  2         NN      30
     C           NN        IFLE 99
     C                     MOVELHKT,NN    HKTNN   3
     C                     MOVELHMB,NN    WTKRO
     C                     MOVELHMB,NN    HTRNN
     C                     MOVELHKD,NN    WKACD
     C                     EXSR $SB920
     C                     MOVELW@KBN     NNKBN
     C           HBM,NN    CHAINFGBPL011             57
     C           *IN57     IFEQ '0'
     C                     MOVELB2SMEI    NNXKO
     C                     ENDIF
     C                     ENDIF
     C*
   56C                     ENDIF
     C*
     C                     SETOF                     88
     C                     MOVE *BLANK    WKACD   1
     C           A         DO   99        ZZ      30
     C           HKD,ZZ    IFNE *BLANK
     C                     MOVE HKD,ZZ    WKACD
     C                     MOVE HMB,ZZ    WTKRO
     C                     SETON                     88
     C                     ENDIF
     C  N88                ENDDO
     C*
     C                     SETOF                     30
     C           W@HIN3    IFNE *BLANK
     C                     SETON                     30
     C                     END
      **メッキ種類
TCHK2C*                    MOVELMEK1      W@MEK
TCHK2C*                    Z-ADD1         @M      20
TCHK2C*          W@MEK2    LOKUP@2,@M                    75
TCHK2C*          *IN75     IFEQ '1'
TCHK2C*                    MOVEL#2,@M     E@ME
TCHK2C*                    END
TCHK2C*          W@MEK2    IFEQ 'D'
TCHK2C*          W@MEK4    ANDEQ'B'
TCHK2C*                    MOVEL#TXT,1    E@ME
TCHK2C*                    END
TCHK2 **カラー
TCHK2C*                    Z-ADD1         @M
TCHK2C*          W@MEK4    LOKUP@4,@M                    75
TCHK2C*          *IN75     IFEQ '1'
TCHK2C*                    MOVE #4,@M     E@CL
TCHK2C*                    END
TCHK2C*
TCHK2C**         K#FCEA    KLIST
TCHK2C**                   KFLD           M1KHN1
TCHK2C**                   KFLD           M1KHN2
TCHK2C**                   KFLD           M1KHN3
TCHK2C**         K#FCEA    CHAINFCEPL01              01
TCHK2C**         *IN01     IFEQ *OFF
TCHK2C**         A2GSKD    ANDEQ*BLANK
TCHK2C**                   MOVELA2MMEI    E@ME
TCHK2C**                   END
      **脱水素
     C                     Z-ADD1         @M
TCHK2C*          W@MEK3    LOKUP@3,@M                    75
TCHK2C*          *IN75     IFEQ '1'
TCHK2C*                    MOVE #3,@M     E@H
TCHK2C*                    END
      *******************
      *部品マスター分 *
      *******************
      **Ｎ－１の実績
     C*                    EXSR $SB910
     C*                    EXSR $SB912
     C*                    ADD  W@JCHU    W@ZSNA
     C*          W@ZSNA    IFEQ 0
     C*                    EXSR $SB914
     C*                    ADD  W@SRO     W@ZSNA
     C*                    END
      *
      *******************
      *構成品分       *
      *******************
      *
     C*                    MOVEL'K'       #KKSEH
     C*                    MOVEL'G'       #KKTEH
     C           KEYAF1    SETLLAEBPL071
     C                     DO   *HIVAL
     C           KEYAF1    READEAEBPL071                 82
     C         82          LEAVE
      **削除
     C           AFSKJY    IFEQ 'D'
     C                     ITER
     C                     END
      **
     C                     MOVELAFSHN1    W2HIN1
     C                     MOVELAFSHN2    W2HIN2
     C                     MOVELAFSHN3    W2HIN3
      **Ｎ－１の実績
     C                     EXSR $SB911
     C                     EXSR $SB913
     C                     ADD  WKJCHU    WKZSNA
      *MSK 2008.11.13
     C           WKZSNA    IFEQ 0
     C                     EXSR $SB915
     C                     ADD  W@SRO     WKZSNA
     C                     END
      **内示数
      *
     C                     Z-ADD0         @SNNM   90
     C                     Z-ADD0         @S1NM   90
     C                     Z-ADD0         @S2NM   90
      *
     C                     SETOF                     01
     C           KEY4      CHAINABBPL211             01
     C           *IN01     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
TCHK1C*                    Z-ADDU1NS,1    @SNNM
     C                     Z-ADDU1NS,2    @S1NM
     C                     Z-ADDU1NS,3    @S2NM
     C                     ELSE
TCHK1C*                    Z-ADDU1SS,1    @SNNM
     C                     Z-ADDU1SS,2    @S1NM
     C                     Z-ADDU1SS,3    @S2NM
     C                     END
     C                     END
      *
TCHK1C           K#FCE     KLIST
TCHK1C                     KFLD           W2HIN1
TCHK1C                     KFLD           W2HIN2
TCHK1C                     KFLD           W2HIN3
TCHK1C           K#FCE     CHAINFCEPL01              01
TCHK1C           *IN01     IFEQ *OFF
TCHK1C           A2GSKD    ANDEQ*BLANK
TCHK1C                     Z-ADDA2GEKN    @SNNM
TCHK1C                     END
     C*
     C           AFSKSU    MULT @SNNM     WKSNNM 100
     C           AFSKSU    MULT @S1NM     WKS1NM 100
     C           AFSKSU    MULT @S2NM     WKS2NM 100
      *
     C                     ADD  WKZSNA    W@ZSNA
     C                     ADD  WKSNNM    W@SNNM
     C                     ADD  WKS1NM    W@S1NM
     C                     ADD  WKS2NM    W@S2NM
     C                     END
      ***
      **日当り箱数
     C           SYSS      IFNE 0
     C           W@ZSNA    DIV  W@KDOA    W@DDHA
     C                     DIV  SYSS      W@DDHA
     C           W@SNNM    DIV  W@KDO0    W@DDH0
     C                     DIV  SYSS      W@DDH0
     C                     MULT PHOSEI    W@DDH0
     C                     DIV  100       W@DDH0 113H
     C           W@S1NM    DIV  W@KDO1    W@DDH1
     C                     DIV  SYSS      W@DDH1
     C                     MULT PHOSEI    W@DDH1
     C                     DIV  100       W@DDH1 113H
     C           W@S2NM    DIV  W@KDO2    W@DDH2
     C                     DIV  SYSS      W@DDH2
     C                     MULT PHOSEI    W@DDH2
     C                     DIV  100       W@DDH2 113H
     C                     END
      **完成重量が０の場合
     C           KASI      IFEQ 0
     C           SYSS      ANDNE0
     C           10000     DIV  SYSS      KASI      H
     C                     END
      **日当りｋｇ
      ***完成重量　／　１０００
      ***完成重量が無い場合は１０とする
     C           KASI      IFEQ 0
     C                     Z-ADD10        W@KASI
     C                     ELSE
     C                     Z-ADDKASI      W@KASI
     C                     END
     C                     DIV  1000      W@KASI
      ***Ｘ　収容数
     C                     MULT SYSS      W@KASI
      ***Ｘ　日当り箱数
     C*          W@KASI    MULT W@DDHA    W@DDKA
     C*          W@KASI    MULT W@DDH0    W@DDK0
     C*          W@KASI    MULT W@DDH1    W@DDK1
     C*          W@KASI    MULT W@DDH2    W@DDK2
      *単重×実績／１０００／稼働日
     C           KASI      MULT W@ZSNA    WWDDKA 153
     C           WWDDKA    DIV  1000      WWDDKA 153
     C           WWDDKA    DIV  W@KDOA    W@DDKA 153
      *
     C           KASI      MULT W@SNNM    WWDDK0 153
     C           WWDDK0    DIV  1000      WWDDK0 153
     C           WWDDK0    DIV  W@KDO0    W@DDK0 153
     C                     MULT PHOSEI    W@DDK0 153
     C                     DIV  100       W@DDK0 153H
      *
     C           KASI      MULT W@S1NM    WWDDK1 153
     C           WWDDK1    DIV  1000      WWDDK1 153
     C           WWDDK1    DIV  W@KDO1    W@DDK1 153
     C                     MULT PHOSEI    W@DDK1 153
     C                     DIV  100       W@DDK1 153H
      *
     C           KASI      MULT W@S2NM    WWDDK2 153
     C           WWDDK2    DIV  1000      WWDDK2 153
     C           WWDDK2    DIV  W@KDO2    W@DDK2 153
     C                     MULT PHOSEI    W@DDK2 153
     C                     DIV  100       W@DDK2 153H
      *-----------------------------------------------------------------*
      *日当りバレル計算                                               *
      *月間必要数×補正値÷稼働日÷Ｃ箱比率÷収容数÷バレルＢ÷１００ *
      *-----------------------------------------------------------------*
     C                     Z-ADD0         KAI12
     C                     Z-ADD0         KAI13
     C                     Z-ADD0         KAI14
     C                     Z-ADD0         KAI21
     C                     Z-ADD0         KAI22
     C                     Z-ADD0         KAI23
     C                     Z-ADD0         KAI24
     C                     Z-ADD0         KAI25
     C                     Z-ADD0         KAI31
     C                     Z-ADD0         KAI32
     C                     Z-ADD0         KAI33
     C                     Z-ADD0         KAI34
     C                     Z-ADD0         KAI35
     C                     Z-ADD0         KAI41
     C                     Z-ADD0         KAI42
     C                     Z-ADD0         KAI43
     C                     Z-ADD0         KAI44
     C                     Z-ADD0         KAI45
      *Ｎ－１月分（実績分には補正値は掛けない）
     C           W@ZSNA    IFNE 0
     C           W@KDOA    ANDNE0
     C           CBKO      ANDNE0
     C           SYSS      ANDNE0
     C           BARB      ANDNE0
     C           W@ZSNA    DIV  W@KDOA    KAI12
     C           KAI12     DIV  CBKO      KAI13
     C           KAI13     DIV  SYSS      KAI14
     C           KAI14     DIV  BARB      W@BARA 152H
     C                     END
      *Ｎ月分
     C           W@SNNM    IFNE 0
     C           PHOSEI    ANDNE0
     C           W@KDO0    ANDNE0
     C           CBKO      ANDNE0
     C           SYSS      ANDNE0
     C           BARB      ANDNE0
     C           W@SNNM    MULT PHOSEI    KAI21
     C           KAI21     DIV  W@KDO0    KAI22
     C           KAI22     DIV  CBKO      KAI23
     C           KAI23     DIV  SYSS      KAI24
     C           KAI24     DIV  BARB      KAI25
     C           KAI25     DIV  100       W@BAR0 152H
     C                     END
      *Ｎ＋１月分
     C           W@S1NM    IFNE 0
     C           PHOSEI    ANDNE0
     C           W@KDO1    ANDNE0
     C           CBKO      ANDNE0
     C           SYSS      ANDNE0
     C           BARB      ANDNE0
     C           W@S1NM    MULT PHOSEI    KAI31
     C           KAI31     DIV  W@KDO1    KAI32
     C           KAI32     DIV  CBKO      KAI33
     C           KAI33     DIV  SYSS      KAI34
     C           KAI34     DIV  BARB      KAI35
     C           KAI35     DIV  100       W@BAR1 152H
     C                     END
      *Ｎ＋２月分
     C           W@S2NM    IFNE 0
     C           PHOSEI    ANDNE0
     C           W@KDO2    ANDNE0
     C           CBKO      ANDNE0
     C           SYSS      ANDNE0
     C           BARB      ANDNE0
     C           W@S2NM    MULT PHOSEI    KAI41
     C           KAI41     DIV  W@KDO2    KAI42
     C           KAI42     DIV  CBKO      KAI43
     C           KAI43     DIV  SYSS      KAI44
     C           KAI44     DIV  BARB      KAI45
     C           KAI45     DIV  100       W@BAR2 152H
     C                     END
      ***
      **発行種類
     C                     MOVEL'2'       E@SYU   1
      **
     C                     EXCPTDAT
      *
     C                     END
      *
     C                     ENDSR
      *
      *
      *@@@@@@@@@@@@*
      * 稼動日数 *
      *@@@@@@@@@@@@*
     C           $SB900    BEGSR
      **
     C           KEYF81    SETLLAGDPL121
     C                     DO   *HIVAL
     C           KEYF81    READEAGDPL121                 81
     C         81          LEAVE
     C           F8HIRU    IFEQ *BLANK
     C                     ADD  0.5       W@KDO
     C                     ENDIF
     C           F8YORU    IFEQ *BLANK
     C                     ADD  0.5       W@KDO
     C                     ENDIF
     C                     ENDDO
      **
     C           $S900E    ENDSR
      *
      *
     C*@@@@@@@@*
     C* 実績 *
     C*@@@@@@@@*
     C           $SB910    BEGSR
      **
     C                     CALL 'MYBR03'
     C                     PARM           P@T     6
     C                     PARM           P@A     6
     C                     PARM           P@B     6
     C                     PARM           P@C     6
     C                     PARM           P@D     6
     C                     PARM           P@E     6
     C                     MOVE P@T       Q@T     60
     C                     MOVE P@A       Q@A     60
     C                     MOVE P@B       Q@B     60
     C                     MOVE P@C       Q@C     60
     C                     MOVE P@D       Q@D     60
     C                     MOVE P@E       Q@E     60
      **
     C           HINKEY    SETLLMBDPL011
     C                     DO   *HIVAL
     C           HINKEY    READEMBDPL011                 21
     C         21          LEAVE
      ***海外は読み飛ばし
     C*          F3NONY    IFEQ 0111
     C*          F3NONY    OREQ 0094
     C*          F3NONY    OREQ 0200
     C*          F3NONY    OREQ 0170
     C*          F3NONY    OREQ 0755
     C*          F3NONY    OREQ 0831
     C*                    ITER
     C*                    END
      ***
     C           W@UYMA    IFEQ Q@T
     C                     ADD  F3TNSU    W@ZSNA
     C                     END
     C           W@UYMA    IFEQ Q@A
     C                     ADD  F3ANSU    W@ZSNA
     C                     END
     C           W@UYMA    IFEQ Q@B
     C                     ADD  F3BNSU    W@ZSNA
     C                     END
     C           W@UYMA    IFEQ Q@C
     C                     ADD  F3CNSU    W@ZSNA
     C                     END
     C           W@UYMA    IFEQ Q@D
     C                     ADD  F3DNSU    W@ZSNA
     C                     END
     C           W@UYMA    IFEQ Q@E
     C                     ADD  F3ENSU    W@ZSNA
     C                     END
      *
     C                     ENDDO
      **
     C           $S910E    ENDSR
      *
      *@@@@@@@@@@@@@@@@@@*
      * 実績（構成品） *
      *@@@@@@@@@@@@@@@@@@*
     C           $SB911    BEGSR
     C                     Z-ADD*ZERO     WKZSNA 100
      **
     C                     CALL 'MYBR03'
     C                     PARM           P@T
     C                     PARM           P@A
     C                     PARM           P@B
     C                     PARM           P@C
     C                     PARM           P@D
     C                     PARM           P@E
     C                     MOVE P@T       Q@T
     C                     MOVE P@A       Q@A
     C                     MOVE P@B       Q@B
     C                     MOVE P@C       Q@C
     C                     MOVE P@D       Q@D
     C                     MOVE P@E       Q@E
      **
     C           HN2KEY    SETLLMBDPL011
     C                     DO   *HIVAL
     C           HN2KEY    READEMBDPL011                 21
     C         21          LEAVE
      ***海外は読み飛ばし
     C*          F3NONY    IFEQ 0111
     C*          F3NONY    OREQ 0094
     C*          F3NONY    OREQ 0200
     C*          F3NONY    OREQ 0170
     C*          F3NONY    OREQ 0755
     C*          F3NONY    OREQ 0831
     C*                    ITER
     C*                    END
      ***
     C           W@UYMA    IFEQ Q@T
     C                     ADD  F3TNSU    WKZSNA
     C                     END
     C           W@UYMA    IFEQ Q@A
     C                     ADD  F3ANSU    WKZSNA
     C                     END
     C           W@UYMA    IFEQ Q@B
     C                     ADD  F3BNSU    WKZSNA
     C                     END
     C           W@UYMA    IFEQ Q@C
     C                     ADD  F3CNSU    WKZSNA
     C                     END
     C           W@UYMA    IFEQ Q@D
     C                     ADD  F3DNSU    WKZSNA
     C                     END
     C           W@UYMA    IFEQ Q@E
     C                     ADD  F3ENSU    WKZSNA
     C                     END
      *
     C                     ENDDO
      **
     C                     MULT AFSKSU    WKZSNA
      **
     C           $S911E    ENDSR
      *
      *
     C*@@@@@@@@@@@@@@@@@@*
     C* 実績（海外分） *
     C*@@@@@@@@@@@@@@@@@@*
     C           $SB912    BEGSR
     C                     Z-ADD*ZERO     W@JCHU 100
      **
     C*          HINKEY    SETLLGSTPL1S1
     C*                    DO   *HIVAL
     C*          HINKEY    READEGSTPL1S1                 21
     C*        21          LEAVE
      ***削除
     C*          G2SKJY    IFEQ 'D'
     C*          G2SKHZ    ANDLE*DATE
     C*                    ITER
     C*                    END
      ***該当年月
     C*          G2JSK6    IFNE W@UYMA
     C*                    ITER
     C*                    END
      ***海外分以外は読み飛ばし
     C*          G2NONY    IFNE 0111
     C*          G2NONY    ANDNE0094
     C*          G2NONY    ANDNE0200
     C*          G2NONY    ANDNE0170
     C*          G2NONY    ANDNE0755
     C*          G2NONY    ANDNE0831
     C*                    ITER
     C*                    END
      ***
     C*                    ADD  G2JCHU    W@JCHU
     C*                    ENDDO
      **
     C           $S912E    ENDSR
      *
      *
     C*@@@@@@@@@@@@@@@@@*
     C* 実績（海外分）*
     C*@@@@@@@@@@@@@@@@@*
     C           $SB913    BEGSR
     C                     Z-ADD*ZERO     WKJCHU 100
      **
     C*          HN2KEY    SETLLGSTPL1S1
     C*                    DO   *HIVAL
     C*          HN2KEY    READEGSTPL1S1                 21
     C*        21          LEAVE
      ***削除
     C*          G2SKJY    IFEQ 'D'
     C*          G2SKHZ    ANDLE*DATE
     C*                    ITER
     C*                    END
      ***該当年月
     C*          G2JSK6    IFNE W@UYMA
     C*                    ITER
     C*                    END
      ***海外分以外は読み飛ばし
     C*          G2NONY    IFNE 0111
     C*          G2NONY    ANDNE0094
     C*          G2NONY    ANDNE0200
     C*          G2NONY    ANDNE0170
     C*          G2NONY    ANDNE0755
     C*          G2NONY    ANDNE0831
     C*                    ITER
     C*                    END
      ***
     C*                    ADD  G2JCHU    WKJCHU
     C*                    ENDDO
      **
     C*                    MULT AFSKSU    WKJCHU
      **
     C           $S913E    ENDSR
      *
      *
     C*@@@@@@@@@@@@@@@@@@@@@*
     C*  構成部品使用実績 *
     C*@@@@@@@@@@@@@@@@@@@@@*
     C           $SB914    BEGSR
     C                     Z-ADD*ZERO     W@SRO   90
      **
     C           KEYMC1    SETLLMCENP131
     C                     DO   *HIVAL
     C           KEYMC1    READEMCENP131                 21
     C         21          LEAVE
     C                     ADD  MCSRYO    W@SRO
     C                     ENDDO
      **
     C           $S914E    ENDSR
      *
      *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
      * 構成部品使用実績（構成品） *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
     C           $SB915    BEGSR
     C                     Z-ADD*ZERO     W@SRO   90
      **
     C           KEYMC2    SETLLMCENP131
     C                     DO   *HIVAL
     C           KEYMC2    READEMCENP131                 21
     C         21          LEAVE
     C                     ADD  MCSRYO    W@SRO
     C                     ENDDO
      **
     C           $S915E    ENDSR
      *
      *
      *MSK 2009.01.08
      *@@@@@@@@@@@@@@@@@@@@@@@@@*
      *  構成品のラインセット *
      *    （機番の代わり）   *
      *@@@@@@@@@@@@@@@@@@@@@@@@@*
     C           $SB920    BEGSR
     C                     MOVEL*BLANK    W@KBN   3
      *
      *構成品工程別月間必要数ファイル
     C                     MOVELM1KHN1    #GKHN1
     C                     MOVELM1KHN2    #GKHN2
     C                     MOVELM1KHN3    #GKHN3
     C           KEYAG1    SETLLAEBPL12
     C                     DO   *HIVAL
     C           KEYAG1    READEAEBPL12                  94
     C         94          LEAVE
      **構成品番工程　所番地登録マスター
     C                     MOVELAGKHN1    #MKHN1
     C                     MOVELAGKHN2    #MKHN2
     C                     MOVELAGKHN3    #MKHN3
     C                     MOVELAGKBMN    #MKBMJ
     C                     MOVELAGUKER    #MUKRJ
     C                     MOVELWKACD     #MKDAI
     C           KEYM51    SETLLAKHPL05
     C                     DO   *HIVAL
     C           KEYM51    READEAKHPL05                  95
     C         95          LEAVE
      **削除
     C           M5SKJY    IFEQ 'D'
     C           M5SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
      **所番地セット
     C                     MOVELM5NTK1    WTR21
     C                     MOVELM5NTK2    WTR22
     C                     MOVELM5NTK3    WTR23
     C                     MOVELM5NTK4    WTR24
      *
      *--------------------------------*
      *構成品メッキかんばんマスター  *
      *--------------------------------*
    AC           WKACD     IFEQ 'P'
      *
     C           TR2KEY    SETLLAKGPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TR2KEY    READEAKGPL031                 21
   21C           *IN21     IFEQ '0'
    DC           E1SKJY    IFEQ 'D'
     C           E1SKHZ    ANDLE*DATE
    DC                     ELSE
      *
    9C           E1STHZ    IFEQ *ALL'9'
     C                     MOVELE1RAIN    W@KBN
     C                     GOTO $S920E
    9C                     ELSE
      *
    *C           *DATE     IFGE E1UKHZ
     C           *DATE     ANDLTE1STHZ
     C                     SETON                     21
     C                     MOVELE1RAIN    W@KBN
     C                     GOTO $S920E
    *C                     END
    9C                     END
      *
    DC                     END
   21C                     END
     C  N21                ENDDO
    AC                     END
      *
      *--------------------------------*
      *構成品トンネルかんばんマスター*
      *--------------------------------*
    AC           WKACD     IFEQ 'Q'
      *
     C           TR2KEY    SETLLAKIPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TR2KEY    READEAKIPL031                 21
   21C           *IN21     IFEQ '0'
    DC           E2SKJY    IFEQ 'D'
     C           E2SKHZ    ANDLE*DATE
    DC                     ELSE
      *
    9C           E2STHZ    IFEQ *ALL'9'
     C                     MOVELE2RAIN    W@KBN
     C                     GOTO $S920E
    9C                     ELSE
      *
    *C           *DATE     IFGE E2UKHZ
     C           *DATE     ANDLTE2STHZ
     C                     SETON                     21
     C                     MOVELE2RAIN    W@KBN
     C                     GOTO $S920E
    *C                     END
    9C                     END
      *
    DC                     END
   21C                     END
     C  N21                ENDDO
    AC                     END
     C*--------------------------------*
   95C                     ENDDO
   94C                     ENDDO
      *
     C           $S920E    ENDSR
      *
      *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
      * かんばんマスターから収容数の取得 *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
     C           $SBSYU    BEGSR
      *
      *--------------------------------*
      *  ..工程内かんばんマスター..  *
      *--------------------------------*
    AC           WKACD     IFEQ 'A'
      *
     C           TKRKEY    SETLLABHPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEABHPL031                 21
   21C           *IN21     IFEQ '0'
    DC           M6SKJY    IFEQ 'D'
     C           M6SKHZ    ANDLE*DATE
    DC                     ELSE
      *
    9C           M6STHZ    IFEQ *ALL'9'
     C                     Z-ADDM6SYUY    SYSS
     C                     Z-ADDM6LOTK    LOTO
    9C                     ELSE
      *
    *C           *DATE     IFGE M6UKHZ
     C           *DATE     ANDLTM6STHZ
     C                     SETON                     21
     C                     Z-ADDM6SYUY    SYSS
     C                     Z-ADDM6LOTK    LOTO
    *C                     END
    9C                     END
      *
    DC                     END
   21C                     END
     C  N21                ENDDO
    AC                     END
      *
      *------------------------------*
      *  ..焼入かんばんマスター..  *
      *------------------------------*
     C           WKACD     IFEQ 'B'
      *
     C           TKRKEY    SETLLADHPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEADHPL031                 21
     C           *IN21     IFEQ '0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           J6STHZ    IFEQ *ALL'9'
     C                     Z-ADDJ6SYOS    SYSS
     C                     Z-ADDJ6LOTO    LOTO
     C                     ELSE
      *
     C           *DATE     IFGE J6UKHZ
     C           *DATE     ANDLTJ6STHZ
     C                     SETON                     21
     C                     Z-ADDJ6SYOS    SYSS
     C                     Z-ADDJ6LOTO    LOTO
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
      *
      *------------------------------*
      *  ..メッキんばんマスター..  *
      *------------------------------*
     C           WKACD     IFEQ 'C'
      *
     C           TKRKEY    SETLLAAFPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEAAFPL031                 21
     C           *IN21     IFEQ '0'
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           A3STHZ    IFEQ *ALL'9'
     C                     Z-ADDA3SSYS    SYSS
     C                     Z-ADDA3CBKO    CBKO
     C           CBKO      IFEQ 0
     C                     ADD  1         CBKO
     C                     END
     C                     Z-ADDA3BARA    BARA
     C                     Z-ADDA3BARB    BARB
     C           BARB      IFEQ 0
     C                     Z-ADDA3BARA    BARB
     C                     END
     C                     ELSE
      *
     C           *DATE     IFGE A3UKHZ
     C           *DATE     ANDLTA3STHZ
     C                     SETON                     21
     C                     Z-ADDA3SSYS    SYSS
     C                     Z-ADDA3CBKO    CBKO
     C           CBKO      IFEQ 0
     C                     ADD  1         CBKO
     C                     END
     C                     Z-ADDA3BARA    BARA
     C                     Z-ADDA3BARB    BARB
     C           BARB      IFEQ 0
     C                     Z-ADDA3BARA    BARB
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
      *
      *------------------------------*
      * トンネルかんばんマスター   *
      *------------------------------*
     C           WKACD     IFEQ 'D'
      *
     C           TKRKEY    SETLLAAGPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEAAGPL031                 21
     C           *IN21     IFEQ '0'
     C           O4SKJY    IFEQ 'D'
     C           O4SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           O4STHZ    IFEQ *ALL'9'
     C                     Z-ADDO4SYOS    SYSS
     C                     Z-ADDO4CBKO    CBKO
     C           CBKO      IFEQ 0
     C                     ADD  1         CBKO
     C                     END
     C                     Z-ADDO4BARA    BARA
     C                     Z-ADDO4BARB    BARB
     C           BARB      IFEQ 0
     C                     Z-ADDO4BARA    BARB
     C                     END
     C                     ELSE
      *
     C           *DATE     IFGE O4UKHZ
     C           *DATE     ANDLTO4STHZ
     C                     SETON                     21
     C                     Z-ADDO4SYOS    SYSS
     C                     Z-ADDO4CBKO    CBKO
     C           CBKO      IFEQ 0
     C                     ADD  1         CBKO
     C                     END
     C                     Z-ADDO4BARA    BARA
     C                     Z-ADDO4BARB    BARB
     C           BARB      IFEQ 0
     C                     Z-ADDO4BARA    BARB
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
      *
      *------------------------------*
      * 引き取りかんばんマスター   *
      *------------------------------*
     C           WKACD     IFEQ 'E'
      *
     C           TKRKEY    SETLLAAHPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEAAHPL031                 21
     C           *IN21     IFEQ '0'
     C           L6SKJY    IFEQ 'D'
     C           L6SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           L6STHZ    IFEQ *ALL'9'
     C                     Z-ADDL6SYOS    SYSS
     C                     ELSE
      *
     C           *DATE     IFGE L6UKHZ
     C           *DATE     ANDLTL6STHZ
     C                     SETON                     21
     C                     Z-ADDL6SYOS    SYSS
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
      *
      *--------------------------------*
      *  ..指示かんばん　マスター..  *
      *--------------------------------*
     C           WKACD     IFEQ 'F'
      *
     C           TKRKEY    SETLLCADPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READECADPL031                 21
     C           *IN21     IFEQ '0'
     C           C2SKJY    IFEQ 'D'
     C           C2SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           C2STHZ    IFEQ *ALL'9'
     C                     Z-ADDC2SYOS    SYSS
     C                     Z-ADDC2BARA    BARA
     C                     Z-ADDC2BARB    BARB
     C           BARB      IFEQ 0
     C                     Z-ADDC2BARA    BARB
     C                     END
     C                     ELSE
      *
     C           *DATE     IFGE C2UKHZ
     C           *DATE     ANDLTC2STHZ
     C                     SETON                     21
     C                     Z-ADDC2SYOS    SYSS
     C                     Z-ADDC2BARA    BARA
     C                     Z-ADDC2BARB    BARB
     C           BARB      IFEQ 0
     C                     Z-ADDC2BARA    BARB
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
      *
      *------------------------------*
      * 完成品かんばんマスター     *
      *------------------------------*
     C           WKACD     IFEQ '0'
      *
     C           TKRKEY    SETLLAAPPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEAAPPL031                 21
     C           *IN21     IFEQ '0'
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           L5STHZ    IFEQ *ALL'9'
     C                     Z-ADDL5SYOS    SYSS
     C                     ELSE
      *
     C           *DATE     IFGE L5UKHZ
     C           *DATE     ANDLTL5STHZ
     C                     SETON                     21
     C                     Z-ADDL5SYOS    SYSS
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
      *
      *------------------------------*
      * 小工程かんばんマスター     *
      *------------------------------*
     C           WKACD     IFEQ '1'
      *
     C           TKRKEY    SETLLAAOPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEAAOPL031                 21
     C           *IN21     IFEQ '0'
     C           T1SKJY    IFEQ 'D'
     C           T1SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           T1STHZ    IFEQ *ALL'9'
     C                     Z-ADDT1SYOS    SYSS
     C                     ELSE
      *
     C           *DATE     IFGE T1UKHZ
     C           *DATE     ANDLTT1STHZ
     C                     SETON                     21
     C                     Z-ADDT1SYOS    SYSS
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
      *
      *------------------------------*
      * 小工程熱処理かんばん       *
      *------------------------------*
     C           WKACD     IFEQ '2'
      *
     C           TKRKEY    SETLLAAYPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEAAYPL031                 21
     C           *IN21     IFEQ '0'
     C           L8SKJY    IFEQ 'D'
     C           L8SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           L8STHZ    IFEQ *ALL'9'
     C                     Z-ADDL8SYOS    SYSS
     C                     Z-ADDL8HKSU    LOTO
     C                     Z-ADDL8ONDO    ONDO
     C                     ELSE
      *
     C           *DATE     IFGE L8UKHZ
     C           *DATE     ANDLTL8STHZ
     C                     SETON                     21
     C                     Z-ADDL8SYOS    SYSS
     C                     Z-ADDL8HKSU    LOTO
     C                     Z-ADDL8ONDO    ONDO
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
      *
      *------------------------------*
      * 購買トンネルかんばん       *
      *------------------------------*
     C           WKACD     IFEQ '4'
      *
     C           TKRKEY    SETLLAEAPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEAEAPL031                 21
     C           *IN21     IFEQ '0'
     C           AESKJY    IFEQ 'D'
     C           AESKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           AESTHZ    IFEQ *ALL'9'
     C                     Z-ADDAESYOS    SYSS
     C                     ELSE
      *
     C           *DATE     IFGE AEUKHZ
     C           *DATE     ANDLTAESTHZ
     C                     SETON                     21
     C                     Z-ADDAESYOS    SYSS
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
      *
      *------------------------------*
      * 半製品かんばんマスター     *
      *------------------------------*
     C           WKACD     IFEQ '6'
      *
     C           TKRKEY    SETLLAANPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEAANPL031                 21
     C           *IN21     IFEQ '0'
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           L7STHZ    IFEQ *ALL'9'
     C                     Z-ADDL7SYOS    SYSS
     C                     ELSE
      *
     C           *DATE     IFGE L7UKHZ
     C           *DATE     ANDLTL7STHZ
     C                     SETON                     21
     C                     Z-ADDL7SYOS    SYSS
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
      *
      *------------------------------*
      * 半製品かんばんマスター     *
      *------------------------------*
     C           WKACD     IFEQ '7'
      *
     C           TKRKEY    SETLLAAXPL101
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEAAXPL101                 21
     C           *IN21     IFEQ '0'
     C           L9SKJY    IFEQ 'D'
     C           L9SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           L9STHZ    IFEQ *ALL'9'
     C                     Z-ADDL9SYOS    SYSS
     C                     Z-ADDL9CBKO    CBKO
     C                     Z-ADDL9ONDO    ONDO
     C           CBKO      IFEQ 0
     C                     ADD  1         CBKO
     C                     END
     C                     Z-ADDL9BARA    BARA
     C                     Z-ADDL9BARB    BARB
     C           BARB      IFEQ 0
     C                     Z-ADDL9BARA    BARB
     C                     END
     C                     ELSE
      *
     C           *DATE     IFGE L9UKHZ
     C           *DATE     ANDLTL9STHZ
     C                     SETON                     21
     C                     Z-ADDL9SYOS    SYSS
     C                     Z-ADDL9CBKO    CBKO
     C                     Z-ADDL9ONDO    ONDO
     C           CBKO      IFEQ 0
     C                     ADD  1         CBKO
     C                     END
     C                     Z-ADDL9BARA    BARA
     C                     Z-ADDL9BARB    BARB
     C           BARB      IFEQ 0
     C                     Z-ADDL9BARA    BARB
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N21                ENDDO
     C                     END
      *
     C*---
     C           $SSYUE    ENDSR
      *
      *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
      * かんばんマスターから収容数の取得（構成品） *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
     C           $SBSYK    BEGSR
      *
      *--------------------------------*
      *構成品かんばんマスター        *
      *--------------------------------*
    AC           WKACD     IFEQ '3'
      *
     C           TKRKEY    SETLLAKBPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEAKBPL031                 21
   21C           *IN21     IFEQ '0'
    DC           L1SKJY    IFEQ 'D'
     C           L1SKHZ    ANDLE*DATE
    DC                     ELSE
      *
    9C           L1STHZ    IFEQ *ALL'9'
     C                     Z-ADDL1SYOS    SYSS
    9C                     ELSE
      *
    *C           *DATE     IFGE L1UKHZ
     C           *DATE     ANDLTL1STHZ
     C                     SETON                     21
     C                     Z-ADDL1SYOS    SYSS
    *C                     END
    9C                     END
      *
    DC                     END
   21C                     END
     C  N21                ENDDO
    AC                     END
      *
      *--------------------------------*
      *構成品メッキかんばんマスター  *
      *--------------------------------*
    AC           WKACD     IFEQ 'P'
      *
     C           TKRKEY    SETLLAKGPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEAKGPL031                 21
   21C           *IN21     IFEQ '0'
    DC           E1SKJY    IFEQ 'D'
     C           E1SKHZ    ANDLE*DATE
    DC                     ELSE
      *
    9C           E1STHZ    IFEQ *ALL'9'
     C                     Z-ADDE1SSYS    SYSS
     C                     Z-ADDE1CBKO    CBKO
     C           W@KBN     IFEQ ' '
     C                     MOVELE1RAIN    W@KBN
     C                     END
     C           CBKO      IFEQ 0
     C                     ADD  1         CBKO
     C                     END
     C                     Z-ADDE1BARA    BARA
     C                     Z-ADDE1BARB    BARB
    9C                     ELSE
      *
    *C           *DATE     IFGE E1UKHZ
     C           *DATE     ANDLTE1STHZ
     C                     SETON                     21
     C                     Z-ADDE1SSYS    SYSS
     C                     Z-ADDE1CBKO    CBKO
     C           W@KBN     IFEQ ' '
     C                     MOVELE1RAIN    W@KBN
     C                     END
     C           CBKO      IFEQ 0
     C                     ADD  1         CBKO
     C                     END
     C                     Z-ADDE1BARA    BARA
     C                     Z-ADDE1BARB    BARB
    *C                     END
    9C                     END
      *
    DC                     END
   21C                     END
     C  N21                ENDDO
    AC                     END
      *
      *--------------------------------*
      *構成品トンネルかんばんマスター*
      *--------------------------------*
    AC           WKACD     IFEQ 'Q'
      *
     C           TKRKEY    SETLLAKIPL031
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           TKRKEY    READEAKIPL031                 21
   21C           *IN21     IFEQ '0'
    DC           E2SKJY    IFEQ 'D'
     C           E2SKHZ    ANDLE*DATE
    DC                     ELSE
      *
    9C           E2STHZ    IFEQ *ALL'9'
     C                     Z-ADDE2SYOS    SYSS
     C                     Z-ADDE2CBKO    CBKO
     C           CBKO      IFEQ 0
     C                     ADD  1         CBKO
     C                     END
     C                     Z-ADDE2BARA    BARA
     C                     Z-ADDE2BARB    BARB
    9C                     ELSE
      *
    *C           *DATE     IFGE E2UKHZ
     C           *DATE     ANDLTE2STHZ
     C                     SETON                     21
     C                     Z-ADDE2SYOS    SYSS
     C                     Z-ADDE2CBKO    CBKO
     C           CBKO      IFEQ 0
     C                     ADD  1         CBKO
     C                     END
     C                     Z-ADDE2BARA    BARA
     C                     Z-ADDE2BARB    BARB
    *C                     END
    9C                     END
      *
    DC                     END
   21C                     END
     C  N21                ENDDO
    AC                     END
      *
     C                     MOVE W@HIN1    P@HIN1
     C                     MOVE W@HIN2    P@HIN2
     C                     MOVE W@HIN3    P@HIN3
      *
     C                     CALL 'MYBR04'
     C                     PARM           WKACD
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           CBKO    20
     C                     PARM           BARA    20
     C                     PARM           BARB    31
      *
     C           $SSYKE    ENDSR
      *
      *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
      *社内かんばん切り替えuﾇjｰ         *
      *工程情報のセット（最新データ）   *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
     CSR         #SB011    BEGSR
      *
     C                     CLEARHKT
     C                     CLEARHBM
     C                     CLEARHKI
     C                     CLEARHMB
     C                     CLEARHDH
     C                     CLEARHSU
     C                     CLEARHKD
      *
     C                     SETOF                     11
     C           KEY1      CHAINAAMPL111             11
     C           *IN11     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     11
     C                     END
     C           *IN11     IFEQ '0'
      *
     C                     Z-ADD1         X       20
     C                     Z-ADD0         Y       20
     C           1         DO   15        X
     C                     MOVELSUK,X     WUKH    80
     C           WUKH      IFGT *DATE
     C           OKT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVELOKT,X     HKT,Y
     C                     Z-ADDOBM,X     HBM,Y
     C                     MOVELOKI,X     HKI,Y
     C                     MOVELOMB,X     HMB,Y
     C                     MOVELODH,X     HDH,Y
     C                     MOVELOKD,X     HKD,Y
     C                     Z-ADDSSU,X     HSU,Y
     C                     END
     C                     ELSE
      *
     C           SKT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVELSKT,X     HKT,Y
     C                     Z-ADDSBM,X     HBM,Y
     C                     MOVELSKI,X     HKI,Y
     C                     MOVELSMB,X     HMB,Y
     C                     MOVELSDH,X     HDH,Y
     C                     MOVELSKD,X     HKD,Y
     C                     Z-ADDSSU,X     HSU,Y
     C                     END
     C                     END
     C                     END
      *
     C                     END
      *
     CSR                   ENDSR
      *
      *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
      *構成品かんばん切り替えuﾇjｰ       *
      *工程情報のセット（最新データ）   *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*
     CSR         #SB012    BEGSR
      *
     C                     CLEARHKT
     C                     CLEARHBM
     C                     CLEARHKI
     C                     CLEARHMB
     C                     CLEARHDH
     C                     CLEARHSU
     C                     CLEARHKD
      *
     C                     SETOF                     11
     C           KEY2      CHAINAKEPL011             11
     C           *IN11     IFEQ '0'
     C           M3SKJY    ANDEQ'D'
     C           M3SKHZ    ANDLE*DATE
     C                     SETON                     11
     C                     END
     C           *IN11     IFEQ '0'
      *
     C                     Z-ADD1         X
     C                     Z-ADD0         Y
     C           1         DO   15        X
     C                     MOVELNUK,X     WUKH
     C           WUKH      IFGT *DATE
     C           QKT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVELQKT,X     HKT,Y
     C                     Z-ADDQBM,X     HBM,Y
     C                     MOVELQMB,X     HMB,Y
     C                     MOVELQDH,X     HDH,Y
     C                     MOVELQKD,X     HKD,Y
     C                     Z-ADDNSU,X     HSU,Y
     C                     END
     C                     ELSE
      *
     C           NKT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVELNKT,X     HKT,Y
     C                     Z-ADDNBM,X     HBM,Y
     C                     MOVELNMB,X     HMB,Y
     C                     MOVELNDH,X     HDH,Y
     C                     MOVELNKD,X     HKD,Y
     C                     Z-ADDNSU,X     HSU,Y
     C                     END
     C                     END
     C                     END
      *
     C                     END
      *
     CSR                   ENDSR
      *
      *
      *@@@@@@@@@@@@@@@@@@@@@@*
      * サブルーチンの終了 *
      *@@@@@@@@@@@@@@@@@@@@@@*
     CSR         #SB019    BEGSR
      *
     C*                    MOVEL'9'       #ICLOS
     C*                    CALL 'EB801R'
     C*                    PARM           #IJHN1  5
     C*                    PARM           #IJHN2  5
     C*                    PARM           #IJHN3  2
     C*                    PARM           #ISEHI  1
     C*                    PARM           #ITEHI  1
     C*                    PARM           #IKSEQ  2
     C*                    PARM           #ICLOS  1
     C*                    PARM           #OMHN1  5
     C*                    PARM           #OMHN2  5
     C*                    PARM           #OMHN3  2
     C*                    PARM           #OMKTE  3
     C*                    PARM           #OMBMN  4
     C*                    PARM           #OMBN1  1
     C*                    PARM           #OMBN2  2
     C*                    PARM           #OMBN3  2
     C*                    PARM           #OMBN4  1
     C*                    PARM           #OKDAI  1
     C*                    PARM           #OKSYO  1
     C*                    PARM           #OMSNO  3
     C*                    PARM           #OSRYO 10
     C*                    PARM           #OSETI 10
     C*                    PARM           #OKKEY 12
     C*                    PARM           #OUKHZ  8
     C*                    PARM           #OUKBB  2
     C*                    PARM           #OSKHZ  8
     C*                    PARM           #OSKBB  2
     C*                    PARM           #ORTN   2
      *
     CSR         ESB019    ENDSR
      *
      *
     OMYBWP01 E                HD
      *A
     O                                      'KIND'
     O                                      ','
      *B
     O                                      'PARTS NO'
     O                                      ','
      *B1
     O                                      'COMMON PARTS NO'
     O                                      ','
      *C
     O                                      'SURFACE TREATMENT'
     O                                      ','
      *D
TCHK2O*                                     'KIND OF SURFACE TREATMEN'
TCHK2O*                                     ','
      *E
TCHK2O*                                     'カラー'
TCHK2O*                                     ','
      *F
TCHK2O*                                     'BAKING'
TCHK2O*                                     ','
      *G
     O                                      'MATERIAL'
     O                                      ','
      *H
     O                                      'MATERIAL DIAMETER'
     O                                      ','
      *I
     O                                      'COMPLETE WEIGHT'
     O                                      ','
      *J
     O                                      'STRENGTH'
     O                                      ','
      *K
     O                                      'LENGH(UNDER HEAD)'
     O                                      ','
      *L
     O                                      'SIZE'
     O                                      ','
      *M
     O                                      'NAME OF PRODUCT'
     O                                      ','
      *N
     O                                      'TEMPERATURE CONDITIONS'
     O                                      ','
      *
     O                                      'CO2'
     O                                      ','
      *O
     O                                      'PCS/CONT'
     O                                      ','
      *P
     O                                      'BOX TYPE'
     O                                      ','
      * P1
     O                                      'BOX RATIO'
     O                                      ','
      * P2
     O                                      'BARREL A'
     O                                      ','
      * P3
     O                                      'BARREL B'
     O                                      ','
      * P4
     O                                      'LOT'
     O                                      ','
      * P5
     O                                      'SURFACE TREATMENT COEFF'
     O                                      ','
      **
     O**                                    '当月設定数'
     O**                                    ','
      **
     O**                                    '重量'
     O**                                    ','
      *Q
     O                         W@NA
     O                                      'ACTUAL(N-1)'
     O                                      ','
      *R
     O                         W@N0
     O                                      'SET NUMBER(N)PCS/MONTH'
     O                                      ','
      *S
     O                         W@N1
     O                                      'FORECAST(N+1)PCS/MONTH'
     O                                      ','
      *T
     O                         W@N2
     O                                      'FORECAST(N+2)PCS/MONTH'
     O                                      ','
      *U
     O                         W@NA
     O                                      'FORECAST(N-1)PCS/MONTH'
     O                                      ','
      *V
     O                         W@N0
     O                                      'FORECAST(N)CONT/DAY'
     O                                      ','
      *W
     O                         W@N1
     O                                      'FORECAST(N+1)CONT/DAY'
     O                                      ','
      *X
     O                         W@N2
     O                                      'FORECAST(N+2)CONT/DAY'
     O                                      ','
      *Y
     O                         W@NA
     O                                      'FORECAST(N-1)KG/DAY'
     O                                      ','
      *Z
     O                         W@N0
     O                                      'FORECAST(N)KG/DAY'
     O                                      ','
      *AA
     O                         W@N1
     O                                      'FORECAST(N+1)KG/DAY'
     O                                      ','
      *AB
     O                         W@N2
     O                                      'FORECAST(N+2)KG/DAY'
     O                                      ','
     O                         W@NA
     O                                      'BARREL(N-1)'
     O                                      ','
      *Z
     O                         W@N0
     O                                      'BARREL(N)'
     O                                      ','
      *AA
     O                         W@N1
     O                                      'BARREL(N+1)'
     O                                      ','
      *AB
     O                         W@N2
     O                                      'BARREL(N+2)'
     O                                      ','
      *-----*
      *AC
     O                         W@NA
     O                                      'OPERATION DATES(N-1)'
     O                                      ','
      *AD
     O                         W@N0
     O                                      'OPERATION DATES(N)'
     O                                      ','
      *AE
     O                         W@N1
     O                                      'OPERATION DATES(N+1)'
     O                                      ','
      *AF
     O                         W@N2
     O                                      'OPERATION DATES(N+2)'
     O                                      ','
      *-----*
      *前々工程
      *AG
     O                                      'BEFORE BEFORE PLANT NAME'
     O                                      ','
      *AH
     O                                      'BEFORE BEFORE PROCESS'
     O                                      ','
      *AI
     O                                      'BEFORE BEFORE MACHINE NO'
     O                                      ','
      *AI2
     O                                      'BEFORE BEFORE LOCATION'
     O                                      ','
      *前工程
      *AJ
     O                                      'BEFORE PLANT NAME'
     O                                      ','
      *AK
     O                                      'BEFORE PROCESS CODE'
     O                                      ','
      *AL
     O                                      'BEFORE MACHINE NO'
     O                                      ','
      *AL2
     O                                      'BEFORE LOCATION'
     O                                      ','
      *自工程
      *AM
     O                                      'PLANT CODE'
     O                                      ','
      *AN
     O                                      'PROCESS CODE'
     O                                      ','
      *AO
     O                                      'MACHINE NO'
     O                                      ','
      *AO2
     O                                      'OWN PROCESS LOCATION'
     O                                      ','
      *後工程
      *AP
     O                                      'AFTER PROCESS LOCATION'
     O                                      ','
      *AQ
     O                                      'AFTER PROCESS CODE'
     O                                      ','
      *AR
     O                                      'AFTER PROCESS MACHINE NO'
     O                                      ','
      *AR2
     O                                      'AFTER PROCESS LOCATION'
     O                                      ','
      *後々工程
      *AS
     O                                      'AFTER PROCESS PLANT CODE'
     O                                      ','
      *AT
     O                                      'AFTER AFTER PROCESS CODE'
     O                                      ','
      *AU
     O                                      'AFTER AFTER PROC MCN NO'
     O                                      ','
      *AU2
     O                                      'AFTER AFTER PROCESS LOC'
     O                                      ','
      *-----*
      *AV
     O                                      'FINAL LOCATION'
     OMYBWP01 E                DAT
      *A
     O                         E@SYU
     O                                      ','
      *B
     O                         W@HIN1
     O                                      '-'
     O                         W@HIN2
     O                 30                   '-'
     O                         W@HIN3
     O                                      ','
      *B1
     O                         K@HIN1
     O                                      '-'
     O                         K@HIN2
     O                 77                   '-'
     O                         K@HIN3
     O                                      ','
      *C
     O                         MEK1
     O                         MEK2
     O                         MEK3
     O                                      ','
      *D
TCHK2O*                        E@ME
TCHK2O*                                     ','
      *E
TCHK2O*                        E@CL
TCHK2O*                                     ','
      *F
TCHK2O*                        E@H
TCHK2O*                                     ','
      *G
     O                         ZANM
     O                                      ','
      *H
     O                         KAZI         '  0.  '
     O                                      ','
      *I
     O                         KASI         '    0.  '
     O                                      ','
      *J
     O                         KIKI
     O                                      ','
      *K
     O                         KUBI
     O                                      ','
      *L
     O                         TUSZ
     O                                      ','
      *M
     O                         SMEI
     O                                      ','
      *N
     O                         ONDO
     O                                      'C'
     O                                      ','
     O                         WCO2         '0.  '
     O                                      '%'
     O                                      ','
      *O
     O                         SYSS
     O                                      ','
      *P
     O                         SSYT
     O                                      ','
      * P1
     O                         CBKO
     O                                      ','
      * P2
     O                         BARA
     O                                      ','
      * P3
     O                         BARB         ' 0. '
     O                                      ','
      * P4
     O                         LOTO
     O                                      ','
      * P5
     O                         MKSU         '0 . '
     O                                      ','
      *
     O**                       GEKN
     O**                                    ','
     O**                       @JURYO       '          0 .   '
     O**                                    ','
      *Q
     O                         W@ZSNA
     O                                      ','
      *R
     O                         W@SNNM
     O                                      ','
      *S
     O                         W@S1NM
     O                                      ','
      *T
     O                         W@S2NM
     O                                      ','
      *U
     O                         W@DDHA       '       0 .   '
     O                                      ','
      *V
     O                         W@DDH0       '      0 .   '
     O                                      ','
      *W
     O                         W@DDH1       '      0 .   '
     O                                      ','
      *X
     O                         W@DDH2       '      0 .   '
     O                                      ','
      *Y
     O                         W@DDKA       '          0 .   '
     O                                      ','
      *Z
     O                         W@DDK0       '          0 .   '
     O                                      ','
      *AA
     O                         W@DDK1       '          0 .   '
     O                                      ','
      *AB
     O                         W@DDK2       '          0 .   '
     O                                      ','
     O                         W@BARA       '            0.  '
     O                                      ','
     O                         W@BAR0       '            0.  '
     O                                      ','
     O                         W@BAR1       '            0.  '
     O                                      ','
     O                         W@BAR2       '            0.  '
     O                                      ','
      *------*
      *AC
     O                         W@KDOA       '0 . '
     O                                      ','
      *AD
     O                         W@KDO0       '0 . '
     O                                      ','
      *AE
     O                         W@KDO1       '0 . '
     O                                      ','
      *AF
     O                         W@KDO2       '0 . '
     O                                      ','
      *------*
      *前々工程　部門名称・工程・機番・所番地
      *AG
     O                         BBFKO
     O                                      ','
      *AH
     O                         HKTBB
     O                                      ','
      *AI
     O                         BBKBN
     O                                      ','
      *AI2
     O                                      '="'
     O                         HTRBB
     O                                      '"'
     O                                      ','
      *前工程　　部門名称・工程・機番・所番地
      *AJ
     O                         BFKO
     O                                      ','
      *AK
     O                         HKTBF
     O                                      ','
      *AL
     O                         BKBN
     O                                      ','
      *AL2
     O                                      '="'
     O                         HTRBF
     O                                      '"'
     O                                      ','
      *自工程　　部門名称・工程・機番・所番地
      *AM
     O                         JIKO
     O                                      ','
      *AN
     O                         HKT,A
     O                                      ','
      *AO
     O                         JKBN
     O                                      ','
      *AO2
     O                                      '="'
     O                         HTRJI
     O                                      '"'
     O                                      ','
      *次工程　　部門名称・工程・機番・所番地
      *AP
     O                         NXKO
     O                                      ','
      *AQ
     O                         HKTNX
     O                                      ','
      *AR
     O                         NKBN
     O                                      ','
      *AR2
     O                                      '="'
     O                         HTRNX
     O                                      '"'
     O                                      ','
      *次々工程　部門名称・工程・機番・所番地
      *AS
     O                         NNXKO
     O                                      ','
      *AT
     O                         HKTNN
     O                                      ','
      *AU
     O                         NNKBN
     O                                      ','
      *AU2
     O                                      '="'
     O                         HTRNN
     O                                      '"'
     O                                      ','
      *------*
      *AV
     O                         STRK
     O                                      '-'
     O                         STRT
     O                                      '-'
     O                         STRR
     O                                      '-'
     O                         STRD
      ** #TXT  1 ...+... 2
      *黒ﾆﾞexｮn
      ** @2  . 1 ...+... 2
      * A亜鉛
      * J銅
      * Y銅ﾇﾇﾞ
      * W二重pｮiﾓ
      * X羽布二重
      * Nubhﾜtﾟｰ[ﾇ
      * Dﾆﾞexｮn
      * Zﾇﾇﾞ亜鉛
      * T単層pｮiﾓ
      * B黒hﾜw
      * Chﾜw
      * F銅pｮiﾓ
      * Q銅pｮiﾓhﾜw
      * E鉄亜鉛
      * Ipｮiﾓ亜鉛
      * Mfpﾈﾞ]
      * V亜鉛- ﾃﾌﾞﾓn -鉄
      * S二硫化yﾒﾎﾞmﾞ]
      * G銅銀めっき
      * K光沢ﾇﾇﾞ
      ** @4  . 1 ...+... 2 ...+... 3
      * .白あげ
      * Chﾜxｰn
      * Uﾏphﾜ
      * B黒色
      * O緑色hﾜxｰn(eﾒｰﾎﾞnﾞｮ[ﾎﾟ)
      * S白三価
      * K黒三価
      * Pﾌﾟｮﾆsﾞbn
      * Rリン酸化皮膜処理
      * Z酸洗
      * Ltﾟﾒﾆｰﾓ
      * Kﾇm]ﾛﾇ黒染
      * F鋼鉄黒染
      * Tnﾒhﾛ]洗浄
      * Y６価hﾜwﾎﾒｰ黄色
      ** @3  . 1 ...+... 2
      * Hベーキング
      * .ストレート
      * 0０時間
      * 1１時間
      * 2２時間
      * 3３時間
      * 4４時間
      * 5５時間
      * 6６時間
      * 7７時間
      * 8８時間
      * 9９時間
