     H            Y.
      ** MYCR21 **************************
      * 熱処理設備負荷グラフデータ作成 *
      * 『新バージョン』               *
      *    I-HASADA        2017/12/20    *
      *    T.TODA          2021/06/02    *
      *      CHANGES(20199)              *
      ************************** MYCR21 **
     FMYCPW21 CF  E                    WORKSTN
     FFCEPP01 IF  E                    DISK
     FAAMPL11 IF  E           K        DISK
     FGHCPL22 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FFCETL03 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FMBDPL12 IF  E           K        DISK
     FABBPL21 IF  E           K        DISK
     FABHPL03 IF  E           K        DISK
     FADHPL03 IF  E           K        DISK
     FCADPL03 IF  E           K        DISK
     FMYCNP21 IF  E           K        DISK                      A
      *
      ***
     E                    HKT        15  3               工程
     E                    HBM        15  4 0             部門
     E                    HKI        15  3               機番
     E                    HMB        15  6               工程所番地
     E                    HDH        15 12               工程品番
     E                    HKD        15  1               かんばん種類大
     E                    HSU        15  9 0             工程設定数
      *
      *====================================
      * 社内かんばん切替えマスター旧工程
     E                    OKT        15  3               工程
     E                    OBM        15  4 0             部門
     E                    OKI        15  3               機番
     E                    OMB        15  6               工程所番地
     E                    ODH        15 12               工程品番
     E                    OKD        15  1               かんばん種類大
      *
      *====================================
      * 社内かんばん切替えマスター新工程
     E                    SKT        15  3               工程
     E                    SBM        15  4 0             部門
     E                    SKI        15  3               機番
     E                    SMB        15  6               工程所番地
     E                    SDH        15 12               工程品番
     E                    SKD        15  1               かんばん種類大
     E                    SSU        15  9 0             工程設定数
     E                    SUK        15 10 0             かんばん切替日
      *
     E                    IKT        10  3               工程／画面
     E                    HSJ         4  1               数字検索
     E                    HHZ         4  6 0             稼働日数日付
     E                    HCD         4  3 1             稼働日数
     E                    HR1         4  1               炉番整備
     E                    HRN         3  1               炉番整備
      *
     E                    U1NS        3  9 0             内示数量N-N+2
     E                    U1SS        3  9 0             内示数量N-N+2
     E                    F4TS       12  7 0             実績数量01-12
      *
     E                    TSU    10  10  1               数字0-9
     E                    TB1     1  20  1   TN1    25   めっき種類
     E                    TB2     1   1 15               めっき種類
     E                    TB3     1  12  1   TN3    10   カラー
     E                    TB4     1  15  1   TN4    40   脱水素
     E                    ER      1  14 70               d[ｰxｮﾈｰﾆﾞ
      *
      ***
     I            DS
     I                                        1  45 OKT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600OBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  45 OKI
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN00
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I            DS
     I                                        1  90 OMB
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1 180 ODH
     I                                        1  12 CKQH01
     I                                       13  24 CKQH02
     I                                       25  36 CKQH03
     I                                       37  48 CKQH04
     I                                       49  60 CKQH05
     I                                       61  72 CKQH06
     I                                       73  84 CKQH07
     I                                       85  96 CKQH08
     I                                       97 108 CKQH09
     I                                      109 120 CKQH10
     I                                      121 132 CKQH11
     I                                      133 144 CKQH12
     I                                      145 156 CKQH13
     I                                      157 168 CKQH14
     I                                      169 180 CKQH15
     I            DS
     I                                        1  15 OKD
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I            DS
     I                                        1  45 SKT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600SBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  45 SKI
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  90 SMB
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1 180 SDH
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1  15 SKD
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1 1350SSU
     I                                        1   90CKSU01
     I                                       10  180CKSU02
     I                                       19  270CKSU03
     I                                       28  360CKSU04
     I                                       37  450CKSU05
     I                                       46  540CKSU06
     I                                       55  630CKSU07
     I                                       64  720CKSU08
     I                                       73  810CKSU09
     I                                       82  900CKSU10
     I                                       91  990CKSU11
     I                                      100 1080CKSU12
     I                                      109 1170CKSU13
     I                                      118 1260CKSU14
     I                                      127 1350CKSU15
     I            DS
     I                                        1 1500SUK
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
      *
     I            DS
     I                                        1  30 IKT
     I                                        1   3 IKO01
     I                                        4   6 IKO02
     I                                        7   9 IKO03
     I                                       10  12 IKO04
     I                                       13  15 IKO05
     I                                       16  18 IKO06
     I                                       19  21 IKO07
     I                                       22  24 IKO08
     I                                       25  27 IKO09
     I                                       28  30 IKO10
      *
     I            DS
     I                                        1  270U1NS
     I                                        1   90U1NNNM
     I                                       10  180U1N1NM
     I                                       19  270U1N2NM
     I            DS
     I                                        1  270U1SS
     I                                        1   90U1SNNM
     I                                       10  180U1S1NM
     I                                       19  270U1S2NM
     I            DS
     I                                        1  840F4TS
     I                                        1   70F4TS01
     I                                        8  140F4TS02
     I                                       15  210F4TS03
     I                                       22  280F4TS04
     I                                       29  350F4TS05
     I                                       36  420F4TS06
     I                                       43  490F4TS07
     I                                       50  560F4TS08
     I                                       57  630F4TS09
     I                                       64  700F4TS10
     I                                       71  770F4TS11
     I                                       78  840F4TS12
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   7 A2MEKI
     I                                        1   4 A2MEK1
     I                                        5   6 A2MEK2
     I                                        7   7 A2MEK3
     I            DS
     I                                        1   80CKSKHZ
     I                                        1   40CKSKYY
     I                                        5   60CKSKMM
     I                                        7   80CKSKDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80A6GSHZ
     I                                        1   40A6GSYY
     I                                        5   60A6GSMM
     I                                        7   80A6GSDD
     I            DS
     I                                        1   80F4SKHZ
     I                                        1   40F4SKYY
     I                                        5   60F4SKMM
     I                                        7   80F4SKDD
     I            DS
     I                                        1  12 W5DHIN
     I                                        1   5 W5DHI1
     I                                        6  10 W5DHI2
     I                                       11  12 W5DHI3
     I            DS
     I                                        1   7 W5MEKI
     I                                        2   2 W5MK2
     I                                        3   3 W5MK3
     I                                        4   4 W5MK4
     I            DS
     I                                        1   60INJYM
     I                                        1   40INJYY
     I                                        5   60INJMM
     I            DS
     I                                        1   60IJIYM
     I                                        1   40IJIYY
     I                                        5   60IJIMM
     I            DS
     I                                        1   60WSTYM
     I                                        1   40WSTYY
     I                                        5   60WSTMM
     I            DS
     I                                        1   60WJSYM
     I                                        1   40WJSYY
     I                                        5   60WJSMM
     I            DS
     I                                        1   6 WJTKR
     I                                        1   1 WJTK1
     I                                        2   3 WJTK2
     I                                        4   5 WJTK3
     I                                        6   6 WJTK4
     I            DS
     I                                        1   6 @MBN
     I                                        1   1 @MBN1
     I                                        2   3 @MBN2
     I                                        4   5 @MBN3
     I                                        6   6 @MBN4
     I            DS
     I                                        1  12 @MHN
     I                                        1   5 @MHN1
     I                                        6  10 @MHN2
     I                                       11  12 @MHN3
     I            DS
     I                                        1   60@NJYM
     I                                        1   40@NJYY
     I                                        5   60@NJMM
     I            DS
     I                                        1   80WYMD
     I                                        1   60WYM
     I                                        1   40WYY
     I                                        5   60WMM
      *
      ***
     C           KEY1      KLIST
     C                     KFLD           WYY
     C                     KFLD           WMM
      *
     C           KEY2      KLIST
     C                     KFLD           W5KOJO
     C                     KFLD           W5RONO
     C                     KFLD           W5KOTI
     C                     KFLD           W5DHIN
      *
     C           KEY3      KLIST
     C                     KFLD           @MHN1
     C                     KFLD           @MHN2
     C                     KFLD           @MHN3
     C                     KFLD           @MKTE
     C                     KFLD           @MBMN
     C                     KFLD           @MBN1
     C                     KFLD           @MBN2
     C                     KFLD           @MBN3
     C                     KFLD           @MBN4
      *
     C           KEY4      KLIST
     C                     KFLD           IJIYY
     C                     KFLD           MMJHN1
     C                     KFLD           MMJHN2
     C                     KFLD           MMJHN3
      *
     C           KEY5      KLIST
     C                     KFLD           MMJHN1
     C                     KFLD           MMJHN2
     C                     KFLD           MMJHN3
     C                     KFLD           @NJYM
      *
     C           KEYD      KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *
     C           KEYE      KLIST
     C                     KFLD           WJTK1
     C                     KFLD           WJTK2
     C                     KFLD           WJTK3
     C                     KFLD           WJTK4
      *
      *---------------------------------*
      *  PSTYM:設定数自動処理当月日付 *
      *  PJSYM:実績日付               *
      *---------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PSTYM   6
     C                     PARM           PJSYM   6
     C                     PARM           PHYM1   6
     C                     PARM           PHYM2   6
     C                     PARM           PHYM3   6
     C                     PARM           PHYM4   6
     C                     PARM           PHCD1   3
     C                     PARM           PHCD2   3
     C                     PARM           PHCD3   3
     C                     PARM           PHCD4   3
      *
     C                     CLEARMYCPW211
      *
      *------------*
      * 内示日付 *
      *------------*
     C                     MOVELPSTYM     WSTYM
      *
      *------------*
      * 実績日付 *
      *------------*
     C                     MOVELPJSYM     WJSYM
      *
      **********
      * 画面 *
      **********
     C           STP1      TAG
     C                     EXFMTMYCPW211
     C                     SETOF                     515253
     C                     SETOF                     545556
     C                     SETOF                     575859
     C                     SETOF                     606162
     C                     SETOF                     636499
      *
      *======
      *  F1
     C           *INKA     IFEQ '1'
     C                     SETON                     U2LR
     C                     RETRN
     C                     END
      *
      *------------*
      * 内示日付 *
      *------------*
     C           INJYM     IFEQ 0
     C                     SETON                     5199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C           INJYY     IFGE 2017
     C           INJMM     ANDGE01
     C           INJMM     ANDLE12
     C                     ELSE
     C                     SETON                     5199
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
      *
     C           INJYM     IFGT WSTYM
     C                     SETON                     5199
     C                     MOVELER,3      MSG
     C                     GOTO STP1
     C                     END
      *
      *------------*
      * 実績日付 *
      *------------*
     C           IJIYM     IFEQ 0
     C                     SETON                     5299
     C                     MOVE ER,4      MSG
     C                     GOTO STP1
     C                     END
      *
     C           IJIYY     IFGE 2017
     C           IJIMM     ANDGE01
     C           IJIMM     ANDLE12
     C                     ELSE
     C                     SETON                     5299
     C                     MOVE ER,5      MSG
     C                     GOTO STP1
     C                     END
      *
     C           IJIYM     IFGT WJSYM
     C                     SETON                     5299
     C                     MOVELER,6      MSG
     C                     GOTO STP1
     C                     END
      *
      *--------------*
      * 工場コード *
      *--------------*
     C           IKOJO     IFEQ *BLANK
     C                     SETON                     5399
     C                     MOVELER,7      MSG
     C                     GOTO STP1
     C                     END
      *
      *============
      * 数字検索
     C                     MOVEAIKOJO     HSJ
      *
     C           1         DO   4         A       30
     C                     SETOF                     01
     C           HSJ,A     LOKUPTSU                      01
     C           *IN01     IFEQ '0'
     C                     SETON                     5399
     C                     MOVELER,8      MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
      *====================
      * 細目マスター検索
     C                     MOVELIKOJO     WKOJO   40
      *
     C                     SETOF                     01
     C           WKOJO     CHAINFGBPL011             01
     C           *IN01     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
     C           *IN01     IFEQ '1'
     C                     SETON                     5399
     C                     MOVELER,9      MSG
     C                     GOTO STP1
     C                     END
      *
      *--------------*
      * 工程コード *
      *------------------------*
      * 工程名称マスター検索 *
      *------------------------*
     C                     SETOF                     02
     C                     Z-ADD53        Y       30
     C           1         DO   10        X       30
     C                     ADD  1         Y
     C           IKT,X     IFNE *BLANK
     C                     SETON                     02
     C                     MOVELIKT,X     WKOTI   3
      *
     C                     SETOF                     01
     C           WKOTI     CHAINFCETL031             01
     C           *IN01     IFEQ '0'
     C           A6GSKD    ANDEQ'D'
     C           A6GSHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
     C           *IN01     IFEQ '1'
     C                     SETON                     99
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,10     MSG
     C                     GOTO STP1
     C                     END
      *
     C                     END
     C                     END
      *
     C           *IN02     IFEQ '0'
     C                     SETON                     545556
     C                     SETON                     575859
     C                     SETON                     606162
     C                     SETON                     6399
     C                     MOVELER,11     MSG
     C                     GOTO STP1
     C                     END
      *
      *----------------*
      * 新旧工程判断 *
      *----------------*
     C           IKUBN     IFEQ *BLANK
     C                     SETON                     6499
     C                     MOVELER,12     MSG
     C                     GOTO STP1
     C                     END
      *
     C           IKUBN     IFNE '1'
     C           IKUBN     ANDNE'2'
     C                     SETON                     6499
     C                     MOVELER,13     MSG
     C                     GOTO STP1
     C                     END
      *
      *======
      *  F5
     C           *INKE     IFEQ '0'
     C                     GOTO STP1
     C                     END
      *
      *----------------*
      * 実績内示日付 *
      *----------------*
     C                     CLEARHHZ
      *
     C                     Z-ADDIJIYM     HHZ,1
     C                     Z-ADDINJYM     HHZ,2
      *
     C                     Z-ADD1         A
     C                     Z-ADDINJYM     WYM
     C           3         DO   4         A
     C           WMM       IFEQ 12
     C                     ADD  1         WYY
     C                     Z-ADD01        WMM
     C                     ELSE
     C                     ADD  1         WMM
     C                     END
     C                     Z-ADDWYM       HHZ,A
     C                     END
      *
      *------------*
      * 稼働日数 *
      *------------*
     C                     CLEARHCD
      *
     C                     Z-ADD1         A
     C           1         DO   4         A
     C                     Z-ADD0         WKAD    31
     C                     Z-ADDHHZ,A     WYM
      *
     C           KEY1      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     01
     C           KEY1      READEAGDPL121                 01
     C           *IN01     IFEQ '1'
     C                     LEAVE
     C                     END
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ITER
     C                     END
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         WKAD
     C                     ELSE
     C                     ADD  0.5       WKAD
     C                     END
     C                     END
      *
     C                     Z-ADDWKAD      HCD,A
     C                     END
      *
      *
     C                     MOVELHHZ,1     PHYM1
     C                     MOVELHHZ,2     PHYM2
     C                     MOVELHHZ,3     PHYM3
     C                     MOVELHHZ,4     PHYM4
     C                     MOVELHCD,1     PHCD1
     C                     MOVELHCD,2     PHCD2
     C                     MOVELHCD,3     PHCD3
     C                     MOVELHCD,4     PHCD4
      *
      **************************
      * 部品情報マスター検索 *
      **************************
     C                     DO   *HIVAL
     C                     SETOF                     10
     C                     READ FCEPP011                 10
     C           *IN10     IFEQ '1'
     C                     LEAVE
     C                     END
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     ITER
     C                     END
     C           A2TEHI    IFNE 'G'
     C                     ITER
     C                     END
      *
     C                     CLEARHKT
     C                     CLEARHBM
     C                     CLEARHKI
     C                     CLEARHMB
     C                     CLEARHDH
     C                     CLEARHSU
     C                     CLEARHKD
      *
     C                     SETOF                     11
     C           KEYD      CHAINAAMPL111             11
     C           *IN11     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     11
     C                     END
     C           *IN11     IFEQ '0'
      *
     C           IKUBN     IFEQ '1'
     C                     Z-ADD0         Y
     C           1         DO   15        X
     C           SKT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVELSKT,X     HKT,Y
     C                     Z-ADDSBM,X     HBM,Y
     C                     MOVELSKI,X     HKI,Y
     C                     MOVELSMB,X     HMB,Y
     C                     MOVELSDH,X     HDH,Y
     C                     MOVELSKD,X     HKD,Y
     C                     Z-ADDSSU,X     HSU,Y
     C                     END
     C                     END
     C                     ELSE
      *
     C                     Z-ADD0         Y
     C           1         DO   15        X
     C                     MOVELSUK,X     WUKH    80
     C           WUKH      IFGT *DATE
     C           OKT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVELOKT,X     HKT,Y
     C                     Z-ADDOBM,X     HBM,Y
     C                     MOVELOKI,X     HKI,Y
     C                     MOVELOMB,X     HMB,Y
     C                     MOVELODH,X     HDH,Y
     C                     MOVELOKD,X     HKD,Y
     C                     Z-ADDSSU,X     HSU,Y
     C                     END
     C                     ELSE
      *
     C           SKT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVELSKT,X     HKT,Y
     C                     Z-ADDSBM,X     HBM,Y
     C                     MOVELSKI,X     HKI,Y
     C                     MOVELSMB,X     HMB,Y
     C                     MOVELSDH,X     HDH,Y
     C                     MOVELSKD,X     HKD,Y
     C                     Z-ADDSSU,X     HSU,Y
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
      *
      *==================*
      * 工場・工程検索 *
      *==================*
     C           1         DO   15        C       30
     C                     CLEARMYCNP211
      *
     C                     MOVE *BLANK    WRONO   4
     C                     Z-ADD0         @MBMN   40
     C                     MOVE *BLANK    @MKTE   3
     C                     MOVE *BLANK    @MSNO   3
     C                     MOVE *BLANK    @MBN
     C                     MOVE *BLANK    @MHN
     C                     Z-ADD0         @SRYO  100
      *
     C           HKT,C     IFEQ *BLANK
     C                     LEAVE
     C                     END
      *
     C                     SETOF                     12
     C                     MOVELHKT,C     WKOTI
     C           WKOTI     LOKUPIKT                      12
     C           *IN12     IFEQ '1'
     C           WKOJO     ANDEQHBM,C
      *
     C                     Z-ADDHBM,C     @MBMN
     C                     MOVELHKT,C     @MKTE
     C                     MOVELHKI,C     @MSNO
     C                     MOVELHMB,C     @MBN
     C                     MOVELHDH,C     @MHN
     C                     Z-ADDHSU,C     @SRYO
      *
     C                     MOVEL@MSNO     WRONO
      *
     C                     Z-ADD@MBMN     W5KOJO
     C                     MOVEL@MKTE     W5KOTI
     C                     MOVEL@MHN1     W5DHI1
     C                     MOVEL@MHN2     W5DHI2
     C                     MOVEL@MHN3     W5DHI3
     C                     Z-ADD@SRYO     W5KTSU
      *
      *--------------------*
      * 工程マスター検索 *
      *--------------------*
     C                     Z-ADD0         @RECD   50
      *
     C           KEY3      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     14
     C           KEY3      READEGHCPL221                 14
     C           *IN14     IFEQ '1'
     C                     LEAVE
     C                     END
     C                     ADD  1         @RECD
      *
      *----------------*
      * 内示数量算出 *
      *----------------*
     C                     Z-ADDINJYM     @NJYM
      *
     C                     SETOF                     15
     C           KEY5      CHAINABBPL211             15
     C           *IN15     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1NS,1    W5NJS0
     C                     ADD  U1NS,2    W5NJS1
     C                     ADD  U1NS,3    W5NJS2
     C                     ELSE
     C                     ADD  U1SS,1    W5NJS0
     C                     ADD  U1SS,2    W5NJS1
     C                     ADD  U1SS,3    W5NJS2
     C                     END
     C                     END
      *
      *----------------*
      * 実績数量算出 *
      *----------------*
     C           KEY4      SETLLMBDPL121
     C                     DO   *HIVAL
     C                     SETOF                     15
     C                     Z-ADDIJIMM     D       30
     C           KEY4      READEMBDPL121                 15
     C           *IN15     IFEQ '1'
     C                     LEAVE
     C                     END
     C           F4SKJY    IFEQ 'D'
     C           F4SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
     C                     ADD  F4TS,D    W5URSU
     C                     END
      *
     C                     END
      *
      *=====
     C                     MOVEL'N'       W5KTYN
     C           @RECD     IFGT 1
     C                     MOVEL'Y'       W5KTYN
     C                     END
      *
      *--------------*
      * 焼入れ情報 *
      *--------------*
     C                     EXSR SBKAB
      *
      *=====
      * 部品情報
     C           W5SYOS    IFEQ 0
     C           A2SYHZ    IFGT *DATE
     C                     Z-ADDA2KSYS    W5SYOS
     C                     MOVELA2KSYT    W5SYOT
     C                     ELSE
     C                     Z-ADDA2SSYS    W5SYOS
     C                     MOVELA2SSYT    W5SYOT
     C                     END
     C                     END
      *
     C                     MOVELA2MEKI    W5MEKI
     C                     MOVELA2ZANM    W5ZANM
     C                     Z-ADDA2KAZI    W5KAZI
     C                     Z-ADDA2KASI    W5KASI
     C                     Z-ADDA2SOZI    W5SOZI
     C                     Z-ADDA2KIKI    W5KIKI
     C                     Z-ADDA2KUBI    W5KUBI
     C                     Z-ADDA2TUSZ    W5TUSZ
     C                     MOVELA2SMEI    W5SMEI
      *
      *=====
      * 重量ｋｇ（月）
      *
     C           W5URSU    MULT W5KASI    W5URJR    H
     C                     DIV  1000      W5URJR    H
     C           W5NJS0    MULT W5KASI    W5NJR0    H
     C                     DIV  1000      W5NJR0    H
     C           W5NJS1    MULT W5KASI    W5NJR1    H
     C                     DIV  1000      W5NJR1    H
     C           W5NJS2    MULT W5KASI    W5NJR2    H
     C                     DIV  1000      W5NJR2    H
     C           W5KTSU    MULT W5KASI    W5KTJR    H
     C                     DIV  1000      W5KTJR    H
      *
      *=====
      * 工程情報（工場）
     C                     Z-ADDHBM,1     W5KJ01
     C                     Z-ADDHBM,2     W5KJ02
     C                     Z-ADDHBM,3     W5KJ03
     C                     Z-ADDHBM,4     W5KJ04
     C                     Z-ADDHBM,5     W5KJ05
     C                     Z-ADDHBM,6     W5KJ06
     C                     Z-ADDHBM,7     W5KJ07
     C                     Z-ADDHBM,8     W5KJ08
     C                     Z-ADDHBM,9     W5KJ09
     C                     Z-ADDHBM,10    W5KJ10
     C                     Z-ADDHBM,11    W5KJ11
     C                     Z-ADDHBM,12    W5KJ12
     C                     Z-ADDHBM,13    W5KJ13
     C                     Z-ADDHBM,14    W5KJ14
     C                     Z-ADDHBM,15    W5KJ15
      *
      *=====
      * 工程情報（工程）
     C                     MOVELHKT,1     W5KT01
     C                     MOVELHKT,2     W5KT02
     C                     MOVELHKT,3     W5KT03
     C                     MOVELHKT,4     W5KT04
     C                     MOVELHKT,5     W5KT05
     C                     MOVELHKT,6     W5KT06
     C                     MOVELHKT,7     W5KT07
     C                     MOVELHKT,8     W5KT08
     C                     MOVELHKT,9     W5KT09
     C                     MOVELHKT,10    W5KT10
     C                     MOVELHKT,11    W5KT11
     C                     MOVELHKT,12    W5KT12
     C                     MOVELHKT,13    W5KT13
     C                     MOVELHKT,14    W5KT14
     C                     MOVELHKT,15    W5KT15
      *
      *------------------------*
      * 炉番、頭0とQ消去 *
      *------------------------*
     C           WRONO     IFNE *BLANK
     C                     MOVEAWRONO     HR1
      *
     C                     Z-ADD1         E       30
     C           1         DO   4         E
     C                     SETOF                     16
     C           HR1,E     IFNE *BLANK
     C           HR1,E     IFEQ '0'
     C                     MOVE *BLANK    HR1,E
     C                     ELSE
     C                     SETON                     16
     C                     END
     C                     END
     C  N16                END
      *
     C                     Z-ADD1         E
     C                     Z-ADD0         F       30
     C                     MOVE *BLANK    HRN
     C           1         DO   4         E
     C                     SETOF                     16
     C           HR1,E     IFNE *BLANK
     C                     ADD  1         F
     C                     MOVELHR1,E     HRN,F
     C           F         IFEQ 3
     C                     SETON                     16
     C                     END
     C                     END
     C  N16                END
      *
     C           HRN,2     IFEQ *BLANK
     C                     MOVELHRN,1     HRN,3
     C                     MOVEL'0'       HRN,2
     C                     MOVEL'0'       HRN,1
     C                     END
      *
     C           HRN,3     IFEQ *BLANK
     C                     MOVELHRN,2     HRN,3
     C                     MOVELHRN,1     HRN,2
     C                     MOVEL'0'       HRN,1
     C                     END
      *
     C                     MOVEAHRN       W5RONO
     C                     END
      *
      *--------------*
      * めっき種類 *
      *--------------*
     C                     SETOF                     16
     C                     Z-ADD1         E
     C           W5MK2     LOKUPTB1,E                    16
     C           *IN16     IFEQ '1'
     C                     MOVELTN1,E     W5MKSR
     C                     END
      *
     C           W5MK2     IFEQ 'D'
     C           W5MK4     ANDEQ'B'
     C                     MOVELTB2,1     W5MKSR
     C                     END
      *
      *-------*
      *  f[ｰ  *
      *-------*
     C                     SETOF                     16
     C                     Z-ADD1         E
     C           W5MK4     LOKUPTB4,E                    16
     C           *IN16     IFEQ '1'
     C                     MOVELTN4,E     W5COLR
     C                     END
      *
      *----------*
      * 脱水素 *
      *----------*
     C                     SETOF                     16
     C                     Z-ADD1         E
     C           W5MK3     LOKUPTB3,E                    16
     C           *IN16     IFEQ '1'
     C                     MOVELTN3,E     W5DASI
     C                     END
      *
      ********************************
      * 熱処理設備負荷グラフデータ *
      ********************************
     C           W5RONO    IFNE *BLANK
     C                     SETOF                     17
     C           KEY2      CHAINMYCNP211             17
     C           *IN17     IFEQ '1'
     C                     SETON                     U1
     C                     WRITEMYCNP211
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C                     END
      *
     C           *INU1     IFEQ '0'
     C                     SETON                     99
     C                     MOVELER,14     MSG
     C                     GOTO STP1
     C                     END
      *
      *
     C                     SETON                     LR
     C                     RETRN
      *
      ***
      ******************
      * サブルーチン *
      * 焼入れ情報   *
      ******************
     C           SBKAB     BEGSR
      *
      *============*
      * 焼入情報 *
      *============*
      *----------------------------*
      *  B :焼入かんばんマスター *
      *----------------------------*
     C                     SETOF                     20
      *
     C                     SETOF                     21
     C                     Z-ADD1         X
     C           'B'       LOKUPHKD,X                    21
     C           *IN21     IFEQ '1'
     C                     SETON                     20
     C                     MOVELHKD,X     W5KDAI
     C                     MOVELHMB,X     WJTKR
      *
     C           KEYE      SETGTADHPL031
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPEADHPL031                 22
     C           *IN22     IFEQ '1'
     C                     LEAVE
     C                     END
     C           J6SKJY    IFEQ *BLANK
     C           *DATE     IFGE J6UKHZ
     C           *DATE     ANDLTJ6STHZ
      *
     C           WRONO     IFEQ *BLANK
     C                     MOVELJ6RONO    WRONO
     C                     END
      *
     C                     Z-ADDJ6HOJI    W5HOJI
     C                     Z-ADDJ6ONDO    W5ONDO
     C                     Z-ADDJ6BRAH    W5BRAH
     C                     Z-ADDJ6HKLT    W5HKLT
     C                     Z-ADDJ6CO2P    W5CO2P
     C                     Z-ADDJ6BASA    W5BASA
     C                     Z-ADDJ6BAHA    W5BAHA
     C                     Z-ADDJ6LOTO    W5LOTO
     C                     Z-ADDJ6KIK1    W5KSK1
     C                     Z-ADDJ6KIK2    W5KSK2
     C                     Z-ADDJ6SYOS    W5SYOS
     C                     MOVELJ6SYOT    W5SYOT
     C                     LEAVE
      *
     C                     END
     C                     END
     C                     END
     C                     END
      *
      *----------------------------*
      *  F :指示かんばんマスター *
      *----------------------------*
     C           *IN20     IFEQ '0'
      *
     C                     SETOF                     21
     C                     Z-ADD1         X
     C           'F'       LOKUPHKD,X                    21
     C           *IN21     IFEQ '1'
     C                     MOVELHKD,X     W5KDAI
     C                     MOVELHMB,X     WJTKR
      *
     C           KEYE      SETGTCADPL031
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPECADPL031                 22
     C           *IN22     IFEQ '1'
     C                     LEAVE
     C                     END
     C           C2SKJY    IFEQ *BLANK
     C           *DATE     IFGE C2UKHZ
     C           *DATE     ANDLTC2STHZ
      *
     C           WRONO     IFEQ *BLANK
     C                     MOVELC2RONO    WRONO
     C                     END
      *
     C                     Z-ADDC2HOJI    W5HOJI
     C                     Z-ADDC2ONDO    W5ONDO
     C                     Z-ADDC2BASK    W5BAHA
     C                     Z-ADDC2LOTO    W5LOTO
     C                     Z-ADDC2KIK1    W5KSK1
     C                     Z-ADDC2KIK2    W5KSK2
     C                     Z-ADDC2SYOS    W5SYOS
     C                     MOVELC2SYOT    W5SYOT
     C                     LEAVE
      *
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
      *==============*
      * 工程内情報 *
      *==============*
      *-------------------------------------*
      *  A :工程内かんばんマスター        *
      *     工程: LAN,AOQ                 *
      *            焼鈍温度、焼鈍保持時間 *
      *-------------------------------------*
      *
     C                     SETOF                     21
     C                     Z-ADD1         X
     C           'LAN'     LOKUPHKT,X                    21
     C           *IN21     IFEQ '0'
     C                     Z-ADD1         X
     C           'AOQ'     LOKUPHKT,X                    21
     C                     END
     C           *IN21     IFEQ '1'
      *
     C                     Z-ADDX         XX      30
     C           XX        DO   99        X
     C           HKD,X     IFNE *BLANK
     C                     LEAVE
     C                     END
     C                     END
      *
     C           'A'       IFEQ HKD,X
     C                     MOVELHMB,X     WJTKR
      *
     C           KEYE      SETGTABHPL031
     C                     DO   *HIVAL
     C                     SETOF                     22
     C           KEYE      REDPEABHPL031                 22
     C           *IN22     IFEQ '1'
     C                     LEAVE
     C                     END
     C           M6SKJY    IFEQ *BLANK
     C           *DATE     IFGE M6UKHZ
     C           *DATE     ANDLTM6STHZ
     C                     Z-ADDM6ONDO    W5SOND
     C                     Z-ADDM6HOJI    W5SHOJ
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
      *
     C                     ENDSR
      *
      *
** TSU
0123456789
** TB1､TN1
AZINC
JCOPPER
YCOPPER BELL
WDOUBLE NICKEL
XAIRCRAFT CLOTH DOUBLE
NMICRO POLARS
DJIOMETTO
ZBELL ZINC
TSINGLE LAYER NICKEL
BBLACK CHROME
CCHROME
FCOPPER NICKEL
QCOPPER NICKEL CHROME
EIRON ZINC
INICKEL ZINC
MKANIZEN
VZINC - COBALT - IRON
SMOLYBDIC SULFIDE
GCOPPER SILVER PLATING
KGLOSS BELL
** TB2
BLACK JIOMETTO
** TB3､TN3
HBAY KING
.STRAIGHT
00 HOURS
11 HOURS
22 HOURS
33 HOURS
44 HOURS
55 HOURS
66 HOURS
77 HOURS
88 HOURS
99 HOURS
** TB4､TN4
.WHITE RISE
CCHROMATE
UUNICLO
BBLACK
OGREEN CHROMATE
STHREE PRICES OF WHITE
KTHREE PRICES OF BLACK
PPASSHIBEITO
RPHOSPHORUS SURFACE OXIDE PROCESSING
ZPICKLING
LPOLY STICKER
KSTAINLESS BLACK OXIDE COATING
FSTEEL BLACK OXIDE COATING
TTRICHLEN WASHING
Y6 PRICE CHROME FREE YELLOW
** ER
E-01 A PRIVATE NOTIFICATION DATA IS NOT INPUT
E-02 A PRIVATE NOTIFICATION DATA IS NOT INPUT DEFINITELY
E-03 ON THIS PRIVATE NOTIFICATION DATE,DATA ARE NOT YET MADE
E-04 RESUITS DATE IS NOT INPUT
E-05 RESUITS DATE IS NOT INPUT DEFINITELY
E-06 ON THERE RESUITS DATE,DATA ARE NOT YET MADE
E-07 A FACTORY CORD IS NOT INPUT
E-08 THE FACTORY CORD PLEASE INPUT A NUMBER
E-09 A RATHER THIN MASTER DOES NOT HAVE A FACTORY CORD
E-10 A PROCESS NAME MASTER DOES NOT HAVE THIS PROCESS CORD
E-11 A PROCESS CORD IN NOT INPUT
E-12 THE OLD AND THE NEW PROCESS JUDGMENT IS NOT INPUT
E-13 THE OLD AND THE NEW PROCESS JUDGMENT IS 1.2
E-14 THERE IS NO MADE DATA
