     H            Y.                                    1
      ** MYCR12 **************************
      * 設備負荷グラフデータ作成『新』 *
      * 『新バージョン』               *
      *  EXCEL CSV形式                 *
      *  I-HASADA            2018/10/23  *
      *  T.TODA              2021/06/14  *
      *    CHANGES(20199)                *
      ************************** MYCR12 **
     FMYCNP10 IP  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FFCGPP31 IF  E           K        DISK
     FMYCWP12 O   F    1900            DISK
      *
      ***
     E                    HHZ         4  6 0             日付
     E                    HCD         4  3 1             稼働日数
     E                    HME        15  1               品名
      *
     E                    TK1     1   9  1   TN1    40   形状１名称
     E                    TK2     1  44  2   TN2    30   形状２名称
     E                    TK3     1  31  2   TN3    30   形状３名称
     E                    TK4     1  35  2   TN4    20   形状４名称
     E                    TK5     1  23  2   TN5    40   形状５名称
     E                    TK6     1  27  2   TN6    30   形状６名称
     E                    TK7     1  10  1   TN7    20   かんばん種類名
      *
      ***
     IMYCNP101    01
      *
      *
     I            DS
     I                                        1   4 W0KIBN
     I                                        1   3 W0KI11
     I                                        4   4 W0KI12
     I            DS
     I                                        1  12 W0DHIN
     I                                        1   5 W0DHI1
     I                                        6  10 W0DHI2
     I                                       11  12 W0DHI3
     I            DS
     I                                        1  12 W0KHN1
     I                                        1   5 W0KH11
     I                                        6  10 W0KH12
     I                                       11  12 W0KH13
     I            DS
     I                                        1  12 W0KHN2
     I                                        1   5 W0KH21
     I                                        6  10 W0KH22
     I                                       11  12 W0KH23
     I            DS
     I                                        1  12 W0KHN3
     I                                        1   5 W0KH31
     I                                        6  10 W0KH32
     I                                       11  12 W0KH33
     I            DS
     I                                        1  12 W0KHN4
     I                                        1   5 W0KH41
     I                                        6  10 W0KH42
     I                                       11  12 W0KH43
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKY4
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80E1SKHZ
     I                                        1   40E1SKYY
     I                                        5   60E1SKMM
     I                                        7   80E1SKDD
     I            DS
     I                                        1  14 WDHIN
     I                                        1   5 WDHI1
     I                                        6   6 WDH1
     I                                        7  11 WDHI2
     I                                       12  12 WDH2
     I                                       13  14 WDHI3
     I            DS
     I                                        1  14 WKHN1
     I                                        1   5 WKH11
     I                                        6   6 WK11
     I                                        7  11 WKH12
     I                                       12  12 WK12
     I                                       13  14 WKH13
     I            DS
     I                                        1  14 WKHN2
     I                                        1   5 WKH21
     I                                        6   6 WK21
     I                                        7  11 WKH22
     I                                       12  12 WK22
     I                                       13  14 WKH23
     I            DS
     I                                        1  14 WKHN3
     I                                        1   5 WKH31
     I                                        6   6 WK31
     I                                        7  11 WKH32
     I                                       12  12 WK32
     I                                       13  14 WKH33
     I            DS
     I                                        1  14 WKHN4
     I                                        1   5 WKH41
     I                                        6   6 WK41
     I                                        7  11 WKH42
     I                                       12  12 WK42
     I                                       13  14 WKH43
     I            DS
     I                                        1   2 WSH
     I                                        1   1 WSH1
     I                                        2   2 WSH2
      *
      ***
     C           KEY1      KLIST
     C                     KFLD           W0DHI1
     C                     KFLD           W0DHI2
     C                     KFLD           W0DHI3
      *
     C           *ENTRY    PLIST
     C                     PARM           PHYM1   6
     C                     PARM           PHYM2   6
     C                     PARM           PHYM3   6
     C                     PARM           PHYM4   6
     C                     PARM           PHCD1   3
     C                     PARM           PHCD2   3
     C                     PARM           PHCD3   3
     C                     PARM           PHCD4   3
     C                     PARM           PKOJO   4
      *
      *****
      *  sｮjﾞｰ
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C                     MOVELPKOJO     WKOJO   40
      *
     C                     SETOF                     11
     C                     MOVE *BLANK    WKJNM  15
     C           WKOJO     CHAINFGBPL011             11
     C           *IN11     IFEQ '0'
     C                     MOVELB2SMEI    WKJNM
     C                     END
      *
     C                     CLEARHHZ
     C                     CLEARHCD
     C                     MOVELPHYM1     HHZ,1
     C                     MOVELPHYM2     HHZ,2
     C                     MOVELPHYM3     HHZ,3
     C                     MOVELPHYM4     HHZ,4
     C                     MOVELPHCD1     HCD,1
     C                     MOVELPHCD2     HCD,2
     C                     MOVELPHCD3     HCD,3
     C                     MOVELPHCD4     HCD,4
      *
     C                     EXCPTHD
     C                     END
      *
      *****
      * 工程代表品番
     C                     MOVE *BLANK    WDHIN
     C                     MOVELW0DHI1    WDHI1
     C                     MOVELW0DHI2    WDHI2
     C                     MOVELW0DHI3    WDHI3
     C           W0DHI2    IFNE *BLANK
     C                     MOVEL'-'       WDH1
     C                     END
     C           W0DHI3    IFNE *BLANK
     C                     MOVEL'-'       WDH2
     C                     END
      *
      *****
      * 構成品番１
     C                     MOVE *BLANK    WKHN1
     C                     MOVELW0KH11    WKH11
     C                     MOVELW0KH12    WKH12
     C                     MOVELW0KH13    WKH13
     C           W0KH12    IFNE *BLANK
     C                     MOVEL'-'       WK11
     C                     END
     C           W0KH13    IFNE *BLANK
     C                     MOVEL'-'       WK12
     C                     END
      *
      *****
      * 構成品番２
     C                     MOVE *BLANK    WKHN2
     C                     MOVELW0KH21    WKH21
     C                     MOVELW0KH22    WKH22
     C                     MOVELW0KH23    WKH23
     C           W0KH22    IFNE *BLANK
     C                     MOVEL'-'       WK21
     C                     END
     C           W0KH23    IFNE *BLANK
     C                     MOVEL'-'       WK22
     C                     END
      *
      *****
      * 構成品番３
     C                     MOVE *BLANK    WKHN3
     C                     MOVELW0KH31    WKH31
     C                     MOVELW0KH32    WKH32
     C                     MOVELW0KH33    WKH33
     C           W0KH32    IFNE *BLANK
     C                     MOVEL'-'       WK31
     C                     END
     C           W0KH33    IFNE *BLANK
     C                     MOVEL'-'       WK32
     C                     END
      *
      *****
      * 構成品番４
     C                     MOVE *BLANK    WKHN4
     C                     MOVELW0KH41    WKH41
     C                     MOVELW0KH42    WKH42
     C                     MOVELW0KH43    WKH43
     C           W0KH42    IFNE *BLANK
     C                     MOVEL'-'       WK41
     C                     END
     C           W0KH43    IFNE *BLANK
     C                     MOVEL'-'       WK42
     C                     END
      *
      *************************************
      * 製品図面情報マスター( EDMICS )  *
      *************************************
     C                     SETOF                     12
     C                     MOVE *BLANK    WZUSU   1
     C                     MOVE *BLANK    WSIZE   4
     C                     MOVE *BLANK    WSHP1   1
     C                     MOVE *BLANK    WSHP2   1
     C                     MOVE *BLANK    WSHP3   1
     C                     MOVE *BLANK    WSHP4   1
     C                     MOVE *BLANK    WSHP5   1
     C                     MOVE *BLANK    WSHP6   1
     C                     Z-ADD0         WKUBI   83
     C                     MOVE *BLANK    WHYMN   5
     C                     MOVE *BLANK    WKODO   5
     C                     MOVE *BLANK    WZAIS   5
     C                     MOVE *BLANK    WNETU   5
     C                     Z-ADD0         WHDSC   83
     C                     Z-ADD0         W2SDS   83
     C                     MOVE *BLANK    WDVRP   6
     C                     MOVE *BLANK    WNJPT  20
     C                     Z-ADD0         WZAGI   83
     C                     Z-ADD0         WZAAT   83
     C                     Z-ADD0         WJIKE   83
     C                     Z-ADD0         WJINA   83
     C           KEY1      CHAINFCGPP311             12
     C           *IN12     IFEQ '0'
     C           E1SKJY    ANDEQ'D'
     C           E1SKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     END
     C           *IN12     IFEQ '0'
     C                     MOVELE1ZUSU    WZUSU
     C                     MOVELE1SIZE    WSIZE
     C                     MOVELE1SHP1    WSHP1
     C                     MOVELE1SHP2    WSHP2
     C                     MOVELE1SHP3    WSHP3
     C                     MOVELE1SHP4    WSHP4
     C                     MOVELE1SHP5    WSHP5
     C                     MOVELE1SHP6    WSHP6
     C                     Z-ADDE1KUBI    WKUBI
     C                     MOVELE1HYMN    WHYMN
     C                     MOVELE1KODO    WKODO
     C                     MOVELE1ZAIS    WZAIS
     C                     MOVELE1NETU    WNETU
     C                     Z-ADDE1HDSC    WHDSC
     C                     Z-ADDE12SDS    W2SDS
     C                     MOVELE1DVRP    WDVRP
     C                     MOVELE1NJPT    WNJPT
     C                     Z-ADDE1ZAGI    WZAGI
     C                     Z-ADDE1ZAAT    WZAAT
     C                     Z-ADDE1JIKE    WJIKE
     C                     Z-ADDE1JINA    WJINA
     C                     END
      *
      *======================*
      * 形状１～形状６名称 *
      *======================*
     C                     MOVE *BLANK    WKJN1  40
     C                     MOVE *BLANK    WKJN2  30
     C                     MOVE *BLANK    WKJN3  30
     C                     MOVE *BLANK    WKJN4  20
     C                     MOVE *BLANK    WKJN5  40
     C                     MOVE *BLANK    WKJN6  30
      *
      *=====
      * 形状１
     C                     SETOF                     12
     C                     Z-ADD1         A       20
     C           WSHP1     LOKUPTK1,A                    12
     C           *IN12     IFEQ '1'
     C                     MOVELTN1,A     WKJN1
     C                     END
      *
      *=====
      * 形状２
     C                     MOVELWSHP1     WSH1
     C                     MOVELWSHP2     WSH2
      *
     C                     SETOF                     12
     C                     Z-ADD1         A
     C           WSH       LOKUPTK2,A                    12
     C           *IN12     IFEQ '1'
     C                     MOVELTN2,A     WKJN2
     C                     END
      *
      *=====
      * 形状３
     C                     MOVELWSHP1     WSH1
     C                     MOVELWSHP3     WSH2
      *
     C                     SETOF                     12
     C                     Z-ADD1         A
     C           WSH       LOKUPTK3,A                    12
     C           *IN12     IFEQ '1'
     C                     MOVELTN3,A     WKJN3
     C                     END
      *
      *=====
      * 形状４
     C                     MOVELWSHP1     WSH1
     C                     MOVELWSHP4     WSH2
      *
     C                     SETOF                     12
     C                     Z-ADD1         A
     C           WSH       LOKUPTK4,A                    12
     C           *IN12     IFEQ '1'
     C                     MOVELTN4,A     WKJN4
     C                     END
      *
      *=====
      * 形状５
     C                     MOVELWSHP1     WSH1
     C                     MOVELWSHP5     WSH2
      *
     C                     SETOF                     12
     C                     Z-ADD1         A
     C           WSH       LOKUPTK5,A                    12
     C           *IN12     IFEQ '1'
     C                     MOVELTN5,A     WKJN5
     C                     END
      *
      *=====
      * 形状６
     C                     MOVELWSHP1     WSH1
     C                     MOVELWSHP6     WSH2
      *
     C                     SETOF                     12
     C                     Z-ADD1         A
     C           WSH       LOKUPTK6,A                    12
     C           *IN12     IFEQ '1'
     C                     MOVELTN6,A     WKJN6
     C                     END
      *
      *****
      * かんばん種類名称
      *
     C                     SETOF                     12
     C                     Z-ADD1         A
     C                     MOVE *BLANK    WKDAI  20
     C           W0KDAI    LOKUPTK7,A                    12
     C           *IN12     IFEQ '1'
     C                     MOVELTN7,A     WKDAI
     C                     END
      *
      *--------*
      * 品名 *
      *--------*
     C                     MOVEAW0SMEI    HME
     C           1         DO   15        A
     C           HME,A     IFEQ ','
     C                     MOVEL*BLANK    HME,A
     C                     END
     C                     END
     C                     MOVEAHME       W0SMEI
      *
      *****
      *  mﾞｰj
     C                     EXCPTDT
      *
      ***
     OMYCWP12 E                HD
     O                                      'EQUIPMENT LOAD DATA'
     O                                      '<NEW>'
     O                                      ','
     O                                      ','
     O                                      '="'
     O                         WKJNM
     O                                      '"'
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      'RESULTS'
     O                                      ','
     O                                      'N MONTH'
     O                                      ','
     O                                      'N+1 MONTH'
     O                                      ','
     O                                      'N+2 MONTH'
      **
     O        E                HD
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      '="'
     O                         HHZ,1        '    /  '
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HHZ,2        '    /  '
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HHZ,3        '    /  '
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HHZ,4        '    /  '
     O                                      '"'
      **
     O        E                HD
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                         HCD,1 3
     O                                      ','
     O                         HCD,2 3
     O                                      ','
     O                         HCD,3 3
     O                                      ','
     O                         HCD,4 3
      **
     O        E                HD
      **
     O        E                HD
     O                                      'AFTER A LOAD AVERAGE'
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      'CURRENT STATE -->'
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      'QUANTITY OF RESULTS'
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      'QUANTITY OF RESULTS'
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      'QUANTITY OF RESULTS'
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      'SELF-PROCESS BOARD -->'
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      'PART -->'
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      ','
     O                                      'EDMICS -->'
      **
     O        E                HD
     O                                      'PROCESS'
     O                                      ','
     O                                      'MACHINE TURN'
     O                                      ','
     O                                      'MODEL'
     O                                      ','
     O                                      'PROCESS'
     O                                      ','
     O                                      'MACHINE TURN'
     O                                      ','
     O                                      'MODEL'
     O                                      ','
     O                                      'FACTORY'
     O                                      ','
     O                                      'PROCESS REPRESENTATIVE '
     O                                      'STOCK NUMBER'
     O                                      ','
      *
     O                                      'PREVIOUS MONTH OF '
     O                                      'SALES RESULTS(MONTH)'
     O                                      ','
     O                                      'N MONTH UNOFFICIAL '
     O                                      'NOTIFICATION QUANTITY'
     O                                      '(MONTH)'
     O                                      ','
     O                                      'N+1 MONTH UNOFFICIAL '
     O                                      'NOTIFICATION QUANTITY'
     O                                      '(MONTH)'
     O                                      ','
     O                                      'N+2 MONTH UNOFFICIAL '
     O                                      'NOTIFICATION QUANTITY'
     O                                      '(MONTH)'
     O                                      ','
     O                                      'PROCESS SETTING '
     O                                      'QUANTITY(CURRENT MONTH)'
     O                                      ','
      *
     O                                      'PREVIOUS MONTH OF '
     O                                      'SALES RESULTS(SUNSHINE)'
     O                                      ','
     O                                      'N MONTH UNOFFICIAL '
     O                                      'NOTIFICATION QUANTITY'
     O                                      '(SUNSHINE)'
     O                                      ','
     O                                      'N+1 MONTH UNOFFICIAL '
     O                                      'NOTIFICATION QUANTITY'
     O                                      '(SUNSHINE)'
     O                                      ','
     O                                      'N+2 MONTH UNOFFICIAL '
     O                                      'NOTIFICATION QUANTITY'
     O                                      '(SUNSHINE)'
     O                                      ','
     O                                      'PROCESS SETTING '
     O                                      'QUANTITY(SUNSHINE)'
     O                                      ','
      *
     O                                      'BOX NUMBER PREVIOUS '
     O                                      'MONTH OF SALES'
     O                                      '(SUNSHINE)'
     O                                      ','
     O                                      'NUMBER OF N MONTH '
     O                                      'UNOFFICIAL NOTIFICATION '
     O                                      'BOXES(SUNSHINE)'
     O                                      ','
     O                                      'NUMBER OF N+1 MONTH '
     O                                      'UNOFFICIAL NOTIFICATION '
     O                                      'BOXES(SUNSHINE)'
     O                                      ','
     O                                      'NUMBER OF N+2 MONTH '
     O                                      'UNOFFICIAL NOTIFICATION '
     O                                      'BOXES(SUNSHINE)'
     O                                      ','
     O                                      'NUMBER OF PROCESS '
     O                                      'SETTING BOXES(SUNSHINE)'
     O                                      ','
      *
     O                                      'MECHANICAL NUMBER '
     O                                      'OF ROTATIONS'
     O                                      ','
     O                                      'OVERALL EQUIPMENT '
     O                                      'EFFICIENCY'
     O                                      ','
     O                                      'NUMBER OF TIME OF '
     O                                      'ARRANGEMENTS'
     O                                      ','
     O                                      'TIME OF '
     O                                      'ARRANGEMENTS'
     O                                      ','
      *
      *自工程かんばん情報
     O                                      'BOARD KIND'
     O                                      ','
     O                                      'BOARD KIND NAME'
     O                                      ','
     O                                      'ADDRESS IN THE PROCESS'
     O                                      ','
     O                                      'NUMBER OF ACCOMMODATION'
     O                                      ','
     O                                      'BOX KIND'
     O                                      ','
     O                                      'NUMBER OF LOT BOXES'
     O                                      ','
     O                                      'BOARD OF ROTATIONS IN '
     O                                      'THE PROCESS'
     O                                      ','
      *
      *部品情報
     O                                      'THE MATERIAL'
     O                                      ','
     O                                      'COMPLETION MATERIAL '
     O                                      'DIAMETER'
     O                                      ','
     O                                      'COMPLETION INDIVIDUAL '
     O                                      'WEIGHT'
     O                                      ','
     O                                      'MATERIAL INDIVIDUAL '
     O                                      'WEIGHT'
     O                                      ','
     O                                      'UNDER THE NECK'
     O                                      ','
     O                                      'BASE-METAL DIAMETER'
     O                                      ','
     O                                      'STRONG'
     O                                      ','
     O                                      'SCREW SIZE'
     O                                      ','
     O                                      'BOARD ATSUSHI'
     O                                      ','
     O                                      'NAME OF PRODUCT'
     O                                      ','
     O                                      'COMPOSITION STOCK '
     O                                      'NUMBER NO.1'
     O                                      ','
     O                                      'COMPOSITION STOCK '
     O                                      'NUMBER NO.2'
     O                                      ','
     O                                      'COMPOSITION STOCK '
     O                                      'NUMBER NO.3'
     O                                      ','
     O                                      'COMPOSITION STOCK '
     O                                      'NUMBER NO.4'
     O                                      ','
      *
      *ＥＤＭＩＣ情報
     O                                      'DRAWING KIND'
     O                                      ','
     O                                      'SCREW SIZE'
     O                                      ','
     O                                      'THE SHAPE NO.1'
     O                                      ','
     O                                      'THE SHAPE NAME NO.1'
     O                                      ','
     O                                      'THE SHAPE NO.2'
     O                                      ','
     O                                      'THE SHAPE NAME NO.2'
     O                                      ','
     O                                      'THE SHAPE NO.3'
     O                                      ','
     O                                      'THE SHAPE NAME NO.3'
     O                                      ','
     O                                      'THE SHAPE NO.4'
     O                                      ','
     O                                      'THE SHAPE NAME NO.4'
     O                                      ','
     O                                      'THE SHAPE NO.5'
     O                                      ','
     O                                      'THE SHAPE NAME NO.5'
     O                                      ','
     O                                      'THE SHAPE NO.6'
     O                                      ','
     O                                      'THE SHAPE NAME NO.6'
     O                                      ','
     O                                      'NECK SHIMONAGA.'
     O                                      ','
     O                                      'TREATING THE SURFACE'
     O                                      ','
     O                                      'STRONG'
     O                                      ','
     O                                      'THE MATERIAL'
     O                                      ','
     O                                      'HEAT-TREATMENT'
     O                                      ','
     O                                      'THE HEAD HEIGHT'
     O                                      ','
     O                                      '2 SIDE MARGIN'
     O                                      ','
     O                                      'DEVELOPED PRODUCT NAME'
     O                                      ','
     O                                      'THE SCREW PACE'
     O                                      ','
     O                                      'THE SEAT CUTSIDE '
     O                                      'DIAMETER'
     O                                      ','
     O                                      'THE SEAT THICKNESS'
     O                                      ','
     O                                      'THE AXIS DIAMETER'
     O                                      ','
     O                                      'SHAFT LENGTH'
      **
     O        E                DT
     O                                      '="'
     O                         W0KOTI
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         W0KI11
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         W0KINO
     O                                      '"'
     O                                      ','
      *
     O                                      '="'
     O                         W0KOTI
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         W0KI11
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         W0KINO
     O                                      '"'
     O                                      ','
      *
     O                                      '="'
     O                         W0KOJO
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WDHIN
     O                                      '"'
     O                                      ','
      *
     O                         W0JISU3
     O                                      ','
     O                         W0NJS03
     O                                      ','
     O                         W0NJS13
     O                                      ','
     O                         W0NJS23
     O                                      ','
     O                         W0KTSU3
     O                                      ','
      *
     O                         W0JHSU3
     O                                      ','
     O                         W0NHS03
     O                                      ','
     O                         W0NHS13
     O                                      ','
     O                         W0NHS23
     O                                      ','
     O                         W0KHSU3
     O                                      ','
      *
     O                         W0JIHS3
     O                                      ','
     O                         W0NJH03
     O                                      ','
     O                         W0NJH13
     O                                      ','
     O                         W0NJH23
     O                                      ','
     O                         W0KTHS3
     O                                      ','
      *
     O                         W0KITN3
     O                                      ','
     O                         W0SOUG3
     O                                      ','
     O                         W0DNKI3
     O                                      ','
     O                         W0DNTI3
     O                                      ','
      *
      *自工程かんばん情報
     O                                      '="'
     O                         W0KDAI
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKDAI
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         W0JTKR
     O                                      '"'
     O                                      ','
     O                         W0SYOS3
     O                                      ','
     O                                      '="'
     O                         W0SYOT
     O                                      '"'
     O                                      ','
     O                         W0LTSU3
     O                                      ','
     O                         W0KBKT3
     O                                      ','
      *
      *部品情報
     O                                      '="'
     O                         W0ZANM
     O                                      '"'
     O                                      ','
     O                         W0KAZI3
     O                                      ','
     O                         W0KASI3
     O                                      ','
     O                         W0SOZI3
     O                                      ','
     O                         W0KUBI3
     O                                      ','
     O                         W0SAIZ3
     O                                      ','
     O**                                    '="'
     O                         W0KIKI3
     O**                                    '"'
     O                                      ','
     O                         W0TUSZ3
     O                                      ','
     O                         W0ITAA3
     O                                      ','
     O                                      '="'
     O                         W0SMEI
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKHN1
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKHN2
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKHN3
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKHN4
     O                                      '"'
     O                                      ','
      *
      *ＥＤＭＩＣＳ情報
     O                                      '="'
     O                         WZUSU
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WSIZE
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WSHP1
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKJN1
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WSHP2
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKJN2
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WSHP3
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKJN3
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WSHP4
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKJN4
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WSHP5
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKJN5
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WSHP6
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKJN6
     O                                      '"'
     O                                      ','
     O                         WKUBI 3
     O                                      ','
     O                                      '="'
     O                         WHYMN
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WKODO
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WZAIS
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WNETU
     O                                      '"'
     O                                      ','
     O                         WHDSC 3
     O                                      ','
     O                         W2SDS 3
     O                                      ','
     O                                      '="'
     O                         WDVRP
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         WNJPT
     O                                      '"'
     O                                      ','
     O                         WZAGI 3
     O                                      ','
     O                         WZAAT 3
     O                                      ','
     O                         WJIKE 3
     O                                      ','
     O                         WJINA 3
      *
      *
** TK1､TN1
1BOLT SCREW
2NUT
3WASHER PIPE O E RING COLOR BUSH SPACER
4RIVET PIN
5RESIN
6INSERT RESIN COMPOUND ARTICLE
7PRESS PLATE
8VEHICLE DEPLOYMENT TOOL
9OTHERS PLUG BOSS SPRING BRAKES CAM
** TK2､TN2
1AHEXAGON
1BFLANGE (TAPER)
1CFLANGE (FLAT)
1DSTUD BOLT
1E12 POINT
1FKNURL
1GPAN (WITH THE SALIVA INCLUDE)
1HPLATE
1KBIND (THE SIDE TAPE AVAILABLE)
1MCHEESE HEAD (WITH THE SALIVA INCLUDE)
1NTRASS (THE SIDE THERE IS A STRAIGHT)
1QOVAL GOLD COIN SHAPE
1RFORM OF ROUND SHAPE
1USQUARE SHAPE
1VDISCHARGE
12U
1ZOTHERS
2AHEXAGON SHAPE
2BFLANGE (TAPER)
2CFLANGE (FLAT)
2E12-POINT
2FKNURL
2JCASTLE
2LTORQUE (E MODEL)
2USQUARE SHAPE
2RFORM OF ROUND SHAPE
2ZOTHERS
3ZOTHERS
4HPLATE
4RFORM OF ROUND SHAPE
4USQUARE SHAPE
43ANCHOR PIN
4ZOTHERS
5SGROMMET
5ZOTHERS
6ZOTHERS
7ZOTHERS
8TJACK
8WSPANNER
8XPLIERS
8YDRIVER
8ZOTHERS
9QOVAL GOLD COIN
9ZOTHERS
** TK3､TN3
1ADEIBU
1BLYCEES
1CFLAT
1DCROSS HOLE
1ETORQUE(E MODEL)
1FHEXAGON HOLE
1GMINUS
1HSERETO
1JWELDING
1MTORQUE (T MODEL)
1SROUND (SPHERICAL SURFACE I INCLUDE R SHAPE)
1T12-POINT
1QHUB
1ZOTHERS
2HSERETO
2JWELDING
2LCAP
2NAPSE
2QHUB
2RPIERCED EARRINGS (I INCLUDE PIERCED EARRINGS CASSETTE)
2SROUND
2ZOTHERS
3ZOTHERS
4JWELDING
4SROUND
4ZOTHERS
5ZOTHERS
6ZOTHERS
7ZOTHERS
8ZOTHERS
9ZOTHERS
** TK4､TN4
10UNAVAILABLE
11SUPACK
12FLAT (FLAT+FLAT)
13SUPACK+FLAT
14CORN(CORN+FLAT)
15RESIN RUBBER
16TOOTH IS WITH IT
17WASHER+COLOR
18SPRING
19SPRING+FLAT
1ZOTHERS
20UNAVAILABLE
21SUPACK
22FLAT
24CORN
26TOOTH IS WITH IT
28SPRING
2ZOTHERS
31SUPACK
32FLAT
34CORN
35RESIN RUBBER
36TOOTH IS WITH IT
38SPRING
3ZOTHERS
40UNAVAILABLE
45RESIN RUBBER
4ZOTHERS
5ZOTHERS
60UNAVAILABLE
6ZOTHERS
7ZOTHERS
8ZOTHERS
90UNAVAILABLE
9ZOTHERS
** TK5､TN5
11EFFECTIVE APERTURE ROLLING DIAMETER
12APPELLATION DIAMETER
13GROWTH
14BELONGING TO A STEP (BEARING SURFACE SIDE AT THE TIME OF TWO STEPS)
15CENTERING
16TAPPING PLUSRUTO
17BELONGING TO SERESHION
18BELONGING TO A RING
1ZOTHERS
2ACUT
2BLOCK (A CASTLE IS EXCLUDED)
2ZOTHERS
3ZOTHERS
44BELONGING TO A STEP
45CENTERING
47BELONGING TO SERESHION
49BELONGING TO A DITCH
4ZOTHERS
5ZOTHERS
6ZOTHERS
7ZOTHERS
8ZOTHERS
9ZOTHERS
** TK6､TN6
1AWILD POINT
1BCHAMFERING
1CFOR A PIECE OF LIMIT
1DFOR THREE POINTS OF LIMITS
1ESURUTO
1FEDGE
1GBAYONET POINT
1HBALL POINT
1JSTEP (STEP-THROUGH CARRIAGE BOLT)
1LSHARPENING POINT (TAPPING)
1MTAPER POINT (TAPPING)
1NNAVIGATOR IS TIGHT
1PET SCREW
1RTAP IS TIGHT
1SROLL POINT
1ZOTHERS
2TZAGURI
2ZOTHERS
3ZOTHERS
4AWILD POINT
4BCHAMFERING
4ZOTHERS
5ZOTHERS
6ZOTHERS
7ZOTHERS
8ZOTHERS
9ZOTHERS
** TK7､TN7
1SMALL PROCESS KANBAN
2SMALL PROCESS QUICK COOLING KANBAN
6HALF-FINISHED GOODS KANBAN
7HEAT-TREATMENT PLATING KANBAN
AKANBAN IN THE PROCESS
BQUICK COOLING
CPLATING KANBAN
DTUNNEL KANBAN
ETAKING CARE OF KANBAN
FINSTRUCTIONS KANBAN
