     H            Y.
      ** MYCR15 **********************************
      * 設備負荷グラフ機種情報データ作成『新』 *
      * 『新バージョン』                       *
      *  EXCEL CSV形式                         *
      *    I-HASADA                2017/12/15    *
      ********************************** MYCR15 **
     FMYCWP13YIP  F     100            DISK
     FMYCWP15 O   F     200            DISK
      *
     IMYCWP13YAA  01
     I                                        1   3 IKOTE
     I                                        4  13 IKKNO L1
     I                                       14  190IKAIT
     I                                       20  242IBRIT
     I                                       25  300IDNKI
     I                                       31  362IDNTI
      *
      ***
     C           *ENTRY    PLIST
     C                     PARM           PKTRT   1
      *
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C                     EXCPTHD
     C                     END
      *
     C           *INL1     IFEQ '1'
     C                     Z-ADD0         WRECD   50
     C                     Z-ADD0         WREC1   50
     C                     Z-ADD0         WREC2   50
     C                     Z-ADD0         WREC3   50
     C                     Z-ADD0         WREC4   50
     C                     Z-ADD0         WKAIT   90
     C                     Z-ADD0         WBRIT   82
     C                     Z-ADD0         WDNKI   90
     C                     Z-ADD0         WDNTI   92
     C                     END
      *
     C                     ADD  1         WRECD
      *
     C           IKAIT     IFNE 0
     C                     ADD  1         WREC1
     C                     ADD  IKAIT     WKAIT
     C                     END
      *
     C           IBRIT     IFNE 0
     C                     ADD  1         WREC2
     C                     ADD  IBRIT     WBRIT
     C                     END
      *
     C           IDNKI     IFNE 0
     C                     ADD  1         WREC3
     C                     ADD  IDNKI     WDNKI
     C                     END
      *
     C           IDNTI     IFNE 0
     C                     ADD  1         WREC4
     C                     ADD  IDNTI     WDNTI
     C                     END
      *
     CL1                   EXSR SUBR
      *
      ***
      ******************
      * サブルーチン *
      ******************
     C           SUBR      BEGSR
      *
     C                     Z-ADD0         TKAIT   60
     C                     Z-ADD0         TBRIT   52
     C                     Z-ADD0         TDNKI   60
     C                     Z-ADD0         TDNTI   62
      *
     C           WREC1     IFNE 0
     C           WKAIT     DIV  WREC1     TKAIT     H
     C                     END
      *
     C           WREC2     IFNE 0
     C           WBRIT     DIV  WREC2     TBRIT     H
     C                     END
      *
     C           WREC3     IFNE 0
     C           WDNKI     DIV  WREC3     TDNKI     H
     C                     END
      *
     C           WREC4     IFNE 0
     C           WDNTI     DIV  WREC4     TDNTI     H
     C                     END
      *
     C                     ENDSR
      *
      ***
     OMYCWP15 E                HD
     O                                      'EQUIPMENT LOAD '
     O                                      'CHART MODEL'
     O                                      '< NEW >'
     O                                      ','
     O                                      'NUMBER   OF ROTATIONS '
     O                                      'RATE CALCULATION'
     O                                      ','
     O                         PKTRT
      **
     O        E                HD
      **
     O        E                HD
     O                                      'THE MODEL'
     O                                      ','
     O                                      'MACHANICAL NUMBER OF '
     O                                      'ROTATIONS'
     O                                      ','
     O                                      'NUMBER OF TIMES OF '
     O                                      'ARRANGEMENTS'
     O                                      ','
     O                                      'TIME OF ARRANGEMENTS'
     O                                      ','
     O                                      'EQUIPMENT NUMBER'
      **
     O        T        L1
     O                                      '="'
     O                         IKKNO
     O                                      '"'
     O                                      ','
     O                         TKAIT 3
     O                                      ','
     O                         TDNKI 3
     O                                      ','
     O                         TDNTI 3
     O                                      ','
     O                         WRECD 3
