     H            Y.
      ** MYCR93 ******************************
      *  PLATING KANBAN MASTER DOWNLOAD      *
      *    I-HASADA            2019/10/08    *
      *-----------------------------------   *
      *  JW1   2023.03.13 ADD COLOR FIELD    *
      ****************************************
     FAAFTL01 IP  E           K        DISK
     FFCEPL01 IF  E           K        DISK
JW1  FABHPP40 IF  E           K        DISK
     FMYCWP93 O   F    1000            DISK
      *
     I            DS
     I                                        1   80A3UKHZ
     I                                        1   40A3UKYY
     I                                        5   60A3UKMM
     I                                        7   80A3UKDD
     I            DS
     I                                        1   80A3STHZ
     I                                        1   40A3STYY
     I                                        5   60A3STMM
     I                                        7   80A3STDD
      *
      ***
     C           KEY1      KLIST
     C                     KFLD           A31HB5
     C                     KFLD           A32HB5
     C                     KFLD           A33HB2
      *
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C                     TIME           WTIME   60
     C                     EXCPTHD
     C                     END
      *
     C           A3SKJY    IFEQ *BLANK
      *
     C                     SETOF                     50
     C           KEY1      CHAINFCEPL011             50
     C           *IN50     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C                     SETON                     50
     C                     END
     C           *IN50     IFEQ '0'
      *
     C           *DATE     IFGE A3UKHZ
     C           *DATE     ANDLTA3STHZ
      *
     C                     MOVE *BLANK    W3HB2   1
     C           A33HB2    IFNE *BLANK
     C                     MOVEL'-'       W3HB2
     C                     END
JW1   * COLOR
 .   C           A3HSYU    CHAINABHPP40              99
 .   C           *IN99     IFEQ *OFF
 .   C                     MOVELA4NAME    XCNAM  15
 .   C                     ELSE
 .   C                     MOVE *BLANK    XCNAM
JW1  C                     ENDIF
      *
     C                     EXCPTDT
     C                     END
     C                     END
     C                     END
      *
      ***
     OMYCWP93 E                HD
     O                                      'DATE:'
     O                         *DATE        '    /  /  '
     O                                      ','
     O                                      ','
     O                                      'TIME:'
     O                         WTIME        '  :  :  '
      *
     O        E                HD
      *
     O        E                HD
     O                                      'A31HB5'
     O                                      ','
     O                                      'A3ATK1'
     O                                      ','
     O                                      'A3UKHZ'
     O                                      ','
     O                                      'A3STHZ'
     O                                      ','
     O                                      'A3ATOK'
     O                                      ','
     O                                      'A3ATOB'
     O                                      ','
     O                                      'A3ATYP'
     O                                      ','
     O                                      'A3ATOH'
     O                                      ','
     O                                      'A3MAEK'
     O                                      ','
     O                                      'A3MAKB'
     O                                      ','
     O                                      'A3MTYP'
     O                                      ','
     O                                      'A3MAEH'
     O                                      ','
     O                                      'A3MTK1'
     O                                      ','
     O                                      'A3KCD1'
     O                                      ','
     O                                      'A3KCD2'
     O                                      ','
     O                                      'A3STI1'
     O                                      ','
     O                                      'A3JOK1'
     O                                      ','
     O                                      'A3JOK2'
     O                                      ','
     O                                      'A3JOK3'
     O                                      ','
     O                                      'A3JOK4'
     O                                      ','
     O                                      'A3JOK5'
     O                                      ','
     O                                      'A3JOK6'
     O                                      ','
     O                                      'A3YOSI'
     O                                      ','
     O                                      'A3MEKI'
     O                                      ','
     O                                      'A3CBKO'
     O                                      ','
     O                                      'A3MAXH'
     O                                      ','
     O                                      'A3SSYS'
     O                                      ','
     O                                      'A3SSYT'
     O                                      ','
     O                                      'A3BARA'
     O                                      ','
     O                                      'A3BARB'
     O                                      ','
     O                                      'A3RAIN'
     O                                      ','
     O                                      'A3LOTO'
     O                                      ','
     O                                      'A3READ'
     O                                      ','
     O                                      'A3KEIS'
     O                                      ','
     O                                      'A3KASI'
     O                                      ','
     O                                      'A3ZMEN'
     O                                      ','
     O                                      'A3KALL'
     O                                      ','
     O                                      'A3KAIS'
     O                                      ','
     O                                      'A3KMIN'
     O                                      ','
     O                                      'A3KMAX'
     O                                      ','
     O                                      'A3SRMS'
     O                                      ','
     O                                      'A3KTSU'
     O                                      ','
     O                                      'A3KSSU'
     O                                      ','
     O                                      'A3SHIY'
     O                                      ','
     O                                      'A3HINM'
     O                                      ','
     O                                      'A3AMXH'
     O                                      ','
JW1  O                                      'A3HSYU'
 .   O                                      ','
 .   O                                      'COLOR '
 .   O                                      ','
JW1  O                                      'PGM:MYCR93'
      *
     O        E                DT
     O                                      '="'
     O                         A31HB5
     O                                      '-'
     O                         A32HB5
     O                         W3HB2
     O                         A33HB2
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3ATK1
     O                                      '-'
     O                         A3ATK2
     O                                      '-'
     O                         A3ATK3
     O                                      '-'
     O                         A3ATK4
     O                                      '"'
     O                                      ','
     O                         A3UKHZ       '    /  /  '
     O                                      ','
     O                         A3STHZ       '    /  /  '
     O                                      ','
     O                                      '="'
     O                         A3ATOK
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3ATOB
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3ATYP
     O                                      '"'
     O                                      ','
     O                         A3ATOH4
     O                                      ','
     O                                      '="'
     O                         A3MAEK
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3MAKB
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3MTYP
     O                                      '"'
     O                                      ','
     O                         A3MAEH4
     O                                      ','
     O                                      '="'
     O                         A3MTK1
     O                                      '-'
     O                         A3MTK2
     O                                      '-'
     O                         A3MTK3
     O                                      '-'
     O                         A3MTK4
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3KCD1
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3KCD2
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3STI1
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3JOK1
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3JOK2
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3JOK3
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3JOK4
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3JOK5
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         A3JOK6
     O                                      '"'
     O                                      ','
     O                         A3YOSI4
     O                                      ','
     O                                      '="'
     O                         A3MEKI
     O                                      '"'
     O                                      ','
     O                         A3CBKO4
     O                                      ','
     O                         A3MAXH4
     O                                      ','
     O                         A3SSYS4
     O                                      ','
     O                                      '="'
     O                         A3SSYT
     O                                      '"'
     O                                      ','
     O                         A3BARA4
     O                                      ','
     O                         A3BARB4
     O                                      ','
     O                                      '="'
     O                         A3RAIN
     O                                      '"'
     O                                      ','
     O                         A3LOTO4
     O                                      ','
     O                         A3READ4
     O                                      ','
     O                         A3KEIS4
     O                                      ','
     O                         A3KASI4
     O                                      ','
     O                                      '="'
     O                         A3ZMEN
     O                                      '"'
     O                                      ','
     O                         A3KALL4
     O                                      ','
     O                         A3KAIS4
     O                                      ','
     O                         A3KMIN4
     O                                      ','
     O                         A3KMAX4
     O                                      ','
     O                         A3SRMS4
     O                                      ','
     O                         A3KTSU4
     O                                      ','
     O                         A3KSSU4
     O                                      ','
     O                         A3SHIY4
     O                                      ','
     O                                      '="'
     O                         A3HINM
     O                                      '"'
     O                                      ','
     O                         A3AMXH4
     O                                      ','
JW1  O                                      '="'
 .   O                         A3HSYU
 .   O                                      '"'
     O                                      ','
 .   O                                      '="'
 .   O                         XCNAM
JW1  O                                      '"'
