     H            Y.
      ** MYCR94 ********************
      * 工程マスター全データ作成 *
      *  I-HASADA      2019/10/08  *
      ******************** MYCR94 **
     FAAMPL11 IP  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FMYCWP94 O   F    1000            DISK
      *
     E                    HKT        15  3               工程
     E                    HBM        15  4 0             部門
     E                    HKI        15  3               機番
     E                    HMB        15  6               工程所番地
     E                    HDH        15 12               工程品番
     E                    HKD        15  1               かんばん種類大
     E                    HSU        15  9 0             工程設定数
      *
      *====================================
      * 社内かんばん切替えマスター旧工程
     E                    OKT        15  3               工程
     E                    OBM        15  4 0             部門
     E                    OKI        15  3               機番
     E                    OMB        15  6               工程所番地
     E                    ODH        15 12               工程品番
     E                    OKD        15  1               かんばん種類大
      *
      *====================================
      * 社内かんばん切替えマスター新工程
     E                    SKT        15  3               工程
     E                    SBM        15  4 0             部門
     E                    SKI        15  3               機番
     E                    SMB        15  6               工程所番地
     E                    SDH        15 12               工程品番
     E                    SKD        15  1               かんばん種類大
     E                    SSU        15  9 0             工程設定数
     E                    SUK        15 10 0             かんばん切替日
      *
      ***
     I            DS
     I                                        1  45 OKT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600OBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  45 OKI
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN00
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I            DS
     I                                        1  90 OMB
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1 180 ODH
     I                                        1  12 CKQH01
     I                                       13  24 CKQH02
     I                                       25  36 CKQH03
     I                                       37  48 CKQH04
     I                                       49  60 CKQH05
     I                                       61  72 CKQH06
     I                                       73  84 CKQH07
     I                                       85  96 CKQH08
     I                                       97 108 CKQH09
     I                                      109 120 CKQH10
     I                                      121 132 CKQH11
     I                                      133 144 CKQH12
     I                                      145 156 CKQH13
     I                                      157 168 CKQH14
     I                                      169 180 CKQH15
     I            DS
     I                                        1  15 OKD
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I            DS
     I                                        1  45 SKT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600SBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  45 SKI
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  90 SMB
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1 180 SDH
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1  15 SKD
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1 1350SSU
     I                                        1   90CKSU01
     I                                       10  180CKSU02
     I                                       19  270CKSU03
     I                                       28  360CKSU04
     I                                       37  450CKSU05
     I                                       46  540CKSU06
     I                                       55  630CKSU07
     I                                       64  720CKSU08
     I                                       73  810CKSU09
     I                                       82  900CKSU10
     I                                       91  990CKSU11
     I                                      100 1080CKSU12
     I                                      109 1170CKSU13
     I                                      118 1260CKSU14
     I                                      127 1350CKSU15
     I            DS
     I                                        1 1500SUK
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
      *
      ***
     C           KEY1      KLIST
     C                     KFLD           CKHIN1
     C                     KFLD           CKHIN2
     C                     KFLD           CKHIN3
      *
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C                     TIME           WTIME   60
     C                     EXCPTHD
     C                     END
      *
     C           CKSKJY    IFEQ *BLANK
      *
     C                     SETOF                     50
     C           KEY1      CHAINFCEPL011             50
     C           *IN50     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C                     SETON                     50
     C                     END
     C           *IN50     IFEQ '0'
      *
     C                     CLEARHKT
     C                     CLEARHBM
     C                     CLEARHKI
     C                     CLEARHMB
     C                     CLEARHDH
     C                     CLEARHKD
     C                     CLEARHSU
      *
     C                     Z-ADD50        Z       20
     C                     MOVEL'00000000'*IN,51
     C                     MOVEL'0000000' *IN,59
      *
     C                     Z-ADD0         Y       20
     C           1         DO   15        X       20
     C*                    MOVELSUK,X     WUKH    80
     C*          WUKH      IFGT *DATE
     C*          OKT,X     IFNE *BLANK
     C*                    ADD  1         Y
     C*                    ADD  1         Z
     C*                    MOVEL'1'       *IN,Z
     C*                    MOVELOKT,X     HKT,Y
     C*                    Z-ADDOBM,X     HBM,Y
     C*                    MOVELOKI,X     HKI,Y
     C*                    MOVELOMB,X     HMB,Y
     C*                    MOVELODH,X     HDH,Y
     C*                    MOVELOKD,X     HKD,Y
     C*                    Z-ADDSSU,X     HSU,Y
     C*                    END
     C*                    ELSE
      *
     C           SKT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     ADD  1         Z
     C                     MOVEL'1'       *IN,Z
     C                     MOVELSKT,X     HKT,Y
     C                     Z-ADDSBM,X     HBM,Y
     C                     MOVELSKI,X     HKI,Y
     C                     MOVELSMB,X     HMB,Y
     C                     MOVELSDH,X     HDH,Y
     C                     MOVELSKD,X     HKD,Y
     C                     Z-ADDSSU,X     HSU,Y
     C                     END
     C                     END
     C*                    END
      *
     C                     MOVE *BLANK    WHIN3   1
     C           CKHIN3    IFNE *BLANK
     C                     MOVEL'-'       WHIN3
     C                     END
      *
     C                     EXCPTDT
     C                     END
     C                     END
      *
      ***
     OMYCWP94 E                HD
     O                                      'DATE:'
     O                         *DATE        '    /  /  '
     O                                      ','
     O                                      ','
     O                                      'TIME:'
     O                         WTIME        '  :  :  '
      *
     O        E                HD
      *
     O        E                HD
     O                                      'CKHIN1'
     O                                      ','
     O                                      'HKT1'
     O                                      ','
     O                                      'HBM1'
     O                                      ','
     O                                      'HKI1'
     O                                      ','
     O                                      'HMB1'
     O                                      ','
     O                                      'HDH1'
     O                                      ','
     O                                      'HKD1'
     O                                      ','
     O                                      'HSU1'
     O                                      ','
     O                                      'HKT2'
     O                                      ','
     O                                      'HBM2'
     O                                      ','
     O                                      'HKI2'
     O                                      ','
     O                                      'HMB2'
     O                                      ','
     O                                      'HDH2'
     O                                      ','
     O                                      'HKD2'
     O                                      ','
     O                                      'HSU2'
     O                                      ','
     O                                      'HKT3'
     O                                      ','
     O                                      'HBM3'
     O                                      ','
     O                                      'HKI3'
     O                                      ','
     O                                      'HMB3'
     O                                      ','
     O                                      'HDH3'
     O                                      ','
     O                                      'HKD3'
     O                                      ','
     O                                      'HSU3'
     O                                      ','
     O                                      'HKT4'
     O                                      ','
     O                                      'HBM4'
     O                                      ','
     O                                      'HKI4'
     O                                      ','
     O                                      'HMB4'
     O                                      ','
     O                                      'HDH4'
     O                                      ','
     O                                      'HKD4'
     O                                      ','
     O                                      'HSU4'
     O                                      ','
     O                                      'HKT5'
     O                                      ','
     O                                      'HBM5'
     O                                      ','
     O                                      'HKI5'
     O                                      ','
     O                                      'HMB5'
     O                                      ','
     O                                      'HDH5'
     O                                      ','
     O                                      'HKD5'
     O                                      ','
     O                                      'HSU5'
     O                                      ','
     O                                      'HKT6'
     O                                      ','
     O                                      'HBM6'
     O                                      ','
     O                                      'HKI6'
     O                                      ','
     O                                      'HMB6'
     O                                      ','
     O                                      'HDH6'
     O                                      ','
     O                                      'HKD6'
     O                                      ','
     O                                      'HSU6'
     O                                      ','
     O                                      'HKT7'
     O                                      ','
     O                                      'HBM7'
     O                                      ','
     O                                      'HKI7'
     O                                      ','
     O                                      'HMB7'
     O                                      ','
     O                                      'HDH7'
     O                                      ','
     O                                      'HKD7'
     O                                      ','
     O                                      'HSU7'
     O                                      ','
     O                                      'HKT8'
     O                                      ','
     O                                      'HBM8'
     O                                      ','
     O                                      'HKI8'
     O                                      ','
     O                                      'HMB8'
     O                                      ','
     O                                      'HDH8'
     O                                      ','
     O                                      'HKD8'
     O                                      ','
     O                                      'HSU8'
     O                                      ','
     O                                      'HKT9'
     O                                      ','
     O                                      'HBM9'
     O                                      ','
     O                                      'HKI9'
     O                                      ','
     O                                      'HMB9'
     O                                      ','
     O                                      'HDH9'
     O                                      ','
     O                                      'HKD9'
     O                                      ','
     O                                      'HSU9'
     O                                      ','
     O                                      'HKT10'
     O                                      ','
     O                                      'HBM10'
     O                                      ','
     O                                      'HKI10'
     O                                      ','
     O                                      'HMB10'
     O                                      ','
     O                                      'HDH10'
     O                                      ','
     O                                      'HKD10'
     O                                      ','
     O                                      'HSU10'
     O                                      ','
     O                                      'HKT11'
     O                                      ','
     O                                      'HBM11'
     O                                      ','
     O                                      'HKI11'
     O                                      ','
     O                                      'HMB11'
     O                                      ','
     O                                      'HDH11'
     O                                      ','
     O                                      'HKD11'
     O                                      ','
     O                                      'HSU11'
     O                                      ','
     O                                      'HKT12'
     O                                      ','
     O                                      'HBM12'
     O                                      ','
     O                                      'HKI12'
     O                                      ','
     O                                      'HMB12'
     O                                      ','
     O                                      'HDH12'
     O                                      ','
     O                                      'HKD12'
     O                                      ','
     O                                      'HSU12'
     O                                      ','
     O                                      'HKT13'
     O                                      ','
     O                                      'HBM13'
     O                                      ','
     O                                      'HKI13'
     O                                      ','
     O                                      'HMB13'
     O                                      ','
     O                                      'HDH13'
     O                                      ','
     O                                      'HKD13'
     O                                      ','
     O                                      'HSU13'
     O                                      ','
     O                                      'HKT14'
     O                                      ','
     O                                      'HBM14'
     O                                      ','
     O                                      'HKI14'
     O                                      ','
     O                                      'HMB14'
     O                                      ','
     O                                      'HDH14'
     O                                      ','
     O                                      'HKD14'
     O                                      ','
     O                                      'HSU14'
     O                                      ','
     O                                      'HKT15'
     O                                      ','
     O                                      'HBM15'
     O                                      ','
     O                                      'HKI15'
     O                                      ','
     O                                      'HMB15'
     O                                      ','
     O                                      'HDH15'
     O                                      ','
     O                                      'HKD15'
     O                                      ','
     O                                      'HSU15'
      *
     O        E                DT
     O                                      '="'
     O                         CKHIN1
     O                                      '-'
     O                         CKHIN2
     O                         WHIN3
     O                         CKHIN3
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKT,1
     O                                      '"'
     O                                      ','
     O                 51                   '="'
     O                 51      HBM,1
     O                 51                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,1
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,1
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,1
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,1
     O                                      '"'
     O                                      ','
     O                         HSU,1 4
     O                                      ','
     O                                      '="'
     O                         HKT,2
     O                                      '"'
     O                                      ','
     O                 52                   '="'
     O                 52      HBM,2
     O                 52                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,2
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,2
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,2
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,2
     O                                      '"'
     O                                      ','
     O                         HSU,2 4
     O                                      ','
     O                                      '="'
     O                         HKT,3
     O                                      '"'
     O                                      ','
     O                 53                   '="'
     O                 53      HBM,3
     O                 53                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,3
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,3
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,3
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,3
     O                                      '"'
     O                                      ','
     O                         HSU,3 4
     O                                      ','
     O                                      '="'
     O                         HKT,4
     O                                      '"'
     O                                      ','
     O                 54                   '="'
     O                 54      HBM,4
     O                 54                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,4
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,4
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,4
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,4
     O                                      '"'
     O                                      ','
     O                         HSU,4 4
     O                                      ','
     O                                      '="'
     O                         HKT,5
     O                                      '"'
     O                                      ','
     O                 55                   '="'
     O                 55      HBM,5
     O                 55                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,5
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,5
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,5
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,5
     O                                      '"'
     O                                      ','
     O                         HSU,5 4
     O                                      ','
     O                                      '="'
     O                         HKT,6
     O                                      '"'
     O                                      ','
     O                 56                   '="'
     O                 56      HBM,6
     O                 56                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,6
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,6
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,6
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,6
     O                                      '"'
     O                                      ','
     O                         HSU,6 4
     O                                      ','
     O                                      '="'
     O                         HKT,7
     O                                      '"'
     O                                      ','
     O                 57                   '="'
     O                 57      HBM,7
     O                 57                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,7
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,7
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,7
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,7
     O                                      '"'
     O                                      ','
     O                         HSU,7 4
     O                                      ','
     O                                      '="'
     O                         HKT,8
     O                                      '"'
     O                                      ','
     O                 58                   '="'
     O                 58      HBM,8
     O                 58                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,8
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,8
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,8
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,8
     O                                      '"'
     O                                      ','
     O                         HSU,8 4
     O                                      ','
     O                                      '="'
     O                         HKT,9
     O                                      '"'
     O                                      ','
     O                 59                   '="'
     O                 59      HBM,9
     O                 59                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,9
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,9
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,9
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,9
     O                                      '"'
     O                                      ','
     O                         HSU,9 4
     O                                      ','
     O                                      '="'
     O                         HKT,10
     O                                      '"'
     O                                      ','
     O                 60                   '="'
     O                 60      HBM,10
     O                 60                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,10
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,10
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,10
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,10
     O                                      '"'
     O                                      ','
     O                         HSU,104
     O                                      ','
     O                                      '="'
     O                         HKT,11
     O                                      '"'
     O                                      ','
     O                 61                   '="'
     O                 61      HBM,11
     O                 61                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,11
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,11
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,11
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,11
     O                                      '"'
     O                                      ','
     O                         HSU,114
     O                                      ','
     O                                      '="'
     O                         HKT,12
     O                                      '"'
     O                                      ','
     O                 62                   '="'
     O                 62      HBM,12
     O                 62                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,12
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,12
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,12
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,12
     O                                      '"'
     O                                      ','
     O                         HSU,124
     O                                      ','
     O                                      '="'
     O                         HKT,13
     O                                      '"'
     O                                      ','
     O                 63                   '="'
     O                 63      HBM,13
     O                 63                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,13
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,13
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,13
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,13
     O                                      '"'
     O                                      ','
     O                         HSU,134
     O                                      ','
     O                                      '="'
     O                         HKT,14
     O                                      '"'
     O                                      ','
     O                 64                   '="'
     O                 64      HBM,14
     O                 64                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,14
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,14
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,14
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,14
     O                                      '"'
     O                                      ','
     O                         HSU,144
     O                                      ','
     O                                      '="'
     O                         HKT,15
     O                                      '"'
     O                                      ','
     O                 65                   '="'
     O                 65      HBM,15
     O                 65                   '"'
     O                                      ','
     O                                      '="'
     O                         HKI,15
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HMB,15
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HDH,15
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         HKD,15
     O                                      '"'
     O                                      ','
     O                         HSU,154
