     H            Y.
     F** MZARSB ********************************************
     F* 部門・工程・機番から機械形式番号を取得           *
     F*  GET MACHINE FORM# BY DEPT/PROCESS/MACHINE         *
     F*      T.SAKASHITA                   2010.10.01      *
     F******************************************** *********
     F*MZAPL27 IF  E           K        DISK
12/18FMFAPL25 IF  E           K        DISK
      * MZAPP20
12/18 * MFAPP21
      *削除予定日
     I            DS
     I                                        1   80M@DEHZ
     I                                        1   40M@SKYY
     I                                        5   60M@SKMM
     I                                        7   80M@SKDD
      *
     C           *ENTRY    PLIST
     C                     PARM           P@BMON  40
     C                     PARM           P@KOTE  3
     C                     PARM           P@KIBN  3
     C                     PARM           P@KKNO 10
      *
     C                     MOVE P@BMON    K@BMON  40
     C                     MOVE P@KIBN    K@KIBN  3
     C                     MOVE P@KOTE    K@KOTE  3
      *
     C           MZAKEY    KLIST
     C                     KFLD           K@BMON
     C                     KFLD           K@KIBN
     C                     KFLD           K@KOTE
      *
     C           MZAKEY    SETLLMFAPL25
     C                     DO   *HIVAL
     C           MZAKEY    READEMFAPL25                  55
     C   55                LEAVE
      *
     C           M@SKJY    IFEQ 'D'
     C           M@DEHZ    ANDLE*DATE
     C                     ITER
     C                     END
      *
     C           M@JTKB    IFEQ '1'
     C                     MOVE M@KEIS    P@KKNO
     C                     LEAVE
     C                     END
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
