     H            Y.
     F** NBGR11 **************************************
     F* ..CREATE OF PURCHASE OLD DIE, AND DIE UP RESULT ACCUMULATION DATA ..*
     F* I-HASADA                      92.05.25       *
     F************************************** NBGR11 **
     FNBGPP01 IP  E                    DISK
     FNBGPL11 UF  E           K        DISK                      A
     FAB#PL03 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     E                    HSJ        12  9 0             社内品番実績数
     E                    HKJ        12  9 0             構成品番実績数
     E                    SU         12  9 0              1-12出荷数量
     I            DS
     I                                        1   80NGSKHZ
     I                                        1   40NGSKYY
     I                                        5   60NGSKMM
     I                                        7   80NGSKDD
     I            DS
     I                                        1   80NGKAHZ
     I                                        3   60NGKAYM
     I                                        1   40NGKAYY
     I                                        5   60NGKAMM
     I                                        7   80NGKADD
     I            DS
     I                                        1   80NHSKHZ
     I                                        1   40NHSKYY
     I                                        5   60NHSKMM
     I                                        7   80NHSKDD
     I            DS
     I                                        1   80NHKOHZ
     I                                        1   40NHKOYY
     I                                        5   60NHKOMM
     I                                        7   80NHKODD
     I            DS
     I                                        1   60NHTIME
     I                                        1   20NHKOHH
     I                                        3   40NHKOSS
     I            DS
     I                                        1   80B1SKHZ
     I                                        1   40B1SKYY
     I                                        5   60B1SKMM
     I                                        7   80B1SKDD
     I            DS
     I                                        1   80B1NOHZ
     I                                        3   60B1NOYM
     I                                        1   40B1NOYY
     I                                        5   60B1NOMM
     I                                        7   80B1NODD
     I            DS
     I                                        1 1080HSJ
     I                                        1   90NHSJ01
     I                                       10  180NHSJ02
     I                                       19  270NHSJ03
     I                                       28  360NHSJ04
     I                                       37  450NHSJ05
     I                                       46  540NHSJ06
     I                                       55  630NHSJ07
     I                                       64  720NHSJ08
     I                                       73  810NHSJ09
     I                                       82  900NHSJ10
     I                                       91  990NHSJ11
     I                                      100 1080NHSJ12
     I            DS
     I                                        1 1080HKJ
     I                                        1   90NHKJ01
     I                                       10  180NHKJ02
     I                                       19  270NHKJ03
     I                                       28  360NHKJ04
     I                                       37  450NHKJ05
     I                                       46  540NHKJ06
     I                                       55  630NHKJ07
     I                                       64  720NHKJ08
     I                                       73  810NHKJ09
     I                                       82  900NHKJ10
     I                                       91  990NHKJ11
     I                                      100 1080NHKJ12
     I            DS
     I                                        1 1080SU
     I                                        1   90I6SRO1
     I                                       10  180I6SRO2
     I                                       19  270I6SRO3
     I                                       28  360I6SRO4
     I                                       37  450I6SRO5
     I                                       46  540I6SRO6
     I                                       55  630I6SRO7
     I                                       64  720I6SRO8
     I                                       73  810I6SRO9
     I                                       82  900I6SROA
     I                                       91  990I6SROB
     I                                      100 1080I6SROC
     I            DS
     I                                        1   80@YMD
     I                                        1   40@YY
     I                                        5   80@MD
     I                                        5   60@MM
     I                                        7   80@DD
     I            DS
     I                                        1   60UYM
     I                                        1   40UYY
     C           KEY       KLIST
     C                     KFLD           NGKONY
     C                     KFLD           NGSHN1
     C                     KFLD           NGSHN2
     C                     KFLD           NGSHN3
     C                     KFLD           NGKHN1
     C                     KFLD           NGKHN2
     C                     KFLD           NGKHN3
     C                     KFLD           @YY
      *
     C           KEY1      KLIST
     C                     KFLD           NGSHN1
     C                     KFLD           NGSHN2
     C                     KFLD           NGSHN3
      *
     C           KEY2      KLIST
     C                     KFLD           @YY
     C                     KFLD           NGSHN1
     C                     KFLD           NGSHN2
     C                     KFLD           NGSHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
     C                     PARM           PYM     6
     C                     MOVE PYM       UYM
      *
     C           NGSKJY    IFEQ 'D'
     C           NGSKHZ    ANDLE*DATE
     C                     GOTO END
     C                     END
     C           NGKAHZ    IFEQ 0
     C                     GOTO END
     C                     END
     C           NGKAYM    IFGT UYM
     C                     GOTO END
     C                     END
      *
     C                     SETOF                     90
     C                     Z-ADDNGKAHZ    @YMD
      *
     C                     DO   *HIVAL
     C                     SETOF                     1091
      *
     C           *IN90     IFEQ '1'
     C                     ADD  1         @YY
     C                     Z-ADD0101      @MD
     C                     END
     C                     SETON                     90
      *
     C           @YY       IFGT UYY
     C                     SETON                     10
     C                     ELSE
      *
     C                     SETOF                     50
     C           KEY       CHAINNBGPL111             50
     C           *IN50     IFEQ '1'
     C                     Z-ADD0         HSJ
     C                     Z-ADD0         HKJ
     C                     END
      *
      *
     C                     Z-ADD@MM       A       20
     C                     Z-ADD1         B       20
     C           A         DO   12        B
      *
     C           NGKAYY    IFEQ @YY
     C           NGKAMM    ANDEQB
     C           NGKADD    ANDGT01
      *
     C           *IN50     IFEQ '1'
     C           KEY1      SETLLAB#PL031
     C                     DO   *HIVAL
     C                     SETOF                     30
     C           KEY1      READEAB#PL031                 30
     C           *IN30     IFEQ '0'
     C           B1SKJY    IFEQ 'D'
     C           B1SKHZ    ANDLE*DATE
     C                     ELSE
     C           B1NOYM    IFEQ NGKAYM
     C           B1NOHZ    ANDGENGKAHZ
     C                     ADD  B1SRYO    HSJ,B
     C                     END
     C                     END
     C                     END
     C  N30                END
     C                     END
     C                     ELSE
      *
     C           *IN91     IFEQ '0'
     C                     SETON                     91
     C                     SETOF                     31
     C           KEY2      CHAINMBEPL051             31
     C                     END
     C           *IN31     IFEQ '0'
     C                     Z-ADDSU,B      HSJ,B
     C                     END
     C                     END
     C                     END
      *
     C                     MOVE *BLANK    NHSKJY
     C                     Z-ADD0         NHSKHZ
     C                     Z-ADD*DATE     NHKOHZ
     C                     TIME           NHTIME
     C                     MOVELPUS       NHKOME
     C                     Z-ADDNGKONY    NHKONY
     C                     MOVE NGSHN1    NHSHN1
     C                     MOVE NGSHN2    NHSHN2
     C                     MOVE NGSHN3    NHSHN3
     C                     MOVE NGKHN1    NHKHN1
     C                     MOVE NGKHN2    NHKHN2
     C                     MOVE NGKHN3    NHKHN3
     C                     Z-ADDNGKAYY    NHKAYY
     C                     Z-ADDNGKAMM    NHKAMM
     C                     Z-ADDNGKADD    NHKADD
     C                     Z-ADD@YY       NHSJYY
     C                     Z-ADD0         NHKJYY
      *
     C           *IN50     IFEQ '0'
     C                     UPDATNBGPL111
     C                     ELSE
     C                     WRITENBGPL111
     C                     END
      *
     C                     END
     C  N10                END
      *
     C           END       TAG
