     H*
     F** NSUR69 ************************
     F* INQUIRY  OF INVENTORY COUNTING ACCUMULATION FILE
     F* A.IDOTA 1990.01.28 *
     F************************ NSUR69 **
     FNSUPW69 CF  E                    WORKSTN
     FNSUNL68 IF  E           K        DISK
     E                    BM         15  4               部門
     E                    KT         15  3               工程
     E                    TR         15  9               所番地
     E                    SY         15  5 0             収容数
     E                    HK         15  3 0             箱数
     E                    ER      1   2 60
      * 部門 *
     I            DS
     I                                        1  60 BM
     I                                        1   4 BM01
     I                                        5   8 BM02
     I                                        9  12 BM03
     I                                       13  16 BM04
     I                                       17  20 BM05
     I                                       21  24 BM06
     I                                       25  28 BM07
     I                                       29  32 BM08
     I                                       33  36 BM09
     I                                       37  40 BM10
     I                                       41  44 BM11
     I                                       45  48 BM12
     I                                       49  52 BM13
     I                                       53  56 BM14
     I                                       57  60 BM15
      * 工程 *
     I            DS
     I                                        1  45 KT
     I                                        1   3 KT01
     I                                        4   6 KT02
     I                                        7   9 KT03
     I                                       10  12 KT04
     I                                       13  15 KT05
     I                                       16  18 KT06
     I                                       19  21 KT07
     I                                       22  24 KT08
     I                                       25  27 KT09
     I                                       28  30 KT10
     I                                       31  33 KT11
     I                                       34  36 KT12
     I                                       37  39 KT13
     I                                       40  42 KT14
     I                                       43  45 KT15
      * 所番地 *
     I            DS
     I                                        1 135 TR
     I                                        1   9 TR01
     I                                       10  18 TR02
     I                                       19  27 TR03
     I                                       28  36 TR04
     I                                       37  45 TR05
     I                                       46  54 TR06
     I                                       55  63 TR07
     I                                       64  72 TR08
     I                                       73  81 TR09
     I                                       82  90 TR10
     I                                       91  99 TR11
     I                                      100 108 TR12
     I                                      109 117 TR13
     I                                      118 126 TR14
     I                                      127 135 TR15
      * 収容数 *
     I            DS
     I                                        1  750SY
     I                                        1   50SY01
     I                                        6  100SY02
     I                                       11  150SY03
     I                                       16  200SY04
     I                                       21  250SY05
     I                                       26  300SY06
     I                                       31  350SY07
     I                                       36  400SY08
     I                                       41  450SY09
     I                                       46  500SY10
     I                                       51  550SY11
     I                                       56  600SY12
     I                                       61  650SY13
     I                                       66  700SY14
     I                                       71  750SY15
      * 箱数 *
     I            DS
     I                                        1  450HK
     I                                        1   30HK01
     I                                        4   60HK02
     I                                        7   90HK03
     I                                       10  120HK04
     I                                       13  150HK05
     I                                       16  180HK06
     I                                       19  210HK07
     I                                       22  240HK08
     I                                       25  270HK09
     I                                       28  300HK10
     I                                       31  330HK11
     I                                       34  360HK12
     I                                       37  390HK13
     I                                       40  420HK14
     I                                       43  450HK15
      * 品番 *
     I            DS
     I                                        1  12 HIN
     I                                        1   5 HIN1
     I                                        6  10 HIN2
     I                                       11  12 HIN3
     I            DS
     I                                        1  14 HNB
     I                                        1   5 HINA
     I                                        6   6 HI1
     I                                        7  11 HINB
     I                                       12  12 HI2
     I                                       13  14 HINC
      * 所番地 *
     I            DS
     I                                        1   6 NSTOKR
     I                                        1   1 TKR1
     I                                        2   3 TKR2
     I                                        4   5 TKR3
     I                                        6   6 TKR4
     I            DS
     I                                        1   9 MTKR
     I                                        1   1 TKRA
     I                                        2   2 HI3
     I                                        3   4 TKRB
     I                                        5   5 HI4
     I                                        6   7 TKRC
     I                                        8   8 HI5
     I                                        9   9 TKRD
      ************
      * 画面１ *
      ************
     C           STP00     TAG
     C                     MOVE *BLANK    HIN
     C                     SETOF                     99
      *
     C           STP10     TAG
     C                     EXFMTNSUPW691
     C                     SETOF                     99
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           HIN       IFEQ *BLANK
     C                     MOVE ER,1      MSG
     C                     SETON                     99
     C                     GOTO STP10
     C                     END
      *
     C                     SETOF                     30
     C           HIN       CHAINNSUNL681             30
     C           *IN30     IFEQ '1'
     C                     MOVE ER,2      MSG
     C                     SETON                     99
     C                     GOTO STP10
     C                     END
      ************
      * 画面２ *
      ************
     C                     MOVEA'00000000'*IN,10
     C                     MOVEA'0000000' *IN,18
     C                     SETOF                     99
     C                     MOVE *BLANK    HNB
     C                     MOVE *BLANK    BM
     C                     MOVE *BLANK    KT
     C                     MOVE *BLANK    TR
     C                     MOVE *BLANK    HI1
     C                     MOVE *BLANK    HI2
     C                     Z-ADD0         SY
     C                     Z-ADD0         HK
      *
     C                     MOVE HIN1      HINA
     C                     MOVE HIN2      HINB
     C                     MOVE HIN3      HINC
     C                     MOVE '-'       HI1
     C           HINC      IFNE *BLANK
     C                     MOVE '-'       HI2
     C                     END
      *
     C                     Z-ADD1         A       20
     C                     SETOF                     30
     C           HIN       SETLLNSUNL681
      *
     C           1         DO   15        A
     C           HIN       READENSUNL681                 30
     C           *IN30     IFEQ '0'
     C           A         ADD  9         C       20
     C                     MOVEA'1'       *IN,C
     C                     MOVE NSBMON    BM,A
     C                     MOVE NSKOTI    KT,A
     C                     MOVE *BLANK    MTKR
     C                     MOVE *BLANK    HI3
     C                     MOVE *BLANK    HI4
     C                     MOVE *BLANK    HI5
     C                     MOVE TKR1      TKRA
     C                     MOVE TKR2      TKRB
     C                     MOVE TKR3      TKRC
     C                     MOVE TKR4      TKRD
     C           TKRB      IFNE *BLANK
     C                     MOVE '-'       HI3
     C                     END
     C           TKRC      IFNE *BLANK
     C                     MOVE '-'       HI4
     C                     END
     C           TKRD      IFNE *BLANK
     C                     MOVE '-'       HI5
     C                     END
     C                     MOVE MTKR      TR,A
     C                     Z-ADDNSSYOS    SY,A
     C                     Z-ADDNSHAKS    HK,A
     C                     END
     C  N30                END
      *
     C           STP20     TAG
     C                     EXFMTNSUPW692
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C           *INKC     IFEQ '1'
     C                     GOTO STP00
     C                     END
     C                     GOTO STP20
**
E-01 INPUT PART NO
E-02 THERE IS NOT THIS PART NO  IN A FILE.
