     H            Y.
     FNZUPL04 IF  E           K        DISK
     FNZUWPS1 O   F     256            DISK
      *
     C           KEY       KLIST
     C                     KFLD           N2HAHZ
      *
     C                     Z-ADD20220720  N2HAHZ
      *
     C                     EXCPTOHED
      *
     C           KEY       SETLLNZUPL04
     C                     DO   *HIVAL
     C           KEY       READENZUPL04                  77
     C* * *                READ NZUPL04                  77
     C   77                LEAVE
      *
     C                     CALL 'BARR83'
     C                     PARM           N2KANR
     C                     PARM           N2SZET
     C                     PARM           N2STHI
     C                     PARM           N2SPAG
     C                     PARM           N2NIJI
     C                     PARM           N2TAIS
     C                     PARM           N2SYKO
     C                     PARM           N2HKSY
     C                     PARM           N2CHKD
     C                     PARM           P#BAR  20
      *
     C                     CALL 'AAMRSK'
     C                     PARM P#BAR     PZBARC 20
     C                     PARM 'JC '     PZKOTE  3
     C                     PARM '0111'    PZBMON  4
     C                     PARM *BLANK    PZKIBN  3
     C                     PARM *BLANK    PZRTN   1
      *
     C                     CALL 'AAMRSK'
     C                     PARM P#BAR     PZBARC 20
     C                     PARM 'KRO'     PZKOTE  3
     C                     PARM '0111'    PZBMON  4
     C                     PARM *BLANK    PZKIBN  3
     C                     PARM *BLANK    PZRTN2  1
      *
     C                     CALL 'AAMRSM'
     C                     PARM P#BAR     PZBARC 20
     C                     PARM *BLANK    PZKOTE  3
     C                     PARM '0111'    PZBMON  4
     C                     PARM 'JC*'     PZKIBN  3
     C                     PARM *BLANK    PZRTN3  1
      *
     C                     CALL 'AJHRS1'
     C                     PARM           P#BAR  20
     C                     PARM           P#RTN   1
      *
     C                     PARM           P#WINY  40
     C                     PARM           P#WINM  20
     C                     PARM           P#WIND  20
     C                     PARM           P#WINJ  20
     C                     PARM           P#WINF  20
     C                     PARM           P#WMJY  20
     C                     PARM           P#MKKB  2
      *
     C                     EXCPTODAT
      *
     C                     ADD  1         @KEN    80
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
     ONZUWPS1 E                OHED
     O                                      'PRINT DATE-BIN,'
     O                                      'PART NO.,'
     O                                      'BARCODE,'
     O                                      'MY PROC.,'
     O                                      'MY SECT.,'
     O                                      'MY LOCA.,'
     O                                      'PRV. PROC.,'
     O                                      'PRV. SECT.,'
     O                                      'PRV. LOCA.,'
     O                                      '0111-JC,'
     O                                      '0111-KRO,'
     O                                      '0111-JC*,'
     O        E                ODAT
     O                         N2HAHZ
     O                                      '-'
     O                         N2HABB
     O                                      ','
     O                         N2SHN1
     O                         N2SHN2
     O                         N2SHN3
     O                                      ','
     O                         P#BAR
     O                                      ','
     O                         N2JKOT
     O                                      ','
     O                         N2JBMN
     O                                      ','
     O                         N2JTK1
     O                                      '-'
     O                         N2JTK2
     O                                      '-'
     O                         N2JTK3
     O                                      '-'
     O                         N2JTK4
     O                                      ','
     O                         N2MKOT
     O                                      ','
     O                         N2MBMN
     O                                      ','
     O                         N2MTK1
     O                                      '-'
     O                         N2MTK2
     O                                      '-'
     O                         N2MTK3
     O                                      '-'
     O                         N2MTK4
     O                                      ','
     O                         P#WINY
     O                                      '/'
     O                         P#WINM
     O                                      '/'
     O                         P#WIND
     O                                      ','
     O                         P#WINJ
     O                                      ':'
     O                         P#WINF
     O                                      ':'
     O                         P#WMJY
     O                                      ','
     O                         P#MKKB
     O                                      ','
     O                         N2NYHZ
     O                                      ','
     O                         N2NYTI
     O                                      ','
     O                         N2DEHZ
     O                                      ','
     O                         N2DETI
     O                                      ','
     O                         PZRTN
     O                                      ','
     O                         PZRTN2
     O                                      ','
     O                         PZRTN3
