     H            Y.
     F*** OAAR35 ***********************************************
     F*  BIN (RG)ﾃｰnﾞ UPDATE OF NAME M/F                       *
     F*    <OUT GOING ORDER BUSINESS>                          *
     F*           H.ITO                90.10.08                *
     F*********************************************** OAAR35 ***
     FOAAPW35 CF  E                    WORKSTN
     FOAAPL35 UF  E           K        DISK                      A
     FOAAPL21 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     E                    KOCD    1   3  1   KONM    8   UPDATE INSTRUCT
     E                    ER      1  13 60               ERROR MESSAGE
     I            DS
     I                                        1   80R8SKHZ
     I                                        1   40R8SKYY
     I                                        5   60R8SKMM
     I                                        7   80R8SKDD
     I            DS
     I                                        1   80R8KOHZ
     I                                        1   40R8KOYY
     I                                        5   60R8KOMM
     I                                        7   80R8KODD
     I            DS
     I                                        1   60WTIME
     I                                        1   20R8KOHH
     I                                        3   40R8KOSS
     C           *ENTRY    PLIST
     C                     PARM           PARM1  10        USER NAME
     C                     Z-ADD0         R5SKHZ
     C*
     C* fﾞx]-1
     C*
     C           @SCR1     TAG
     C                     EXFMTOAAPW351
     C                     SETOF                     020399
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* ﾃcﾆ]hﾎﾞ]
     C*
     C                     MOVE *BLANK    @KONM   8
     C                     SETOF                     20
     C                     Z-ADD1         A       10
     C           @KOSN     LOKUPKOCD,A                   20
     C           *IN20     IFEQ '0'
     C                     SETON                     0299
     C                     MOVELER,01     MSG
     C                     GOTO @SCR1
     C                     END
     C                     MOVELKONM,A    @KONM
     C*
     C* RGﾃｰnﾞ
     C*
     C           @RGCD     IFEQ *BLANK
     C                     SETON                     0399
     C                     MOVELER,02     MSG
     C                     GOTO @SCR1
     C                     END
     C                     SETOF                     31
     C           @RGCD     CHAINOAAPL211             31
     C           *IN31     IFEQ '0'
     C           R5SKJY    ANDEQ'D'
     C           R5SKHZ    ANDLE*DATE
     C                     SETON                     31
     C                     END
     C           *IN31     IFEQ '1'
     C                     SETON                     0399
     C                     MOVELER,03     MSG
     C                     GOTO @SCR1
     C                     END
     C*
     C* lbf
     C*
     C                     SETOF                     30
     C           @RGCD     CHAINOAAPL351             30
     C           @KOSN     IFEQ '2'
     C           *IN30     IFEQ '0'
     C           R8SKJY    IFEQ 'D'
     C           R8SKHZ    ANDLE*DATE
     C                     GOTO @001
     C                     END
     C                     SETON                     020399
     C                     MOVELER,04     MSG
     C                     GOTO @SCR1
     C                     END
     C                     END
     C*
     C* s]ﾃc
     C*
     C           @KOSN     IFEQ '1'
     C           *IN30     IFEQ '1'
     C                     SETON                     020399
     C                     MOVELER,05     MSG
     C                     GOTO @SCR1
     C                     END
     C           R8SKJY    IFEQ 'D'
     C           R8SKHZ    ANDLE*DATE
     C                     SETON                     020399
     C                     MOVELER,06     MSG
     C                     GOTO @SCR1
     C                     END
     C                     END
     C*
     C* nﾒiﾆ
     C*
     C           @KOSN     IFEQ '0'
     C           *IN30     IFEQ '1'
     C                     SETON                     020399
     C                     MOVELER,07     MSG
     C                     GOTO @SCR1
     C                     END
     C           R8SKJY    IFEQ 'D'
     C           R8SKHZ    ANDLE*DATE
     C                     SETON                     020399
     C                     MOVELER,08     MSG
     C                     GOTO @SCR1
     C                     END
     C                     END
     C           @001      TAG
     C*
     C                     MOVE *BLANK    @USER  10
     C                     SETOF                     31
     C           PARM1     CHAINRGAPL111             31
     C           *IN31     IFEQ '0'
     C           J8SKJY    ANDEQ'D'
     C                     SETON                     31
     C                     END
     C           *IN31     IFEQ '0'
     C                     MOVELJ8NAME    @USER
     C                     END
     C                     MOVELR8RGNM    @RGNM
     C                     Z-ADDR8SEHH    @SEHH
     C                     Z-ADDR8SESS    @SESS
     C                     MOVE R8SEBB    @SEBB
     C           @KOSN     IFEQ '2'
     C                     MOVE *BLANK    @RGNM
     C                     Z-ADD0         @SEHH
     C                     Z-ADD0         @SESS
     C                     MOVE *BLANK    @SEBB
     C                     END
     C*
     C* fﾞx]-2
     C*
     C           @SCR2     TAG
     C                     EXFMTOAAPW352
     C                     SETOF                     020304
     C                     SETOF                     050699
     C           *INKC     IFEQ '1'
     C                     MOVE *BLANK    @KOSN
     C                     MOVE *BLANK    @RGCD
     C                     GOTO @SCR1
     C                     END
     C*
     C* ﾆｬｮfﾍﾞ]xbﾆｭc
     C*
     C           @RGNM     IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVELER,09     MSG
     C                     GOTO @SCR2
     C                     END
     C*
     C* ﾆｬｮfﾍﾞ]xbﾆｭc f]ﾆﾞ
     C*
     C* ﾈｮmbﾆﾞf] ﾆﾞf]
     C*
     C           @SEHH     IFLT 0
     C                     SETON                     0399
     C                     MOVELER,10     MSG
     C                     GOTO @SCR2
     C                     END
     C           @SEHH     IFGE 25
     C                     SETON                     0399
     C                     MOVELER,11     MSG
     C                     GOTO @SCR2
     C                     END
     C*
     C* ﾈｮmbﾆﾞf] ﾎ]
     C*
     C           @SESS     IFGE 61
     C                     SETON                     0499
     C                     MOVELER,12     MSG
     C                     GOTO @SCR2
     C                     END
     C*
     C* ﾈｮmbﾍﾞ]
     C*
     C           @SEBB     IFEQ *BLANK
     C                     SETON                     0599
     C                     MOVELER,13     MSG
     C                     GOTO @SCR2
     C                     END
     C*
     C  NKE                GOTO @SCR2
     C*
     C                     MOVE @RGCD     R8RGCD
     C                     MOVE @RGNM     R8RGNM
     C                     Z-ADD@SEHH     R8SEHH
     C                     Z-ADD@SESS     R8SESS
     C                     MOVE @SEBB     R8SEBB
     C*
     C                     MOVE @KONM     MKOSN
     C                     MOVE @RGCD     MRGCD
     C*
     C           @KOSN     IFEQ '0'
     C                     MOVEL'D'       R8SKJY
     C                     Z-ADD*DATE     R8SKHZ
     C                     ELSE
     C                     MOVE *BLANK    R8SKJY
     C                     Z-ADD0         R8SKHZ
     C                     END
     C                     Z-ADD*DATE     R8KOHZ
     C                     TIME           WTIME
     C                     MOVELPARM1     R8KOME
     C           *IN30     IFEQ '0'
     C                     UPDATOAAPL351
     C                     ELSE
     C                     WRITEOAAPL351
     C                     END
      *
     C                     MOVE *BLANK    @KOSN
     C                     MOVE *BLANK    @RGCD
     C                     GOTO @SCR1
     C*
      *
**  (KOCD/KONM)
00-CANCEL
11-CHANGE
22-ADD
**  ER
E-01  UPDATE INSTRUCTION IS 0.1.2
E-02  RG CODE ISN'T INPUT
E-03  RG CODE ISN'T REGISTERED WITH M/F
E-04  ADD WAS APPOINTED, BUT M/F EXISTS
E-05  A CHANGE WAS APPOINTED, BUT M/F DOESN'T EXIST
E-06  A CHANGE WAS APPOINTED, BUT M/F IS CANCELLED ALREADY
E-07  A CANCELLATION WAS APPOINTED, BUT M/F DOESN'T EXIST
E-08  A CANCELLATION WAS APPOINTED, BUT M/F IS CANCELLED
E-09  SHIPMENT BIN NAME ISN'T INPUT
E-10  SETTING TIME(HOUR) ISN'T INPUT
E-11  SETTING TIME(HOUR) ISN'T RIGHT
E-12  SETTING TIME(MINUTES) ISN'T RIGHT
E-13  SETTING BIN ISN'T INPUT
