     H            Y.
     F** OBAR62 **********************************
     F* INPUT DATA  WHICH DOES BLOCKING OFFOR S/88
     F*EXCLUSIVE INSTRUCTION TAG THAT IS NOT CONTAINED KANJI OUTGOING DATA
     F* C:N.HAYAKAWA              91.02.06       *
     F********************************************
     FOBAWP61 IF  F     100            DISK
     FOBAWP62 O   F     508            DISK                      A
     E                    OUT         5100               OUTPUT
     E                    AL20      508  1               OUTPUT
     IOBAWP61 AA  01
     I                                        1 100 INDAT
     C********************************
     C*       １回のみの処理       *
     C********************************
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C* MAKE HEX '31' IS S/88 '1' *
     C                     BITOF'01234567'HEX31   1
     C                     BITON'237'     HEX31            HEX 31
     C* MAKE HEX '37' IS S/88 '7' *
     C                     BITOF'01234567'HEX37   1
     C                     BITON'23567'   HEX37            HEX 37
     C* MAKE HEX '20' ASCII BLANK *
     C                     BITOF'01234567'HEX20   1
     C                     BITON'2'       HEX20            HEX 20
     C* ALL20にASCIIの空白を入れる*
     C           1         DO   508       F       30
     C                     MOVE HEX20     AL20,F
     C                     END
     C*データＩＤ*
     C                     MOVELHEX31     DATID   2
     C                     MOVE HEX37     DATID
     C                     MOVEAAL20      SP6     6
     C                     END
     C*出力フィールドのクリア*
     C           LOOP1     TAG
     C                     MOVEAAL20      OUT
     C*ＲＥＡＤ（１ブロック５レコード）*
     C           1         DO   5         C       20
     C                     READ OBAWP61                  11
     C           *IN11     IFEQ '1'
     C                     GOTO STEP99
     C                     END
     C                     MOVE INDAT     OUT,C
     C                     END
     C*ファイル出力*
     C                     EXCPTOUTF
     C                     GOTO LOOP1
     C*入力ファイル終了*
     C           STEP99    TAG
     C           C         IFGT 1
     C                     EXCPTOUTF
     C                     END
     C                     SETON                     LR
     C                     RETRN
     OOBAWP62 EADD             OUTF
     O                         DATID      2
     O                         OUT,1    102
     O                         OUT,2    202
     O                         OUT,3    302
     O                         OUT,4    402
     O                         OUT,5    502
     O                         SP6      508
