     H            Y.
     F***RAARA7**********************************************
     F* INPUT THE ACCUMULATION OPEN LOCATION WHICH ACCUMULATED FIRST INTO
     F* INSTANT TAG PUBLICATION FILE
     F*           1984.07.22         M-OKUDA                *
     F*******************************************************
     FINPUT   UP  F     200            DISK
     FDA#PL12 IF  E           K        DISK
     IINPUT   AA  01
     I                                       87  880URMM
     I                                    P  89  910RRN
     I                                      110 110 THAI
     I                                      166 171 THNO
     I                                      172 177 BANC
     C                     Z-ADDURMM      KMM     20
     C                     Z-ADDRRN       KRRN    50
     C           UKEY      KLIST
     C                     KFLD           KMM
     C                     KFLD           KRRN
     C           THAI      IFNE 'S'
     C           THAI      IFNE 'G'
     C                     SETOF                     03
     C           UKEY      CHAINDA#PL121             03
     C           *IN03     IFEQ '0'
     C           BANC      IFEQ *BLANK
     C                     MOVE B8TKRO    BANCO   6
     C                     ELSE
     C                     MOVE BANC      BANCO
     C                     END
     C                     MOVE B8THNO    THNOO   4
     C                     Z-ADDB8RECD    RECO    20
     C                     EXCPTDATA
     C                     END
     C                     END
     C                     END
     OINPUT   E                DATA
     O                         THNOO    169
     O                         RECO     171
     O                         BANCO    177
