     H            Y.
     F** RBDR22 **************************************
     F*  .. CREAT COST LEVEL DATA FOR COMMON PARTS ..*
     F*       I-HASADA                91.03.30       *
     F*       GBC                   2000.07.14       *
     F************************************** RBDR22 **
     FRBDPW21 CF  E                    WORKSTN
     FFBCPL05 IF  E           K        DISK
     FMBDTL05 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGBFPL51 UF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER                        UC
     E                    ER      1  19 60               d[-xlﾈbﾆﾞ
     E                    YN      1   2  1               YN
     E                    HZ          6  4 0             ﾍﾇﾞiﾌbﾛl
   #@E                    #A          6006 0             ﾍﾇﾞiﾌbﾛl
     E                    SU          6  7 0             ﾍ]ﾌﾞ]ﾌbﾛl
   #@E*
   #@E                    ##@        15  1
     I            DS
     I                                        1   40CYM
     I                                        1   20UYY
     I                                        3   40UMM
     I                                        5   80EHIZK
     I                                        5   60EYY
     I                                        7   80EMM
     I                                        9  120SHIZK
     I                                        9  100SYY
     I                                       11  120SMM
     I                                       41  82 SU
     I                                       41  470F3TNSU
     I                                       48  540F3ANSU
     I                                       55  610F3BNSU
     I                                       62  680F3CNSU
     I                                       69  750F3DNSU
     I                                       76  820F3ENSU
     I                                       92  950THIZK
     I                                       92  930TYY
     I                                       94  950TMM
     I            DS
     I                                        1  23 XTK
     I                                        1   40XTOKU
     I                                        5  19 XMHIN
     I                                        5   9 XMHN1
     I                                       10  14 XMHN2
     I                                       15  19 XMHN3
     I                                       20  230XNONY
     I            DS
     I                                        1  23 YTK
     I                                        1   40YTOKU
     I                                        5   9 YMHN1
     I                                       10  14 YMHN2
     I                                       15  19 YMHN3
     I                                       20  230YNONY
     I            DS
     I                                        1  23 @AKEY
     I                                        1   40FBTOKU
     I                                        5   9 FBMHN1
     I                                       10  14 FBMHN2
     I                                       15  19 FBMHN3
     I                                       20  230FBNONY
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80G9SKHZ
     I                                        1   40G9SKYY
     I                                        5   60G9SKMM
     I                                        7   80G9SKDD
   #@I*
   #@I            DS
   #@I                                        1  15 #@YFC
   #@I                                        1  15 ##@
     C           BKEY      KLIST
     C                     KFLD           WTOKU
     C                     KFLD           WMHN1
     C                     KFLD           WMHN2
     C                     KFLD           WMHN3
     C                     KFLD           WMHN4
     C                     KFLD           WNONY
      *
     C           KEY2      KLIST
     C                     KFLD           #TOKU
     C                     KFLD           #TKOJ
     C                     KFLD           #HIN1
     C                     KFLD           #HIN2
     C                     KFLD           #HIN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PYYMM   4
      *
     C                     SETOF                     16
     C                     MOVE PYYMM     CYM
     C                     MOVE CYM       HZ,1
     C           UMM       COMP 1                        11
     C   11                Z-ADD12        TMM
     C  N11      UMM       SUB  1         TMM
     C   11      UYY       IFLE 0
     C                     Z-ADD99        UYY
     C                     ELSE
     C           UYY       SUB  1         UYY
     C                     END
     C                     Z-ADDUYY       TYY
     C                     MOVE THIZK     HZ,2
     C           TMM       COMP 1                        11
     C   11                Z-ADD12        TMM
     C  N11      TMM       SUB  1         TMM
     C   11      TYY       IFLE 0
     C                     Z-ADD99        UYY
     C                     ELSE
     C           TYY       SUB  1         UYY
     C                     END
     C                     Z-ADDUYY       TYY
     C                     MOVE THIZK     HZ,3
     C           TMM       COMP 1                        11
     C   11                Z-ADD12        TMM
     C  N11      TMM       SUB  1         TMM
     C   11      TYY       IFLE 0
     C                     Z-ADD99        UYY
     C                     ELSE
     C           TYY       SUB  1         UYY
     C                     END
     C                     Z-ADDUYY       TYY
     C                     MOVE THIZK     HZ,4
     C           TMM       COMP 1                        11
     C   11                Z-ADD12        TMM
     C  N11      TMM       SUB  1         TMM
     C   11      TYY       IFLE 0
     C                     Z-ADD99        UYY
     C                     ELSE
     C           TYY       SUB  1         UYY
     C                     END
     C                     Z-ADDUYY       TYY
     C                     MOVE THIZK     HZ,5
     C           TMM       COMP 1                        11
     C   11                Z-ADD12        TMM
     C  N11      TMM       SUB  1         TMM
     C   11      TYY       IFLE 0
     C                     Z-ADD99        UYY
     C                     ELSE
     C           TYY       SUB  1         UYY
     C                     END
      *
     C                     Z-ADDUYY       TYY
     C                     MOVE THIZK     HZ,6
     C                     MOVE HZ,1      PDATEE  40
     C                     MOVE HZ,6      PDATES  40
     C                     Z-ADD0         SHIZK
     C                     Z-ADD0         EHIZK
     C                     Z-ADD0         DTOKU
     C                     Z-ADD0         STOKU
     C                     Z-ADD1         O       30
     C                     MOVE *BLANK    #HIN1   5
     C                     MOVE *BLANK    #HIN2   5
     C                     MOVE *BLANK    #HIN3   5
      *
     C           STEP1     TAG
     C                     EXFMTRBDPW211
     C                     SETOF                     091650
     C                     SETOF                     519192
     C                     SETOF                     939499
     C                     SETOF                     303132
     C   KA                SETON                     LR
     C   KA                RETRN
      *
      *
     C           SYY       IFGT 50
     C                     Z-ADD1900      W@A     40
     C                     ELSE
     C                     Z-ADD2000      W@A     40
     C                     ENDIF
     C                     ADD  SYY       W@A
      *
     C*******    SYY       IFLE 80
     C           W@A       IFLE 1980
     C                     SETON                     99
     C                     MOVELER,1      MSG
     C                     SETON                     91
     C                     GOTO STEP1
     C                     END
     C           SMM       IFGT 12
     C                     SETON                     99
     C                     MOVELER,2      MSG
     C                     SETON                     91
     C                     GOTO STEP1
     C                     END
     C           SMM       IFLT 01
     C                     SETON                     99
     C                     MOVELER,3      MSG
     C                     SETON                     91
     C                     GOTO STEP1
     C                     END
   #@C*
   #@C                     EXSR S#@I01
      *
   #@C           PD#@01    IFLT EH#@01
     C                     SETON                     99
     C                     MOVELER,4      MSG    60
     C                     SETON                     91
     C                     GOTO STEP1
     C                     END
      *
      *
     C           EYY       IFGT 50
     C                     Z-ADD1900      W@A     40
     C                     ELSE
     C                     Z-ADD2000      W@A     40
     C                     ENDIF
     C                     ADD  EYY       W@A
      *
     C*******    EYY       IFLE 80
     C           W@A       IFLE 1980
     C                     SETON                     99
     C                     MOVELER,5      MSG
     C                     SETON                     92
     C                     GOTO STEP1
     C                     END
     C           EMM       IFGT 12
     C                     SETON                     99
     C                     MOVELER,6      MSG
     C                     SETON                     92
     C                     GOTO STEP1
     C                     END
     C           EMM       IFLT 01
     C                     SETON                     99
     C                     MOVELER,7      MSG
     C                     SETON                     92
     C                     GOTO STEP1
     C                     END
   #@C*
   #@C                     EXSR S#@I02
      *
   #@C           PD#@02    IFGT SH#@01
     C                     SETON                     99
     C                     MOVELER,8      MSG
     C                     SETON                     92
     C                     GOTO STEP1
     C                     END
      *
     C           DTOKU     IFEQ 0
     C                     SETON                     99
     C                     MOVELER,9      MSG
     C                     SETON                     93
     C                     GOTO STEP1
     C                     END
      *
     C           STOKU     IFEQ 0
     C                     SETON                     99
     C                     MOVELER,10     MSG
     C                     SETON                     94
     C                     GOTO STEP1
     C                     END
      *
     C                     Z-ADD1         G       10
   #@C*
   #@C                     EXSR S#@I03
   #@C           SH#@01    LOKUP#A,G                     50ﾎﾓbﾍﾇﾞi
     C           *IN50     IFEQ '1'
     C                     Z-ADDG         S       10
     C                     ELSE
     C                     Z-ADD6         S
     C                     END
      *
     C                     Z-ADD1         G
   #@C*
   #@C                     EXSR S#@I04
   #@C           EH#@01    LOKUP#A,G                     51ﾅbﾆ]ﾍﾇﾞi
     C           *IN51     IFEQ '1'
     C                     Z-ADDG         E       10
     C                     ELSE
     C                     Z-ADD1         E
     C                     END
     C           DTKOJ     COMP *BLANK               1616  :NE
      *
     C           STEP2     TAG
     C           DTOKU     CHAINFGBPL011             09
     C           *IN09     IFEQ '1'
     C                     MOVE *BLANK    TMEID  15
     C                     MOVE *BLANK    TMEI1  10
     C                     ELSE
     C                     MOVELB2SMEI    TMEID
     C                     MOVELB2SMEI    TMEI1
      *
     C*          B2GRUP    IFEQ '3'
     C*          DTOKU     IFNE 4812
     C*          DTOKU     IFNE 8400
     C*                    SETON                     9993
     C*                    MOVELER,11     MSG
     C*                    GOTO STEP1
     C*                    END
     C*                    END
     C*                    END
     C                     END
      *
     C                     SETOF                     09
     C           STOKU     CHAINFGBPL011             09
     C           *IN09     IFEQ '1'
     C                     MOVE *BLANK    TMEIS  15
     C                     ELSE
     C                     MOVE B2SMEI    TMEIS
      *
     C*          B2GRUP    IFEQ '3'
     C*          STOKU     IFNE 4812
     C*          STOKU     IFNE 8400
     C*                    SETON                     9994
     C*                    MOVELER,12     MSG
     C*                    GOTO STEP1
     C*                    END
     C*                    END
     C*                    END
     C                     END
      *
     C                     SETOF                     61
     C           @YN       LOKUPYN                       61
     C           *IN61     IFEQ '0'
     C                     SETON                     3099
     C                     MOVELER,13     MSG
     C                     GOTO STEP1
     C                     END
      *
     C           @YN       IFEQ 'Y'
     C           #TOKU     IFEQ 0
     C                     SETON                     3199
     C                     MOVELER,14     MSG
     C                     GOTO STEP1
     C                     END
     C*
     C           #TKOJ     IFEQ *BLANK
     C                     SETON                     3299
     C                     MOVELER,15     MSG
     C                     GOTO STEP1
     C                     END
     C*
     C                     SETOF                     35
     C           #TOKU     CHAINFGBPL011             35
     C*
     C           *IN35     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     35
     C                     END
     C*
     C           *IN35     IFEQ '1'
     C                     MOVELER,16     MSG
     C                     GOTO STEP1
     C                     END
     C*
     C           DTOKU     IFNE #TOKU
     C                     SETON                     3199
     C                     MOVELER,19     MSG
     C                     GOTO STEP1
     C                     END
     C                     END
      *
     C           @YN       IFEQ 'N'
     C           #TOKU     IFNE 0
     C                     SETON                     3199
     C                     MOVELER,17     MSG
     C                     GOTO STEP1
     C                     END
     C*
     C           #TKOJ     IFNE *BLANK
     C                     SETON                     3299
     C                     MOVELER,18     MSG
     C                     GOTO STEP1
     C                     END
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STEP1
     C                     END
      *
     C           @YN       IFEQ 'Y'
     C                     MOVE #TOKU     ##TOKU  4
     C                     MOVE #TKOJ     ##TKOJ  1
     C                     CALL 'GBFR05'
     C                     PARM           ##TOKU
     C                     PARM           ##TKOJ
     C                     END
      *
     C                     SETOF                     505152
     C                     SETOF                     537071
     C                     SETOF                     72
     C                     SETON                     06
      *
     C                     MOVE *BLANK    WAKEY  23
     C                     Z-ADD0         @ATAN  105
     C                     Z-ADD0         WATAN  105
      *
     C*--------------------------------*
      *  ..SALES UNIT PRICE MASTER FILE..  *
     C*--------------------------------*
     C           DTOKU     SETLLFBCPL05
S1   C                     DO   *HIVAL
     C                     SETOF                     20
     C           DTOKU     READEFBCPL05                  20
      *
 S2  C           *IN20     IFEQ '1'
   3 C           *IN53     IFEQ '1'
   4 C           WATAN     IFEQ 0
     C                     Z-ADD@ATAN     WATAN
  E4 C                     END
  S4 C           WATAN     IFNE 0
     C                     EXSR SBRT
  E4 C                     END
   3 C                     END
  S3 C           *IN21     IFEQ '1'
     C                     EXCPTTOTL
     C                     CLOSEQPRINT
  E3 C                     END
     C                     SETON                     LR
     C                     RETRN
 X2  C                     ELSE
      *
  S3 C           FBSKJY    IFEQ 'D'
     C           FBSKHZ    ANDLE*DATE
  X3 C                     ELSE
      *
  S4 C           *IN16     IFEQ '1'                        ﾃcﾆﾞｭc ﾆmb
   5 C           FBNKOJ    IFNE DTKOJ
     C                     GOTO END1
   5 C                     END
  E4 C                     END
      *
  S4 C           *IN50     IFEQ '0'
     C                     SETON                     5053
     C                     MOVE @AKEY     WAKEY
  E4 C                     END
      *
  S4 C           @AKEY     IFEQ WAKEY
     C                     Z-ADDFBTOKU    WTOKU   40
     C                     Z-ADDFBNONY    WNONY   40
     C                     MOVE FBMHN1    WMHN1   5
     C                     MOVE FBMHN2    WMHN2   5
     C                     MOVE FBMHN3    WMHN3   5
     C                     MOVE *BLANK    WMHN4   5
     C                     Z-ADDFBTOKU    XTOKU
     C                     Z-ADDFBNONY    XNONY
     C                     MOVE FBMHN1    XMHN1
     C                     MOVE FBMHN2    XMHN2
     C                     MOVE FBMHN3    XMHN3
     C                     MOVE *BLANK    XMHN4   5
      *
     C           *DATE     IFGE FBTKHZ
     C           *DATE     ANDLEFBTSHZ
     C                     Z-ADDFBNTAN    @TANK  105
     C                     ELSE
     C                     Z-ADDFBOTAN    @TANK
     C                     END
      *
  S5 C           *IN70     IFEQ '0'
     C                     SETON                     70
     C                     Z-ADD@TANK     @ATAN            :@
  E5 C                     END
  S5 C           @TANK     IFLE @ATAN                      :@
     C                     Z-ADD@TANK     @ATAN            :@ MIN
  E5 C                     END
      *
  S5 C           *DATE     IFGE FBTKHZ
     C           *DATE     ANDLEFBTSHZ
  S6 C           FBNTAN    IFNE 0
      *
  S7 C           *IN71     IFEQ '0'
     C                     SETON                     71
     C                     Z-ADDFBNTAN    WATAN
  E7 C                     END
  S7 C           FBNTAN    IFLE WATAN
     C                     Z-ADDFBNTAN    WATAN
  E7 C                     END
      *
   6 C                     END
   5 C                     END
  X4 C                     ELSE
      *
     C                     MOVE @AKEY     WAKEY
  S5 C           WATAN     IFEQ 0
     C                     Z-ADD@ATAN     WATAN
  E5 C                     END
      *
  S5 C           WATAN     IFNE 0
     C                     EXSR SBRT
  E5 C                     END
      *
     C                     Z-ADDFBTOKU    WTOKU
     C                     Z-ADDFBNONY    WNONY
     C                     MOVE FBMHN1    WMHN1
     C                     MOVE FBMHN2    WMHN2
     C                     MOVE FBMHN3    WMHN3
     C                     MOVE *BLANK    WMHN4
     C                     Z-ADDFBTOKU    XTOKU
     C                     Z-ADDFBNONY    XNONY
     C                     MOVE FBMHN1    XMHN1
     C                     MOVE FBMHN2    XMHN2
     C                     MOVE FBMHN3    XMHN3
     C                     MOVE *BLANK    XMHN4
      *
     C                     SETOF                     7172
     C                     Z-ADD0         WATAN
     C           *DATE     IFGE FBTKHZ
     C           *DATE     ANDLEFBTSHZ
     C                     Z-ADDFBNTAN    @ATAN
     C                     ELSE
     C                     Z-ADDFBOTAN    @ATAN
     C                     END
      *
  S5 C           *DATE     IFGE FBTKHZ
     C           *DATE     ANDLEFBTSHZ
  S6 C           FBNTAN    IFNE 0
      *
  S7 C           *IN71     IFEQ '0'
     C                     SETON                     71
     C                     Z-ADDFBNTAN    WATAN
  E7 C                     END
  S7 C           FBNTAN    IFLE WATAN
     C                     Z-ADDFBNTAN    WATAN
  E7 C                     END
      *
  E6 C                     END
  E5 C                     END
      *
     C           END1      TAG
  E4 C                     END
   3 C                     END
 E2  C                     END
E1   C  N20                END
      *
      *
     C           SBRT      BEGSR
      *
     C*----------------------------------------------------*
     C*                    j]fuﾇjｰn eoﾆﾞKEYﾉ ﾉcpｬcncib･ ﾑw *
     C*----------------------------------------------------*
     C           BKEY      SETLLMBDTL051
     C           STP4      TAG
     C                     SETOF                     22
     C           BKEY      READEMBDTL051                 22
     C   22                GOTO STP5
     C           F3SKJY    CABEQ'D'       STP4
     C   16      F3NKOJ    CABNEDTKOJ     STP4
     C                     Z-ADDF3TOKU    YTOKU
     C                     Z-ADDF3NONY    YNONY
     C                     MOVE F3MHN1    YMHN1
     C                     MOVE F3MHN2    YMHN2
     C                     MOVE F3MHN3    YMHN3
     C           XTK       CABEQYTK       STEP71
     C           XTK       CABLTYTK       STP5
     C                     GOTO STP4
      *
     C           STEP71    TAG
     C                     Z-ADDE         C       10
     C           STP6      TAG
     C           GSRYO     ADD  SU,C      GSRYO  100
     C           C         IFEQ S
     C                     GOTO STP4
     C                     END
     C                     ADD  1         C
     C                     GOTO STP6
      *
     C*----------------------------------------------------*
     C*                    ﾍfhﾇﾓ xｰfｰ ﾉ ﾌ]ﾌﾞbj]f ･ ﾑvﾃv    *
     C*----------------------------------------------------*
     C           STP5      TAG
      *
     C                     MOVE STOKU     @TOKU   4
     C                     MOVE STOKU     @NONY   4
     C                     MOVE *BLANK    @NKOJ   1
     C                     MOVE *BLANK    @NUKE   4
     C                     MOVELXMHIN     @MHIN  20
     C                     Z-ADD0         @TAN   105
     C                     MOVE *DATE     @HIZK   8
     C                     MOVE *BLANK    @CHEK   1
      *
     C                     CALL 'FBCR10'
     C                     PARM           @TOKU
     C                     PARM           @NONY
     C                     PARM           @NKOJ
     C                     PARM           @NUKE
     C                     PARM           @MHIN
     C                     PARM           @HIZK
     C                     PARM           @TAN
     C                     PARM           @CHEK
      *
     C           @CHEK     IFEQ '*'
     C                     Z-ADD0         WBTAN  105
     C                     ELSE
     C                     Z-ADD@TAN      WBTAN  105
     C                     ENDIF
      *
     C*----------------------------------------------------*
     C*                    xbﾅbg]fﾞh ﾉ ﾃﾞcib ibﾅ]          *
     C*----------------------------------------------------*
     C           GSRYO     MULT WBTAN     WBKING 122
     C           GSRYO     MULT WATAN     WAKING 122
     C           FAKING    ADD  WAKING    FAKING 122
     C           FBKING    ADD  WBKING    FBKING 122
      *
     C*----------------------------------------------------*
     C*  ﾍfhﾇﾓxｰfｰ n ﾍfhﾅﾛﾓxｰfｰ ctcp j]ffﾞaﾓng ﾉ ﾃﾞcib    *
     C*----------------------------------------------------*
     C                     Z-ADD0         WSTAN  105
     C                     Z-ADD0         WSKING 122
     C           WATAN     IFNE 0
     C           WBTAN     IFNE 0
     C           FAKINX    ADD  WAKING    FAKINX 122
     C           FBKINX    ADD  WBKING    FBKINX 122
     C           WATAN     SUB  WBTAN     WSTAN
     C           WAKING    SUB  WBKING    WSKING
     C           FSKING    ADD  WSKING    FSKING 122
     C                     END
     C                     END
      *
     C           *IN21     IFEQ '0'
     C                     SETON                     21
     C                     OPEN QPRINT
     C                     EXCPTMIDS
     C                     END
      *
     C                     EXSR UPD
     C                     EXCPTMESI
     C   OF                EXCPTMIDS
      *
     C                     SETOF                     OF
     C                     ENDSR
     C*---------------
     C* UPD <1992.05.25>
     C*---------------
     C           UPD       BEGSR
     C                     MOVE WMHN1     #HIN1
     C                     MOVE WMHN2     #HIN2
     C                     MOVE WMHN3     #HIN3
     C*
     C                     SETOF                     60
     C           KEY2      CHAINGBFPL511             60
     C           *IN60     IFEQ '0'
     C           G9SKJY    ANDEQ'D'
     C           G9SKHZ    ANDLE*DATE
     C                     SETON                     60
     C                     END
     C*
     C           *IN60     IFEQ '0'
     C                     ADD  GSRYO     G9SRYO
     C                     UPDATGBFPL511
     C                     END
     C*
     C                     ENDSR
   #@C*==============================================================*
   #@C*          S#@I01   ﾍlﾞiﾈｮmbﾆｭﾒ
   #@C*==============================================================*
   #@C           S#@I01    BEGSR
   #@C*<<
   #@C                     MOVE PDATEE    #@YFC
   #@C                     EXSR SB#@YM
   #@C                     MOVE #@YTC     PD#@01  60
   #@C*<<
   #@C                     MOVE EHIZK     #@YFC
   #@C                     EXSR SB#@YM
   #@C                     MOVE #@YTC     EH#@01  60
   #@C*
   #@C                     ENDSR
   #@C*==============================================================*
   #@C*          S#@I02   ﾍlﾞiﾈｮmbﾆｭﾒ
   #@C*==============================================================*
   #@C           S#@I02    BEGSR
   #@C*<<
   #@C                     MOVE PDATES    #@YFC
   #@C                     EXSR SB#@YM
   #@C                     MOVE #@YTC     PD#@02  60
   #@C*<<
   #@C                     MOVE SHIZK     #@YFC
   #@C                     EXSR SB#@YM
   #@C                     MOVE #@YTC     SH#@01  60
   #@C*
   #@C                     ENDSR
   #@C*==============================================================*
   #@C*          S#@I03   ﾍlﾞiﾈｮmbﾆｭﾒ
   #@C*==============================================================*
   #@C           S#@I03    BEGSR
   #@C*<<
   #@C                     MOVE SHIZK     #@YFC
   #@C                     EXSR SB#@YM
   #@C                     MOVE #@YTC     SH#@01  60
   #@C*<<
   #@C                     Z-ADD0         #@     150
   #@C                     DO   6         #@
   #@C                     MOVE HZ,#@     #@YFC
   #@C                     EXSR SB#@YM
   #@C                     MOVE #@YTC     #A,#@
   #@C                     END
   #@C*
   #@C                     ENDSR
   #@C*==============================================================*
   #@C*          S#@I04   ﾍlﾞiﾈｮmbﾆｭﾒ
   #@C*==============================================================*
   #@C           S#@I04    BEGSR
   #@C*<<
   #@C                     MOVE EHIZK     #@YFC
   #@C                     EXSR SB#@YM
   #@C                     MOVE #@YTC     EH#@01  60
   #@C*<<
   #@C                     Z-ADD0         #@     150
   #@C                     DO   6         #@
   #@C                     MOVE HZ,#@     #@YFC
   #@C                     EXSR SB#@YM
   #@C                     MOVE #@YTC     #A,#@
   #@C                     END
   #@C*
   #@C                     ENDSR
   #@C*==============================================================*
   #@C*          SB#@Y1   ﾍlﾞis]f]ﾆｭﾒ    YY -> YYYY
   #@C*==============================================================*
   #@C           SB#@Y1    BEGSR
   #@C*<<ﾎｧｰﾓnﾞkｭcﾉmbgﾞ>>
   #@C           #@YFC     IFNE *BLANK
   #@C                     MOVEL#@YFC     #@YTC  15
   #@C                     EXSR SB#@XX
   #@C                     MOVE #@YFC     #@YFN  150
   #@C*<<  0 > YY >= -99 >>
   #@C           #@YFN     IFGE -99
   #@C           #@YFN     ANDLT0
   #@C                     ADD  100       #@YFN
   #@C*<<  50 > YY >= 0 >>
   #@C           #@YFN     IFGE 0
   #@C           #@YFN     ANDLT50
   #@C                     ADD  2000      #@YFN
   #@C                     MOVE #@YFN     #@YTC
   #@C                     ELSE
   #@C*<<  100 > YY >= 50 >>
   #@C           #@YFN     IFGE 50
   #@C           #@YFN     ANDLT100
   #@C                     ADD  1900      #@YFN
   #@C                     MOVE #@YFN     #@YTC
   #@C                     END
   #@C                     END
   #@C                     ELSE
   #@C*<< 50 > YY >= 0 >>
   #@C           #@YFN     IFGE 0
   #@C           #@YFN     ANDLT50
   #@C                     ADD  2000      #@YFN
   #@C                     MOVE #@YFN     #@YTC
   #@C                     ELSE
   #@C*<< 100 > YY >= 50 >>
   #@C           #@YFN     IFGE 50
   #@C           #@YFN     ANDLT100
   #@C                     ADD  1900      #@YFN
   #@C                     MOVE #@YFN     #@YTC
   #@C                     END
   #@C                     END
   #@C                     END
   #@C                     ELSE
   #@C                     MOVEL*BLANK    #@YTC
   #@C                     END
   #@C*
   #@C                     MOVEL*BLANK    #@YFC
   #@C*
   #@C                     ENDSR
   #@C*==============================================================*
   #@C*          SB#@YM   ﾍlﾞis]f]ﾆｭﾒ    YYMM -> YYYYMM
   #@C*==============================================================*
   #@C           SB#@YM    BEGSR
   #@C*<<ﾎｧｰﾓnﾞkｭcﾉmbgﾞ>>
   #@C           #@YFC     IFNE *BLANK
   #@C                     MOVEL#@YFC     #@YTC  15
   #@C                     EXSR SB#@XX
   #@C                     MOVE #@YFC     #@YFN  150
   #@C*
   #@C           #@YFN     IFNE 0
   #@C           #@YFN     IFGT 5000
   #@C           #@YFN     IFEQ 9999
   #@C                     MOVE 999999    #@YFN
   #@C                     ELSE
   #@C                     ADD  190000    #@YFN
   #@C                     END
   #@C                     ELSE
   #@C                     ADD  200000    #@YFN
   #@C                     END
   #@C                     END
   #@C                     MOVE #@YFN     #@YTC
   #@C                     ELSE
   #@C                     MOVEL*BLANK    #@YTC
   #@C                     END
   #@C*
   #@C                     MOVEL*BLANK    #@YFC
   #@C*
   #@C                     ENDSR
   #@C*==============================================================*
   #@C*          SB#@YD   ﾍlﾞis]f]ﾆｭﾒ    YYMMDD -> YYYYMMDD
   #@C*==============================================================*
   #@C           SB#@YD    BEGSR
   #@C*<<ﾎｧｰﾓnﾞkｭcﾉmbgﾞ>>
   #@C           #@YFC     IFNE *BLANK
   #@C                     MOVEL#@YFC     #@YTC  15
   #@C                     EXSR SB#@XX
   #@C                     MOVE #@YFC     #@YFN  150
   #@C*
   #@C           #@YFN     IFNE 0
   #@C           #@YFN     IFGT 500000
   #@C           #@YFN     IFEQ 999999
   #@C                     MOVE 99999999  #@YFN
   #@C                     ELSE
   #@C                     ADD  19000000  #@YFN
   #@C                     END
   #@C                     ELSE
   #@C                     ADD  20000000  #@YFN
   #@C                     END
   #@C                     END
   #@C                     MOVE #@YFN     #@YTC
   #@C                     ELSE
   #@C                     MOVEL*BLANK    #@YTC
   #@C                     END
   #@C*
   #@C                     MOVEL*BLANK    #@YFC
   #@C*
   #@C                     ENDSR
   #@C*==============================================================*
   #@C*          SB#@XX   ﾍlﾞis]f]ﾆｭﾒ    ' '->'0' (XLATE)
   #@C*==============================================================*
   #@C           SB#@XX    BEGSR
   #@C*
   #@C           ##@,1     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,1
   #@C                     END
   #@C*
   #@C           ##@,2     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,2
   #@C                     END
   #@C*
   #@C           ##@,3     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,3
   #@C                     END
   #@C*
   #@C           ##@,4     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,4
   #@C                     END
   #@C*
   #@C           ##@,5     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,5
   #@C                     END
   #@C*
   #@C           ##@,6     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,6
   #@C                     END
   #@C*
   #@C           ##@,7     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,7
   #@C                     END
   #@C*
   #@C           ##@,8     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,8
   #@C                     END
   #@C*
   #@C           ##@,9     IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,9
   #@C                     END
   #@C*
   #@C           ##@,10    IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,10
   #@C                     END
   #@C*
   #@C           ##@,11    IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,11
   #@C                     END
   #@C*
   #@C           ##@,12    IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,12
   #@C                     END
   #@C*
   #@C           ##@,13    IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,13
   #@C                     END
   #@C*
   #@C           ##@,14    IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,14
   #@C                     END
   #@C*
   #@C           ##@,15    IFEQ *BLANK
   #@C                     MOVEL'0'       ##@,15
   #@C                     END
   #@C*
   #@C                     ENDSR
     OQPRINT  E  104           MIDS
     O                         DTOKU      9
     O                         TMEI1     21
     O                                   35 'COST ACCOUNT'
     O                                   49 'DATA RESOURCE'
     O                                   77 'A='
     O                         TMEID     92
     O                                  108 'LIST-UP DATE'
     O                         UDATE Y  118
     O                                  126 'PAGE'
     O                         PAGE  Z  130
     O        E  1             MIDS
     O                 16                10 ' PLANT'
     O                 16      DTKOJ     12
     O                 16                34 'BASED ON THE SALES OF'
     O                                   77 'VS. B='
     O                         TMEIS     92
      *
     O        E  1             MIDS
     O                         SHIZK     37
     O                                   38 '-'
     O                         EHIZK     42
     O                         DTOKU     50
     O                         DTOKU     67
     O                         STOKU     79
     O                         STOKU     97
     O                                  114 'DIFFERENCE'
     O                                  131 'DIFFERENCE'
     O        E  2             MIDS
     O                                   11 'PART NUMBER'
     O                                   22 'DELIVERY'
     O                                   42 'QUANTITY'
     O                                   55 'UNITPRICE'
     O                                   69 'AMOUNT'
     O                                   84 'UNITPRICE'
     O                                   99 'AMOUNT'
     O                                  114 'IN UNITPRICE'
     O                                  131 'IN AMOUNT'
     O        E  1             MESI
     O                         WMHN1      5
     O                                    6 '-'
     O                         WMHN2     11
     O                                   12 '-'
     O                         WMHN3     17
     O                         WNONY     22
     O                         GSRYO 1B  42
     O                         WATAN P   55
     O                         WAKINGPB  71
     O                         WBTAN P   84
     O                         WBKINGPB 102
     O                         WSTAN QB 114
     O                         WSKINGQB 131
     O        E  1             TOTL
     O                                   48 '*(A) @FOUND AMOUNT*'
     O                         FAKINXPB  71
     O                         FBKINXPB 102
     O                         FSKINGQB 131
     O        E  1             TOTL
     O                                   48 '** (A) ALL AMOUNT **'
     O                         FAKINGPB  71
     O                         FBKINGPB 102
**
E-01 FIRST YEAR OF DATE IS TOO SMALL.
E-02 FIRST MONTH OF DATE IS SMALLER THAN 12.
E-03 FIRST MONTH OF DATE IS SMALLER THAN 1.
E-04 FIRST DATE HAS NO CORRESPONDING DATA.
E-05 LAST YEAR OF DATE IS TOO SMALL.
E-06 LAST MONTH OF DATE IS SAMLLER THAN 12.
E-07 LAST MONTH OF DATE IS SAMLLER THAN 1.
E-08 DATA HAS NOT BEEN TRANSCTED AT LAS DATE.
E-09 NO USER CODE TO COST CHECK.
E-10 NO USER CODE TO REFER COST.
E-11 COMPARISON INRALID FOR COST CHECK.
E-12 COMPARISON INRALID FOR COST REFERENCE.
E-13 INPUT (Y/N).
E-14 INPUT USER.
E-15 INPUT PLANT CODE.
E-16 USER NOT FOUND.
E-17 NO NEED TO INPUT USER FOR (N).
E-18 NO NEED TO INPUT PLANT CODE FOR (N).
E-19 WRONG USER CODE TO INPUT SALES QUANTITY.
**
Y
N
