     H            Y.
     F** RCHR12 ********************************************
     F* SECTION . MACHINE NO ALLOCATED PART NUMBER LIST                 *
     F*            M-OKUDA             1983.11.16          *
     F******************************************** RCHR12 **
     FGHCNL21 IP  E           K        DISK
     FMFAPL25 IF  E           K        DISK
     FMFBPL20 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGHCNL22 IF  E           K        DISK
     FFCAPL07 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
%0001FOUTPUT1 O   F     512            DISK
     E                    SU         12  9 0             12fiﾞlﾇcﾒﾑc
     IGHCNL211
     I                                              MBMBMNL6
     I                                              MBMSNOL5
     I                                              MBMKTEL4
     I                                              MBMHN1L3
     I                                              MBMHN2L2
     I                                              MBMHN3L1
     IFCADP1     UDS
     I                                        1   1 UJYUN
     I                                        2   3 UKADO
     I                                        4   7 UNEN
     I                                        8   9 UTUK
     I            DS
     I                                        1   3 MBMSNO
     I                                        1   1 MSNO1
     I                                        2   3 MSNO2
     I                                        4  15 KHIN3
     I                                        4   8 MBMHN1
     I                                        9  13 MBMHN2
     I                                       14  15 MBMHN3
     I                                       16  27 JHIN3
     I                                       16  20 MBJHN1
     I                                       21  25 MBJHN2
     I                                       26  27 MBJHN3
     I                                       28  39 KHIN6
     I                                       28  32 MWMHN1
     I                                       33  37 MWMHN2
     I                                       38  39 MWMHN3
     I                                       40  51 JHIN6
     I                                       40  44 MWJHN1
     I                                       45  49 MWJHN2
     I                                       50  51 MWJHN3
     I                                       52  63 KHBAN
     I                                       52  56 KHBN1
     I                                       57  61 KHBN2
     I                                       62  63 KHBN3
     I                                       64  69 KBANC
     I                                       64  64 KMBN1
     I                                       65  66 KMBN2
     I                                       67  68 KMBN3
     I                                       69  69 KMBN4
     I                                       70  81 KJHIN
     I                                       70  74 KJHN1
     I                                       75  79 KJHN2
     I                                       80  81 KJHN3
     I                                       82  87 WBANC
     I                                       82  82 MWMBN1
     I                                       83  84 MWMBN2
     I                                       85  86 MWMBN3
     I                                       87  87 MWMBN4
     I                                      119 2260SU
     I                                      119 1270I6SRO1
     I                                      128 1360I6SRO2
     I                                      137 1450I6SRO3
     I                                      146 1540I6SRO4
     I                                      155 1630I6SRO5
     I                                      164 1720I6SRO6
     I                                      173 1810I6SRO7
     I                                      182 1900I6SRO8
     I                                      191 1990I6SRO9
     I                                      200 2080I6SROA
     I                                      209 2170I6SROB
     I                                      218 2260I6SROC
     I                                      231 2360WYYMM
     I                                      231 2340Y
     I                                      235 2360M
     C           KKEY      KLIST
     C                     KFLD           MBMBMN
     C                     KFLD           MBMSNO
     C                     KFLD           MBMKTE
      *
     C           KKEY2     KLIST
     C                     KFLD           MBMBMN
     C                     KFLD           Y
     C                     KFLD           M
     C                     KFLD           MBMSNO
      *
     C           HKEY      KLIST
     C                     KFLD           MBMHN1
     C                     KFLD           MBMHN2
     C                     KFLD           MBMHN3
      *
     C           HSKEY     KLIST
     C                     KFLD           Y
     C                     KFLD           MBMHN1
     C                     KFLD           MBMHN2
     C                     KFLD           MBMHN3
      *
     C           NKEY      KLIST
     C                     KFLD           KHBN1
     C                     KFLD           KHBN2
     C                     KFLD           KHBN3
     C                     KFLD           KKOTE
     C                     KFLD           KBMON
     C                     KFLD           KMBN1
     C                     KFLD           KMBN2
     C                     KFLD           KMBN3
     C                     KFLD           KMBN4
     C                     KFLD           KJHN1
     C                     KFLD           KJHN2
     C                     KFLD           KJHN3
      *
     C           AKEY      KLIST
     C                     KFLD           MWJHN1
     C                     KFLD           MWJHN2
     C                     KFLD           MWJHN3
      *
     C           ASKEY     KLIST
     C                     KFLD           Y
     C                     KFLD           MWJHN1
     C                     KFLD           MWJHN2
     C                     KFLD           MWJHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
     C                     PARM           PYYMM   6
     C                     PARM           PKADO   2
      *
     C   11                GOTO STEP00
     C                     SETON                     11
     C                     TIME           WTIME   60
     C   U8                SETON                     06    iﾞlﾆﾞ
      *
     C                     MOVE PYYMM     WYYMM
     C                     MOVE PKADO     WKADO   20
     C                     Z-ADD0         KSRYO
     C                     Z-ADD0         GSRYO
     C                     Z-ADD0         JSRYOA
     C                     Z-ADD0         JSRYO
      *
     C                     SETOF                     70
     C           PUS       CHAINRGAPL111             70
     C           *IN70     IFEQ '0'
     C           J8SKJY    IFEQ *BLANK
     C                     MOVELJ8NAME    WUSNM   8
     C                     END
     C                     END
     C           STEP00    TAG
      *
     C                     SETOF                     10
     C           MBMBMN    CABEQ0111      STEP02           IAF
     C                     GOTO END
      *
     C           STEP02    TAG
     C  NL1                GOTO END
     C   L6                SETOF                     04
     C   L6      MBMBMN    CHAINFGBPL011             04
     C   L6 04             MOVE *BLANK    BMEI   15
     C   L6N04             MOVELB2SMEI    BMEI
     C  NL4                GOTO STEP01
      *
     C                     SETOF                     01
     C           KKEY2     CHAINMFBPL201             01
     C   01                Z-ADD0         M2SIRT
     C                     SETOF                     01
     C           KKEY      CHAINMFAPL251             01
     C   01                MOVE *BLANK    M@BUKA
     C   01                MOVE *BLANK    M@KAKA
     C   01                Z-ADD0         M@RPMH
     C           STEP01    TAG
      *
     C** 01                GOTO END
      *
     C   06                GOTO STEP23
     C                     SETOF                     02
     C           HKEY      CHAINFCAPL071             02
     C   02                Z-ADD0         WSRYOA
     C  N02                Z-ADDN5JHKN    WSRYOA
     C                     GOTO STEP24
     C           STEP23    TAG
      *
     C                     SETOF                     02
     C           HSKEY     CHAINMBEPL051             02
     C   02                Z-ADD0         WSRYO   90
     C  N02                Z-ADDSU,M      WSRYO   90
     C           WSRYO     DIV  WKADO     WSRYOA
     C           STEP24    TAG
      *
     C           JSRYO     ADD  WSRYOA    JSRYO   90
     C                     SETOF                     03
     C           HKEY      CHAINFCEPL011             03
     C   03                Z-ADD0         A2GEKN
     C           A2GEKN    DIV  20        WGEKN   90
     C                     SETON                     10
     C           KHIN3     COMP JHIN3                1212
      *
     C****************************************************************
     C*       ﾃcmbp jbﾆm f]ﾈbﾍ]ﾌﾞ]<ﾃﾍ]ﾌﾞ]> ･ ﾍﾜlc                    *
     C****************************************************************
     C                     MOVE MBMKTE    KKOTE   3
     C                     MOVE MBMHN1    KHBN1
     C                     MOVE MBMHN2    KHBN2
     C                     MOVE MBMHN3    KHBN3
     C                     MOVE MBMBMN    KBMON   40
     C                     MOVE MBMBN1    KMBN1
     C                     MOVE MBMBN2    KMBN2
     C                     MOVE MBMBN3    KMBN3
     C                     MOVE MBMBN4    KMBN4
     C                     MOVE *BLANK    KJHN1
     C                     MOVE *BLANK    KJHN2
     C                     MOVE *BLANK    KJHN3
     C                     Z-ADD0         GSRYO   90
      *
     C  NL5                GOTO STEP04
     C           KSRYO     CABEQ0         STEP04
      *
     C                     EXCPTKTO
     C   OF                EXCPTHD
     C                     Z-ADD0         KSRYO
     C                     Z-ADD0         JSRYOA  90
      *
     C           STEP04    TAG
     C           *IN88     IFEQ '0'
     C                     SETON                     88
     C                     EXCPTHD
     C                     ELSE
      *
     C   L6                EXCPTHD
     C                     END
      *
     C   10                EXCPTMSA
     C   OF                EXCPTHD
      *
     C                     SETOF                     05
     C           NKEY      SETLLGHCNL221
     C           STEP7     TAG
      *
     C                     SETOF                     20
     C                     READ GHCNL221                 20
     C   20                GOTO STEP8
      *
     C           KHIN6     CABNEKHBAN     STEP8
     C           MWMBMN    CABNEKBMON     STEP8
     C           MWMKTE    CABNEKKOTE     STEP8
     C           WBANC     CABNEKBANC     STEP8
     C           MWSETI    DIV  20        GSRYOA  90
     C           GSRYO     ADD  GSRYOA    GSRYO
     C           JHIN6     CABEQKHBAN     STEP7
     C                     MOVE *BLANK    WDHYO
     C           KHIN6     CABNEJHIN6     STEP03
     C                     MOVE 'D'       WDHYO   1
      *
     C           STEP03    TAG
     C   06                GOTO STEP21
     C                     SETOF                     02
     C           AKEY      CHAINFCAPL071             02
     C   02                Z-ADD0         WSRYOA
     C  N02                Z-ADDN5JHKN    WSRYOA
     C                     GOTO STEP22
     C           STEP21    TAG
      *
     C                     SETOF                     02
     C           ASKEY     CHAINMBEPL051             02
     C   02                Z-ADD0         WSRYOA  90
     C  N02                Z-ADDSU,M      WSRYO   90
     C  N02      WSRYO     DIV  WKADO     WSRYOA    H
     C           STEP22    TAG
     C           JSRYO     ADD  WSRYOA    JSRYO   90
      *
     C                     SETON                     05
     C                     EXCPTMS
     C   OF                EXCPTHD
     C                     GOTO STEP7
     C           STEP8     TAG
      *
     C  N05                GOTO STEP09
     C           GSRYO     CABEQ0         STEP09
     C                     EXCPTSTO
     C   OF                EXCPTHD
      *
     C           STEP09    TAG
     C           GSRYO     ADD  KSRYO     KSRYO   90
     C           JSRYOA    ADD  JSRYO     JSRYOA
     C                     Z-ADD0         GSRYO
     C                     Z-ADD0         JSRYO
     C           END       TAG
      *
     CLR                   EXCPTKTO
      *
     OQPRINT  E  102           HD
     O                                   11 'RCHR12-K8H1'
     O                         Y     Z   18
     O                                   19 '.'
     O                         M     Z   21
     O                                   27 'MONTH'
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  128 '..................'
     O        E  1             HD
     O                                   55 '*** PART NO LIST'
     O                                   74 'BY MACHINE NO. ***'
     O                                  111 '.'
     O                                  119 '.'
     O                                  128 '.'
     O        E  1             HD
     O                         MBMBMN     5
     O                         BMEI      22
     O                                   99 'DATE'
     O                         UDATE Y  108
     O                                  111 '.'
     O                                  119 '.'
     O                                  128 '.'
     O                         WUSNM    127
     O        E  2             HD
     O                                   99 'TIME'
     O                         WTIME Y  108
     O                                  128 '..................'
     O        E  1             HD
     O                                    7 'SEC'
     O                                   13 'MCH'
     O                                   18 'MCH'
     O                                   24 'PROC'
     O                                   29 'INST'
     O                                   41 'PART NAME'
     O                                   54 'MATERIAL'
     O                                   70 'DIAMETER'
     O                                   77 'LENGTH'
     O                                   88 'SET NBR/20'
     O                         M     Z   92
     O                 06                99 'ACTUAL/'
     O                 06      PKADO    101
     O                N06                99 '10 DAY/'
     O                N06      UKADO    101
     O                                  110 'TURN NBR'
     O                                  121 'PRFOMCE'
     O*                                 102 'ﾍlﾑcﾆﾞf]/H'
     O        E  1             HD
     O                                   13 'GRP'
     O                                   17 'NO'
     O                                  122 'OPE RATE'
     O        E 11             MSA
     O*                        M8KKR1     4
     O*                                   5 '-'
     O                         M@BUKA     6
     O                                    7 '-'
     O                         M@KAKA     8
     O                         M@KGUN    13
     O                         MSNO1     16
     O                                   17 '-'
     O                         MSNO2     19
     O                         MBMKTE    24
     O                 12                27 'D'
     O                         MBMHN1    35
     O                                   36 '-'
     O                         MBMHN2    41
     O                                   42 '-'
     O                         MBMHN3    44
     O                         A2ZANM    61
     O                         A2SAIZ1   67
     O                         A2KUBI1   74
     O                         WGEKN 1   89
     O                         WSRYOA1  101
     O                         M@RPMH1  111
     O                         M2SIRT1  121
     O                                  123 '%'
     O        E  1             MS
     O                         WDHYO     27
     O                         MWJHN1    35
     O                                   36 '-'
     O                         MWJHN2    41
     O                                   42 '-'
     O                         MWJHN3    44
     O                         A2ZANM    61
     O                         A2SAIZ1   67
     O                         A2KUBI1   74
     O                         GSRYOA1   89
     O                         WSRYOA1  101
     O        E  1             STO
     O                                   40 '* PART NO TOTAL *'
     O                         GSRYO     89 '   ,   , * '
     O                         JSRYO    101 '   ,   , * '
     O        E  2             KTO
     O                                   40 '* MACHINE NO TOTAL *'
     O                         KSRYO  B  89 '   ,   , * '
     O                         JSRYOA B 101 '   ,   , * '
     OOUTPUT1 E                MSA
     O                         M@BUKA
     O                                      '-'
     O                         M@KAKA
     O                                      ','
     O                         M@KGUN
     O                                      ','
     O                         MSNO1
     O                                      '-'
     O                         MSNO2
     O                                      ','
     O                         MBMKTE
     O                                      ','
     O                                      'D'
     O                                      ','
     O                         MBMHN1
     O                                      '-'
     O                         MBMHN2
     O                                      '-'
     O                         MBMHN3
     O                                      ','
     O                         A2ZANM
     O                                      ','
     O                         A2SAIZ2
     O                                      ','
     O                         A2KUBI2
     O                                      ','
     O                         WGEKN
     O                                      ','
     O                         WSRYOA
     O                                      ','
     O                         M@RPMH
     O                                      ','
     O                         M2SIRT
     O        E                MS
     O                         M@BUKA
     O                                      '-'
     O                         M@KAKA
     O                                      ','
     O                         M@KGUN
     O                                      ','
     O                         MSNO1
     O                                      '-'
     O                         MSNO2
     O                                      ','
     O                         MBMKTE
     O                                      ','
     O                         WDHYO
     O                                      ','
     O                         MWJHN1
     O                                      '-'
     O                         MWJHN2
     O                                      '-'
     O                         MWJHN3
     O                                      ','
     O                         A2ZANM
     O                                      ','
     O                         A2SAIZ2
     O                                      ','
     O                         A2KUBI2
     O                                      ','
     O                         GSRYOA
     O                                      ','
     O                         WSRYOA
     O                                      ','
     O                         M@RPMH
     O                                      ','
     O                         M2SIRT
