     H            Y.
     F** RCHR13 ********************************************
     F* SECTION . MACHINE NO  ALLOCATED PART NUMBER LIST                *
     F*            M-OKUDA             1983.11.16          *
      *
      *            H.AMANO             2003.04.16
      *            H.AMANO             2003.05.07
     F******************************************** RCHR13 **
     FRCHWP11 IT  F       7           EDISK
     FGHCNL21 IF  E           K        DISK
     FGHCNL22 IF  E           K        DISK
     FMFAPL25 IF  E           K        DISK
     FMFAPL29 IF  E           K        DISK
     FMFBPL20 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FFCAPL07 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
%0001FMBDPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
%0001F***OUTPUT1 O   F      16            DISK
     E                    SU         12  9 0             12fiﾞlﾇcﾒﾑc
     E    RCHWP11         HA      1  30  4 0 HB      3   ﾆﾞﾑci]KEY
     IFCHDP1     UDS
     I                                        1   1 UJYUN
     I                                        2   3 UKADO
     I                                        4   7 UNEN
     I                                        8   9 UTUKI
     I            DS
     I                                        1   3 MBMSNO
     I                                        1   1 MSNO1
     I                                        2   3 MSNO2
     I                                        4  15 KHIN3
     I                                        4   8 MBMHN1
     I                                        9  13 MBMHN2
     I                                       14  15 MBMHN3
     I                                       16  27 JHIN3
     I                                       16  20 MBJHN1
     I                                       21  25 MBJHN2
     I                                       26  27 MBJHN3
     I                                       28  39 KHIN6
     I                                       28  32 MWMHN1
     I                                       33  37 MWMHN2
     I                                       38  39 MWMHN3
     I                                       40  51 JHIN6
     I                                       40  44 MWJHN1
     I                                       45  49 MWJHN2
     I                                       50  51 MWJHN3
     I                                       52  63 KHBAN
     I                                       52  56 KHBN1
     I                                       57  61 KHBN2
     I                                       62  63 KHBN3
     I                                       64  69 KBANC
     I                                       64  64 KMBN1
     I                                       65  66 KMBN2
     I                                       67  68 KMBN3
     I                                       69  69 KMBN4
     I                                       70  81 KJHIN
     I                                       70  74 KJHN1
     I                                       75  79 KJHN2
     I                                       80  81 KJHN3
     I                                       82  87 WBANC
     I                                       82  82 MWMBN1
     I                                       83  84 MWMBN2
     I                                       85  86 MWMBN3
     I                                       87  87 MWMBN4
     I                                      119 2260SU
     I                                      119 1270I6SRO1
     I                                      128 1360I6SRO2
     I                                      137 1450I6SRO3
     I                                      146 1540I6SRO4
     I                                      155 1630I6SRO5
     I                                      164 1720I6SRO6
     I                                      173 1810I6SRO7
     I                                      182 1900I6SRO8
     I                                      191 1990I6SRO9
     I                                      200 2080I6SROA
     I                                      209 2170I6SROB
     I                                      218 2260I6SROC
     I                                      231 2360WYYMM
     I                                      231 2340Y
     I                                      235 2360M
     C****************************************************************
     C*   < ﾎﾟﾜhﾞ[w ﾉ ﾆﾞｭci] >                                       *
     C*                                                              *
     C*     U1 = udﾉﾎﾟﾜhﾞ[w mﾞ gz]ﾈﾓ ,  U2 = ALL-LIST UP  ( FCHR35 ) *
     C*..............................................................*
     C*     U3 = ﾎﾞy]ﾆmb             ,  U4 = gﾌﾞ] ﾆmb                *
     C*     U5 = ghﾞ] ﾆmb            ,  U6 = vﾆﾑc                    *
     C*     U7 = vﾆﾑc                ,  U8 = NO iﾞlﾆﾞ. OFF ﾆﾞﾏ]mﾞ-j  *
     C****************************************************************
      *
     C           KEY12     KLIST
     C                     KFLD           WBMON
     C                     KFLD           WGRUP
     C                     KFLD           WKBAN
      *
     C           KEY35     KLIST
     C                     KFLD           WBMON
     C                     KFLD           WKBAN
     C                     KFLD           WKOTE
     C                     KFLD           WMHN1
     C                     KFLD           WMHN2
     C                     KFLD           WMHN3
      *
     C           KKEY      KLIST
     C                     KFLD           KBMON
     C                     KFLD           KMSNO
     C                     KFLD           KMKTE
      *
     C           KKEY2     KLIST
     C                     KFLD           KBMON
     C                     KFLD           Y
     C                     KFLD           M
     C                     KFLD           KMSNO
      *
     C           HKEY      KLIST
     C                     KFLD           MBMHN1
     C                     KFLD           MBMHN2
     C                     KFLD           MBMHN3
      *
     C           JSKEY     KLIST
     C                     KFLD           Y
     C                     KFLD           MBMHN1
     C                     KFLD           MBMHN2
     C                     KFLD           MBMHN3
      *
     C           AKEY      KLIST
     C                     KFLD           MWJHN1
     C                     KFLD           MWJHN2
     C                     KFLD           MWJHN3
      *
     C           NKEY      KLIST
     C                     KFLD           KHBN1
     C                     KFLD           KHBN2
     C                     KFLD           KHBN3
     C                     KFLD           KKOTE
     C                     KFLD           KBMON
     C                     KFLD           KMBN1
     C                     KFLD           KMBN2
     C                     KFLD           KMBN3
     C                     KFLD           KMBN4
     C                     KFLD           KJHN1
     C                     KFLD           KJHN2
     C                     KFLD           KJHN3
      *
     C           ASKEY     KLIST
     C                     KFLD           Y
     C                     KFLD           MWJHN1
     C                     KFLD           MWJHN2
     C                     KFLD           MWJHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
     C                     PARM           PYYMM   6
     C                     PARM           PKADO   2
      *
     C                     TIME           WTIME   60
     C                     MOVE PYYMM     WYYMM
     C                     MOVE PKADO     WKADO   20
     C                     Z-ADD0         KSRYO
     C                     Z-ADD0         GSRYO
     C                     Z-ADD0         JSRYOA
     C                     Z-ADD0         JSRYO
     C                     Z-ADD1         I
      *
     C                     SETOF                     70
     C           PUS       CHAINRGAPL111             70
     C           *IN70     IFEQ '0'
     C           J8SKJY    IFEQ *BLANK
     C                     MOVELJ8NAME    WUSNM   8
     C                     END
     C                     END
      *
     C   U3                GOTO STEPBM
     C   U4                GOTO STEPKB
     C   U5                GOTO STEPKG
     C                     GOTO STEP99
      *
     C****************************************************************
     C*     U3  ﾎﾞy]ﾆmb ﾉ mﾞ-j ﾈ]jhﾆﾑﾒ                               *
     C****************************************************************
     C           STEPBM    TAG
     C                     MOVE HA,1      WBMON
     C                     MOVE *BLANK    WKBAN
     C                     MOVE *BLANK    WMHN1
     C                     MOVE *BLANK    WMHN2
     C                     MOVE *BLANK    WMHN3
     C                     GOTO STEP15
      *
     C****************************************************************
     C*     U5  ghﾞ]ﾆmb ﾉ mﾞ-j ﾈ]jhﾆﾑﾒ  MFAPL29 uﾇj- mﾞ hﾎﾞ]ﾇﾓ       *
     C****************************************************************
     C           STEPKG    TAG
     C           STEP13    TAG
     C           I         CABGT30        END
     C           HA,I      CABEQ0         END
     C                     MOVE HA,I      WBMON   40
     C                     MOVE HB,I      WGRUP   3
     C                     MOVE *BLANK    WKBAN
     C           KEY12     SETLLMFAPL291
     C           STEP14    TAG
      *
     C                     SETOF                     08
     C                     READ MFAPL291                 08
     C   08                GOTO STEP99
     C           M@SKJY    CABEQ'D'       STEP14
     C           M@KOJY    CABNEWBMON     STEP99
     C           M@KGUN    CABNEWGRUP     STEP99
     C                     Z-ADD0         KSRYO
     C                     Z-ADD0         JSRYOA
     C                     MOVE M@KBN1    WKBAN
     C                     MOVE *BLANK    WMHN1
     C                     MOVE *BLANK    WMHN2
     C                     MOVE *BLANK    WMHN3
     C                     GOTO STEP15
      *
     C****************************************************************
     C*     U4  gﾌﾞ]ﾆmb ﾉ mﾞ-j ﾈ]jhﾆﾑﾒ                               *
     C****************************************************************
     C           STEPKB    TAG
     C           I         CABGT30        END
     C           HA,I      CABEQ0         END
     C                     MOVE HA,I      WBMON   40
     C                     MOVE HB,I      WKBAN   3
     C                     MOVE *BLANK    WKOTE   3
     C                     MOVE *BLANK    WMHN1   5
     C                     MOVE *BLANK    WMHN2   5
     C                     MOVE *BLANK    WMHN3   2
     C           STEP15    TAG
      *
     C                     SETOF                     04
     C           WBMON     CHAINFGBPL011             04
     C   04                MOVE *BLANK    BMEI   15
     C  N04                MOVELB2SMEI    BMEI
     C  N07                EXCPTHD
     C  N07                SETON                     07
     C           KEY35     SETLLGHCNL211
     C           STEP10    TAG
      *
     C                     SETOF                     06
     C                     READ GHCNL211                 06
     C   06                GOTO STEP99
     C           MBMBMN    CABNEWBMON     STEP99
     C           MBMSNO    CABNEWKBAN     STEP20
     C           MBMBMN    CABNEKBMON     STEP12
     C           MBMSNO    CABNEKMSNO     STEP12
     C           MBMKTE    CABNEKMKTE     STEP12
     C           MBMHN1    CABNEKMHN1     STEP12
     C           MBMHN2    CABNEKMHN2     STEP12
     C           MBMHN3    CABNEKMHN3     STEP12
     C                     GOTO STEP10
     C           STEP20    TAG
      *
     C           KSRYO     CABEQ0         STEP04
     C                     EXCPTKTO
      *
     C                     SETOF                     09
     C   U4      I         COMP 30                       09
     C   U4N09   I         ADD  1         X       20
     C   U4N09   HA,X      COMP 0                        09
     C   U4N09             EXCPTHD
      *
     C   U3                EXCPTHD
     C   U3                MOVE MBMSNO    WKBAN
      *
     C                     Z-ADD0         KSRYO
     C                     Z-ADD0         JSRYOA  90
     C           STEP04    TAG
      *
     C   U4                GOTO STEP99
     C   U5                GOTO STEP14
     C           STEP12    TAG
      *
     C                     MOVE MBMBMN    KBMON   40
     C                     MOVE MBMSNO    KMSNO   3
     C                     MOVE MBMKTE    KMKTE   3
     C                     MOVE MBMHN1    KMHN1   5
     C                     MOVE MBMHN2    KMHN2   5
     C                     MOVE MBMHN3    KMHN3   2
      *
     C                     SETOF                     01
     C           KKEY2     CHAINMFBPL201             01
     C   01                Z-ADD0         M2SIRT
      *
     C                     SETOF                     01
     C           KKEY      CHAINMFAPL251             01
     C   01                MOVE *BLANK    M@BUKA
     C   01                MOVE *BLANK    M@KAKA
     C   01                Z-ADD0         M@RPMH
     C   01                GOTO STEP10
     C   U8                GOTO STEP23
      *
     C                     SETOF                     02
     C           HKEY      CHAINFCAPL071             02
     C   02                Z-ADD0         WSRYOA
     C  N02                Z-ADDN5JHKN    WSRYOA
     C                     GOTO STEP24
     C           STEP23    TAG
      *
     C                     SETOF                     02
     C           JSKEY     CHAINMBEPL051             02
     C   02                Z-ADD0         WSRYO   90
     C  N02                Z-ADDSU,M      WSRYO   90
     C           WSRYO     DIV  WKADO     WSRYOA
     C           STEP24    TAG
      *
     C           JSRYO     ADD  WSRYOA    JSRYO   90
      *
     C                     SETOF                     03
     C           HKEY      CHAINFCEPL011             03
     C   03                Z-ADD0         A2GEKN
     C           A2GEKN    DIV  20        WGEKN   90
     C                     SETON                     10
     C           KHIN3     COMP JHIN3                1212
      *
     C****************************************************************
     C*       ﾃcmbp jbﾆm f]ﾈbﾍ]ﾌﾞ]<ﾃﾍ]ﾌﾞ]> ･ ﾍﾜlc                    *
     C****************************************************************
     C                     MOVE MBMKTE    KKOTE   3
     C                     MOVE MBMHN1    KHBN1
     C                     MOVE MBMHN2    KHBN2
     C                     MOVE MBMHN3    KHBN3
     C                     MOVE MBMBMN    KBMON   40
     C                     MOVE MBMBN1    KMBN1
     C                     MOVE MBMBN2    KMBN2
     C                     MOVE MBMBN3    KMBN3
     C                     MOVE MBMBN4    KMBN4
     C                     MOVE *BLANK    KJHN1
     C                     MOVE *BLANK    KJHN2
     C                     MOVE *BLANK    KJHN3
      *
     C                     Z-ADD0         GSRYO   90
     C   10                EXCPTMSA
%0001 *
     C                     MOVE *BLANK    BAR1    1
     C           MBMHN3    IFNE *BLANK
     C                     MOVE '-'       BAR1
     C                     END
     C                     EXSR #SB100
     C***        CFLG      IFEQ '*'
     C***10                EXCPTDT
     C***                  END
%0001 *
     C   OF                EXCPTHD
      *
     C                     SETOF                     05
     C           NKEY      SETLLGHCNL221
     C           STEP7     TAG
      *
     C                     SETOF                     20
     C                     READ GHCNL221                 20
     C   20                GOTO STEP8
      *
     C           KHIN6     CABNEKHBAN     STEP8
     C           MWMBMN    CABNEKBMON     STEP8
     C           MWMKTE    CABNEKKOTE     STEP8
     C           WBANC     CABNEKBANC     STEP8
     C           MWSETI    DIV  20        GSRYOA  90
     C           GSRYO     ADD  GSRYOA    GSRYO
     C           JHIN6     CABEQKHBAN     STEP7
     C                     MOVE *BLANK    WDHYO
     C           KHIN6     CABNEJHIN6     STEP03
     C                     MOVE 'D'       WDHYO   1
     C           STEP03    TAG
      *
     C   U8                GOTO STEP21
      *
     C                     SETOF                     02
     C           AKEY      CHAINFCAPL071             02
     C   02                Z-ADD0         WSRYOA
     C  N02                Z-ADDN5JHKN    WSRYOA
     C                     GOTO STEP22
     C           STEP21    TAG
      *
     C                     SETOF                     02
     C           ASKEY     CHAINMBEPL051             02
     C   02                Z-ADD0         WSRYOA  90
     C  N02                Z-ADDSU,M      WSRYO   90
     C  N02      WSRYO     DIV  WKADO     WSRYOA    H
     C           STEP22    TAG
      *
     C           JSRYO     ADD  WSRYOA    JSRYO   90
     C                     SETON                     05
     C                     EXCPTMS
     C   OF                EXCPTHD
     C                     GOTO STEP7
     C           STEP8     TAG
      *
     C  N05                GOTO STEP09
     C           GSRYO     CABEQ0         STEP09
     C                     EXCPTSTO
     C   OF                EXCPTHD
     C           STEP09    TAG
      *
     C           GSRYO     ADD  KSRYO     KSRYO   90
     C           JSRYOA    ADD  JSRYO     JSRYOA
     C           GSRYO     ADD  FSRYO     FSRYO   90
     C           JSRYO     ADD  FSRYOA    FSRYOA  90
     C                     Z-ADD0         GSRYO
     C                     Z-ADD0         JSRYO
     C                     GOTO STEP10
     C           STEP99    TAG
      *
     C           I         CABGE30        END
     C           I         ADD  1         I       20
     C   U4                GOTO STEPKB
     C   U5                GOTO STEP13
     C           END       TAG
      *
     C                     SETON                     LR
     CLR                   EXCPTFTO
%0001 *-----------------------------------------------------*
     C           #SB100    BEGSR
     C           KEY1      KLIST
     C                     KFLD           MBMHN1
     C                     KFLD           MBMHN2
     C                     KFLD           MBMHN3
     C                     MOVE *BLANK    CFLG    1
     C                     SETOF                     77
     C           KEY1      SETLLMBDPL011
     C                     DO   *HIVAL
     C                     READEMBDPL011                 77
     C           *IN77     IFEQ '0'
     C           F3SKJY    ANDEQ*BLANK
     C           F3TOKU    IFEQ 0541
     C           F3TOKU    OREQ 3411
     C                     MOVE '*'       CFLG
     C                     SETON                     77
     C                     END
     C                     END
     C  N77                ENDDO
     C           ESB100    ENDSR
%0001 *-----------------------------------------------------*
      *
     OQPRINT  E  102           HD
     O                                   11 'RCHR13-K8H1'
     O                         Y     Z   18
     O                                   19 '.'
     O                         M     Z   21
     O                                   27 'MONTH '
     O                                   99 'PAGE'
     O                         PAGE  Z  103
     O                                  128 '..................'
     O        E  1             HD
     O                                   55 '*** PART NO LIST'
     O                                   74 'BY MACHINE NO. ***'
     O                                  111 '.'
     O                                  119 '.'
     O                                  128 '.'
     O        E  1             HD
     O                         WBMON      5
     O                         BMEI      22
     O                                   99 'DATE'
     O                         UDATE Y  108
     O                                  111 '.'
     O                                  119 '.'
     O                                  128 '.'
     O                         WUSNM    127
     O        E  2             HD
     O                 U3                60 'SECTION APPOINTMENT'
     O                 U4                60 'MACHINE NO APPOINTMENT'
     O                 U5                48 'MACHINE GROUP'
     O                 U5                60 ' APPOINTMENT'
     O                                   99 'TIME'
     O                         WTIME Y  108
     O                                  128 '..................'
     O        E  1             HD
     O                                    7 'SEC'
     O                                   13 'MCH'
     O                                   18 'MCH'
     O                                   24 'PROC'
     O                                   29 'INST'
     O                                   38 'LOCATION'
     O                                   51 'PART NAME '
     O                                   66 'SET NBR/D'
     O                         M     Z   70
     O                 U8                77 'ACTUAL/'
     O                 U8      PKADO     79
     O                NU8                77 '10 DAY/'
     O                NU8      UKADO     79
     O                                   88 'TURN NBR'
     O                                   99 'PRFOMCE'
     O*                                 112 'ﾍlﾑcﾆﾞf]/H'
     O                                  110 'MATERIAL'
     O                                  126 'DIAMETER'
     O        E  1             HD
     O                                   13 'GRP'
     O                                   17 'NO'
     O                                  100 'OPE RATE'
     O        E 11             MSA
     O*                        M8KKR1     4
     O*                                   5 '-'
     O                         M@BUKA     6
     O                                    7 '-'
     O                         M@KAKA     8
     O                         M@KGUN    13
     O                         MSNO1     16
     O                                   17 '-'
     O                         MSNO2     19
     O                         MBMKTE    24
     O                 12                27 'D'
     O                         MBMBN1    31
     O                                   32 '-'
     O                         MBMBN2    34
     O                                   35 '-'
     O                         MBMBN3    37
     O                                   38 '-'
     O                         MBMBN4    39
     O                         MBMHN1    45
     O                                   46 '-'
     O                         MBMHN2    51
     O                                   52 '-'
     O                         MBMHN3    54
     O                         WGEKN 1   66
     O                         WSRYOA1   78
     O                         M@RPMH1   88
     O                         M2SIRT1   98
     O                                  100 '%'
     O                      N03A2ZANM   117
     O                      N03A2KAZI4  124
     O        E  1             MS
     O                         WDHYO     27
     O                         MWJHN1    45
     O                                   46 '-'
     O                         MWJHN2    51
     O                                   52 '-'
     O                         MWJHN3    54
     O                         GSRYOA1   66
     O                         WSRYOA1   78
     O                      N03A2ZANM   117
     O                      N03A2KAZI4  124
     O        E  1             STO
     O                                   50 '* PART NO TOTAL *'
     O                         GSRYO     66 '   ,   , * '
     O                         JSRYO     78 '   ,   , * '
     O        E  1             KTO
     O                                   50 '* MACHINE NO TOTAL *'
     O                         KSRYO  B  66 '   ,   , * '
     O                         JSRYOA B  78 '   ,   , * '
     O        E  1             FTO
     O                                   50 '* FINALS TOTAL *'
     O                         FSRYO  B  66 '   ,   , * '
     O                         FSRYOA B  78 '   ,   , * '
     O***OUTPUT1 E                DT
     O                         MBMHN1
     O*                                     '-'
     O                         MBMHN2
     O*                        BAR1
     O                         MBMHN3
