     H*
     F***************************************************************
     F* RCLR61 OUT GOING VOTE INPUT                             *
     F*           '84.07.04 N.SHIBAYAMA                             *
     F***************************************************************
     FRCLPW61 CF  E                    WORKSTN
     FDC#PL11 UF  E           K        DISK
     E                    ER      1   3 60
     E                    NN     10  10  1
     E                    TN         32  6
     E                    MI         32  3 0
     I            DS
     I                                        1 192 TN
     I                                        1   6 TNO1
     I                                        7  12 TNO2
     I                                       13  18 TNO3
     I                                       19  24 TNO4
     I                                       25  30 TNO5
     I                                       31  36 TNO6
     I                                       37  42 TNO7
     I                                       43  48 TNO8
     I                                       49  54 TNO9
     I                                       55  60 TNO10
     I                                       61  66 TNO11
     I                                       67  72 TNO12
     I                                       73  78 TNO13
     I                                       79  84 TNO14
     I                                       85  90 TNO15
     I                                       91  96 TNO16
     I                                       97 102 TNO17
     I                                      103 108 TNO18
     I                                      109 114 TNO19
     I                                      115 120 TNO20
     I                                      121 126 TNO21
     I                                      127 132 TNO22
     I                                      133 138 TNO23
     I                                      139 144 TNO24
     I                                      145 150 TNO25
     I                                      151 156 TNO26
     I                                      157 162 TNO27
     I                                      163 168 TNO28
     I                                      169 174 TNO29
     I                                      175 180 TNO30
     I                                      181 186 TNO31
     I                                      187 192 TNO32
     I            DS
     I                                        1  96 MI
     I                                        1   30MAI1
     I                                        4   60MAI2
     I                                        7   90MAI3
     I                                       10  120MAI4
     I                                       13  150MAI5
     I                                       16  180MAI6
     I                                       19  210MAI7
     I                                       22  240MAI8
     I                                       25  270MAI9
     I                                       28  300MAI10
     I                                       31  330MAI11
     I                                       34  360MAI12
     I                                       37  390MAI13
     I                                       40  420MAI14
     I                                       43  450MAI15
     I                                       46  480MAI16
     I                                       49  510MAI17
     I                                       52  540MAI18
     I                                       55  570MAI19
     I                                       58  600MAI20
     I                                       61  630MAI21
     I                                       64  660MAI22
     I                                       67  690MAI23
     I                                       70  720MAI24
     I                                       73  750MAI25
     I                                       76  780MAI26
     I                                       79  810MAI27
     I                                       82  840MAI28
     I                                       85  870MAI29
     I                                       88  900MAI30
     I                                       91  930MAI31
     I                                       94  960MAI32
     I            DS
     I                                        1   6 TTT
     I                                        1   1 TTT1
     I                                        2   2 TTT2
     I                                        3   40TTT3
     I                                        5   60TTT4
     I            DS
     I                                        1   6 WWW
     I                                        3   3 WWW3
     I                                        4   4 WWW4
     I                                        5   5 WWW5
     I                                        6   6 WWW6
     C           TNKEY     KLIST
     C                     KFLD           TTT1
     C                     KFLD           TTT2
     C                     KFLD           TTT3
     C                     KFLD           TTT4
     C***************************************************************
     C* CL.7.1.1  fﾞx] ﾎb-ﾓnﾞ hﾒa-                                  *
     C***************************************************************
     C           STEP1     TAG
     C                     Z-ADD1         I       20
     C           1         DO   32        I
     C                     MOVE *BLANK    TN,I
     C                     Z-ADD0         MI,I
     C                     MOVE '0'       *IN,I
     C                     END
     C                     SETOF                     90
     C***************************************************************
     C* CL.7.1.2  fﾞx] 1 ﾍﾑcﾆﾞ                                      *
     C***************************************************************
     C           STEP2     TAG
     C                     EXFMTRCLPW611
     C   KA                SETON                     LR
     C   KA                RETRN
     C***************************************************************
     C* CL.7.2    fﾞx] 1 kdlh                                       *
     C***************************************************************
     C                     Z-ADD1         I
     C           1         DO   32        I
     C                     MOVE '0'       *IN,I
     C                     END
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    ERSW    1
     C                     EXSR #CHE
     C           ERSW      CABEQ'*'       STEP2          90
     C   KE                GOTO ED
     C                     GOTO STEP2
     C           ED        TAG
     C                     EXSR #UP
     C                     GOTO STEP1
     C***************************************************************
     C* CL.7.2    fﾞx] 1 kdlh                                       *
     C***************************************************************
     C           #CHE      BEGSR
     C                     Z-ADD1         I
     C           1         DO   32        I
     C                     SETOF                         90
     C           TN,I      IFNE *BLANK
     C                     MOVE TN,I      WWW
     C                     Z-ADD1         Z       20
     C           WWW3      LOKUPNN,Z                     50
     C   50                Z-ADD1         Z
     C   50      WWW4      LOKUPNN,Z                     50
     C   50                Z-ADD1         Z
     C   50      WWW5      LOKUPNN,Z                     50
     C   50                Z-ADD1         Z
     C   50      WWW6      LOKUPNN,Z                     50
     C  N50                MOVE '*'       ERSW
     C  N50                MOVELER,2      MSG
     C  N50                SETON                     90
     C  N50                MOVE '1'       *IN,I
     C  N50                GOTO CHEEND
     C                     MOVE TN,I      TTT
     C           TNKEY     CHAINDC#PL111             40
     C   40                MOVE '*'       ERSW
     C   40                MOVELER,1      MSG
     C   40                MOVE '1'       *IN,I
     C   40                SETON                     90
     C  N40      P5SKJY    IFEQ 'D'
     C                     MOVE '*'       ERSW
     C                     MOVELER,1      MSG
     C                     MOVE '1'       *IN,I
     C                     SETON                     90
     C                     END
     C           TN,I      IFNE *BLANK
     C           MI,I      IFEQ 0
     C                     MOVE '*'       ERSW
     C                     MOVELER,3      MSG
     C                     MOVE '1'       *IN,I
     C                     SETON                     90
     C                     END
     C                     END
     C           CHEEND    TAG
     C                     END
     C  N90                END
     C                     ENDSR
     C***************************************************************
     C* CL.7.1.3.3 iﾞ]mb ﾓbﾈg ﾎabﾓ ﾃcﾆ]                             *
     C***************************************************************
     C           #UP       BEGSR
     C                     Z-ADD1         I
     C           1         DO   32        I
     C           TN,I      IFNE *BLANK
     C                     MOVE TN,I      TTT
     C           TNKEY     CHAINDC#PL111             40
     C   40                GOTO EEEE
     C                     ADD  MI,I      P5KMIS
     C           P5KMIS    IFGE P5MAIS
     C                     MOVE *YEAR     P5SYYY
     C                     MOVE UMONTH    P5SYMM
     C                     MOVE UDAY      P5SYDD
     C                     END
     C                     UPDATDC#PL111
     C           EEEE      TAG
     C                     END
     C                     END
     C                     ENDSR
**
E-01 PROD ORDER-NO IS NOT INPUT OR CANCELLED
E-02 CONTENTS OF PROD ORDER-NO IS WRONG
E-03 SHIP ORDER-NO WAS INPUT, BUT THE NUMBER OF SHEETS IS 0
**
0123456789
