     H            Y.
     F*** RCLR52 *********************************
     F* LIMITATION KANBAN INCOMING VOTE BAR CODE INPUT *
     F* S.YAMAGAMI 96.02.16                      *
     F********************************************
     FRCLPW52 CF  E                    WORKSTN
     FFCLPL22 UF  E           K        DISK
     FDC#PL11 UF  E           K        DISK
     E                    ER      1   5 60
     E                    NN     10  10  1
     E                    CHK1        7  1               * ﾌﾞｰﾃｰnﾞ
     E                    TABX1  11  43  1   TABY1   2 0 * CHR->NUMERIC
     E                    TABX2  11  43  2 0 TABY2   1   * NUMERIC->CHR
     I            DS
     I                                        1   6 TTT
     I                                        1   1 TTT1
     I                                        2   2 TTT2
     I                                        3   40TTT3
     I                                        5   60TTT4
     I            DS
     I                                        1   6 ZZZ
     I                                        1   1 ZZZ1
     I                                        2   2 ZZZ2
     I                                        3   4 ZZZ3
     I                                        5   6 ZZZ4
     I            DS
     I                                        1   6 WWW
     I                                        3   3 WWW3
     I                                        4   4 WWW4
     I                                        5   5 WWW5
     I                                        6   6 WWW6
     I            DS
     I                                        1   2 P5BAN2
     I                                        1   1 BAN2
     I            DS
     I                                        1  12 P3HINB
     I                                        1   5 P3HIN1
     I                                        6  10 P3HIN2
     I                                       11  12 P3HIN3
     I            DS
     I                                        1  12 P5HINB
     I                                        1   5 P5HIN1
     I                                        6  10 P5HIN2
     I                                       11  12 P5HIN3
     I            DS
     I                                        1   60WTIME
     I                                        1   20P5KOHH
     I                                        3   40P5KOSS
     I            DS
     I                                        1   80P5KOHZ
     I                                        1   40P5KOYY
     I                                        5   60P5KOMM
     I                                        7   80P5KODD
     I            DS
     I                                        1  14 WHIN
     I                                        1   5 WHIN1
     I                                        6   6 WH1
     I                                        7  11 WHIN2
     I                                       12  12 WH2
     I                                       13  14 WHIN3
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *
     C           TNKEY     KLIST
     C                     KFLD           TTT1
     C                     KFLD           TTT2
     C                     KFLD           TTT3
     C                     KFLD           TTT4
     C           ZKEY      KLIST
     C                     KFLD           ZZZ1
     C                     KFLD           ZZZ2
     C                     KFLD           ZZZ3
     C                     KFLD           ZZZ4
     C*
     C                     MOVE *ALL'~'   @SEN
     C           STEP1     TAG
     C                     MOVE *BLANK    @BAR
     C           STEP2     TAG
     C                     EXFMTRCLPW521
     C                     SETOF                     0199
     C*
     C           *INKC     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C                     MOVE *BLANK    ERSW    1
     C                     EXSR #CHE
     C*
     C           ERSW      IFEQ '*'
     C                     GOTO STEP2
     C                     END
     C*
     C                     Z-ADD*DATE     P5KOHZ
     C                     TIME           WTIME
     C                     MOVE US        P5KONA
     C                     MOVE *YEAR     P5NKYY
     C                     MOVE UMONTH    P5NKMM
     C                     MOVE UDAY      P5NKDD
     C                     UPDATDC#PL111
     C*
     C           BAN2      IFEQ 'Z'
     C                     MOVE *YEAR     P3SOYY
     C                     MOVE UMONTH    P3SOMM
     C                     MOVE UDAY      P3SODD
     C                     UPDATFCLPL221
     C                     END
     C*
     C                     MOVEL@BAR      WBAR
     C                     MOVE P5HIN1    WHIN1
     C                     MOVE P5HIN2    WHIN2
     C                     MOVE P5HIN3    WHIN3
     C                     MOVE '-'       WH1
     C                     MOVE '-'       WH2
     C                     MOVEL@BAR      WTNO
     C*
     C                     GOTO STEP1
     C*
     C****************************************************************
     C* fﾞx]1 kdlh                                                   *
     C****************************************************************
     C           #CHE      BEGSR
     C*
     C                     MOVEL@BAR      WWW
     C*
     C                     Z-ADD1         Z       20
     C           WWW3      LOKUPNN,Z                     50
     C   50                Z-ADD1         Z
     C   50      WWW4      LOKUPNN,Z                     50
     C   50                Z-ADD1         Z
     C   50      WWW5      LOKUPNN,Z                     50
     C   50                Z-ADD1         Z
     C   50      WWW6      LOKUPNN,Z                     50
     C           *IN50     IFEQ '0'
     C                     MOVE '*'       ERSW
     C                     MOVELER,2      MSG
     C                     SETON                     0199
     C                     GOTO CHEEND
     C                     END
     C*
     C* kｩｮhmﾞﾆﾞｮn
     C                     MOVEA@BAR      CHK1
     C                     Z-ADD0         I       20
     C                     Z-ADD0         WKKEI   50
     C                     MOVE *BLANK    #M43    1
     C           1         DO   6         I
     C                     SETOF                     75
     C           CHK1,I    LOKUPTABX1     TABY1          75
     C           *IN75     IFEQ '1'
     C                     ADD  TABY1     WKKEI
     C                     END
     C                     END
     C*
     C           WKKEI     DIV  43        WKSHO   20
     C                     MVR            WAMARI  20
     C*
     C                     SETOF                     75
     C           WAMARI    LOKUPTABX2     TABY2          75
     C           *IN75     IFEQ '1'
     C                     MOVE TABY2     #M43
     C                     END
     C*
     C                     MOVE @BAR      CHK     1
     C           #M43      IFNE CHK
     C                     MOVE '*'       ERSW
     C                     MOVELER,5      MSG
     C                     SETON                     0199
     C                     GOTO CHEEND
     C                     END
     C*
     C*
     C                     MOVEL@BAR      TTT
     C           TNKEY     CHAINDC#PL111             40
     C           *IN40     IFEQ '1'
     C                     MOVE '*'       ERSW
     C                     MOVELER,1      MSG
     C                     SETON                     0199
     C                     GOTO CHEEND
     C                     END
     C*
     C           P5SKJY    IFEQ 'D'
     C                     MOVE '*'       ERSW
     C                     MOVELER,1      MSG
     C                     SETON                     0199
     C                     GOTO CHEEND
     C                     END
     C*
     C                     EXSR #ZCHE
     C                     EXSR #HICHE
     C*
     C           CHEEND    TAG
     C                     ENDSR
     C****************************************************************
     C* Zﾌﾞ]k uﾇj- kdlh                                              *
     C****************************************************************
     C           #ZCHE     BEGSR
     C           BAN2      CABNE'Z'       ZCHEED
     C                     MOVEL@BAR      ZZZ
     C           ZKEY      CHAINFCLPL221             50
     C   50                GOTO ERR
     C           P3SKJY    CABEQ'D'       ERR
     C           P3HINB    CABNEP5HINB    ERR
     C                     GOTO ZCHEED
     C           ERR       TAG
     C                     MOVE '*'       ERSW
     C                     MOVELER,3      MSG
     C                     SETON                     0199
     C           ZCHEED    ENDSR
     C****************************************************************
     C* pﾏcﾃ ﾍﾞ kdlh                                                 *
     C****************************************************************
     C           #HICHE    BEGSR
     C           P5NKYY    IFEQ 0
     C           P5NKMM    ANDEQ0
     C           P5NKDD    ANDEQ0
     C                     ELSE
     C                     MOVE '*'       ERSW
     C                     MOVELER,4      MSG
     C                     SETON                     0199
     C                     END
     C                     ENDSR
     C*
**
E-01 PROD ORDER-NO IS NOT INPUT OR CANCELLED
E-02 CONTENTS OF PROD ORDER-NO IS WRONG
E-03 PART NO WITH Z LOCATION M/F ISN'T COLLATED
E-04 DAY IN A WEEK MANAGING IN COMING ALREADY IS INPUT
E-05 PLEASE READ ONCE AGAIN
**
0123456789
**     TABX1,TABY1
000101202303404505606707808909A10
B11C12D13E14F15G16H17I18J19K20L21
M22N23O24P25Q26R27S28T29U30V31W32
X33Y34Z35-36.37 38\39/40+41%42
**     TABX2,TABY2
00001102203304405506607708809910A
11B12C13D14E15F16G17H18I19J20K21L
22M23N24O25P26Q27R28S29T30U31V32W
33X34Y35Z36-37.38 39\40/41+42%
