     H            Y.
     F** RCPR11 ********************************************
     F* ORDER RECEIPT POOL DATA FROM POOLKANBAN DATA CREATE                *
     F* < INPUT FILE MUST READ BY INTRAL COMPANY PART NO ORDER
     F*            M-OKUDA             1986.04.24          *
     F******************************************************
     FINPUT   IP  F     200            DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGAAPL11 IF  E           K        DISK
     FAGDPL11 IF  E           K        DISK
     FAAFPL03 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FGA#TL51 IF  E           K        DISK                      A
     FRGAPL11 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    PD         30  8 0             ﾎﾟ-ﾓﾍlﾞi
     E                    PS         30  7 0             mﾌbﾇﾞvﾎﾟｰﾓﾒｭc
     E                    P1         30  7 0             ﾎﾟｰﾓﾒｭc
     E                    PT         30  7 0             ﾃﾞcibﾎﾟｰﾓﾒｭc
     E                    KD         30  6 0             xｮgf]ﾈbﾍﾞ
     E                    HP         14  4 0             fnﾞcﾍﾞ
     E                    MP         14  3 0             ﾌｮﾃcﾇﾞvubﾇc
     E                    BN         15  6               ﾌﾞ]k
     E                    TP         15  1               f]ﾌﾞ]ﾆｬﾓb
     E                    BM      1   7  4 0 ME      6   ﾎﾞy]&xb
     E                    ER      1  18 60               d[- xlﾈ-ﾆﾞ
     IINPUT   AA  01
     I                                        3   60TOKU
     I                                        7   7 TKOJ
     I                                        8  11 TUKE
     I                                       12  150NONY
     I                                       16  16 NKOJ
     I                                       17  20 NUKE
     I                                       21  32 SHIN  L1
     I                                       21  25 SHN1
     I                                       26  30 SHN2
     I                                       31  32 SHN3
     I                                       33  47 MHIN
     I                                       33  37 MHN1
     I                                       38  42 MHN2
     I                                       43  47 MHN3
     I                                       48  57 KBAN
     I                                    P  58  622TANK
     I                                       63  63 TKBN
     I                                       64  64 TTAI
     I                                       65  71 NBAN
     I                                    P  72  750SRYO
     I                                       76  76 TANI
     I                                       77  77 NSYO
     I                                       87  880DTMM
     I                                    P  89  910DRRN
     I                                       92  990SYHZ
     I                                       92  950SYYY
     I                                       96  970SYMM
     I                                       98  990SYDD
     I                                      100 1070NOHZ
     I                                      108 108 JTAI
     I                                      110 110 THAI
     I                                      112 112 SEFU
     I                                      113 113 DATA
     I                                      114 114 POOL
     I                                      115 118 SKEI
     I                                      119 120 NSGT
     I                                      121 140 HMEI
     I                                      141 155 TOKI
     I                                      156 165 NSTE
     I                                      166 171 THNO
     I                                      172 177 ZBAN
     I                                      172 172 ZBN1
     I                                      173 174 ZBN2
     I                                      175 176 ZBN3
     I                                      177 177 ZBN4
     I                                      178 181 EGYO
     I            DS
     I                                        1   80CLYMD
     I                                        1   40CLYY
     I                                        5   60CLMM
     I                                        7   80CLDD
     I            DS
     I                                        1   80MTHAI
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80DLHIZK
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80PRYMD
     I                                        1   40PRYY
     I                                        5   60PRMM
     I                                        7   80PRDD
     I            DS
     I                                        1   80S9SKHZ
     I                                        1   40S9SKYY
     I                                        5   60S9SKMM
     I                                        7   80S9SKDD
     I            DS
     I                                        1   80S9KOHZ
     I                                        1   40S9KOYY
     I                                        5   60S9KOMM
     I                                        7   80S9KODD
     I            DS
     I                                        1   60S9KOTM
     I                                        1   20S9KOHH
     I                                        3   40S9KOSS
     I                                        5   60S9KOBB
     I            DS
     I                                        1  12 S9SHIN
     I                                        1   5 S9SHN1
     I                                        6  10 S9SHN2
     I                                       11  12 S9SHN3
     I            DS
     I                                        1  15 S9MHIN
     I                                        1   5 S9MHN1
     I                                        6  10 S9MHN2
     I                                       11  15 S9MHN3
     I            DS
     I                                        1   7 S9METK
     I                                        1   4 S9MTK1
     I                                        5   6 S9MTK2
     I                                        7   7 S9MTK3
     I            DS
     I                                        1   80S9THHZ
     I                                        1   40S9THYY
     I                                        5   60S9THMM
     I                                        7   80S9THDD
     I            DS
     I                                        1   80S9MEHZ
     I                                        1   40S9MEYY
     I                                        5   60S9MEMM
     I                                        7   80S9MEDD
     I            DS
     I                                        1   80S9PEHZ
     I                                        1   40S9PEYY
     I                                        5   60S9PEMM
     I                                        7   80S9PEDD
     I            DS
     I                                        1   80S9MKHZ
     I                                        1   40S9MKYY
     I                                        5   60S9MKMM
     I                                        7   80S9MKDD
     I            DS
     I                                        1   6 S9PBAN
     I                                        1   1 S9PBN1
     I                                        2   3 S9PBN2
     I                                        4   5 S9PBN3
     I                                        6   6 S9PBN4
     I            DS
     I                                        1   80S9YOHZ
     I                                        1   40S9YOYY
     I                                        5   60S9YOMM
     I                                        7   80S9YODD
     I            DS
     I                                        1   80S9PTHZ
     I                                        1   40S9PTYY
     I                                        5   60S9PTMM
     I                                        7   80S9PTDD
     I            DS
     I                                        1  90 BN
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  15 TP
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1   6 CKBANC
     I                                        1   1 CKBAN1
     I                                        2   3 CKBAN2
     I                                        4   5 CKBAN3
     I                                        6   6 CKBAN4
     I            DS
     I                                        1   6 A3BANC
     I                                        1   1 A3ATK1
     I                                        2   3 A3ATK2
     I                                        4   5 A3ATK3
     I                                        6   6 A3ATK4
     I            DS
     I                                        1   80A3UKHZ
     I                                        1   40A3UKYY
     I                                        5   60A3UKMM
     I                                        7   80A3UKDD
     I            DS
     I                                        1   80A3STHZ
     I                                        1   40A3STYY
     I                                        5   60A3STMM
     I                                        7   80A3STDD
     C******************************************************
     C* M-NO               ﾑhﾆﾞlf[ fnﾞcﾍﾞmﾞ 30pkﾉ fﾛ]jｰIN  *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           PUSER  10
     C           CLKEY     KLIST
     C                     KFLD           CLYY
     C                     KFLD           CLMM
     C                     KFLD           CLDD
     C           *IN02     IFEQ '0'
     C                     SETON                     02
     C                     MOVE *BLANK    TNAME
     C                     SETOF                     13
     C           PUSER     CHAINRGAPL111             13
     C           *IN13     IFEQ '0'
     C                     MOVELJ8NAME    TNAME   9
     C                     END
     C                     TIME           WTIME   60
     C                     EXCPTHD
     C                     SETOF                     03
     C                     MOVE *DATE     CLYMD
     C           CLKEY     SETLLAGDPL11
     C                     Z-ADD0         PD
     C                     Z-ADD1         W       20
     C                     READ AGDPL11                  03
     C           *IN03     CABEQ'1'       STEP01
     C           1         DO   30        W
     C                     READ AGDPL11                  03
     C           *IN03     CABEQ'1'       STEP01
     C                     Z-ADDMTHAI     PD,W
     C                     END
     C                     END
     C           STEP01    TAG
     C           POOL      CABNE'1'       END              ﾎﾟｰﾓ以外読み飛ばし
     C           INCTR     ADD  1         INCTR   50
     C                     SETOF                     11
     C           NONY      CHAINFGBPL01              11
     C           *IN11     IFEQ '0'
     C                     MOVELB2SMEI    NMEI   16
     C                     ELSE
     C                     MOVE *BLANK    NMEI
     C                     END
     C******************************************************
     C* M-NO               ﾆﾞｬkｬcuﾇjｰ ﾉ ﾑvﾃv               *
     C******************************************************
     C           JKEY      KLIST
     C                     KFLD           TOKU
     C                     KFLD           NONY
     C                     KFLD           NKOJ
     C                     KFLD           NUKE
     C                     KFLD           MHN1
     C                     KFLD           MHN2
     C                     KFLD           MHN3
     C                     SETOF                     0499
     C           JKEY      CHAINGAAPL111             04
     C           *IN04     IFEQ '1'
     C                     GOTO END
     C                     SETON                     99
     C                     MOVELER,3      MSG    60
     C                     GOTO STEP99
     C                     END
     C           B3SKBN    IFEQ 'D'
     C                     GOTO END
     C                     SETON                     99
     C                     MOVELER,4      MSG    60
     C                     GOTO STEP99
     C                     END
     C           B3PDAY    IFLE 0
     C                     GOTO END
     C                     SETON                     99
     C                     MOVELER,14     MSG    60
     C                     GOTO STEP99
     C                     END
     C           SHIN      IFNE KSHIN
     C                     MOVE SHIN      KSHIN  12
     C******************************************************
     C* M-NO               ﾎﾞﾍ]uﾇjｰ mﾞ ﾆｫobmﾌb ﾉ kｩｮh      *
     C******************************************************
     C           BKEY      KLIST
     C                     KFLD           SHN1
     C                     KFLD           SHN2
     C                     KFLD           SHN3
     C                     SETOF                     05
     C           BKEY      CHAINFCEPL011             05
     C           *IN05     IFEQ '1'
     C                     SETON                     99
     C                     MOVELER,1      MSG    60
     C                     GOTO STEP99
     C                     END
     C           A2GSKD    IFEQ 'D'
     C           DLHIZK    IFLE *DATE
     C                     SETON                     99
     C                     MOVELER,2      MSG    60
     C                     GOTO STEP99
     C                     END
     C                     END
     C******************************************************
     C* M-NO               f]ﾌﾞ]gﾒfduﾇjｰﾉ kｩｮh             *
     C******************************************************
     C                     SETOF                     14
     C           BKEY      CHAINAAMPL111             14
     C           *IN14     IFEQ '1'
     C                     SETON                     99
     C                     MOVELER,15     MSG    60
     C                     GOTO STEP99
     C                     END
     C           CKSKJY    IFEQ 'D'
     C                     SETON                     99
     C                     MOVELER,16     MSG    60
     C                     GOTO STEP99
     C                     END
     C                     Z-ADD1         Q       20
     C                     Z-ADD1         S       20
     C           1         DO   15        Q
     C           15        SUB  Q         S
     C           TP,S      CABEQ'C'       STEP19
     C                     END
     C                     SETON                     99
     C                     MOVELER,17     MSG    60
     C                     GOTO STEP99
     C           STEP19    TAG
     C                     MOVE BN,S      CKBANC
     C******************************************************
     C* M-NO               xlgf]ﾌﾞ]uﾇj- ﾉ kｩｮh             *
     C******************************************************
     C           MKKEY     KLIST
     C                     KFLD           CKBAN1
     C                     KFLD           CKBAN2
     C                     KFLD           CKBAN3
     C                     KFLD           CKBAN4
     C                     KFLD           SYYY
     C                     KFLD           SYMM
     C                     KFLD           SYDD
     C                     KFLD           SYBB
     C                     Z-ADD01        SYBB    20
     C           MKKEY     SETGTAAFPL031
     C                     SETOF                     10
     C           STEP16    TAG
     C                     READPAAFPL03                  10
     C           *IN10     IFEQ '1'
     C                     SETON                     99
     C                     MOVELER,5      MSG    60
     C                     GOTO STEP99
     C                     END
     C           A3SKJY    CABEQ'D'       STEP16
     C           A3UKHZ    IFGT SYHZ
     C                     SETON                     99
     C                     MOVELER,6      MSG    60
     C                     GOTO STEP99
     C                     END
     C           A3STHZ    IFLT SYHZ
     C                     SETON                     99
     C                     MOVELER,6      MSG    60
     C                     GOTO STEP99
     C                     END
     C           A3BANC    IFNE CKBANC
     C                     SETON                     99
     C                     MOVELER,18     MSG    60
     C                     GOTO STEP99
     C                     END
     C******************************************************
     C* M-NO               ﾎﾟ-ﾓ pｮﾇc ﾉ kｩｮh                *
     C*       ﾈbﾅ]pｮﾇc = f]ﾌﾞ]LT + xｮgLT + ﾃ]tﾟcLT         *
     C*                  1 pk      xｮgLT   1 pk            *
     C******************************************************
     C                     Z-ADDA3UKHZ    SETAHZ  80       xｮgjkafﾞﾒﾍﾞ
     C           SETAHZ    IFGT 0
     C           SETAHZ    IFGT *DATE
     C                     SETON                     99
     C                     MOVE ER,7      MSG
     C                     MOVELSETAHZ    MSG
     C                     GOTO STEP99
     C                     END
     C                     END
     C                     Z-ADD1         SEDAY   20
     C           A3READ    IFLT 1
     C                     Z-ADD1         SEREAD  20       xｮgLT
     C                     ELSE
     C                     Z-ADDA3READ    SEREAD
     C                     END
     C           SEDAY     ADD  SEREAD    SEDAY            ﾈbﾅ]LT
     C                     Z-ADD0         KD
     C                     Z-ADD1         A       20
     C           1         DO   30        A
     C           PD,A      IFGT 0
     C                     MOVE PD,A      CLYMD
     C           CLKEY     SETLLAGDPL11
     C                     SETOF                     06
     C           1         DO   SEDAY
     C                     READ AGDPL11                  06
     C   06                GOTO STEP15
     C                     END
     C                     Z-ADDMTHAI     KD,A
     C                     END
     C           STEP15    TAG
     C                     END
     C******************************************************
     C* M-NO               iﾞ]ﾅﾞbﾉ ﾍajﾒﾎﾟｰﾓﾇc ﾌbﾛl ﾅhﾈb    *
     C******************************************************
     C           PDKEY     KLIST
     C                     KFLD           SHN1
     C                     KFLD           SHN2
     C                     KFLD           SHN3
     C                     KFLD           PRYY
     C                     KFLD           PRMM
     C                     KFLD           PRDD
     C                     SETOF                     0708
     C                     MOVE *DATE     PRYMD
     C           PDKEY     SETLLGA#TL511
     C                     Z-ADD0         PS
     C                     Z-ADD0         PT
     C           STEP04    TAG
     C                     READ GA#TL51                  08
     C           *IN08     CABEQ'1'       STEP06
     C           S9SKJY    CABEQ'D'       STEP04
     C           S9SHIN    IFNE KSHIN
     C                     SETON                     08
     C                     GOTO STEP06
     C                     END
     C           STEP05    TAG
     C                     SETOF                     07
     C                     Z-ADD1         W       20
     C           S9YOHZ    LOKUPPD,W                     07
     C           *IN07     IFEQ '1'
     C           PS,W      ADD  S9SYUY    PS,W
     C                     END
     C                     GOTO STEP04
     C           STEP06    TAG
     C           A3BARA    IFGE 1
     C                     Z-ADDA3BARA    SEBARE  20
     C                     ELSE
     C           A3BARA    ADD  .9        SEBARE  20       xｮgﾌﾞﾛﾓ
     C                     END
     C                     Z-ADD0         P1
     C                     Z-ADDPS        PT
     C                     END
     C******************************************************
     C* M-NO               ﾎﾟｰﾓmﾌb ﾅbﾆｬcﾍﾞ ﾉ ﾈｮmb          *
     C******************************************************
     C                     MOVE *DATE     CLYMD
     C           CLKEY     SETLLAGDPL11
     C                     Z-ADD0         MND
     C                     SETOF                     06
     C           1         DO   SEDAY
     C                     READ AGDPL11                  06
     C   06                GOTO STEP03
     C           SYHZ      IFLT MTHAI
     C           MND       ADD  1         MND     20
     C                     END
     C                     END
     C           STEP03    TAG
     C           *IN06     IFEQ '1'
     C                     SETON                     99
     C                     MOVE ER,8      MSG
     C                     GOTO STEP99
     C                     END
     C           SYHZ      IFLT MTHAI
     C                     SETON                     99
     C                     MOVE ER,9      MSG
     C                     MOVELMND       MSG
     C                     GOTO STEP99
     C                     END
     C           PD,30     IFLT SYHZ
     C                     SETON                     99
     C                     MOVELER,10     MSG
     C                     GOTO STEP99
     C                     END
     C           A3READ    IFGE 1
     C                     Z-ADDA3READ    R       20
     C                     ELSE
     C           A3READ    ADD  .9        R
     C                     END
     C                     SETOF                     09
     C                     Z-ADDSYHZ      CLYMD
     C           CLKEY     SETLLAGDPL11
     C           1         DO   R
     C                     READPAGDPL11                  09
     C           *IN09     IFEQ '1'
     C                     SETON                     99
     C                     MOVELER,11     MSG
     C                     GOTO STEP99
     C                     END
     C                     END
     C                     Z-ADDMTHAI     TEHIZK  80       mﾌbiﾞ]fbﾍﾞ
     C******************************************************
     C* M-NO               ﾎﾟｰﾓﾑﾒｭhﾍﾞp ﾎﾟｰﾓf]ﾌﾞ] ﾝﾒﾎﾒ      *
     C******************************************************
     C           SRYO      DIV  A3SSYS    PLHAKO  30
     C                     MVR            PLAMR   50
     C           PLAMR     IFGT 0
     C           PLHAKO    ADD  1         PLHAKO           ﾎﾟｰﾓf]ﾌﾞ]ubﾇ
     C                     END
     C                     Z-ADDPLHAKO    PKMAIS  30       ﾌｮﾃcubﾇc
     C                     Z-ADD0         SETHAI  80       ﾅbﾆｬcncpｬcﾍﾞ
     C           STEP14    TAG
     C                     MOVE *BLANK    PLSW    1
     C                     Z-ADD1         W
     C           1         DO   30        W
     C           PD,W      IFGT 0
     C           PD,W      IFLE TEHIZK
     C           1         DO   SEBARE
     C           PT,W      IFLT B3SUDD
     C           PT,W      ADD  A3SSYS    PT,W
     C           P1,W      ADD  A3SSYS    P1,W
     C           PLHAKO    SUB  1         PLHAKO
     C                     MOVE '1'       PLSW
     C                     Z-ADDPD,W      SETHAI  80       ﾅbﾆｬcncpｬcﾍﾞ
     C           PLHAKO    CABEQ0         STEP11
     C                     ELSE
     C           PLHAKO    CABEQ0         STEP11
     C                     GOTO STEP10
     C                     END
     C                     END
     C                     END
     C                     END
     C           STEP10    TAG
     C                     END
     C           PLHAKO    CABEQ0         STEP11
     C           PLSW      IFEQ *BLANK
     C                     MOVE ER,12     MSG
     C           PLHAKO    MULT A3SSYS    OVSRYO  70       ﾎﾟｰﾓﾎﾉcﾇc
     C                     MOVELOVSRYO    MSG
     C                     SETON                     99
     C                     GOTO STEP99
     C                     END
     C                     GOTO STEP14
     C******************************************************
     C* M-NO               ﾎﾟｰﾓ f]ﾌﾞ] ﾅbﾆｬcf]ﾈbﾍﾞ          *
     C******************************************************
     C           STEP11    TAG
     C                     Z-ADD1         Z       20
     C           1         DO   30        Z
     C           P1,Z      IFGT 0
     C                     Z-ADDKD,Z      MHIZK   80       ALL f]ﾈbﾍﾞ
     C                     END
     C                     END
     C******************************************************
     C* M-NO               ﾎﾟｰﾓ f]ﾌﾞ]mﾞｰj ﾉ ﾆｬｮﾒｭh         *
     C******************************************************
     C                     MOVE *BLANK    S9MKOJ
     C                     SETOF                     12
     C                     Z-ADD1         M       20
     C           A3MAKB    LOKUPBM,M                     12
     C           *IN12     IFEQ '1'
     C                     MOVELME,M      S9MKOJ
     C                     GOTO STEP07
     C                     END
     C                     SETOF                     12
     C           A3MAKB    CHAINFGBPL01              12
     C           *IN12     IFEQ '0'
     C                     MOVELB2SMEI    S9MKOJ
     C                     END
     C           STEP07    TAG
     C                     MOVE *BLANK    S9HMEK
     C                     SETOF                     12
     C           A3ATOB    CHAINFGBPL01              12
     C           *IN12     IFEQ '0'
     C                     MOVELB2SMEI    S9HMEK
     C                     END
     C           OKCTR     ADD  1         OKCTR   50
     C                     Z-ADD0         C
     C                     Z-ADD1         N       20
     C           1         DO   30        N
     C           P1,N      IFGT 0
     C           P1,N      DIV  A3SSYS    H       30
     C                     MOVE *BLANK    S9SKJY
     C                     Z-ADD0         S9SKHZ
     C                     Z-ADD0         S9KOHZ
     C                     TIME           S9KOTM
     C                     MOVE PUSER     S9KOME
     C                     MOVE SHIN      S9SHIN
     C                     MOVELA3JOK1    S9JKN1
     C                     MOVELA3JOK2    S9JKN2
     C                     MOVELA3JOK3    S9JKN3
     C                     MOVELA3JOK4    S9JKN4
     C                     MOVELA3JOK5    S9JKN5
     C                     MOVELA3JOK6    S9JKN6
     C                     MOVELA3JOK7    S9JKN7
     C                     MOVE A3KCD2    S9TYPE
     C                     MOVELA3YOSI    S9FORM
     C                     MOVE A3MEKI    S9METK
     C                     Z-ADDA3MAKB    S9MBMN
     C                     Z-ADDA3MAEH    S9MBCD
     C                     Z-ADDA3ATOB    S9HBMN
     C                     Z-ADDA3ATOH    S9HBCD
     C                     MOVE A3MTK1    S9MBN1
     C                     MOVE A3MTK2    S9MBN2
     C                     MOVE A3MTK3    S9MBN3
     C                     MOVE A3MTK4    S9MBN4
     C                     MOVE A3ATK1    S9JBN1
     C                     MOVE A3ATK2    S9JBN2
     C                     MOVE A3ATK3    S9JBN3
     C                     MOVE A3ATK4    S9JBN4
     C                     MOVE A3ZETI    S9ZTAI
     C                     Z-ADDA3CBKO    S9CRIT
     C                     Z-ADDA3SSYS    S9SYUY
     C                     MOVE A3SSYT    S9STAN
     C                     Z-ADDA3BARA    S9BARL
     C                     MOVE A3RAIN    S9MLIN
     C                     Z-ADDPKMAIS    S9KMIS
     C                     Z-ADDPKMAIS    S9SER2
     C                     Z-ADDTOKU      S9TOKU
     C                     Z-ADDNONY      S9NONY
     C                     MOVE NMEI      S9NMEI
     C                     MOVE NKOJ      S9NKOJ
     C                     MOVE NUKE      S9NUKE
     C                     Z-ADDSRYO      S9SRYO
     C                     Z-ADDDTMM      S9JNMM
     C                     Z-ADDDRRN      S9JNNO
     C                     Z-ADDSYHZ      S9THHZ
     C                     Z-ADDNOHZ      S9MEHZ
     C                     Z-ADDMHIZK     S9PEHZ
     C                     Z-ADDKD,N      S9MKHZ
     C                     MOVE NSGT      S9SGAT
     C                     Z-ADDB3KONP    S9KSYU
     C                     MOVE ZBAN      S9PBAN
     C                     MOVE *BLANK    S9POVR
     C                     Z-ADDPD,N      S9YOHZ
     C                     Z-ADD0         S9PTHZ
     C           1         DO   H                          ubﾇcﾎﾞ]hﾒfdﾆ
     C           C         ADD  1         C       30
     C                     Z-ADDC         S9SER1
     C                     WRITEGA#TL511
     C           KBCTR     ADD  1         KBCTR   50
     C                     END
     C                     Z-ADD0         P1,N
     C                     END
     C                     END
     C                     Z-ADD0         P1
     C                     GOTO END
     C******************************************************
     C* M-NO               ﾎﾟｰﾓ f]ﾌﾞ]mﾞｰj d[ｰﾆｭﾒ           *
     C******************************************************
     C           STEP99    TAG
     C           ERCTR     ADD  1         ERCTR   50
     C                     EXCPTMS
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
     C                     Z-ADD1         PP      20
     C           STEP13    TAG
     C                     Z-ADD0         HP
     C                     Z-ADD0         MP
     C                     Z-ADD1         P       20
     C           1         DO   14        P
     C           P         ADD  20        X       20
     C                     MOVE '0'       *IN,X
     C                     END
     C                     Z-ADD1         P       20
     C           1         DO   14        P
     C           PP        IFLE 30
     C           PD,PP     IFLT SYHZ
     C                     Z-ADDPD,PP     HP,P
     C                     Z-ADDPT,PP     MP,P
     C           P         ADD  20        X       20
     C                     MOVE '1'       *IN,X
     C           PP        ADD  1         PP
     C                     ELSE
     C           P         IFLE 1
     C                     EXCPTMS2                        d[ｰobﾑc
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
     C                     GOTO END
     C                     END
     C                     GOTO STEP12
     C                     END
     C                     END
     C                     END
     C                     EXCPTMS1                        ﾌｮﾃcﾆﾞｭcgｭc
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
     C                     GOTO STEP13
     C           STEP12    TAG
     C                     EXCPTMS1                        ﾌｮﾃcﾆﾞｭcgｭc
     C                     EXCPTMS2                        d[ｰobﾑc
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OF
     C                     END
     C           END       TAG
     C                     Z-ADD0         SETHAI
     C                     Z-ADD0         PLHAKO
     CLR                   EXCPTTO
     OQPRINT  E  102           HD
     O                                  131 '+-------------------+'
     O        E  1             HD
     O                                  131 '| CHARGE  | GOVERNER|'
     O        E  1             HD
     O                                   89 'TIME'
     O                         WTIME Y   98
     O                                  111 '|'
     O                         TNAME    120
     O                                  121 '|'
     O                                  131 '|'
     O        E  2             HD
     O                                   10 'RCPR11-1'
     O                                   44 'POOL KANBAN'
     O                                   53 'ABNORMAL'
     O                                   70 'CALCULATION LIST'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  103 'PAGE'
     O                         PAGE  Y  108
     O                                  131 '+-------------------+'
     O        E  2             HD
     O                                    6 'CUST'
     O                                   14 'RCV CO.'
     O                                   16 'F'
     O                                   22 'RCV'
     O                                   33 'USER P/N'
     O                                   52 'INT CO P/N'
     O                                   63 'QTY'
     O                                   76 'USR DLV DATE'
     O                                   90 'SHIP ODR DATE'
     O                                   97 'LAST K'
     O                                  106 'UNPOOL'
     O                                  118 'ACCOM QTY'
     O                                  124 'SHEET'
     O                                  129 'LOC'
     O        E  2             MS
     O                         TOKU       6
     O                         NONY      13
     O                         NKOJ      16
     O                         NUKE      22
     O                         MHIN      40
     O                         SHN1      47
     O                                   48 '-'
     O                         SHN2      53
     O                                   54 '-'
     O                         SHN3      56
     O                         SRYO  1   63
     O                         NOHZ  Y   74
     O                         SYHZ  Y   86
     O                         SETHAI    97
     O                         OVSRYO1  107
     O                         A3SSYS1  117
     O                         PLHAKO1  122
     O                         ZBN1     124
     O                                  125 '-'
     O                         ZBN2     127
     O                                  128 '-'
     O                         ZBN3     130
     O                                  131 '-'
     O                         ZBN4     132
     O        E  1             MS1
     O                                   16 'K PUBLISH DATE'
     O                 21      HP,1  Y   23
     O                 22      HP,2  Y   31
     O                 23      HP,3  Y   39
     O                 24      HP,4  Y   47
     O                 25      HP,5  Y   55
     O                 26      HP,6  Y   63
     O                 27      HP,7  Y   71
     O                 28      HP,8  Y   79
     O                 29      HP,9  Y   87
     O                 30      HP,10 Y   95
     O                 31      HP,11 Y  103
     O                 32      HP,12 Y  111
     O                 33      HP,13 Y  119
     O                 34      HP,14 Y  127
     O        E  1             MS1
     O                                   16 'SHEETS'
     O                         MP,1  Z   23
     O                         MP,2  Z   31
     O                         MP,3  Z   39
     O                         MP,4  Z   47
     O                         MP,5  Z   55
     O                         MP,6  Z   63
     O                         MP,7  Z   71
     O                         MP,8  Z   79
     O                         MP,9  Z   87
     O                         MP,10 Z   95
     O                         MP,11 Z  103
     O                         MP,12 Z  111
     O                         MP,13 Z  119
     O                         MP,14 Z  127
     O        E  1             MS2
     O                                   16 '**ERR CONTENTS**'
     O                         MSG    B  80
     O                                  121 'ODR RCV NO'
     O                         DTMM     125
     O                         DRRN     130
     O        E  2             MS2
     O                                   20 '- - - - - - - - - - '
     O                                   40 '- - - - - - - - - - '
     O                                   60 '- - - - - - - - - - '
     O                                   80 '- - - - - - - - - - '
     O                                  100 '- - - - - - - - - - '
     O                                  120 '- - - - - - - - - - '
     O                                  132 '- - - - - - '
     O        E 2              TO
     O                                   10 'INPUT'
     O                         INCTR     18 '  , * '
     O                                   30 'DATA-OK'
     O                         OKCTR     38 '  , * '
     O                                   50 'ERROR'
     O                         ERCTR     58 '  , * '
     O                                   70 'K -OUT'
     O                         KBCTR     78 '  , * '
**       SECTION &NAME
8915 HEADQUATERS
8923 HEADQUATERS
8931 HEADQUATERS
8958 HEADQUATERS
8974 ENA
8982 GIHU
9008 HEADQUATERS
**       ERROR MESSAGE
E-01 PART M/F DOES NOT EXIST
E-02 PART M/F IS DELETED
E-03 ORDER RECEIPT M/F DOES NOT EXIST
E-04 ORDER RECEIPT M/F IS DELETED
E-05 PLATING KANBAN M/F DOES NOT EXIST
E-06 THERE ISN'T PLATING K M/F LIVING AT PROD ODR DATE
E-07 IT BECOME START DATE FOR PLATING KANBAN
E-08 THERE IS NOT A CALENDAR FOR DAYS OF PRODUCTION LT
E-09 THERE IS NOT PRODUCTION L/T AT ALL
E-10 SHIPMENT ODR DATE IS OVR 30 OPE DAYS A HEAD, NO CALC              IT IS
E-11 NOT ENOUGH CALENDAR TO GO BACK TO PROD LT FRM SHIP ODR             DAY
E-12      CAN'T BE POOLED. DVIDE OR CHG DELV DATE
E-13 NO READ CALENDER FOR PROD LT FROM LAST K ADMIT DATE
E-14 DATA IS POOL, BUT ODR REC M/F ISN'T APPOINTED POOL
E-15 THERE IS NOT KANBAN CHANGE M/F
E-16 KANBAN CHANGE M/F IS DELETED
E-17 PLATING KANBAN DOES NOT EXIST IN KANBAN CHANGE M/F
E-18 KANBAN CHG M/F & LOC OF PLATING KANBAN ARE DIFFERENT
