     H            Y.
     F** RGAR22 ********************************************
     F*  UPDATE EMPLOYEE MASTER                            *
     F*  Y.MAEDA                            2010.11.19     *
     F******************************************** TU002R **
     FRGAPW22 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN   KSFILE SFREC1
     FRGAPL21 IF  E           K        DISK
      *
     IINFDS       DS
     I                                    B 378 3790$$RRN
     I****************************
     I*プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     C*
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT            初期処理
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C* 初期ﾈｮmb
     C*===============================================================
     C           #INIT     BEGSR
     C                     MOVEA*ALL'0'   *IN
     C*  SFLCLR
     C                     SETON                     72
     C                     WRITESFCTL1
     C                     SETOF                     72
     C                     Z-ADD0         RRN     40
     C                     Z-ADD0         ENDRRN  40
     C                     MOVE *BLANK    @@UMU   1        データ有無
     C*
     C                     SETOF                     90
S1   C                     DO   *HIVAL
     C                     READ RGAPL211                 90
     C   90                LEAVE
 S2  C           R2SKJY    IFEQ 'D'
     C           R2SKHZ    ANDLE*DATE
     C                     ITER
 E2  C                     ENDIF
     C*
     C                     MOVELR2ENUM    @ENUM
     C                     MOVELR2ENAM    @ENAM
      *
     C                     ADD  1         RRN
     C                     WRITESFREC1
E1   C                     ENDDO
     C*-------------------------
     C           RRN       IFEQ 0
     C                     MOVE '#END    '@STEP
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     Z-ADD1         DSPRRN
     C                     ENDIF
     C                     ENDSR
     C*===============================================================
      *画面１*
     C*===============================================================
     C           #DSP1     BEGSR
     C                     SETON                     71
     C                     WRITEDSP01
     C                     EXFMTSFCTL1
     C                     SETOF                     71
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD$$RRN     DSPRRN
      *----*
      * F3 *
      *----*
     C   KC                MOVE '#END    '@STEP
     C                     ENDSR
