     H            Y.
     F** UTLR04 ********************************************
     F*  PROGRAM: SAVE AB#WP451 TO AB#PP2M                 *
     F*  WRITTEN: JW (SRA)  2022.10.19                     *
     F******************************************************
     FAB#WP451IF  F     256            DISK
     FAB#PP2M O   F     290            DISK
      *--------------------------------------------------------
     IAB#WP451AA  01
     I                                        1 256 WP451
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           $PGM   10
      *
     C                     TIME           SDATE
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      *
     C                     DO   *HIVAL
     C                     READ AB#WP451                 98
     C   98                LEAVE
      *
     C                     MOVELWP451     PP2M  256
     C                     MOVELTODAY     M2CRHZ  80
     C                     MOVELNOW       M2CRTM  60
     C                     MOVEL#USER     M2CRUS 10
     C                     MOVEL$PGM      M2CRWS 10
     C                     EXCPT#DTL
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *===================================================
     OAB#PP2M E                #DTL
     O                         PP2M     256
     O                         M2CRHZ   264
     O                         M2CRTM   270
     O                         M2CRUS   280
     O                         M2CRWS   290
