     H            Y.
     F** UTLR01 ********************************************
     F*  PROGRAM: SAVE ABAWP42 TO ABAWP42B                 *
     F*  WRITTEN: JW (SRA)  2021.02.18                     *
     F******************************************************
     FABAWP42 IF  F     318            DISK
     FABAWP42BO   E                    DISK
      *--------------------------------------------------------
     IABAWP42 AA  01
     I                                        1   40ABTOKU
     I                                        5   80ABNONY
     I                                        9   9 ABNKOJ
     I                                       10  13 ABNUKE
     I                                       14  17 ABSBAN
     I                                       18  22 ABMHN1
     I                                       23  27 ABMHN2
     I                                       28  32 ABMHN3
     I                                       33  37 ABMHN4
     I                                       38  42 ABQPC
     I                                       43  43 ABNOKN
     I                                       44  520ABNJS1
     I                                    P  53  560ABQT01
     I                                    P  57  600ABQT02
     I                                    P  61  640ABQT03
     I                                    P  65  680ABQT04
     I                                    P  69  720ABQT05
     I                                    P  73  760ABQT06
     I                                    P  77  800ABQT07
     I                                    P  81  840ABQT08
     I                                    P  85  880ABQT09
     I                                    P  89  920ABQT10
     I                                    P  93  960ABQT11
     I                                    P  97 1000ABQT12
     I                                    P 101 1040ABQT13
     I                                    P 105 1080ABQT14
     I                                    P 109 1120ABQT15
     I                                    P 113 1160ABQT16
     I                                    P 117 1200ABQT17
     I                                    P 121 1240ABQT18
     I                                    P 125 1280ABQT19
     I                                    P 129 1320ABQT20
     I                                    P 133 1360ABQT21
     I                                    P 137 1400ABQT22
     I                                    P 141 1440ABQT23
     I                                    P 145 1480ABQT24
     I                                    P 149 1520ABQT25
     I                                    P 153 1560ABQT26
     I                                    P 157 1600ABQT27
     I                                    P 161 1640ABQT28
     I                                    P 165 1680ABQT29
     I                                    P 169 1720ABQT30
     I                                    P 173 1760ABQT31
     I                                      177 1850ABNJS2
     I                                      186 1940ABNJS3
     I                                      195 2030ABNJS4
     I                                      204 2120ABNJS5
JW   I                                      213 2210ABNJS6
     I                                      222 2300ABNJS7
     I            DS
     I                                        1  140@DATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           $PID    1
      *
     C                     TIME           @DATE
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      *
     C                     DO   *HIVAL
     C                     READ ABAWP42                  98
     C   98                LEAVE
      *
     C                     EXSR #SET
      *
     C                     WRITEABAW42B1
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *=============================================================
      *  SET DATA
      *=============================================================
     C           #SET      BEGSR
      *
     C                     Z-ADDTODAY     ABCRHZ
     C                     Z-ADDNOW       ABCRTM
     C                     MOVEL#USER     ABCRUS
      *
     C                     SELEC
     C           $PID      WHEQ '4'
     C                     MOVEL'ABACP4'  ABCRID
     C           $PID      WHEQ '5'
     C                     MOVEL'ABACP5'  ABCRID
     C           $PID      WHEQ '6'
     C                     MOVEL'ABACP6'  ABCRID
     C           $PID      WHEQ '7'
     C                     MOVEL'ABACP7'  ABCRID
     C                     OTHER
     C                     MOVE *BLANK    ABCRID
     C                     ENDSL
      *
     C                     ENDSR
