     H            Y.
     F** SAVR05  *******************************************
     F*  SAVE SOURCE FILE TO IMPWP02                       *
     F*  JW   2023.04.26                                   *
     F******************************************************
     FIMPORT  IF  F     800            DISK
     FIMPWP02 O   E                    DISK
      *--------------------------------------------------------
     IIMPORT  AA  01
     I                                        1  12 SEQ
     I                                        1 200 DAT1
     I                                      201 400 DAT2
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *--------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I                                      264 269 #JOB
      ****************************************************
      * MAINROUTINE
      ****************************************************
     C           *ENTRY    PLIST
     C                     PARM           $FIL   10
     C                     PARM           $LIB   10
     C                     PARM           $PGM   10
      *
     C                     TIME           SDATE
      *
     C                     DO   *HIVAL
     C                     READ IMPORT                   98
     C   98                LEAVE
      *
     C                     CLEARIMPWP021
     C                     Z-ADDTODAY     IMCRDT
     C                     Z-ADDNOW       IMCRTM
     C                     MOVEL#USER     IMCRUS
     C                     MOVEL#WSID     IMCRWS
     C                     MOVEL$FIL      IMFILE
     C                     MOVEL$LIB      IMLIB
     C                     MOVEL$PGM      IMCRPG
     C                     MOVELDAT1      IMDATA
     C                     MOVE DAT2      IMDATA
     C                     WRITEIMPWP021
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
