     H            Y.
     F** SAVR06 ********************************************
     F*  PROGRAM: SAVE AB#PP6U TO AB#PP6US                 *
     F*           (RUNS IN GENEDI)                         *
     F*  WRITTEN: JW (SRA)  2024.07.30                     *
     F******************************************************
     FAB#PP6U IF  E                    DISK
     FAB#PP6USO   E                    DISK
      *--------------------------------------------------------
     IAB#PP6U1    01
     I              M6AK101                         M6AK11
     I              M6AK102                         M6AK12
     I              M6AK201                         M6AK21
     I              M6AK202                         M6AK22
     I              M6AK301                         M6AK31
     I              M6AK302                         M6AK32
     I              M6AK304                         M6AK34
     I              M6AK401                         M6AK41
     I              M6AK402                         M6AK42
     I              M6AK403                         M6AK43
     I              M6AK901                         M6AK91
     I              M6AK902                         M6AK92
     I              M6AK903                         M6AK93
     I              M6AK904                         M6AK94
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
     C                     TIME           SDATE
      *
     C                     DO   *HIVAL
     C                     READ AB#PP6U                  98
     C   98                LEAVE
      *
     C                     Z-ADDTODAY     M6CRHZ
     C                     Z-ADDNOW       M6CRTM
     C                     MOVEL#PGM      M6CRPG
     C                     WRITEAB#P6US1
      *
     C                     ENDDO
      *
      * SET RECEIVED DATE/TIM IN JCMPP11
     C                     CALL 'UEXC53A'
      *
     C                     SETON                     LR
     C                     RETRN
