     H            Y.
     FAAFPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 246 W#WS
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
     C           *ENTRY    PLIST
     C                     PARM           A3ATK1
     C                     PARM           A3ATK2
     C                     PARM           A3ATK3
     C                     PARM           A3ATK4
     C                     PARM           P@JOK1  2
     C                     PARM           P@JOK2  2
     C                     PARM           P@JOK3  2
     C                     PARM           P@JOK4  2
     C                     PARM           P@JOK5  2
     C                     PARM           P@JOK6  2
     C                     PARM           P@JOK7  2
     C                     PARM           P@JOK8  2
     C                     PARM           P@KDAI  1
      *
     C                     MOVE *BLANK    P@JOK1  2
     C                     MOVE *BLANK    P@JOK2  2
     C                     MOVE *BLANK    P@JOK3  2
     C                     MOVE *BLANK    P@JOK4  2
     C                     MOVE *BLANK    P@JOK5  2
     C                     MOVE *BLANK    P@JOK6  2
     C                     MOVE *BLANK    P@JOK7  2
     C                     MOVE *BLANK    P@JOK8  2
     C                     MOVE *BLANK    P@KDAI  1
      *
     C                     MOVE *BLANK    W@KDAI  1
      *
     C           KEY       KLIST
     C                     KFLD           A3ATK1
     C                     KFLD           A3ATK2
     C                     KFLD           A3ATK3
     C                     KFLD           A3ATK4
      *
     C           KEY       SETGTAAFPL03
     C                     DO   *HIVAL
     C           KEY       REDPEAAFPL03                  77
     C   77                LEAVE
     C           A3SKJY    IFEQ 'D'
     C                     ITER
     C                     END
      *
     C           A3STDD    IFNE 99
     C                     ITER
     C                     END
      *
     C                     MOVE A3JOK1    P@JOK1  2
     C                     MOVE A3JOK2    P@JOK2  2
     C                     MOVE A3JOK3    P@JOK3  2
     C                     MOVE A3JOK4    P@JOK4  2
     C                     MOVE A3JOK5    P@JOK5  2
     C                     MOVE A3JOK6    P@JOK6  2
     C                     MOVE A3JOK7    P@JOK7  2
     C                     MOVE A3JOK8    P@JOK8  2
     C                     MOVE 'C'       P@KDAI
      *
     C                     LEAVE
     C                     ENDDO
      *
     C           KEY       SETGTAAHPL03
     C                     DO   *HIVAL
     C           KEY       REDPEAAHPL03                  77
     C   77                LEAVE
     C           A3SKJY    IFEQ 'D'
     C                     ITER
     C                     END
      *
     C           L6STDD    IFNE 99
     C                     ITER
     C                     END
      *
     C                     MOVE L6JOK1    P@JOK1  2
     C                     MOVE L6JOK2    P@JOK2  2
     C                     MOVE L6JOK3    P@JOK3  2
     C                     MOVE L6JOK4    P@JOK4  2
     C                     MOVE L6JOK5    P@JOK5  2
     C                     MOVE L6JOK6    P@JOK6  2
     C                     MOVE L6JOK7    P@JOK7  2
     C                     MOVE L6JOK8    P@JOK8  2
      *
     C           W@KDAI    IFNE *BLANK
     C           W#WS      IFEQ 'HPI'
     C                     DSPLY          W@KDAI
     C                     END
     C                     END
      *
     C                     MOVE 'E'       P@KDAI
      *
     C                     LEAVE
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
