     H            Y.
     F** T#TR11 *********************************************
     F* SETTING #(MACHINE GROUP) SUMMARY                    *
     F*             Y.SAMEJIMA     2015.06.18               *
     F*******************************************************
     FT#TWP10 IF  E           K        DISK
     FT#TWP11 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60WTIME
     I                                        7  140WDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C*
     C                     SETOF                     98
     C                     MOVEL*BLANK    W@GROP  3
     C                     Z-ADD0         W@KSSU 100
     C           *LOVAL    SETLLT#TWP101
     C                     DO   *HIVAL
     C                     READ T#TWP101                 99
     C*
     C           *IN98     IFEQ '1'
     C           *IN99     IFEQ '1'
     C           T#GROP    ORNE W@GROP
     C                     CLEART#TWP111
     C                     MOVELW@GROP    T2GROP
     C                     Z-ADDW@KSSU    T2KSSU
     C                     WRITET#TWP111
     C                     MOVEL*BLANK    W@GROP
     C                     Z-ADD0         W@KSSU
     C                     ENDIF
     C                     ENDIF
     C*
     C   99                LEAVE
     C*
     C                     MOVELT#GROP    W@GROP
     C                     ADD  T#KSSU    W@KSSU
     C                     SETON                     98
     C*
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*****************************************************************
