     H            Y.
     F** T#TR65 **************************************
     F* OUTSOURCE FORECAST                           *
     F*     ITS.          2015.07.17                 *
     F*------------------------------------------------------------------------*
     F* 2016/01/28 | JW (SRA)    | JW1 | ADD PREVIOUS LOCATION                 *
     F*                                | ADD SUPPLY, DELAY QTY                 *
     F**************************************************************************
     FT#TPW65 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
     F                                        RRN   KSFILE SFL2
     F                                        RRN   KSFILE SFL3
     F                                              KINFDS INFDS
     FT#TWP62 IF  E           K        DISK
     FT#TWP64 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FT#TPP50 IF  E           K        DISK
JW1  FAFAPL94 IF  E           K        DISK
JW1  FT#TWP63 IF  E           K        DISK
JW1  FAFATL80 IF  E           K        DISK
JW1  FALDPL30 IF  E           K        DISK
JW1  FAFDPL24 IF  E           K        DISK
     F*------------------------------------------------------------------------*
      *
     E                    NK         21  3 0
     E                    SP         21  4 1
     E                    YZ         21  4 1
     E                    ER      1  11 65
      *
     I            DS
     I                                        1   6 W2TKR
     I                                        1   1 W2TKR1
     I                                        2   3 W2TKR2
     I                                        4   5 W2TKR3
     I                                        6   6 W2TKR4
      *
     I            DS
     I                                        1  630NK
     I                                        1   30S1NK01
     I                                        4   60S1NK02
     I                                        7   90S1NK03
     I                                       10  120S1NK04
     I                                       13  150S1NK05
     I                                       16  180S1NK06
     I                                       19  210S1NK07
     I                                       22  240S1NK08
     I                                       25  270S1NK09
     I                                       28  300S1NK10
     I                                       31  330S1NK11
     I                                       34  360S1NK12
     I                                       37  390S1NK13
     I                                       40  420S1NK14
     I                                       43  450S1NK15
     I                                       46  480S1NK16
     I                                       49  510S1NK17
     I                                       52  540S1NK18
     I                                       55  570S1NK19
     I                                       58  600S1NK20
     I                                       61  630S1NK21
      *
     I            DS
     I                                        1  841SP
     I                                        1   41S1SP01
     I                                        5   81S1SP02
     I                                        9  121S1SP03
     I                                       13  161S1SP04
     I                                       17  201S1SP05
     I                                       21  241S1SP06
     I                                       25  281S1SP07
     I                                       29  321S1SP08
     I                                       33  361S1SP09
     I                                       37  401S1SP10
     I                                       41  441S1SP11
     I                                       45  481S1SP12
     I                                       49  521S1SP13
     I                                       53  561S1SP14
     I                                       57  601S1SP15
     I                                       61  641S1SP16
     I                                       65  681S1SP17
     I                                       69  721S1SP18
     I                                       73  761S1SP19
     I                                       77  801S1SP20
     I                                       81  841S1SP21
      *
     I            DS
     I                                        1  841YZ
     I                                        1   41S1YZ01
     I                                        5   81S1YZ02
     I                                        9  121S1YZ03
     I                                       13  161S1YZ04
     I                                       17  201S1YZ05
     I                                       21  241S1YZ06
     I                                       25  281S1YZ07
     I                                       29  321S1YZ08
     I                                       33  361S1YZ09
     I                                       37  401S1YZ10
     I                                       41  441S1YZ11
     I                                       45  481S1YZ12
     I                                       49  521S1YZ13
     I                                       53  561S1YZ14
     I                                       57  601S1YZ15
     I                                       61  641S1YZ16
     I                                       65  681S1YZ17
     I                                       69  721S1YZ18
     I                                       73  761S1YZ19
     I                                       77  801S1YZ20
     I                                       81  841S1YZ21
      *
     I            DS
     I                                        1   80WKDATE
     I                                        1   40WKDAYY
     I                                        5   60WKDAMM
     I                                        7   80WKDADD
      *
JW1  I            DS
JW1  I                                        1   80@TGT8
JW1  I                                        1   40@TGTYY
JW1  I                                        5   60@TGTMM
JW1  I                                        7   80@TGTDD
      *
JW1  I            DS
JW1  I                                        1   80A9ODHZ
JW1  I                                        1   40A9ODYY
JW1  I                                        5   60A9ODMM
JW1  I                                        7   80A9ODDD
      *
JW1  I            DS
JW1  I                                        1   80AFODHZ
JW1  I                                        1   40AFODYY
JW1  I                                        5   60AFODMM
JW1  I                                        7   80AFODDD
      *
JW1  I            DS
JW1  I                                        1   80A3SYDT
JW1  I                                        1   40A3SYYY
JW1  I                                        5   60A3SYMM
JW1  I                                        7   80A3SYDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 ##USER
     I                                      264 269 W#JBNO
      *
     IINFDS       DS
     I                                    B 370 3710#CUR
     I                                    B 378 3790#POS
     C*----------------------------------------------------*
     C                     EXSR #INZ
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
     C                     MOVELP1BMON    C1BMON
     C           P1BMON    CHAINFGBPL011             22
     C           *IN22     IFEQ '0'
     C                     MOVELB2SMEI    C1SMEI
     C                     ENDIF
     C           P1BMON    IFEQ 9999
     C                     MOVEL*BLANK    C1SMEI
     C                     MOVEL'ALL'     C1SMEI
     C                     ENDIF
      *
     C                     MOVEL*BLANK    C1HED
     C                     MOVEL*BLANK    C2HED
     C                     MOVEL*BLANK    C2HED
      *
     C                     MOVEL*BLANK    #1HED  78
     C**JW1      #1HED     CAT  'PARTS#':0#1HED
     C**JW1      #1HED     CAT  'LOCAT':13#1HED
     C**JW1      #1HED     CAT  'ION':0   #1HED
JW1  C                     MOVELER,3      #1HED
     C           KEYF8     KLIST
     C                     KFLD           WKDAYY
     C                     KFLD           WKDAMM
     C                     KFLD           WKDADD
     C                     Z-ADD*DATE     WKDATE
     C                     Z-ADD1         X       30
     C           KEYF8     SETLLAGDPL121
     C                     READ AGDPL121                 20
     C                     EXSR #SB101
     C                     MOVEL#1HED     C1HED
      *
     C                     MOVEL*BLANK    #1HED  78
     C**JW1      #1HED     CAT  'PARTS#':0#1HED
     C**JW1      #1HED     CAT  'LOCAT':13#1HED
     C**JW1      #1HED     CAT  'ION':0   #1HED
JW1  C                     MOVELER,3      #1HED
     C                     Z-ADD1         X       30
     C                     EXSR #SB101
     C                     MOVEL#1HED     C2HED
      *
     C                     MOVEL*BLANK    #1HED  78
     C**JW1      #1HED     CAT  'PARTS#':0#1HED
     C**JW1      #1HED     CAT  'LOCAT':13#1HED
     C**JW1      #1HED     CAT  'ION':0   #1HED
JW1  C                     MOVELER,3      #1HED
     C                     Z-ADD1         X       30
     C                     EXSR #SB101
     C                     MOVEL#1HED     C3HED
      *
     C                     Z-ADD1         WKP     10
     C                     SETON                     59
      *
     C                     MOVEL*BLANK    C1CMT
     C                     MOVELP1BMON    WKBMON  4
     C           WKBMON    CHAINT#TPP501             20
     C           *IN20     IFEQ '0'
     C           T5SKJY    ANDEQ'D'
     C           T5SKDT    ANDLE*DATE
     C                     SETON                     20
     C                     ENDIF
     C***        *IN20     IFEQ '1'
     C***                  MOVELER,2      C1CMT
     C***                  ENDIF
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB101    BEGSR
      *
     C           *IN20     DOWEQ'0'
     C           X         ANDLE7
     C           F8HIRU    IFEQ *BLANK
     C                     EXSR #SB110
     C                     ADD  1         X
     C                     ENDIF
     C                     READ AGDPL121                 20
     C                     ENDDO
      *
     CSR         ESB101    ENDSR
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB110    BEGSR
      *
     C                     MOVE F8KAMM    ##MM    2
     C                     MOVE F8KADD    ##DD    2
     C           #1HED     CAT  ##MM:2    #1HED
     C           #1HED     CAT  '/':0     #1HED
     C           #1HED     CAT  ##DD:0    #1HED
      *
     CSR         ESB110    ENDSR
      *----------------------------------------------------*
      * CONTROL                                            *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * INQ                                                *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     C                     SETOF                     8166
     C           *LOVAL    SETLLT#TWP621
     C                     READ T#TWP621                 81
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ T#TWP621                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     MOVE '02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * SFL                                                *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C           CTRX      IFEQ 0
     C                     SETON                     72
     C                     SETON                     99
     C                     MOVELER,1      D9ERR
     C                     ELSE
     C                     SETON                     7273
     C                     ENDIF
      *
     C                     WRITET#TPW659
     C                     WRITET#TPW657
     C                     SETOF                     919293
     C                     SETOF                     9495
     C                     SELEC
     C           CTRX      WHEQ 1
     C                     SETON                     91
     C           CTRX      WHEQ 2
     C                     SETON                     9192
     C           CTRX      WHEQ 3
     C                     SETON                     919293
     C           CTRX      WHEQ 4
     C                     SETON                     919293
     C                     SETON                     94
     C           CTRX      WHEQ 5
     C                     SETON                     919293
     C                     SETON                     9495
     C                     ENDSL
     C                     WRITET#TPW658
      *
     C                     SELEC
     C           WKP       WHEQ 1
     C                     EXFMTSFLCTL
     C           WKP       WHEQ 2
     C                     EXFMTSFLCT2
     C           WKP       WHEQ 3
     C                     EXFMTSFLCT3
     C                     ENDSL
      *
     C                     SETOF                     7273
     C                     SETOF                     3199
     C                     MOVEL*BLANK    D9ERR
      * F3
     C           *IN03     IFEQ '1'
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           CTRX      IFEQ 0
     C                     GOTO ESB220
     C                     ENDIF
      * F7 LEFT
     C           *IN07     IFEQ '1'
     C           WKP       IFEQ 1
     C                     ELSE
     C                     SUB  1         WKP
     C                     ENDIF
     C                     GOTO ESB220
     C                     ENDIF
      * F8 RIGHT
     C           *IN08     IFEQ '1'
     C           WKP       IFEQ 3
     C                     ELSE
     C                     ADD  1         WKP
     C                     ENDIF
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
      * ROLLDOWN/PAGEUP *
      *-----------------*
     C           *IN52     IFEQ '1'
     C*                    ADD  1         CTRX
      * 1ST. PAGE
     C           WKPAGE    IFEQ 1
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
     C           *IN81     IFEQ '1'
     C                     SETOF                     81
     C           *HIVAL    SETGTT#TWP621
     C                     READPT#TWP621                 81
     C                     SUB  1         CTRX
     C                     ENDIF
      *
     C                     ADD  05        CTRX
      *                         L--表示行数
     C                     SETOF                     6627
      *
     C           *IN81     DOWEQ'0'
     C           *IN27     ANDEQ'0'
     C                     EXSR #READP
     C                     READPT#TWP621                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXTP
     C                     ENDDO
      *
     C                     Z-ADD0         CTRX    40
      *
     C           *IN81     IFEQ '1'
     C           *LOVAL    SETLLT#TWP621
     C                     READ T#TWP621                 81
     C                     ENDIF
      *
     C                     EXSR #CLR
     C                     SETOF                     8166
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ T#TWP621                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     SUB  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *--------------------*
      * ROLL-UP            *
      *--------------------*
     C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
      *
     C                     EXSR #CLR
      *
     C                     SETOF                     6681
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ T#TWP621                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     ADD  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     WRITET#TPW657
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * READ                                               *
      *----------------------------------------------------*
     CSR         #READ     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREAD
     C                     ENDIF
      *
     C                     EXSR #EDIT
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     ADD  1         CTRX
     C                     WRITESFL
     C                     WRITESFL2
     C                     WRITESFL3
      *
     C           CTRX      IFEQ 05
     C                     SETON                       66
     C                     ENDIF
      *
     CSR         EREAD     ENDSR
      *----------------------------------------------------*
      * READP                                              *
      *----------------------------------------------------*
     CSR         #READP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREADP
     C                     ENDIF
      *
     C                     SUB  1         CTRX           27
      *
     CSR         EREADP    ENDSR
      *----------------------------------------------------*
      * SELECT                                             *
      *----------------------------------------------------*
     CSR         #SELEC    BEGSR
      *
     C                     MOVEL*BLANK    WKGET
     C           P1DAYS    IFEQ 0
     C                     MOVEL'1'       WKGET
     C                     ELSE
     C                     EXSR #SELE2
     C                     ENDIF
      *
     CSR         ESELEC    ENDSR
      *----------------------------------------------------*
      * EDIT                                               *
      *----------------------------------------------------*
     CSR         #SELE2    BEGSR
      *
     C                     Z-ADD0         Y       30
     C           KEYW4     SETLLT#TWP641
     C           KEYW4     READET#TWP641                 65
     C           *IN65     DOWEQ'0'
     C                     ADD  1         Y
     C           W4YZIK    IFLT 0
     C           Y         IFLE P1DAYS
     C                     MOVEL'1'       WKGET
     C                     ENDIF
     C                     ENDIF
     C           KEYW4     READET#TWP641                 65
     C                     ENDDO
      *
     CSR         ESELE2    ENDSR
      *----------------------------------------------------*
      * CLEAR                                              *
      *----------------------------------------------------*
     CSR         #CLR      BEGSR
      *
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     WRITESFLCT2
     C                     WRITESFLCT3
     C                     SETOF                     7166
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN    40
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
     C                     SETOF                     919293
     C                     SETOF                     9495
      *
     CSR         ECLR      ENDSR
      *----------------------------------------------------*
      * EDIT                                               *
      *----------------------------------------------------*
     CSR         #EDIT     BEGSR
      *
     C                     MOVEL*BLANK    S1HIN
     C           S1HIN     CAT  W2HIN1:0  S1HIN
     C           S1HIN     CAT  '-':0     S1HIN
     C           S1HIN     CAT  W2HIN2:0  S1HIN
     C           W2HIN3    IFNE *BLANK
     C           S1HIN     CAT  '-':0     S1HIN
     C           S1HIN     CAT  W2HIN3:0  S1HIN
     C                     ENDIF
     C                     MOVEL*BLANK    S1TKR
     C           S1TKR     CAT  W2TKR2:0  S1TKR
     C           S1TKR     CAT  '-':0     S1TKR
     C           S1TKR     CAT  W2TKR3:0  S1TKR
      * GET PREVIOUS LOCATION
JW1  C                     MOVELW2TKR2    $LOC
JW1  C                     MOVE W2TKR3    $LOC
JW1  C                     MOVELW2HIN1    $SHN1
JW1  C                     MOVELW2HIN2    $SHN2
JW1  C                     MOVELW2HIN3    $SHN3
JW1  C                     CALL 'UTLC05'
JW1  C                     PARM           $LOC    4
JW1  C                     PARM           $SHN1   5
JW1  C                     PARM           $SHN2   5
JW1  C                     PARM           $SHN3   2
JW1  C                     PARM           $PLOC   4
JW1  C                     PARM           $RTN    1
JW1  C                     MOVEL$PLOC     FLD3    3
JW1  C                     MOVE '-'       FLD3
JW1  C                     MOVE $PLOC     S0TKR
JW1  C                     MOVELFLD3      S0TKR
      *
     C                     Z-ADDW2INVE    S1INVE
     C                     CLEARNK
     C                     CLEARSP
     C                     CLEARYZ
     C                     EXSR #EDIT2
      * GET SUPPLY QTY
JW1  C                     EXSR #SUP
JW1  C                     Z-ADD@SUP      S1SUP
      * GET DELAY QTY
JW1  C                     EXSR #DSP
JW1  C           @SUP      SUB  @DSP      @DLY    50
JW1  C           @DLY      IFLE 0
JW1  C                     Z-ADD0         @DLY
JW1  C                     ENDIF
JW1  C                     Z-ADD@DLY      S1DLY
JW1  C           S1DLY     IFGT 0
JW1  C                     SETON                     55
JW1  C                     ENDIF
      *
     C                     MOVEL*BLANK    S1SMEI
     C           W2BMON    CHAINFGBPL011             22
     C           *IN22     IFEQ '0'
     C                     MOVELB2SMEI    S1SMEI
     C                     ENDIF
      *
     C           *IN59     IFEQ '0'
     C                     SETON                     59
     C                     ELSE
     C                     SETOF                     59
     C                     ENDIF
      *
     CSR         EEDIT     ENDSR
      *----------------------------------------------------*
JW1   *  GET SUPPLY QTY                                    *
      *----------------------------------------------------*
JW1  CSR         #SUP      BEGSR
     C                     Z-ADD0         @SUP    50
     C                     Z-ADD0         @SUP1   50
     C                     Z-ADD0         @SUP2   50
      *CASE1 @SUP2: FROM AFAPL94
     C                     EXSR #SUP1
      *CASE2 @SUP2: FROM AFDPL24
     C                     EXSR #SUP2
      *
     C           @SUP1     IFGE @SUP2
     C                     Z-ADD@SUP1     @SUP
     C                     ELSE
     C                     Z-ADD@SUP2     @SUP
     C                     ENDIF
      *
JW1  CSR         ESUP      ENDSR
      *----------------------------------------------------*
JW1   *  GET SUPPLY QTY 1                                  *
      *----------------------------------------------------*
JW1  CSR         #SUP1     BEGSR
      *
     C                     MOVE *OFF      *IN96
     C                     MOVELW2BMON    K@SUPP
     C                     MOVELW2HIN1    K@PAR1
     C                     MOVELW2HIN2    K@PAR2
     C                     MOVELW2HIN3    K@PAR3
     C                     MOVEL@TGTYY    K@ODYY
     C                     MOVEL@TGTMM    K@ODMM
     C                     MOVEL@TGTDD    K@ODDD
      *
     C           K@AFA1    SETLLAFAPL94
     C           *IN96     DOWEQ*OFF
     C           K@AFA2    READEAFAPL94                  96
     C           *IN96     IFEQ *OFF
      *
     C* IGNORE IF ORDER DATE > TODAY
     C           A9ODHZ    IFGT @TDAY8
     C                     GOTO @SKP9A
     C                     ENDIF
      *
     C* IGNORE IF SHIP QTY<>0
     C                     EXSR #SHIP1
     C           SQTY1     IFNE 0
     C                     GOTO @SKP9A
     C                     ENDIF
     C*
     C           A9HAKO    SUB  A9NOSU    WKQTY   50
     C           WKQTY     IFLE 0
     C                     Z-ADD0         WKQTY
     C                     ENDIF
     C                     ADD  WKQTY     @SUP1
      *----
     C           @SKP9A    TAG
     C                     ENDIF
     C                     ENDDO
      *
JW1  CSR         ESUP1     ENDSR
      *----------------------------------------------------*
JW1   *  GET SUPPLY QTY 2                                  *
      *----------------------------------------------------*
JW1  CSR         #SUP2     BEGSR
      *
     C                     MOVE *OFF      *IN96
     C                     MOVELW2BMON    K@SUPP
     C                     MOVELW2HIN1    K@PAR1
     C                     MOVELW2HIN2    K@PAR2
     C                     MOVELW2HIN3    K@PAR3
     C                     MOVEL@TGTYY    K@ODYY
     C                     MOVEL@TGTMM    K@ODMM
     C                     MOVEL@TGTDD    K@ODDD
      *
     C           K@AFA1    SETLLAFDPL24
     C           *IN96     DOWEQ*OFF
     C           K@AFA2    READEAFDPL24                  96
     C           *IN96     IFEQ *OFF
      *
     C* IGNORE IF ORDER DATE >= TODAY
     C           AFODHZ    IFGT @TDAY8
     C                     GOTO @SKP9B
     C                     ENDIF
      *
     C* IGNORE IF RECEIVE DATE <> 0
     C           AFNOYY    IFNE 0
     C                     GOTO @SKP9B
     C                     ENDIF
     C*
     C                     ADD  AFHAKO    @SUP2
      *----
     C           @SKP9B    TAG
     C                     ENDIF
     C                     ENDDO
      *
JW1  CSR         ESUP2     ENDSR
      *----------------------------------------------------*
JW1   *  GET DELAY QTY                                     *
      *----------------------------------------------------*
JW1  CSR         #DSP      BEGSR
      *
     C                     Z-ADD0         @DSP    50
     C                     MOVELW2HIN1    K@HIN1
     C                     MOVELW2HIN2    K@HIN2
     C                     MOVELW2HIN3    K@HIN3
     C                     MOVEL*OFF      *IN98
     C           K@WP63    SETLLT#TWP63
     C           *IN98     DOWEQ*OFF
     C           K@WP63    READET#TWP63                  98
     C           *IN98     IFEQ *OFF
     C           W3BMON    ANDEQW2BMON
     C           W3DATE    ANDGE@TDAY8
     C                     ADD  W3NYKA    @DSP
     C                     ENDIF
     C                     ENDDO
      *
JW1  CSR         EDSP      ENDSR
JW1   *----------------------------------------------------*
JW1   * GET OUTSOURCE SHIP QTY1                            *
JW1   *----------------------------------------------------*
JW1  CSR         #SHIP1    BEGSR
JW1   *
JW1  C           K#TL80    KLIST
JW1  C                     KFLD           K8ORD#  60
JW1  C                     KFLD           K8HIN1  5
JW1  C                     KFLD           K8HIN2  5
JW1  C                     KFLD           K8HIN3  2
      *
     C                     Z-ADD0         SQTY1   50
JW1  C                     MOVELA9ODNO    K8ORD#
JW1  C                     MOVELA9PAR1    K8HIN1
JW1  C                     MOVELA9PAR2    K8HIN2
JW1  C                     MOVELA9PAR3    K8HIN3
JW1  C           K#TL80    SETLLAFATL80
JW1  C*
JW1  C                     DO   *HIVAL
JW1  C*
JW1  C           K#TL80    READEAFATL80                  88
JW1  C   88                LEAVE
JW1  C           A8SKJY    IFNE *BLANK
JW1  C                     ITER
JW1  C                     END
JW1  C*
JW1  C           K#ADL3    KLIST
JW1  C                     KFLD           A8ZETI
JW1  C                     KFLD           A8TEHI
JW1  C                     KFLD           A8PAGE
JW1  C           K#ADL3    SETLLALDPL30
JW1  C*
JW1  C                     DO   *HIVAL
JW1  C*
JW1  C           K#ADL3    READEALDPL30                  89
JW1  C   89                LEAVE
JW1  C           A3SYDT    IFGT A9ODHZ
JW1  C                     ADD  1         SQTY1
JW1  C                     LEAVE
JW1  C                     ENDIF
JW1  C*
JW1  C                     ENDDO
JW1  C                     ENDDO
JW1   *
JW1  CSR         ESHIP1    ENDSR
      *----------------------------------------------------*
      * EDIT                                               *
      *----------------------------------------------------*
     CSR         #EDIT2    BEGSR
      *
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     373839
     C                     SETOF                     404142
     C                     SETOF                     434445
     C                     SETOF                     464748
     C                     SETOF                     495030
JW1  C                     SETOF                     55
     C           KEYW4     KLIST
     C                     KFLD           W2HIN1
     C                     KFLD           W2HIN2
     C                     KFLD           W2HIN3
     C                     KFLD           W2TKR
     C                     Z-ADD0         Y       30
     C           KEYW4     SETLLT#TWP641
     C           KEYW4     READET#TWP641                 65
     C           *IN65     DOWEQ'0'
     C                     ADD  1         Y
     C           Y         IFLE 21
     C                     Z-ADDW4NYKA    NK,Y
     C                     Z-ADDW4SHIP    SP,Y
     C                     Z-ADDW4YZIK    YZ,Y
     C           W4YZIK    IFLT 0
     C           Y         ADD  29        II      30
     C                     MOVEL'1'       *IN,II
     C                     ENDIF
     C                     ENDIF
     C           KEYW4     READET#TWP641                 65
     C                     ENDDO
      *
     CSR         EEDIT2    ENDSR
      *----------------------------------------------------*
      * NEXT                                               *
      *----------------------------------------------------*
     CSR         #NEXT     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXT
     C                     ENDIF
      *
     C                     READ T#TWP621                 81
      *
     CSR         ENEXT     ENDSR
      *----------------------------------------------------*
      * PRV                                                *
      *----------------------------------------------------*
     CSR         #NEXTP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXTP
     C                     ENDIF
      *
     C                     READPT#TWP621                 81
      *
     CSR         ENEXTP    ENDSR
      *----------------------------------------------------*
JW1   * INITIALIZE                                         *
      *----------------------------------------------------*
     CSR         #INZ      BEGSR
      * PLIST                                              *
     C           *ENTRY    PLIST
     C                     PARM           P1BMON  40
     C                     PARM           P1SORT  1
     C                     PARM           P1DAYS  20
     C                     PARM           P9CMD   2
      * KLIST
JW1  C           K@AFA1    KLIST
JW1  C                     KFLD           K@SUPP
JW1  C                     KFLD           K@PAR1
JW1  C                     KFLD           K@PAR2
JW1  C                     KFLD           K@PAR3
JW1  C                     KFLD           K@ODYY
JW1  C                     KFLD           K@ODMM
JW1  C                     KFLD           K@ODDD
      *
JW1  C           K@AFA2    KLIST
JW1  C                     KFLD           K@SUPP
JW1  C                     KFLD           K@PAR1
JW1  C                     KFLD           K@PAR2
JW1  C                     KFLD           K@PAR3
      *
JW1  C           K@WP63    KLIST
JW1  C                     KFLD           K@HIN1
JW1  C                     KFLD           K@HIN2
JW1  C                     KFLD           K@HIN3
      *
JW1  C           *LIKE     DEFN A9SUPP    K@SUPP
JW1  C           *LIKE     DEFN A9PAR1    K@PAR1
JW1  C           *LIKE     DEFN A9PAR2    K@PAR2
JW1  C           *LIKE     DEFN A9PAR3    K@PAR3
JW1  C           *LIKE     DEFN A9ODYY    K@ODYY
JW1  C           *LIKE     DEFN A9ODMM    K@ODMM
JW1  C           *LIKE     DEFN A9ODDD    K@ODDD
      *
JW1  C           *LIKE     DEFN W3HIN1    K@HIN1
JW1  C           *LIKE     DEFN W3HIN2    K@HIN2
JW1  C           *LIKE     DEFN W3HIN3    K@HIN3
      * SET TARGET DATE
JW1  C                     MOVEL*DATE     @TDAY8  80
      *
JW1  C                     MOVEL@TDAY8    $DT8
JW1  C                     MOVEL'-'       $SIGN
JW1  C                     MOVEL'0031'    $DAYS
JW1  C                     MOVEL'N'       $IAF
JW1  C                     CALL 'UTLR10'
JW1  C                     PARM           $DT8    8
JW1  C                     PARM           $SIGN   1
JW1  C                     PARM           $DAYS   4
JW1  C                     PARM           $IAF    1
JW1  C                     PARM           $TGT8   8
JW1  C                     PARM           $RTN    1
      *
JW1  C           $RTN      IFEQ *BLANK
JW1  C                     MOVEL$TGT8     @TGT8
JW1  C                     ENDIF
      *
JW1  CSR         EINZ      ENDSR
**
ER-1 NO DATA.
NO OUT SRC L/T MASTER
PARTS#/LOCATION   DLY/INV
