     H            Y.
     F** T#TR61 *********************************************
     F* OUTSOURCE FORECAST該当品番データ作成
     F*             ITS.           2015.07.16               *
     F*******************************************************
     FAAMPL11 IF  E           K        DISK
     FT#TWP61 O   E                    DISK                      A
     FT#TPP50 IF  E           K        DISK
     E                    OBM        15  4               部門
     E                    OTK        15  6               所番地
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60WTIME
     I                                        7  140WDATE
      *
     I            DS
     I                                        1   80WKDATE
     I                                        1   40WKDAYY
     I                                        5   60WKDAMM
     I                                        7   80WKDADD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P1BMON  40
     C                     PARM           P9CMD   2
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     MOVEL'1'       OPNCLS
     C                     TIME           SDATE
     C                     MOVELP1BMON    WKBMON  4
      *
     C           *LOVAL    SETLLAAMPL111
     C                     READ AAMPL111                 80
     C           *IN80     DOWEQ'0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #SB400
     C                     ENDIF
     C                     READ AAMPL111                 80
     C                     ENDDO
      *
     C           OPNCLS    IFEQ '0'
     C                     MOVE '9'       OPNCLS
     C                     CALL 'AAMRSB'
     C                     PARM           A2BHB1  5
     C                     PARM           A2BHB2  5
     C                     PARM           A2BHB3  2
     C                     PARM           OPNCLS  1
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C                     MOVEA*BLANK    OBM
     C                     MOVEA*BLANK    OTK
     C                     CALL 'AAMRSB'
      *入力パラメータ
     C                     PARM           CKHIN1  5
     C                     PARM           CKHIN2  5
     C                     PARM           CKHIN3  2
     C                     PARM           OPNCLS  1
      *出力パラメータ
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     MOVEL'0'       OPNCLS
     C                     MOVEAPBMN      OBM
     C                     MOVEAPTKR      OTK
      *該当する部門があるか
     C                     Z-ADD15        X       30
     C                     MOVEL'0'       GET     1
     C           X         DOWGE1
     C           GET       ANDEQ'0'
     C           P1BMON    IFEQ 9999
     C                     MOVELOBM,X     WKBMON
     C                     ENDIF
     C           OBM,X     IFNE '0000'
     C           OBM,X     ANDNE'0111'
     C           OBM,X     ANDNE'8990'
     C           OBM,X     ANDEQWKBMON
     C           OTK,X     ANDNE'------'
     C                     EXSR #SB123
     C           *IN20     IFEQ '0'
     C                     CLEART#TWP611
     C                     MOVELOBM,X     W1BMON
     C                     MOVELCKHIN1    W1HIN1
     C                     MOVELCKHIN2    W1HIN2
     C                     MOVELCKHIN3    W1HIN3
     C                     MOVELOTK,X     W1TKR
     C                     WRITET#TWP611
     C****                 MOVEL'1'       GET     1
     C                     ENDIF
     C                     ENDIF
     C                     SUB  1         X
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB123    BEGSR
      *
     C                     MOVELOBM,X     KKBMON  4
     C           KKBMON    CHAINT#TPP501             20
     C           *IN20     IFEQ '0'
     C           T5SKJY    ANDEQ'D'
     C           T5SKDT    ANDLE*DATE
     C                     SETON                     20
     C                     ENDIF
      *
     CSR         ESB123    ENDSR
