     H            Y.
     F** UAAR03B ***************************************************************
     F*  UPDATE IAF PART# IN PRICE MASTER                                      *
     F*  WRITTEN BY JW (SRA)  2023.08.18                                       *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UAAR03B'
     F*                    PARM           $TOKU   4
     F*                    PARM           $NONY   4
     F*                    PARM           $NKOJ   1
     F*                    PARM           $NUKE   4
     F*                    PARM           $MHIN  20
     F*                    PARM           $UPD    1
     F*                    PARM           $RTN    1
     F*   IN  $TOKU    4A CUST#
     F*       $NONY    4A DELV#
     F*       $NKOJ    1A FACTORY
     F*       $NUKE    4A DOCK
     F*       $MHIN   20A USER PART#
     F*       $UPD     1A UPDATE FLAG (Y=UPDATE)
     F*   OUT $RTN     1A RETURN (*=PRICE HAS BEEN UPDATED
     F* ----------------------------------------------------
     F*   * UPDATE IAF PART# IN PRICE MASTER(FBCPP01)
     F**************************************************************************
     FFBCPL01AUF  E           K        DISK
     FFBCPP05 O   E                    DISK
     FQPRINT  O   F     198     OF     PRINTER
     I            DS
     I                                        1  20 KMHIN
     I                                        1   5 KMHN1
     I                                        6  10 KMHN2
     I                                       11  15 KMHN3
     I                                       16  20 KMHN4
     I            DS
     I                                        1  12 XSHIN
     I                                        1   5 XSHN1
     I                                        6  10 XSHN2
     I                                       11  12 XSHN3
     I            DS
     I                                        1  14 OGSHIN
     I                                        1   5 FBSHN1
     I                                        6   6 SP1
     I                                        7  11 FBSHN2
     I                                       12  12 SP2
     I                                       13  14 FBSHN3
     I            DS
     I                                        1  14 TBSHIN
     I                                        1   5 TBSHN1
     I                                        6   6 SP3
     I                                        7  11 TBSHN2
     I                                       12  12 SP4
     I                                       13  14 TBSHN3
     I            DS
     I                                        1  14 ZBSHIN
     I                                        1   5 ZBSHN1
     I                                        6   6 SP5
     I                                        7  11 ZBSHN2
     I                                       12  12 SP6
     I                                       13  14 ZBSHN3
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C                     MOVEL$TOKU     K1TOKU
     C                     MOVEL$NONY     K1NONY
     C                     MOVEL$NKOJ     K1NKOJ
     C                     MOVEL$NUKE     K1NUKE
     C                     MOVEL$MHIN     KMHIN
     C                     MOVELKMHN1     K1MHN1
     C                     MOVELKMHN2     K1MHN2
     C                     MOVELKMHN3     K1MHN3
     C                     MOVELKMHN4     K1MHN4
     C           K#PL01    SETLLFBCPL01A
      *
      * READ PRICE MASTER
     C                     DO   *HIVAL
     C           K#PL01    READEFBCPL01A                 98
     C   98                LEAVE
      *
     C           FBSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           FBSHIN    IFEQ @SHIN
     C                     ITER
     C                     ENDIF
      *
     C           BBHFLG    IFEQ '@'
     C                     MOVEL@SHIN     @SHIN2 12
     C                     ELSE
     C                     EXSR #ADJ1
     C                     ENDIF
      *
     C           FBSHIN    IFNE @SHIN2
     C                     EXSR #PRINT
      *
     C           $UPD      IFEQ 'Y'
     C                     MOVELZBSHN1    FBSHN1
     C                     MOVELZBSHN2    FBSHN2
     C                     MOVELZBSHN3    FBSHN3
     C                     MOVE '*'       FBKOME
     C                     UPDATFBCPL011
      * LOG
     C                     EXSR #LOG
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           SEQ#      IFEQ 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  LOG                                               *
      *----------------------------------------------------*
     C           #LOG      BEGSR
      *
     C                     CLEARFBCPP051
     C                     MOVE 'CHG'     F5PTYP
     C                     Z-ADDTODAY     F5PRHZ
     C                     Z-ADDNOW       F5PRTM
     C                     MOVEL#USER     F5PRUS
     C                     MOVEL#PGM      F5PRPG
      *
     C                     Z-ADDFBTOKU    F5TOKU
     C                     Z-ADDFBNONY    F5NONY
     C                     MOVELFBNKOJ    F5NKOJ
     C                     MOVELFBNUKE    F5NUKE
     C                     MOVELFBMHN1    F5MHN1
     C                     MOVELFBMHN2    F5MHN2
     C                     MOVELFBMHN3    F5MHN3
     C                     MOVELFBMHN4    F5MHN4
     C                     MOVELFBSHN1    F5SHN1
     C                     MOVELFBSHN2    F5SHN2
     C                     MOVELFBSHN3    F5SHN3
     C                     Z-ADDFBNTAN    F5NTAN
     C                     Z-ADDFBTKHZ    F5TKHZ
     C                     Z-ADDFBTSHZ    F5TSHZ
     C                     WRITEFBCPP051
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  ADJ IAF PART#                                     *
      *----------------------------------------------------*
     C           #ADJ1     BEGSR
      *
     C                     MOVELFBMHIN    XSHIN
     C                     MOVE FBMHN3    LTR3    3
     C                     SELEC
     C           LTR3      WHNE *BLANK
     C                     MOVE *BLANK    XSHN3
     C           XSHN3     WHEQ '0 '
     C           XSHN3     OREQ '00'
     C                     MOVE *BLANK    XSHN3
     C           FBSHN1    WHEQ XSHN1
     C           FBSHN2    ANDEQXSHN2
     C                     MOVELFBSHN3    XSHN3
     C           FBMHN1    WHEQ XSHN1
     C           FBMHN2    ANDEQXSHN2
     C                     MOVELFBMHN3    XSHN3
     C                     ENDSL
      *
     C                     MOVELXSHIN     @SHIN2
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C           LIN#      IFGE 66
     C                     EXCPT@HDR
     C                     Z-ADD4         LIN#
     C                     ENDIF
      * EDIT
     C                     MOVEL@SHIN     XSHIN
     C                     MOVELXSHN1     TBSHN1
     C                     MOVELXSHN2     TBSHN2
     C                     MOVELXSHN3     TBSHN3
      *
     C                     MOVEL@SHIN2    XSHIN
     C                     MOVELXSHN1     ZBSHN1
     C                     MOVELXSHN2     ZBSHN2
     C                     MOVELXSHN3     ZBSHN3
      * DETAIL
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $MHIN  20
     C                     PARM           $UPD    1
     C                     PARM           $RTN    1
      *
     C           K#PL01    KLIST
     C                     KFLD           K1TOKU  40
     C                     KFLD           K1NONY  40
     C                     KFLD           K1NKOJ  1
     C                     KFLD           K1NUKE  4
     C                     KFLD           K1MHN1  5
     C                     KFLD           K1MHN2  5
     C                     KFLD           K1MHN3  5
     C                     KFLD           K1MHN4  5
      *
     C           $UPD      IFEQ 'Y'
     C                     MOVE *ON       *IN88
     C                     ELSE
     C                     MOVE *OFF      *IN88
     C                     MOVE 'N'       $UPD
     C                     ENDIF
      *
     C                     TIME           SDATE
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD88        LIN#    30
     C                     MOVE ' '       $RTN
     C                     MOVE ' '       SP1
     C                     MOVE ' '       SP2
     C                     MOVE ' '       SP3
     C                     MOVE ' '       SP4
     C                     MOVE ' '       SP5
     C                     MOVE ' '       SP6
      * GET IAF PART#
     C                     MOVEL$TOKU     PTOKU
     C                     MOVEL$NONY     PNONY
     C                     MOVEL$NKOJ     PNKOJ
     C                     MOVEL$NUKE     PNUKE
     C                     MOVEL$MHIN     PMHIN
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           PMHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @RTN    1
      *
     C           BBHFLG    IFEQ '*'
     C                     MOVE '*'       BBHFLG  1
     C                     MOVE *BLANK    @SHIN
     C                     ELSE
     C                     MOVE '@'       BBHFLG
     C                     ENDIF
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   15 'UPD='
     O                         $UPD      16
     O                                   45 '** CHECK IAF_PART# I'
     O                                   65 'N PRICE MASTER **   '
     O                                  106 'DATE'
     O                         TODAY    109 '    .  .  '
     O                         NOW      119 '0 :  :  '
     O                                  122 'P.'
     O                         PAGE  Z  126
     O        E   02           @HDR
     O                                    1 '.'
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   10 'CUST'
     O                                   15 'DELV'
     O                                   17 'F'
     O                                   22 'DOCK'
     O                                   32 'USER_PART'
     O                                   49 'IAF_PART'
     O                                   55 '<--'
     O                                   65 'TRUE_PART'
     O                                   86 'ADJUSTED_PART'
     O                                   98 'UNIT_PRICE'
     O                                  108 'EFF_DATE'
     O                                  119 'EXP_DATE'
     O                                  130 'UPD_DATE'
     O        E   04           @HDR
     O                                   20 '--------------------'
     O                                   40 '--------------------'
     O                                   60 '--------------------'
     O                                   80 '--------------------'
     O                                  100 '--------------------'
     O                                  120 '--------------------'
     O                                  132 '------------'
     O        E 1              @DTL
     O                         SEQ#    +001
     O                         FBTOKU  +001
     O                         FBNONY  +001
     O                         FBNKOJ  +001
     O                         FBNUKE  +001
     O                         FBMHN1  +001
     O                         FBMHN2  +001
     O                         FBMHN3  +001
      * OLD SHIN
     O                         OGSHIN  +001
      * NEW SHIN
     O                         TBSHIN  +001
     O                         BBHFLG  +001
      * ADJ SHIN
     O                 88      ZBSHIN  +001
      *
     O                         FBNTAN1 +000
     O                         FBTKHZ  +001 '    /  /  '
     O                         FBTSHZ  +001 '    /  /  '
     O                         FBKOHZ  +001 '    /  /  '
