     H            Y/                                    1
     H**UAAR06 ********************************************************
     H* SORT TURN# TABLE MAINTENANCE (AAHPPS6)                        *
     H* JW       2019.05.09                                           *
     H*****************************************************************
     FUAAPW06 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     FAAHPPS6 UF  E           K        DISK                      A
      *================================================================
     E                    MSG     1  20 60
      *================================================================
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
      *
     I            DS
     I                                        1  140@TIME
     I                                        1   60NOW
     I                                        7  140TODAY
      *     <<
      *
     I           SDS
     I                                     *PROGRAM #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I                                      264 269 #JBNO
      *===============================================================
      *  START  PROGRAM
      *===============================================================
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C           @STEP     CASEQ'#CHK1   '#CHK1
     C           @STEP     CASEQ'#DSP2   '#DSP2
     C           @STEP     CASEQ'#CHK2   '#CHK2
     C           @STEP     CASEQ'#CHK2 F5'#CHK2
     C           @STEP     CASEQ'#UPDAT  '#UPDAT
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      *   << INIT >>
      *===============================================================
     C           #INIT     BEGSR
     C                     TIME           @TIME
     C                     MOVEA*ALL'0'   *IN
     C                     MOVE *BLANK    D1KBN
     C                     MOVE *BLANK    D1MCN#
     C                     MOVE *BLANK    XMSG
     C                     MOVE '#DSP1   '@STEP
     C                     ENDSR
      *===============================================================
      *   DISPLAY SCREEN 1
      *===============================================================
     C           #DSP1     BEGSR
     C*
     C                     EXFMTDSP01
     C                     MOVE *OFF      *IN21
     C                     MOVE *OFF      *IN22
     C                     SETOF                     85
     C                     MOVE *BLANK    XMSG
     C*
     C                     MOVE '#CHK1   '@STEP
     C*  < F1 >  END JOB
     C           *INKA     IFEQ *ON
     C                     MOVE '#END    '@STEP
     C                     ENDIF
     C*  < F12 >  INQUIRY
     C           *INKL     IFEQ *ON
     C                     MOVE *BLANK    P@MCN#
     C                     CALL 'UAAR07'
     C                     PARM           P@MCN#  3
     C                     MOVE '#DSP1   '@STEP
     C                     ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *  CHECK SCREEN 1
      *===============================================================
     C           #CHK1     BEGSR
     C                     Z-ADD0         D2TRN#
     C*--------------------
     C* D1KBN (21)
     C*--------------------
     C                     SELEC
     C           D1KBN     WHEQ '0'
     C                     MOVEL'0-CANCEL'D2KBN
     C                     SETON                     30
     C           D1KBN     WHEQ '1'
     C                     MOVEL'1-CHANGE'D2KBN
     C                     SETOF                     30
     C           D1KBN     WHEQ '2'
     C                     MOVEL'2-ADD   'D2KBN
     C                     SETOF                     30
     C                     OTHER
     C                     SETON                     2185
     C                     MOVELMSG,1     XMSG
     C                     GOTO @CHK1X
     C                     ENDSL
     C*--------------------
     C* D1MCN# (22)
     C*--------------------
     C           D1MCN#    IFEQ *BLANK
     C                     SETON                     2285
     C                     MOVELMSG,2     XMSG
     C                     GOTO @CHK1X
     C                     ENDIF
     C*--------------------
     C           KEY01     KLIST
     C                     KFLD           K@MCN#  3
     C*
     C                     MOVELD1MCN#    K@MCN#
     C           KEY01     CHAINAAHPPS6             N90
     C  N90      S6SKJY    IFEQ 'D'                        DELETE CODE
     C                     SETON                     90
     C                     ENDIF
      *
     C           *IN90     IFEQ *ON
     C                     Z-ADD0         S6TRN#
     C                     ENDIF
      *
S1   C           *IN90     IFEQ *OFF
     C           D1KBN     IFEQ '2'                        2-ADD
     C                     SETON                     2122
     C                     SETON                         85
     C                     MOVELMSG,5     XMSG
     C                     GOTO @CHK1X
     C                     ENDIF
X1   C                     ELSE
     C           D1KBN     IFNE '2'                        NE 2-ADD
     C                     SETON                     212223
     C                     SETON                         85
     C                     MOVELMSG,4     XMSG
     C                     GOTO @CHK1X
     C                     ENDIF
E1   C                     ENDIF
     C*-------------------------
     C           @CHK1X    TAG
     C*-------------------------
     C*
S1   C           *IN85     IFEQ *ON
     C                     MOVE '#DSP1   '@STEP
X1   C                     ELSE
     C                     Z-ADDS6TRN#    D2TRN#
     C                     MOVE *BLANK    XMSG
     C                     MOVE '#DSP2   '@STEP
      * PROTECT FLAG (30)
     C           D1KBN     IFEQ '0'
     C                     MOVE *ON       *IN30
     C                     ELSE
     C                     MOVE *OFF      *IN30
     C                     ENDIF
      *
E1   C                     ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *   DISPLAY SCREEN 2
      *===============================================================
     C           #DSP2     BEGSR
     C*
     C                     EXFMTDSP02
     C                     SETOF                     85
     C                     SETOF                     30
     C                     SETOF                     31
     C                     MOVE *BLANK    XMSG
     C*
     C                     MOVE '#CHK2   '@STEP
     C*  < F3 >  BACK
     C           *INKC     IFEQ *ON
     C                     MOVE *OFF      *IN21
     C                     MOVE *OFF      *IN22
     C                     MOVE *BLANK    XMSG
     C                     MOVE '#DSP1   '@STEP
     C                     ENDIF
     C*  < F5 >  UPDAT
     C           *INKE     IFEQ *ON
     C                     MOVE '#CHK2 F5'@STEP
     C           D1KBN     IFEQ '0'                        0-CANCEL
     C                     MOVE '#UPDAT  '@STEP
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDSR
      *===============================================================
      *  CHECK SCREEN 2
      *===============================================================
     C           #CHK2     BEGSR
     C*
     C           D2TRN#    IFEQ 0
     C                     SETON                     85
     C                     SETON                     31
     C                     MOVELMSG,8     XMSG
     C                     MOVEL'#DSP2   '@STEP
     C                     GOTO @CHK2X
     C                     ENDIF
     C*
     C*-------------------------
     C           @CHK2X    TAG
     C*-------------------------
     C           *IN85     IFEQ *OFF
     C           @STEP     IFEQ '#CHK2 F5'
     C                     MOVEL'#UPDAT  '@STEP
     C                     ELSE
     C                     MOVELMSG,3     XMSG
     C                     MOVEL'#DSP2   '@STEP
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      * UPDATE
      *===============================================================
     C           #UPDAT    BEGSR
     C*
     C           KEY01     CHAINAAHPPS6              90
     C*
     C           D1KBN     IFEQ '0'                        0-CANCEL
     C                     MOVE 'D'       S6SKJY           DELETE CODE
     C                     Z-ADDTODAY     S6SKDT           DELETE DATE
     C                     Z-ADDNOW       S6SKTM           DELETE TIME
     C                     MOVEL#PGM      S6SKPG           DELETE PGM
     C                     MOVEL#USER     S6SKUS           DELETE USER
     C  N90                UPDATAAHPPS61
     C                     ELSE
     C                     MOVE *BLANK    S6SKJY           DELETE CODE
     C                     Z-ADD0         S6SKDT           DELETE DATE
     C                     Z-ADD0         S6SKTM           DELETE TIME
     C                     MOVE *BLANK    S6SKPG           DELETE PGM
     C                     MOVE *BLANK    S6SKUS           DELETE USER
     C                     Z-ADD0         S6CRDT           CREATE DATE
     C                     Z-ADD0         S6CRTM           CREATE TIME
     C                     MOVE *BLANK    S6CRPG           CREATE PGM
     C                     MOVE *BLANK    S6CRUS           CREATE USER
      *
     C           *IN90     IFEQ *OFF
     C                     Z-ADDTODAY     S6KODT           UPDATE DATE
     C                     Z-ADDNOW       S6KOTM           UPDATE TIME
     C                     MOVEL#PGM      S6KOPG           UPDATE PGM
     C                     MOVEL#USER     S6KOUS           UPDATE USER
     C                     ELSE
     C                     Z-ADDTODAY     S6CRDT           CREATE DATE
     C                     Z-ADDNOW       S6CRTM           CREATE TIME
     C                     MOVEL#PGM      S6CRPG           CREATE PGM
     C                     MOVEL#USER     S6CRUS           CREATE USER
     C                     Z-ADD0         S6KODT           UPDATE DATE
     C                     Z-ADD0         S6KOTM           UPDATE TIME
     C                     MOVE *BLANK    S6KOPG           UPDATE PGM
     C                     MOVE *BLANK    S6KOUS           UPDATE USER
     C                     ENDIF
      *
     C                     MOVELD1MCN#    S6MCN
     C                     Z-ADDD2TRN#    S6TRN#
      *
     C   90                WRITEAAHPPS61
     C  N90                UPDATAAHPPS61
     C                     ENDIF
      *
     C                     MOVE *BLANK    D1KBN
     C**                   MOVE *BLANK    D1MCN#
     C                     MOVE *BLANK    XMSG
     C                     MOVE *OFF      *IN21
     C                     MOVE *OFF      *IN22
     C                     MOVE '#DSP1   '@STEP
      *
     C                     ENDSR
      *===============================================================
**  MSG  1         2         3         4         5         60 (60A)
 ENTER 0, 1 OR 2 FOR THE UPDATE ID !                          01
 ENTER MACHINE# #                                             02
 PRESS F5 TO UPDATE...                                        03
 THERE IS NO TARGET DATA.                                     04
 MACHINE# IS ALREADY REGISTERED !                             05
                                                              06
                                                              07
 ENTER TURN# !                                                08
                                                              09
                                                              10
