     H            Y.
     F** UAPR01 *********************************************************
     F*  COPY MULTIPLE FILES FROM HFILE1 TO TFILE1                      *
     F*  JW       2020.11.17                                            *
     F*******************************************************************
     FUAPPW01 CF  E                    WORKSTN
      *----------------------------------------------------
     E                    MSG     1   4 60
     E                    FIL        18 10
     E                    STS        18  2
     E                    PF         18 10
     I            DS
     I                                        1 180 FIL
     I                                        1  10 XFIL01
     I                                       11  20 XFIL02
     I                                       21  30 XFIL03
     I                                       31  40 XFIL04
     I                                       41  50 XFIL05
     I                                       51  60 XFIL06
     I                                       61  70 XFIL07
     I                                       71  80 XFIL08
     I                                       81  90 XFIL09
     I                                       91 100 XFIL10
     I                                      101 110 XFIL11
     I                                      111 120 XFIL12
     I                                      121 130 XFIL13
     I                                      131 140 XFIL14
     I                                      141 150 XFIL15
     I                                      151 160 XFIL16
     I                                      161 170 XFIL17
     I                                      171 180 XFIL18
     I            DS
     I                                        1 180 PF
     I                                        1  10 XPF001
     I                                       11  20 XPF002
     I                                       21  30 XPF003
     I                                       31  40 XPF004
     I                                       41  50 XPF005
     I                                       51  60 XPF006
     I                                       61  70 XPF007
     I                                       71  80 XPF008
     I                                       81  90 XPF009
     I                                       91 100 XPF010
     I                                      101 110 XPF011
     I                                      111 120 XPF012
     I                                      121 130 XPF013
     I                                      131 140 XPF014
     I                                      141 150 XPF015
     I                                      151 160 XPF016
     I                                      161 170 XPF017
     I                                      171 180 XPF018
     I            DS
     I                                        1  36 STS
     I                                        1   2 XSTS01
     I                                        3   4 XSTS02
     I                                        5   6 XSTS03
     I                                        7   8 XSTS04
     I                                        9  10 XSTS05
     I                                       11  12 XSTS06
     I                                       13  14 XSTS07
     I                                       15  16 XSTS08
     I                                       17  18 XSTS09
     I                                       19  20 XSTS10
     I                                       21  22 XSTS11
     I                                       23  24 XSTS12
     I                                       25  26 XSTS13
     I                                       27  28 XSTS14
     I                                       29  30 XSTS15
     I                                       31  32 XSTS16
     I                                       33  34 XSTS17
     I                                       35  36 XSTS18
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *----------------------------------------------------
     C                     EXSR #INIT
      * DISPLAY
     C                     DO   *HIVAL
     C                     EXFMTDSP01
     C                     MOVE *BLANK    XMSG
     C                     MOVE *OFF      *IN85
      * F1: EXIT
     C           *INKA     IFEQ *ON
     C           *INKC     OREQ *ON
     C           *INKL     OREQ *ON
     C                     LEAVE
     C                     ENDIF
      * CHECK DATA
     C                     EXSR #CHK1
      * CHECK DATA
     C           *IN85     IFEQ *ON
     C                     ITER
     C                     ENDIF
      * ENTER
     C           *INKE     IFEQ *OFF
     C                     MOVELMSG,3     XMSG
     C                     ITER
     C                     ENDIF
      * F5
      *
     C           1         DO   18        IX      20
     C           FIL,IX    IFNE *BLANK
     C                     MOVELFIL,IX    $FILE
     C                     CALL '@DL3'
     C                     PARM           $FILE  10
     C                     PARM           $RTNX   1
      *
     C           $RTNX     IFEQ *BLANK
     C                     MOVEL'OK'      STS,IX
     C                     ELSE
     C                     MOVEL'X '      STS,IX
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVELMSG,1     XMSG
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *----------------------------------------------------
      * CHECK DATA
      *----------------------------------------------------
     C           #CHK1     BEGSR
      * CHECK DATA
     C           XFIL01    IFEQ *BLANK
     C           XFIL02    ANDEQ*BLANK
     C           XFIL03    ANDEQ*BLANK
     C           XFIL04    ANDEQ*BLANK
     C           XFIL05    ANDEQ*BLANK
     C           XFIL06    ANDEQ*BLANK
     C           XFIL07    ANDEQ*BLANK
     C           XFIL08    ANDEQ*BLANK
     C           XFIL09    ANDEQ*BLANK
     C           XFIL10    ANDEQ*BLANK
     C           XFIL11    ANDEQ*BLANK
     C           XFIL12    ANDEQ*BLANK
     C           XFIL13    ANDEQ*BLANK
     C           XFIL14    ANDEQ*BLANK
     C           XFIL15    ANDEQ*BLANK
     C           XFIL16    ANDEQ*BLANK
     C           XFIL17    ANDEQ*BLANK
     C           XFIL18    ANDEQ*BLANK
     C                     MOVE *ON       *IN85
     C                     MOVELMSG,2     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      * IF NO ERROR
     C           1         DO   18        IX      20
     C                     MOVE *BLANK    STS,IX
     C                     MOVE *BLANK    PF,IX
     C                     ENDDO
      *
     C           1         DO   18        IX      20
     C           FIL,IX    IFNE *BLANK
     C                     MOVELFIL,IX    $FILE
     C                     CALL 'UTLC04'
     C                     PARM           $FILE  10
     C                     PARM           $PF    10
     C                     PARM           $ATR   10
     C                     PARM           $RTNX   1
     C           $RTNX     IFEQ *BLANK
     C                     MOVEL$PF       PF,IX
     C                     ELSE
     C                     MOVE *ON       *IN85
     C                     MOVELMSG,4     XMSG
     C                     MOVEL'*ERROR*' PF,IX
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           XCHK1     ENDSR
      *----------------------------------------------------
      * INITIAL SET
      *----------------------------------------------------
     C           #INIT     BEGSR
     C                     ENDSR
** MSG
ALL FILES HAVE BEEN PROCESSED...
ENTER FILE NAME!
PRESS F5 TO COPY...
FILE NOT FOUND!
