     F******************************************************
     F* IT IS RPG INQUIRY SOURCE PROGRAM                  *
     F*THAT WAS MADE  WITH SIMPLE INQUIRY PGM        *
     F******************************************************
     FUCLR14S CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        SFLRRNKSFILE SFLREC
     FFCLPL24 IF  E           K        DISK
     E                    ERR     1   3 78
     IINFDS       DS
     I                                      273 282 WSNAME
     I* ﾅﾎﾞﾎabﾓ ﾅbﾆﾑcgb- ﾉ tf]ﾎb-ﾓnﾞ < MIN >
     I            DS
     I                                        10019 SKEYDS
     I* ﾅﾎﾞﾎabﾓ ﾅbjﾞbgb- tf]ﾎb-ﾓnﾞ < MAX >
     I            DS
     I                                        10019 EKEYDS
     I* SEARCH LOVAL KEY
     I            DS
     I                                        1   1 LVKY01
     I                                        2   6 LVKY02
     I                                        7  11 LVKY03
     I                                       12  13 LVKY04
     I                                       14  14 LVKY05
     I                                       15  16 LVKY06
     I                                       17  18 LVKY07
     I                                       19  19 LVKY08
     I                                        10019 LVKYDS
     I* SEARCH HIVAL KEY
     I            DS
     I                                        1   1 HVKY01
     I                                        2   6 HVKY02
     I                                        7  11 HVKY03
     I                                       12  13 HVKY04
     I                                       14  14 HVKY05
     I                                       15  16 HVKY06
     I                                       17  18 HVKY07
     I                                       19  19 HVKY08
     I                                        10019 HVKYDS
     I* mﾞ-jsﾞ-ﾇ gb- ﾝ-hﾎb-ﾓnﾞ
     I            DS
     I                                        1   1 FLKY01
     I                                        2   6 FLKY02
     I                                        7  11 FLKY03
     I                                       12  13 FLKY04
     I                                       14  14 FLKY05
     I                                       15  16 FLKY06
     I                                       17  18 FLKY07
     I                                       19  19 FLKY08
     I                                        10019 FKEYDS
     I* mﾞ-jsﾞ-ﾇ ﾆﾑcfb gb-ﾎbﾓnﾞ
     I            DS
     I                                        1   1 P3BKBN
     I                                        2   6 P3HIN1
     I                                        7  11 P3HIN2
     I                                       12  13 P3HIN3
     I                                       14  14 P3BAN1
     I                                       15  16 P3BAN2
     I                                       17  18 P3BAN3
     I                                       19  19 P3BAN4
     I                                        10019 DBKEY
     C* mﾞ-jsﾞ-ﾇ ﾆﾑcfb gb-ﾆﾞﾏ]b
     C           FULKEY    KLIST
     C                     KFLD           FLKY01
     C                     KFLD           FLKY02
     C                     KFLD           FLKY03
     C                     KFLD           FLKY04
     C                     KFLD           FLKY05
     C                     KFLD           FLKY06
     C                     KFLD           FLKY07
     C                     KFLD           FLKY08
     C* ﾅﾎﾞﾎabﾓ xbﾅbgﾞﾑc ﾉ ﾆmb
     C                     Z-ADD19        LINES   30
     C***********************************************
     C*    ﾆﾑcfb xb]ﾓ-k]                            *
     C***********************************************
     C           PUT01     TAG
     C                     EXFMTSCR1
     C* CMD-1 ﾆﾏcﾒﾑc kdlh
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C* gb- fﾞ pﾏcﾒﾑhﾅﾛjf kdlhﾇﾓ
     C           WSKY01    IFEQ *BLANK
     C                     MOVE ERR,1     ERRMSG 78
     C                     GOTO ERR01
     C                     END
     C*       *****************************************             *USER*
     C*      *        gb- ﾑvﾃv kdlh ﾓ-k].........      *            *USER*
     C*     *       * ﾅ]ﾎﾟﾓ *                           *           *USER*
     C*     *              MOVE ERR,X     ERRMSG        *           *USER*
     C*      *             GOTO ERR01                  *            *USER*
     C*       *****************************************             *USER*
     C* HIVAL/LOVAL/FULLKEY  ﾈln ﾇﾓ
     C                     MOVE *HIVAL    HVKYDS
     C                     MOVE *LOVAL    LVKYDS
     C                     MOVE *BLANK    FLKY01
     C                     MOVE *BLANK    FLKY02
     C                     MOVE *BLANK    FLKY03
     C                     MOVE *BLANK    FLKY04
     C                     MOVE *BLANK    FLKY05
     C                     MOVE *BLANK    FLKY06
     C                     MOVE *BLANK    FLKY07
     C                     MOVE *BLANK    FLKY08
     C* HIVAL/LOVAL/FULLKEYY ﾈln
     C                     MOVE WSKY01    HVKY01
     C                     MOVE WSKY01    LVKY01
     C                     MOVE WSKY01    FLKY01
     C           WSKY02    IFNE *BLANK
     C                     MOVE WSKY02    HVKY02
     C                     MOVE WSKY02    LVKY02
     C                     MOVE WSKY02    FLKY02
     C                     END
     C           WSKY03    IFNE *BLANK
     C                     MOVE WSKY03    HVKY03
     C                     MOVE WSKY03    LVKY03
     C                     MOVE WSKY03    FLKY03
     C                     END
     C           WSKY04    IFNE *BLANK
     C                     MOVE WSKY04    HVKY04
     C                     MOVE WSKY04    LVKY04
     C                     MOVE WSKY04    FLKY04
     C                     END
     C           WSKY05    IFNE *BLANK
     C                     MOVE WSKY05    HVKY05
     C                     MOVE WSKY05    LVKY05
     C                     MOVE WSKY05    FLKY05
     C                     END
     C           WSKY06    IFNE *BLANK
     C                     MOVE WSKY06    HVKY06
     C                     MOVE WSKY06    LVKY06
     C                     MOVE WSKY06    FLKY06
     C                     END
     C           WSKY07    IFNE *BLANK
     C                     MOVE WSKY07    HVKY07
     C                     MOVE WSKY07    LVKY07
     C                     MOVE WSKY07    FLKY07
     C                     END
     C           WSKY08    IFNE *BLANK
     C                     MOVE WSKY08    HVKY08
     C                     MOVE WSKY08    LVKY08
     C                     MOVE WSKY08    FLKY08
     C                     END
     C* mﾞ-jsﾞ-ﾇ ﾑvﾃv ﾅﾎﾞﾓ-k]
     C                     SETON                     9091
     C                     EXSR SFLSTR
     C                     SETOF                     9091
     C   99                GOTO PUT01
     C                     GOTO PUT02
     C           ERR01     TAG
     C                     SETON                     99
     C                     GOTO PUT01
     C* jﾞb 2 fﾞx] ﾉ ﾆﾏlﾒﾑh
     C           PUT02     TAG
     C                     WRITESCR2
     C                     DO   *HIVAL
     C   99                SETON                     98
     C  N99                SETON                     9798
     C                     EXFMTSFLCTL
     C                     SETOF                     9798
     C* CMD-1 ﾆﾏcﾒﾑc kdlh
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C  N91N92             GOTO PUT01
     C* mﾞ-jsﾞ-ﾇ ﾑvﾃv ﾅﾎﾞﾓ-k]
     C                     EXSR SFLSTR
     C                     END
     C***********************************************
     C*  mﾞ-j ･ xyﾒ- p ﾑvﾃv ﾅﾎﾞﾓ-k]                 *
     C***********************************************
     C           SFLSTR    BEGSR
     C                     Z-ADD*ZERO     LINECT
     C* ROLL-UP ﾉ ng gb- ﾉ ﾈln
     C           *IN91     IFEQ '1'
     C                     Z-ADD1         SFLRRN  40
     C* lgﾞﾉ ﾎabﾓ fﾞ aﾓf kdlhﾇﾓ
     C           *IN90     IFEQ '1'
     C           FULKEY    SETLLFCLPL24
     C*  ROLL-UPgb- ﾉng lgﾞﾉ xbﾅb
     C                     ELSE
     C           LAST      IFEQ '*'
     C                     MOVE ERR,2     ERRMSG
     C                     GOTO ERRSTR
     C                     END
     C* PREVIOUS END KEY SET
     C                     MOVE EKEYDS    FKEYDS
     C           FULKEY    SETGTFCLPL24
     C                     END
     C* ROLL-DOWN gb- fﾞ eﾅﾛjng gb- ﾉ ﾈln
     C                     ELSE
     C           PAGCNT    SUB  1         PAGWRK  30
     C           PAGWRK    IFLE *ZERO
     C                     MOVE ERR,2     ERRMSG
     C                     GOTO ERRSTR
     C                     END
     C* ﾆgﾞﾉ xbﾅbﾆﾏlﾒﾑhﾇﾓ ﾅbﾆﾑ ﾉ gb- e ﾈlnﾇﾓ
     C                     MOVE SKEYDS    FKEYDS
     C           FULKEY    SETLLFCLPL24
     C                     Z-ADDLINES     SFLRRN
     C                     END
     C* fﾞx] ﾉ ﾆﾑgﾈlmb
     C           *IN90     IFEQ '1'
     C                     Z-ADD*ZERO     PAGCNT
     C                     END
     C* ﾅﾎﾞﾎabﾓ hﾒa
     C                     SETON                     96
     C                     WRITESFLCTL
     C                     SETOF                     96
     C* ﾅﾎﾞﾎabﾓ p mﾞ-j ﾑvﾃv
     C                     DO   *HIVAL
     C           *IN91     IFEQ '1'
     C           STEP01    TAG
     C                     READ FCLPL24                  20
     C  N20      P3SKJY    CABEQ'D'       STEP01
     C   20                SETON                     94
     C                     ELSE
     C           STEP02    TAG
     C                     READPFCLPL24                  20
     C           P3SKJY    CABEQ'D'       STEP02
     C                     END
     C* ﾅbﾃﾞ ﾉ mﾞ-jumﾞ ﾑvgljng ﾉ ﾆﾑﾒ
     C           *IN20     CABEQ'1'       LPOUT
     C* ﾆﾑcfb gb- ﾉ kdlh
     C           DBKEY     CABLTLVKYDS    LPOUT
     C           DBKEY     IFGT HVKYDS
     C                     SETON                     94
     C                     GOTO LPOUT
     C                     END
     C* mﾞ-ﾎb-ﾓnﾞ n  ﾝ-hﾇm-ﾆﾑ] ﾎb-ﾓnﾞ
     C*       *****************************************             *USER*
     C*      *     mﾞ-j ﾑvﾃv                           *            *USER*
     C*      *        ﾏ-ﾅﾞ- mbgﾞ ﾎb-ﾓnﾞ                *            *USER*
     C*       *****************************************             *USER*
     C                     ADD  1         LINECT  30
     C                     WRITESFLREC
     C* ﾅbﾆﾑﾉ xbﾅbgb- tf]
     C           SFLRRN    IFEQ 1
     C                     MOVE DBKEY     SKEYDS
     C           *IN91     CABEQ'0'       LPOUT
     C                     END
     C* ﾅbﾃﾞ ﾉ xbﾅbgﾞﾑc ﾉ tf]
     C           SFLRRN    IFEQ LINES
     C                     MOVE DBKEY     EKEYDS
     C           *IN91     CABEQ'1'       LPOUT
     C                     END
     C           *IN91     IFEQ '1'
     C                     ADD  1         SFLRRN
     C                     ELSE
     C                     SUB  1         SFLRRN
     C                     END
     C                     END
     C           LPOUT     TAG
     C           LINECT    IFEQ *ZEROS
     C                     MOVE ERR,3     ERRMSG
     C                     GOTO ERRSTR
     C                     END
     C* PAGE ﾃ]nﾜ-ﾓ
     C           *IN91     IFEQ '1'
     C                     ADD  1         PAGCNT  30
     C           LINECT    IFLT LINES
     C                     MOVE '*'       LAST    1
     C                     ELSE
     C                     MOVE *BLANK    LAST
     C                     END
     C                     ELSE
     C                     MOVE *BLANK    LAST
     C                     SUB  1         PAGCNT
     C                     END
     C                     GOTO ENDSTR
     C           ERRSTR    TAG
     C                     SETON                     99
     C           ENDSTR    ENDSR
**  ERR ARAY
THIS REFERENCE KEY IS WRONG
CORRESPOND DATA IS NOT FOUND ANY MORE
CORRESPOND DATA IS NOT FOUND
