     H            Y.
      ** UEXR06B **********************************************
      *  GET KANBAN PICK UP CONDITION                         *
      *  WRITTEN: JW (SRA)   2022.09.16                       *
      *-------------------------------------------------------*
      *  CALLING SEQ.                                         *
      *                    CALL 'UEXR06B'
      *                    PARM           PSHIN  12
      *                    PARM           PJOK   14
      *                    PARM           PJNM  140
      *-------------------------------------------------------*
      *   IN   PSHIN  12A    IAF PART NO.                     *
      *   OUT  PJOK   14A    PICK-UP COND X 7 (TABLE OF 2A)   *
      *        PJNM  140A    PICK-UP NAME X 7 (TABLE OF 20A)  *
      *********************************************************
     FAAHPL05 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
      ******************************************************
     E                    JOK         7  2
     E                    JNM         7 20
     I            DS
     I                                        1  12 K#SHIN
     I                                        1   5 K#SHN1
     I                                        6  10 K#SHN2
     I                                       11  12 K#SHN3
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W$JBNO
      *==========================================================
      *  MAIN ROUTINE
      *==========================================================
     C                     EXSR #INIT
      * GET CONDITION CODE
     C           K#05      SETLLAAHPL05
     C                     DO   *HIVAL
     C           K#05      READEAAHPL05                  91
     C   91                LEAVE
      *
     C           L6SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELL6JOK1    JOK,1
     C                     MOVELL6JOK2    JOK,2
     C                     MOVELL6JOK3    JOK,3
     C                     MOVELL6JOK4    JOK,4
     C                     MOVELL6JOK5    JOK,5
     C                     MOVELL6JOK6    JOK,6
     C                     MOVELL6JOK7    JOK,7
     C                     LEAVE
     C                     ENDDO
      * GET CONDITION NAME
     C           1         DO   7         IX      20
     C                     MOVE *BLANK    JNM,IX
     C           JOK,IX    IFNE *BLANK
     C           JOK,IX    SETLLAAAPL01
     C                     DO   *HIVAL
     C           JOK,IX    READEAAAPL01                  92
     C   92                LEAVE
     C                     MOVELA5JOKM    JNM,IX
     C                     LEAVE
     C                     ENDDO
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEAJOK       PJOK
     C                     MOVEAJNM       PJNM
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *===============================================================
      *  INITIAL SETTING
      *===============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           PSHIN  12
     C                     PARM           PJOK   14
     C                     PARM           PJNM  140
      *
     C           K#05      KLIST
     C                     KFLD           K#SHN1
     C                     KFLD           K#SHN2
     C                     KFLD           K#SHN3
      *
     C                     MOVELPSHIN     K#SHIN
     C                     MOVE *BLANK    PJOK
     C                     MOVE *BLANK    PJNM
      *
     C                     ENDSR
