     H            Y.
     F** UEXR04 ********************************************
     F*  EXSUB - GET PRE FROM PART                         *
     F*  J. WATANABE  2018.03.01                           *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR04'
     F*                    PARM           $SHN   12
     F*                    PARM           $NOBN   20
     F*                    PARM           $NONY   40
     F*                    PARM           $QTY    80
     F*                    PARM           $RTN    1
     F*  IN  $SHPDT  8 0 SHP DATE
     F*      $NOBN   2 0 BIN#
     F*      $NONY   4 0 DELIVERY CODE
     F*  OUT $QTY    8 0 TOTAL QTY
     F*      $RTN    1 A RETURN CODE (BKLANK=NO ERR, *=ERROR
     F******************************************************
     FAH#TL19 IF  E           K        DISK
     FALDPL30 IF  E           K        DISK
     FADAPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAAIPL11 IF  E           K        DISK
      *--------------------------------------------------------
     E                    DT         24  1
     E                    BI         24  2 0
     E                    OBM        15  4               DEPT
     E                    OKB        15  3               MACHINE
     E                    OTK        15  6               LOCATION
     E                    OKO        15  3               PROCESS
      *
     I              '0123456789'          C         NUM
     I              '0123456789'          C         WKCKSU
      *
     I            DS
     I                                        1  24 DT
     I                                       01  01 CDDT08
     I                                       02  02 CDDT09
     I                                       03  03 CDDT10
     I                                       04  04 CDDT11
     I                                       05  05 CDDT12
     I                                       06  06 CDDT13
     I                                       07  07 CDDT14
     I                                       08  08 CDDT15
     I                                       09  09 CDDT16
     I                                       10  10 CDDT17
     I                                       11  11 CDDT18
     I                                       12  12 CDDT19
     I                                       13  13 CDDT20
     I                                       14  14 CDDT21
     I                                       15  15 CDDT22
     I                                       16  16 CDDT23
     I                                       17  17 CDDT24
     I                                       18  18 CDDT01
     I                                       19  19 CDDT02
     I                                       20  20 CDDT03
     I                                       21  21 CDDT04
     I                                       22  22 CDDT05
     I                                       23  23 CDDT06
     I                                       24  24 CDDT07
      *
     I            DS
     I                                        1  480BI
     I                                       01  020CDBI08
     I                                       03  040CDBI09
     I                                       05  060CDBI10
     I                                       07  080CDBI11
     I                                       09  100CDBI12
     I                                       11  120CDBI13
     I                                       13  140CDBI14
     I                                       15  160CDBI15
     I                                       17  180CDBI16
     I                                       19  200CDBI17
     I                                       21  220CDBI18
     I                                       23  240CDBI19
     I                                       25  260CDBI20
     I                                       27  280CDBI21
     I                                       29  300CDBI22
     I                                       31  320CDBI23
     I                                       33  340CDBI24
     I                                       35  360CDBI01
     I                                       37  380CDBI02
     I                                       39  400CDBI03
     I                                       41  420CDBI04
     I                                       43  440CDBI05
     I                                       45  460CDBI06
     I                                       47  480CDBI07
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1   80K1HZ
     I                                        1   40K1YY
     I                                        5   60K1MM
     I                                        7   80K1DD
      *
     I            DS
     I                                        1   80F8KA
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
      *
     I            DS
     I                                        1  100WWCM
     I                                        1   80WWCMHZ
     I                                        9  100WWCMBB
      *
     I            DS
     I                                        1  100CFHT
     I                                        1   80CFHTHZ
     I                                        9  100CFHTBB
      *
     I            DS
     I                                        1   80WW10DY
     I                                        1   40WW10YY
     I                                        5   60WW10MM
     I                                        7   80WW10DD
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1   80A2SY
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      *
     I            DS
     I                                        1   6 A2KTR
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
      *
     I            DS
     I                                        1   6 A2STR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I            DS
     I                                        1   80BANODT
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
      *
     I            DS
     I                                        1   80EKNODT
     I                                        1   40EKNOYY
     I                                        5   60EKNOMM
     I                                        7   80EKNODD
      *
     I            DS
     I                                        1   80A3SYDT
     I                                        1   40A3SYYY
     I                                        5   60A3SYMM
     I                                        7   80A3SYDD
      *
     I            DS
     I                                        1   80ADKODT
     I                                        1   40ADKOYY
     I                                        5   60ADKOMM
     I                                        7   80ADKODD
      *
     I            DS
     I                                        1   6 K@BANA
     I                                        1   1 K@BAN1
     I                                        2   3 K@BAN2
     I                                        4   5 K@BAN3
     I                                        6   6 K@BAN4
      *
     I            DS
     I                                        1   6 K#BANA
     I                                        1   1 K#BAN1
     I                                        2   3 K#BAN2
     I                                        4   5 K#BAN3
     I                                        6   6 K#BAN4
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      *
     C                     EXSR #INIT
      *
     C           KEYCF1    SETLLAH#TL191
     C           KEYCF2    READEAH#TL191                 21
     C           *IN21     DOWEQ'0'
     C           CFSKJY    IFEQ 'D'
     C           CFSKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #SB410
     C                     ENDIF
     C           KEYCF2    READEAH#TL191                 21
     C                     ENDDO
      *
     C                     MOVELMINO      P@MINO
     C                     MOVELMINASI    P@MINA
     C                     MOVELPRE       P@PRE
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------*
      * ALDRS1                                           *
      *--------------------------------------------------*
     C           #SB410    BEGSR
      *
     C                     MOVE CFCHYU    PHCHYU
     C                     MOVE CFZENO    PHZENO
     C                     MOVE CFTHNO    PHTHNO
     C                     MOVE CFHTHZ    PHHTHZ
     C                     CALL 'ALDRS1'
     C                     PARM           PHCHYU  1
     C                     PARM           PHZENO  4
     C                     PARM           PHTHNO  3
     C                     PARM           PHHTHZ  8
     C                     PARM           PHMAIS  4
     C                     MOVE PHMAIS    @@MAIS  40
     C           @@MAIS    IFLT CFMAIS
     C                     EXSR #SB411
     C                     ENDIF
      *
     C           ESB410    ENDSR
      *--------------------------------------------------*
      * LOAD,UNLOAD                                      *
      *--------------------------------------------------*
     C           #SB411    BEGSR
      *
     C                     Z-ADD0         P@PKHZ
     C                     MOVEL*BLANK    W1PDAY  1
     C                     EXSR ##PIC
      *
     C                     Z-ADD0         P@WIHZ
     C                     MOVEL*BLANK    W1WDAY  1        PROCESS DATE
     C                     EXSR ##WIN
     C           W1WDAY    IFEQ *BLANK
     C                     EXSR ##WIN2
     C                     ENDIF
     C                     SETOF                     79
     C           'SB '     LOKUPOKO                      79
     C           W1WDAY    IFEQ *BLANK
     C           *IN79     IFEQ '1'
     C                     EXSR ##WIN3
     C                     ENDIF
     C                     ENDIF
      * SCALE DATE/TIME
     C                     Z-ADD0         P@KEHZ
     C                     MOVEL*BLANK    W1KDAY  1        SCALE DATE
     C                     EXSR ##KEI
     C           W1KDAY    IFEQ *BLANK
     C                     EXSR ##KEI2
     C                     ENDIF
      * PURCHASE DATE/TIME
     C                     MOVEL*BLANK    P@OTHZ
     C                     MOVEL*BLANK    W1ODAY  1        SCALE DATE
     C                     EXSR ##OUTS
      *
     C                     SELEC
     C           W1WDAY    WHEQ *BLANK
     C           W1KDAY    ANDEQ*BLANK
     C           W1PDAY    ANDEQ*BLANK
     C           W1ODAY    ANDEQ*BLANK
     C           CFHT      IFLE WWCM
     C                     ADD  CFMAIS    MINO
     C                     ENDIF
     C           W1WDAY    WHEQ '1'
     C           W1KDAY    OREQ '1'
     C           W1PDAY    OREQ '1'
     C           W1ODAY    OREQ '1'
     C                     EXSR #SB420
     C                     EXSR #SB421
     C           CFMAIS    SUB  XFMAIS    WFMAIS
     C                     SUB  SAITE     WFMAIS
     C           W1WDAY    IFEQ '1'
     C           W1KDAY    OREQ '1'
     C           W1ODAY    OREQ '1'
     C                     ADD  WFMAIS    MINASI
     C                     ENDIF
     C           W1WDAY    IFEQ *BLANK
     C           W1KDAY    ANDEQ*BLANK
     C           W1ODAY    ANDEQ*BLANK
     C           W1PDAY    ANDEQ'1'
     C                     ADD  WFMAIS    PRE
     C                     ENDIF
     C                     ENDSL
      *
     C           ESB411    ENDSR
      *--------------------------------------------------*
      * MINASI                                           *
      *--------------------------------------------------*
     CSR         #SB420    BEGSR
      *
     C                     Z-ADD0         WFMAIS  30
     C                     Z-ADD0         XFMAIS  30
     C                     Z-ADD0         SAITE   30
     C           K#L30     KLIST
     C                     KFLD           CFZENO
     C                     KFLD           CFTHNO
     C           K#L30     SETLLALDPL301
     C           K#L30     READEALDPL301                 16
     C           *IN16     DOWEQ'0'
     C           A3SYDT    IFGE CFHTHZ
     C                     Z-ADD*ZERO     I       30
      *
     C           WKCKSU    CHECKA3PAGE                   25
     C           *IN25     IFEQ '1'
     C                     MOVEL'01'      A3PAGE
     C                     ENDIF
      *
     C                     MOVE A3PAGE    I
     C           I         IFLE CFMAIS
     C                     ADD  1         XFMAIS
     C                     ENDIF
     C                     ENDIF
     C           K#L30     READEALDPL301                 16
     C                     ENDDO
      *
      *
     CSR         ESB420    ENDSR
      *--------------------------------------------------*
      * MINASI                                           *
      *--------------------------------------------------*
     CSR         #SB421    BEGSR
      *
     C           K#AD01    KLIST
     C                     KFLD           K@KSKB  1
     C                     KFLD           CFZENO
     C                     KFLD           CFTHNO
     C                     MOVEL'A'       K@KSKB
     C           K#AD01    SETLLADAPL01
     C           K#AD01    READEADAPL01                  91
     C           *IN91     DOWEQ'0'
     C           ADDTKB    IFEQ 'S'
     C           NUM       CHECKADPGNO                   90
     C           *IN90     IFEQ '0'
     C                     MOVELADPGNO    W@A2@2  20
     C           W@A2@2    IFLE CFMAIS
     C           CFHTHZ    ANDLTADKODT
     C                     ADD  1         SAITE
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C           K#AD01    READEADAPL01                  91
     C                     ENDDO
      *
     CSR         ESB421    ENDSR
      *===============================================================
      *         PICUP DATE/TIME
      *===============================================================
     CSR         ##PIC     BEGSR
      *
     C                     CALL 'ALCRS1'
     C                     PARM           CFCHYU  1
     C                     PARM CFZENO    CFZENO  4
     C                     PARM CFTHNO    CFTHNO  3
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@PKHZ  80       WORK ADMITTABLE DATE
     C                     PARM           P@PKTM  60       WORK ADMITTABLE TIME
      *
     C           P@PKHZ    IFNE 0
     C                     MOVEL'1'       W1PDAY
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      *         PROCESS DATE/TIME 1
      *===============================================================
     CSR         ##WIN     BEGSR
     C                     CALL 'AJSR1Z'
     C                     PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
      *                               GET ------
     C                     PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C                     PARM           P@WITM  60       WORK ADMITTABLE TIME
      *
     C           P@WIHZ    IFNE 0
     C                     MOVEL'1'       W1WDAY
     C                     ENDIF
      *
     CSR                   ENDSR
      *===============================================================
      *       PROCESS DATE/TIME 2
      *===============================================================
     CSR         ##WIN2    BEGSR
     C                     CALL 'AJSR2Z'
     C                     PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C                     PARM           P@WITM  60       WORK ADMITTABLE TIME
      *
     C           P@WIHZ    IFNE 0
     C                     MOVEL'1'       W1WDAY
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      *        PROCESS DATE/TIME 3
      *===============================================================
     CSR         ##WIN3    BEGSR
     C                     CALL 'ALMR0Z'
     C                     PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C                     PARM           P@WITM  60       WORK ADMITTABLE TIME
      *
     C           P@WIHZ    IFNE 0
     C                     MOVEL'1'       W1WDAY
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      *      SCALES DATE/TIME 1
      *===============================================================
     CSR         ##KEI     BEGSR
     C                     CALL 'AJHR2Z'
     C                     PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@KEHZ  80       WEIGHING DATE
     C                     PARM           P@KETM  60       WEIGHING TIME
      *
     C           P@KEHZ    IFNE 0
     C                     MOVEL'1'       W1KDAY
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      *        SCALES DATE/TIME 2
      *===============================================================
     CSR         ##KEI2    BEGSR
     C                     CALL 'AJHR2W'
     C                     PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@KEHZ  80       WEIGHING DATE
     C                     PARM           P@KETM  60       WEIGHING TIME
      *
     C           P@KEHZ    IFNE 0
     C                     MOVEL'1'       W1KDAY
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      *         PURCHASE DATE/TIME
      *===============================================================
     C           ##OUTS    BEGSR
      *
     C                     CALL 'AFARS1'
     C                     PARM           CFCHYU  1
     C                     PARM CFZENO    CFZENO  4
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@OTHZ  8
     C                     PARM           P@PNHZ  8
     C                     PARM           P@RCHZ  8
     C                     PARM           P@OMAI  4
      *
     C                     MOVE P@OTHZ    W@OTHZ  80
     C           W@OTHZ    IFNE 0
     C                     MOVEL'1'       W1ODAY
     C                     ENDIF
     C*
     C                     ENDSR
      *=============================================================
      *                    INITIAL PROCESS
      *=============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P@BHB1  5
     C                     PARM           P@BHB2  5
     C                     PARM           P@BHB3  2
     C                     PARM           P@MINO 11
     C                     PARM           P@MINA 11
     C                     PARM           P@PRE  11
      *
     C                     MOVE *ALL'0'   P@MINO
     C                     MOVE *ALL'0'   P@MINA
     C                     MOVE *ALL'0'   P@PRE
      *
     C                     Z-ADD0         MINO   110
     C                     Z-ADD0         MINASI 110
     C                     Z-ADD0         PRE    110
      *
     C           KEYCF1    KLIST
     C                     KFLD           P@BHB1
     C                     KFLD           P@BHB2
     C                     KFLD           P@BHB3
     C                     KFLD           WW10YY
     C                     KFLD           WW10MM
     C                     KFLD           WW10DD
      *
     C           KEYCF2    KLIST
     C                     KFLD           P@BHB1
     C                     KFLD           P@BHB2
     C                     KFLD           P@BHB3
      *
     C                     Z-ADD0         WWTOHZ  80
     C                     Z-ADD0         WWZNHZ  80
     C                     Z-ADD0         WWYOHZ  80
     C                     Z-ADD0         WWCIBI  20
     C                     READ AAIPL111                 20
     C           *IN20     IFEQ '0'
     C                     Z-ADDCDTOHZ    WWTOHZ
     C                     Z-ADDCDZNHZ    WWZNHZ
     C                     Z-ADDCDYOHZ    WWYOHZ
     C                     Z-ADDCDCIBI    WWCIBI
     C                     ENDIF
      * 10DAYS
     C           KEYF8     KLIST
     C                     KFLD           K1YY    40
     C                     KFLD           K1MM    20
     C                     KFLD           K1DD    20
     C                     Z-ADDWWTOHZ    K1HZ
     C                     Z-ADD0         WW10DY  80
     C                     Z-ADD1         X       20
     C           KEYF8     SETGTAGDPL121
     C                     READPAGDPL121                 20
     C           *IN20     DOWEQ'0'
     C           X         ANDLE10
     C           F8HIRU    IFEQ *BLANK
     C                     Z-ADDF8KA      WW10DY
     C                     ADD  1         X
     C                     ENDIF
     C                     READPAGDPL121                 20
     C                     ENDDO
      * PICK UP COMPLETE
     C                     Z-ADD1         X
     C                     Z-ADD0         WWBIN   20
     C           X         DOWLE24
     C           DT,X      IFNE *BLANK
     C                     Z-ADDBI,X      WWBIN
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
     C                     Z-ADDWWTOHZ    WWCMHZ
     C           WWBIN     SUB  3         WWCMBB
     C           WWCMBB    IFLE 0
     C                     Z-ADDWWZNHZ    WWCMHZ
     C                     ADD  WWCIBI    WWCMBB
     C                     ENDIF
      *
     C                     ENDSR
