     H            Y.
     F** UEXR41H ******************************************************
     F*  EXSUB- GET IAF SHIPPED QTY BY PART AND YEAR (YTD) BY PP10    *
     F*  UPDATED: JW (SRA) 2022.08.04                                 *
     F*---------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR41H'
     F*                    PARM           $YEAR   4
     F*                    PARM           $NONY   4
     F*                    PARM           $MHIN  20
     F*                    PARM           $YTDQ   9
     F*  IN: $YEAR   4A  START YEAR
     F*      $NONY   4A  DELIVERY CODE
     F*      $MHIN  20A  USER PART
     F*  OUT:$YTDQ   9A  Y-T-D QTY
     F******************************************************
     FAB#PL10GIF  E           K        DISK
      *
     I            DS
     I                                        1  20 WAMHIN
     I                                        1   5 KAMHN1
     I                                        6  10 KAMHN2
     I                                       11  15 KAMHN3
     I                                       16  20 KAMHN4
      *
     I            DS
     I                                        1  20 BAMHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
      *
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
      *=====================================================
      * INITIAL SETTING
      *=====================================================
     C           *ENTRY    PLIST
     C                     PARM           $YEAR   4
     C                     PARM           $NONY   4
     C                     PARM           $MHIN  20
     C                     PARM           $YTDQ   9
      *
     C                     MOVE *ALL'0'   $YTDQ
     C                     Z-ADD0         @YTDQ   90
     C                     MOVEL$NONY     @NONY   40
      *
     C           K#01      KLIST
     C                     KFLD           KANONY  40
     C                     KFLD           KAMHN1  5
     C                     KFLD           KAMHN2  5
     C                     KFLD           KAMHN3  5
     C                     KFLD           KAMHN4  5
     C                     KFLD           KANOYY  40
     C                     KFLD           KANOMM  20
     C                     KFLD           KANODD  20
      *
     C           K#01B     KLIST
     C                     KFLD           KANONY  40
     C                     KFLD           KAMHN1  5
     C                     KFLD           KAMHN2  5
     C                     KFLD           KAMHN3  5
     C                     KFLD           KAMHN4  5
      *
     C                     MOVEL$NONY     KANONY
     C                     MOVEL$MHIN     WAMHIN
     C                     MOVEL$YEAR     KANOYY
     C                     Z-ADD0         KANOMM
     C                     Z-ADD0         KANODD
      *===================================================
      *           MAIN ROUTINE
      *===================================================
      *
     C           K#01      SETLLAB#PL10G
     C                     DO   *HIVAL
     C           K#01B     READEAB#PL10G                 98
     C   98                LEAVE
      * IGNORE
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  BASRYO    @YTDQ
     C                     ENDDO
      *
     C                     MOVEL@YTDQ     $YTDQ
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
