     H            Y.
     F** UEXR20B ********************************************
     F*  PROGRAM: EXSUB -  GET AWNC RAN# FROM AB#EP40S      *
     F*  WRITTEN: JW (SRA) 2020.06.02                       *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR20B'
     F*                    PARM           $NONY   4
     F*                    PARM           $NOHZ   8
     F*                    PARM           $MHIN  20
     F*                    PARM           $RAN#  12
     F*                    PARM           $ODRN  10
     F*                    PARM           $RTN    1
     F*  IN  $NONY   4A  DELIVERY#
     F*      $NOHZ   8A  SHIP DATE
     F*      $MHIN  20A  USER PART
     F*  OUT $RAN#  12A  DOCK CODE
     F*      $ODRN  10A  PO#
     F*      $RTN    1A  RETURN CODE (OK:BLANK, *:ERROR)
     F******************************************************
     FAB#EL4S2IF  E           K        DISK
      *===================================================
      * SYSTEM DATE
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      * KEY FIELDS
     I            DS
     I                                        1   80K#NOHZ
     I                                        1   40K#NOYY
     I                                        5   60K#NOMM
     I                                        7   80K#NODD
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      * GET IAF PART
     C           KEY1      SETLLAB#EL4S2
      *
     C                     DO   *HIVAL
     C           KEY1      READEAB#EL4S2                 98
     C   98                LEAVE
      *
     C                     MOVELEMANI     $RAN#     P
     C                     MOVELEODRN     $ODRN     P
     C**                   LEAVE
     C                     ENDDO
      *
     C           $RAN#     IFEQ *BLANK
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $NOHZ   8
     C                     PARM           $MHIN  20
     C                     PARM           $RAN#  12
     C                     PARM           $ODRN  10
     C                     PARM           $RTN    1
      *
     C           KEY1      KLIST
     C                     KFLD           K#NONY  4
     C                     KFLD           K#NOHZ  80
     C                     KFLD           K#MHIN 30
      *
     C                     MOVEL$NONY     K#NONY
     C                     MOVEL$NOHZ     K#NOHZ
     C                     MOVEL$MHIN     K#MHIN
     C                     MOVE *BLANK    $RTN
     C                     MOVE *BLANK    $RAN#
     C                     MOVE *BLANK    $ODRN
      *
     C                     ENDSR
