     H            Y.
     F** UEXR33 *********************************************
     F*  PROGRAM: GET COMPONENT PART INFO                   *
     F*           (WASHER)                                  *
     F*  WRITTEN: T.SAKAKI      2020.09.09                  *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR33'
     F*                    PARM           $KHN1   5
     F*                    PARM           $KHN2   5
     F*                    PARM           $KHN3   2
     F*                    PARM           $DATE   80
     F*                    PARM           $MKTE   3
     F*                    PARM           $MBMN   40
     F*                    PARM           $MBAN   6
     F*                    PARM           $RTN    1
     F*  IN  $KHN1 :  5A IAF PART1
     F*      $KHN2 :  5A IAF PART2
     F*      $KHN3 :  2A IAF PART3
     F*      $DATE :  8S STANDARD DATE
     F*  OUT $MKTE :  3A PROCESS
     F*      $MBMN :  4S DEPARTMENT
     F*      $MBAN :  6A LOCATION
     F*      $RTN  :  1A RETURN CODE (Y:OK , N:NG)
     F******************************************************
     FAKDPL01 IF  E           K        DISK
     FADHTL06 IF  E           K        DISK
      *
     I            DS
     I                                        1   6 W@LOCA
     I                                        1   1 W@LOC1
     I                                        2   3 W@LOC2
     I                                        4   5 W@LOC3
     I                                        6   6 W@LOC4
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C                     MOVEL*BLANK    W@LOCA
     C                     MOVEL*BLANK    $MKTE
     C                     Z-ADD0         $MBMN
     C                     MOVEL*BLANK    $MBAN
     C                     MOVEL'N'       $RTN
      *
     C           K#KEY     SETGTAKDPL011
     C           K#KEY     REDPEAKDPL011                 92
     C           *IN92     IFEQ '0'                        ~¬IF_02
     C                     MOVELM2MBN1    W@LOC1
     C                     MOVELM2MBN2    W@LOC2
     C                     MOVELM2MBN3    W@LOC3
     C                     MOVELM2MBN4    W@LOC4
     C                     MOVELW@LOCA    $MBAN
     C                     MOVELM2MKTE    $MKTE
     C                     Z-ADDM2MBMN    $MBMN
     C                     MOVEL'Y'       $RTN
     C                     ELSE
     C           K#KEY     SETGTADHTL011
     C           K#KEY     REDPEADHTL011                 92
     C           *IN92     IFEQ '0'                        ~~¬IF_03
     C           J6SKJY    ANDEQ*BLANK                     ~~¬IF_03
     C           J6STHZ    ANDEQ99999999                   ~~¬IF_03
     C                     MOVELJ6ATK1    W@LOC1
     C                     MOVELJ6ATK2    W@LOC2
     C                     MOVELJ6ATK3    W@LOC3
     C                     MOVELJ6ATK4    W@LOC4
     C                     MOVELW@LOCA    $MBAN
     C                     MOVEL'OQ'      $MKTE
     C                     Z-ADD0111      $MBMN
     C                     MOVEL'Y'       $RTN
     C                     END                             __｢IF_03
     C                     END                             _｢IF_02
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $KHN1   5
     C                     PARM           $KHN2   5
     C                     PARM           $KHN3   2
     C                     PARM           $DATE   80
     C                     PARM           $MKTE   3
     C                     PARM           $MBMN   40
     C                     PARM           $MBAN   6
     C                     PARM           $RTN    1
      *
     C           K#KEY     KLIST
     C                     KFLD           $KHN1   5
     C                     KFLD           $KHN2   5
     C                     KFLD           $KHN3   2
      *
     C                     ENDSR
