     H            Y.
     F** UEXR29D ********************************************
     F*  PROGRAM: CHECK ORDER PACKING LIST STATUS           *
     F*                                                     *
     F*  WRITTEN: JW (SRA) 2024.02.28                       *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR29D'
     F*                    PARM           $NONY   4
     F*                    PARM           $NKOJ   1
     F*                    PARM           $NUKE   4
     F*                    PARM           $NOHZ   8
     F*                    PARM           $NOBN   2
     F*                    PARM           $STS    1
     F*  IN  $NONY :  4A DELIVERY#
     F*      $NKOJ :  1A FACTORY
     F*      $NUKE :  4A DOCK
     F*      $NOHZ :  8A SHIP DATE
     F*      $NOBN :  2A BIN#
     F*  OUT $STS  :  1A STATUS CODE (Y=YES, N=NO)
     F******************************************************
     FAB#PL1Q IF  E           K        DISK
      *-----------------------------------------------------
     I            DS
     I                                        1   80KNOHZ
     I                                        1   40KNOYY
     I                                        5   60KNOMM
     I                                        7   80KNODD
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      * CHECK PP10
     C           K#PP10    SETLLAB#PL1Q
     C                     DO   *HIVAL
     C           K#PP10    READEAB#PL1Q                  98
     C   98                LEAVE
      *
     C           BASERL    IFNE *BLANK
     C                     MOVE 'Y'       $STS
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $NOHZ   8
     C                     PARM           $NOBN   2
     C                     PARM           $STS    1
      *
     C           K#PP10    KLIST
     C                     KFLD           KNONY   40
     C                     KFLD           KNKOJ   1
     C                     KFLD           KNUKE   4
     C                     KFLD           KNOHZ   80
     C                     KFLD           KNOBN   20
      * SET KEYS
     C                     MOVEL$NONY     KNONY
     C                     MOVEL$NKOJ     KNKOJ
     C                     MOVEL$NUKE     KNUKE
     C                     MOVEL$NOHZ     KNOHZ
     C                     MOVEL$NOBN     KNOBN
     C                     MOVE 'N'       $STS
      *
     C                     ENDSR
