     H            Y.
     F** UEXR30 *********************************************
     F*  PROGRAM: EXSUB - GET # OF ORDERS                   *
     F*  WRITTEN: JW (SRA) 2020.04.28                       *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR30'
     F*                    PARM           $NONY   4 0
     F*                    PARM           $NKOJ   1
     F*                    PARM           $NUKE   4
     F*                    PARM           $SHFM   8 0
     F*                    PARM           $SHTO   8 0
     F*                    PARM           $NOBN   2
     F*                    PARM           $ODRN  10
     F*                    PARM           $INVN  16
     F*                    PARM           $QTY    5 0
     F*  IN  $NONY   4 0  DELIVERY#  (0 OK)
     F*      $NKOJ   1    FACTORY    (* OK)
     F*      $NUKE   4    DOCK       (* OK)
     F*      $SHFM   8 0  SHIP FROM
     F*      $SHTO   8 0  SHIP TO
     F*      $NOBN   2    BIN#       (* OK)
     F*      $ODRN  10    ORDER#     (* OK)
     F*      $INVN  16    INVOICE#   (* OK)
     F*  OUT $QTY    5 0  # OF ORDER
     F*******************************************************
     FAB#PL19EIF  E           K        DISK
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C                     Z-ADD0         $QTY
      *
     C           K#19E     SETLLAB#PL19E
      *
     C                     DO   *HIVAL
     C           K#NONY    READEAB#PL19E                 98
     C   98                LEAVE
      * END ?
     C           BANOHZ    IFGT $SHTO
     C                     LEAVE
     C                     ENDIF
      * IGNORE
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      * DELIVERY#
     C           $NONY     IFNE 0
     C           $NONY     ANDNEBANONY
     C                     ITER
     C                     ENDIF
      * FACTORY
     C           $NKOJ     IFNE '*'
     C           $NKOJ     ANDNEBANKOJ
     C                     ITER
     C                     ENDIF
      * DOCK
     C           $NUKE     IFNE '*'
     C           $NUKE     ANDNEBANUKE
     C                     ITER
     C                     ENDIF
      * BIN#
     C           $NOBN     IFNE '*'
     C           @NOBN     ANDNEBANOBN
     C                     ITER
     C                     ENDIF
      * ODER#
     C           $ODRN     IFNE '*'
     C           $ODRN     ANDNEBAODRN
     C                     ITER
     C                     ENDIF
      * INVOICE#
     C           $INVN     IFNE '*'
     C           $INVN     ANDNEBAINVN
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         $QTY
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *===================================================
      * INITIAL SETTING
      *===================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NONY   40
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $SHFM   80
     C                     PARM           $SHTO   80
     C                     PARM           $NOBN   2
     C                     PARM           $ODRN  10
     C                     PARM           $INVN  16
     C                     PARM           $QTY    50
      *
     C           K#19E     KLIST
     C                     KFLD           K#NONY  40
     C                     KFLD           K#NOHZ  80
      *
     C                     Z-ADD$NONY     K#NONY
     C                     Z-ADD$SHFM     K#NOHZ
      *
     C           $NOBN     IFGE '00'
     C           $NOBN     ANDLE'99'
     C                     MOVEL$NOBN     @NOBN   20
     C                     ELSE
     C           $NOBN     IFNE '* '
     C                     Z-ADD01        @NOBN
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
