     H            Y.
     F** UEXR20 *********************************************
     F*  PROGRAM: EXSUB -  GET AWNC RAN#                    *
     F*  WRITTEN: JW (SRA) 2020.02.26                       *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR20'
     F*                    PARM           $NONY   4
     F*                    PARM           $NUKE   4
     F*                    PARM           $NOHZ   8
     F*                    PARM           $BIN    2
     F*                    PARM           $MHIN  20
     F*                    PARM           $INVN  16
     F*                    PARM           $RAN#  12
     F*                    PARM           $ODRN  10
     F*                    PARM           $RTN    1
     F*  IN  $NONY   4A  DELIVERY#
     F*      $NUKE   4A  DOCK CODE
     F*      $NOHZ   8A  SHIP DATE
     F*      $BIN    2A  BIN#
     F*      $MHIN  20A  USER PART
     F*      $INVN  16A  INVOICE#
     F*  OUT $RAN#  12A  DOCK CODE
     F*      $ODRN  10A  PO#
     F*      $RTN    1A  RETURN CODE (OK:BLANK, *:ERROR)
     F******************************************************
     FAB#PP40 IF  E           K        DISK
      *===================================================
      * SYSTEM DATE
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      * KEY FIELDS
     I            DS
     I                                        1   80K#NOHZ
     I                                        1   40K#NOYY
     I                                        5   60K#NOMM
     I                                        7   80K#NODD
     I            DS
     I                                        1  20 K#MHIN
     I                                        1   5 K#MHN1
     I                                        6  10 K#MHN2
     I                                       11  15 K#HHN3
     I                                       16  20 K#HHN4
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      * GET IAF PART
     C           KEY1      SETLLAB#PP40
     C           *IN94     DOUEQ*ON
     C           KEY1      READEAB#PP40                  94
      *
     C           *IN94     IFEQ *OFF
     C           DADEL#    ANDEQ$INVN
     C           DANOBN    ANDEQ#BIN
     C                     MOVELDAMANI    $RAN#
     C                     MOVELDASTAD    $ODRN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           $RAN#     IFEQ *BLANK
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $NUKE   4
     C                     PARM           $NOHZ   8
     C                     PARM           $BIN    2
     C                     PARM           $MHIN  20
     C                     PARM           $INVN  16
     C                     PARM           $RAN#  12
     C                     PARM           $ODRN  10
     C                     PARM           $RTN    1
      *
     C           KEY1      KLIST
     C                     KFLD           K#NONY  40
     C                     KFLD           K#NOYY  40
     C                     KFLD           K#NOMM  20
     C                     KFLD           K#NODD  20
     C                     KFLD           K#NUKE  4
     C                     KFLD           K#MHN1  5
     C                     KFLD           K#MHN2  5
     C                     KFLD           K#HHN3  5
     C                     KFLD           K#HHN4  5
      *
     C                     MOVEL$NONY     K#NONY
     C                     MOVEL$NOHZ     K#NOHZ
     C                     MOVEL$NUKE     K#NUKE
     C                     MOVEL$MHIN     K#MHIN
     C                     MOVEL$BIN      #BIN    20
     C                     MOVE *BLANK    $RTN
     C                     MOVE *BLANK    $RAN#
     C                     MOVE *BLANK    $ODRN
      *
     C                     ENDSR
