     H            Y.
     F** UEXR49   **************************************************************
     F*  PROGRAM    : (FORD) CHECK ASN STATUS BY PACKING LIST#                 *
     F*  WRITTEN    : 2022.08.22                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F*--------------------------------------------------------                *
     F*  JW1          2025.04.21 STOP CHECKING WEIGHT                          *
      **************************************************************************
      *  CALLING SEQ.
      *                    CALL 'UEXR49 '
      *                    PARM           $PL#    9
      *                    PARM           $STT    1
      *   IN  $PL#    9A  PACKING LIST#
      *   OUT $STT    1A  STATUS
      *                   ' ' GOOD
      *                   '1' ERROR BY AB#PP75
      *                   '2' ERROR BY AB#PP10
      *                   '3' ERROR BY AB#PP70
      *                   '4' ERROR BY ABF4P01
      *                   '5' ERROR BY ABF6P01
      *                   '*' ERROR BY OTHER
     F**************************************************************************
     FAB#PL76 IF  E           K        DISK
     FAB#PL1A IF  E           K        DISK
     FAB#PL7B IF  E           K        DISK
     FABF4P01 IF  E           K        DISK
     FABF6L02 IF  E           K        DISK
      *
     I            DS
     I                                        1   80PUNOHZ
     I                                        1   40PUNOYY
     I                                        5   60PUNOMM
     I                                        7   80PUNODD
     I            DS
     I                                        1   80PURLHZ
     I                                        1   40PURLYY
     I                                        5   60PURLMM
     I                                        7   80PURLDD
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      * CHECK PP75 --> 1
     C           $PL#      CHAINAB#PL76              99
     C           *IN99     IFEQ *ON
     C           *IN99     OREQ *OFF
     C           PUSKJY    ANDEQ'D'
     C                     MOVE '1'       $STS
     C                     GOTO PEND
     C                     ENDIF
      * CHECK PP10 --> 2
     C                     Z-ADDPUNOHZ    KANOHZ
     C                     Z-ADDPUBINN    KANOBN
     C                     Z-ADDPUNONY    KANONY
     C                     MOVELPUNKOJ    KANKOJ
     C                     MOVELPUNUKE    KANUKE
     C                     Z-ADD0         P10CNT  30
     C           K#PL1A    SETLLAB#PL1A
     C                     DO   *HIVAL
     C           K#PL1A    READEAB#PL1A                  98
     C   98                LEAVE
      *
     C           PUODRN    IFNE *BLANK
     C           PUODRN    ANDNEBAODRN
     C           BASKJY    OREQ 'D'
     C                     ITER
     C                     ENDIF
     C                     ADD  1         P10CNT
     C                     LEAVE
     C                     ENDDO
     C           P10CNT    IFEQ 0
     C                     MOVE '2'       $STS
     C                     GOTO PEND
     C                     ENDIF
      * CHECK PP70 --> 3
     C                     MOVELPUNONY    KKNONY
     C                     MOVELPUNKOJ    KKNKOJ
     C                     MOVELPUNUKE    KKNUKE
     C                     Z-ADDPUNOYY    KKNOYY
     C                     Z-ADDPUNOMM    KKNOMM
     C                     Z-ADDPUNODD    KKNODD
     C                     MOVELPUBINN    KKNOBN
     C                     Z-ADD0         P70CNT  30
     C           K#PL7B    SETLLAB#PL7B
     C                     DO   *HIVAL
     C           K#PL7B    READEAB#PL7B                  97
     C   97                LEAVE
      *
     C           PUODRN    IFNE *BLANK
     C           PUODRN    ANDNEEKODRN
     C           EKSKJY    OREQ 'D'
     C                     ITER
     C                     ENDIF
     C                     ADD  1         P70CNT
     C                     LEAVE
     C                     ENDDO
     C           P70CNT    IFEQ 0
     C                     MOVE '3'       $STS
     C                     GOTO PEND
     C                     ENDIF
      * CHECK ABF4P01 --> 4
     C                     Z-ADDPUNONY    KBSUPP
     C                     MOVELPUNUKE    KBDOCK
     C                     Z-ADDPUNOHZ    KBSHDT
     C                     Z-ADDPUBINN    KBBIN
     C                     Z-ADDPURLYY    KBREYY
     C                     Z-ADDPURLMM    KBREMM
     C                     Z-ADDPURLDD    KBREDD
     C                     Z-ADD0         P4CNT   30
     C           K#4P01    SETLLABF4P01
     C                     DO   *HIVAL
     C           K#4P01    READEABF4P01                  96
     C   96                LEAVE
      *
     C           YBSKJY    IFEQ 'D'
     C****JW1    YBWEIT    OREQ 0
     C                     ITER
     C                     ENDIF
     C                     ADD  1         P4CNT
     C                     LEAVE
     C                     ENDDO
      *
     C           P4CNT     IFEQ 0
     C                     MOVE '4'       $STS
     C**TEMP               GOTO PEND
     C                     ENDIF
      * CHECK ABF6P01 --> 5
     C                     Z-ADDPUNOHZ    KCSHDT
     C                     Z-ADDPUBINN    KCSHTM
     C                     Z-ADDPURLYY    KCRYYY
     C                     Z-ADDPURLMM    KCRMMM
     C                     Z-ADDPURLDD    KCRDDD
     C                     Z-ADDPUNONY    KCDELY
     C                     MOVELPUNUKE    KCDOCK
     C                     Z-ADD0         P6CNT   30
     C           K#6L02    SETLLABF6L02
     C                     DO   *HIVAL
     C           K#6L02    READEABF6L02                  95
     C   95                LEAVE
      *
     C           FCSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C                     ADD  1         P6CNT
     C                     LEAVE
     C                     ENDDO
     C           P6CNT     IFEQ 0
     C                     MOVE '5'       $STS
     C                     GOTO PEND
     C                     ENDIF
      *
     C           PEND      TAG
     C                     MOVE *ON       *INLR
     C                     RETRN
      ******************
      * INIT
      ******************
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $PL#    9        IN : PACKING#
     C                     PARM           $STS    1        OUT: STATUS
      *
     C           K#PL1A    KLIST
     C                     KFLD           KANOHZ  80
     C                     KFLD           KANOBN  20
     C                     KFLD           KANONY  40
     C                     KFLD           KANKOJ  1
     C                     KFLD           KANUKE  4
      *
     C           K#PL7B    KLIST
     C                     KFLD           KKNONY  4
     C                     KFLD           KKNKOJ  1
     C                     KFLD           KKNUKE  4
     C                     KFLD           KKNOYY  40
     C                     KFLD           KKNOMM  20
     C                     KFLD           KKNODD  20
     C                     KFLD           KKNOBN  2
      *
     C           K#4P01    KLIST
     C                     KFLD           KBSUPP  40
     C                     KFLD           KBDOCK  4
     C                     KFLD           KBSHDT  80
     C                     KFLD           KBBIN   20
     C                     KFLD           KBREYY  40
     C                     KFLD           KBREMM  20
     C                     KFLD           KBREDD  20
      *
     C           K#6L02    KLIST
     C                     KFLD           KCSHDT  80
     C                     KFLD           KCSHTM  20
     C                     KFLD           KCRYYY  40
     C                     KFLD           KCRMMM  20
     C                     KFLD           KCRDDD  20
     C                     KFLD           KCDELY  40
     C                     KFLD           KCDOCK  4
      *
     C                     MOVE ' '       $STS
     C                     TIME           SDATE
      *
     C                     ENDSR
