     H            Y.
     F** UEXR41F ************************************************
     F*  EXSUB- GET FORD ADD-ON ERROR                           *
     F*  WRITTEN: JW (SRA) 2024.11.11                           *
     F*---------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR41F'
     F*                    PARM           $NONY   4
     F*                    PARM           $NUKE   4
     F*                    PARM           $MHIN  20
     F*                    PARM           $STT    1
     F*  IN: $NONY   4A  DELIVERY CODE
     F*      $NUKE   4A  DOCK
     F*      $MHIN  20A  USER PART
     F*  OUT:$STT    1A  ADD-ON (Y: EXISTS, N: NOT EXIST)
     F******************************************************
     FABBPP54 IF  E           K        DISK
      *
      *=====================================================
      * INITIAL SETTING
      *=====================================================
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $NUKE   4
     C                     PARM           $MHIN  20
     C                     PARM           $STT    1
      *
     C                     MOVE 'N'       $STT
     C                     MOVEL$NONY     @NONY   40
      *
     C           K#01      KLIST
     C                     KFLD           K4NONY  40
     C                     KFLD           K4NUKE  4
     C                     KFLD           K4MHIN 20
      *
     C                     MOVEL$NONY     K4NONY
     C                     MOVEL$NUKE     K4NUKE
     C                     MOVEL$MHIN     K4MHIN
      *===================================================
      *           MAIN ROUTINE
      *===================================================
      *
     C           K#01      SETLLABBPP54
     C                     DO   *HIVAL
     C           K#01      READEABBPP54                  98
     C   98                LEAVE
      *
     C                     MOVE 'Y'       $STT
     C                     LEAVE
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
