     H            Y.
      ** UEXR59F ***************************************************
      *  GET EDI824 INFORMATION (FORD)                             *
      *  JW     2025.05.14                                         *
      **************************************************************
      *  CALLING SEQ.
      *                    CALL 'UEXR59F'
      *                    PARM           $SHID  10
      *                    PARM           $STT    3
      *                    PARM           $DATE   8
      *                    PARM           $TIME   6
      *   IN  $SHID  10A  SHID
      *   OUT $STT    3A  YES:ACCEPTED, NO:REJECTED, BLANK:NO ANSWER
      *   "   $DATE   8A  RECEIVE DATE
      *   "   $TIME   6A  RECEIVE TIME
      ***********************************************************
     FJCMPL11EIF  E           K        DISK
      ***********************************************************
     C                     EXSR #INIT
      *
      *
     C           K#SHID    SETLLJCMPL11E
      *
     C                     DO   *HIVAL
     C           K#SHID    READEJCMPL11E            N    51
     C   51                LEAVE
      *
     C                     ADD  1         @CNT
     C                     MOVE J1CRME    @997    1
      *
     C           @997      IFEQ 'A'
     C                     MOVEL'YES'     $STT
     C                     MOVELJ1KOHZ    $DATE
     C                     MOVELJ1KOTM    $TIME
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      ***********************************************************
      * INITIAL SETTINGS
      ***********************************************************
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $SHID  10
     C                     PARM           $STT    3
     C                     PARM           $DATE   8
     C                     PARM           $TIME   6
      *
     C                     MOVEL$SHID     K#SHID 10
     C                     MOVE *BLANK    $STT
     C                     Z-ADD0         @CNT    50
      *
     C                     ENDSR
