     H            Y.
     F** UEXR41J ******************************************************
     F*  EXSUB GET FORD-YTD-RECEIVE QTY BY PPF1                       *
     F*  WRITTEN: JW (SRA) 2022.12.15                                 *
     F*---------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR41J'
     F*                    PARM           $LSHZ   8
     F*                    PARM           $NONY   4
     F*                    PARM           $MHIN  20
     F*                    PARM           $YTDQ   9
     F*  IN: $LDHZ   8A  LAST DATE
     F*      $NONY   4A  DELIVERY CODE
     F*      $MHIN  20A  USER PART
     F*  OUT:$YTDQ   9A  YTD RECEIVED QTY
     F******************************************************
     FAB#PLF1FIF  E           K        DISK
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C           K#LF1     SETLLAB#PLF1F
     C                     DO   *HIVAL
     C                     READ AB#PLF1F                 98
     C   98                LEAVE
      *
     C           F5NONY    IFNE @NONY
     C           F5IPAR    ORNE $MHIN
     C                     LEAVE
     C                     ENDIF
      *
     C           F5LSDT    IFGE @LSHZ
     C                     Z-ADDF5YSQY    @YTDQ
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVEL@YTDQ     $YTDQ
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *=====================================================
      * INITIAL SETTING
      *=====================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $LSHZ   8
     C                     PARM           $NONY   4
     C                     PARM           $MHIN  20
     C                     PARM           $YTDQ   9
      *
     C           K#LF1     KLIST
     C                     KFLD           KANONY  40
     C                     KFLD           KAIPAR 20
     C                     KFLD           KADATE  80
      *
     C                     MOVE *ALL'0'   $YTDQ
     C                     Z-ADD0         @YTDQ   90
     C                     MOVEL$LSHZ     @LSHZ   80
     C                     MOVEL$NONY     @NONY   40
      *SET KEY
     C                     MOVEL$LSHZ     KADATE
     C                     MOVEL$NONY     KANONY
     C                     MOVEL$MHIN     KAIPAR
      *
     C                     ENDSR
