     H            Y.
      ** UEXR57A ***************************************************
      *  GET AUTHORIZATION# FOR SUBARU                             *
      *  JW     2025.03.04                                         *
      **************************************************************
      *  CALLING SEQ.
      *                    CALL 'UEXR57A'
      *                    PARM           $PL#    9
      *                    PARM           $AUTH  20
      *   IN  $PL#    9A  PACKING LIST#
      *   OUT $AUTH  20A  AUTHORIZATION#
      ***********************************************************
     FAB#PP2S IF  E           K        DISK
      ***********************************************************
     C           *ENTRY    PLIST
     C                     PARM           $PL#    9
     C                     PARM           $AUTH  20
      *
     C           $PL#      CHAINAB#PP2S              99
     C           *IN99     IFEQ *OFF
     C                     MOVELS2A#      $AUTH
     C                     ELSE
     C                     MOVE *BLANK    $AUTH
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
