     H            Y.
     F** UEXR34 *********************************************
     F*  PROGRAM: GET WIRE KANBAN INFO                      *
     F*  WRITTEN: T.SAKAKI      2020.09.09                  *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR34'
     F*                    PARM           $ZAIS  15
     F*                    PARM           $ZAIK   52
     F*                    PARM           $KOJE   40
     F*                    PARM           $KAKE   40
     F*                    PARM           $DATE   80
     F*                    PARM           $ZETI   4
     F*                    PARM           $WLOC   6
     F*                    PARM           $RTN    1
     F*  IN  $ZAIS : 15A  MATERIAL NAME
     F*      $ZAIK :  5S2 WIRE DIAMETER
     F*      $KOJE :  4S  PLANT CODE  *IAF
     F*      $KAKE :  4S  SUPPLIER CODE
     F*      $DATE :  8S  STANDARD DATE
     F*  OUT $ZETI :  4A  WIRE ID NUMBER
     F*      $WLOC :  6A  LOCATION
     F*      $RTN  :  1A  RETURN CODE (Y:OK , N:NG)
     F******************************************************
     FIZAPL01 IF  E           K        DISK
      *
     I            DS
     I                                        1   6 W@LOCA
     I                                        1   1 W@LOC1
     I                                        2   3 W@LOC2
     I                                        4   5 W@LOC3
     I                                        6   6 W@LOC4
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
     I            DS
     I                                        1   80ZCUKHZ
     I                                        1   40ZCUKYY
     I                                        5   60ZCUKMM
     I                                        7   80ZCUKDD
     I            DS
     I                                        1   80ZCSTHZ
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C                     MOVEL*BLANK    W@LOCA
     C                     MOVEL*BLANK    $ZETI
     C                     MOVEL*BLANK    $WLOC
     C                     MOVEL'N'       $RTN
      *
     C           K#KEY     SETGTIZAPL011
     C                     DO   *HIVAL
     C           K#KEY     REDPEIZAPL011                 92
     C   92                LEAVE                           ~¬IF_02
      *
     C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE$DATE
     C                     ITER
     C                     ENDIF
      *
     C           $DATE     IFGE ZCUKHZ
     C           $DATE     ANDLEZCSTHZ
     C                     MOVELZCADR1    W@LOC1
     C                     MOVELZCADR2    W@LOC2
     C                     MOVELZCADR3    W@LOC3
     C                     MOVELZCADR4    W@LOC4
     C                     MOVELW@LOCA    $WLOC
     C                     MOVELZCKNO3    $ZETI
     C                     MOVEL'Y'       $RTN
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $ZAIS  15
     C                     PARM           $ZAIK   52
     C                     PARM           $KOJE   40
     C                     PARM           $KAKE   40
     C                     PARM           $DATE   80
     C                     PARM           $ZETI   4
     C                     PARM           $WLOC   6
     C                     PARM           $RTN    1
      *
     C           K#KEY     KLIST
     C                     KFLD           $ZAIS
     C                     KFLD           $ZAIK
     C                     KFLD           $KOJE
     C                     KFLD           $KAKE
      *
     C                     ENDSR
