     H            Y.
     F** UEXR05C *******************************************
     F*  EXSUB - GET LOCATION OF AAMPP11 FROM SHIN/DEPT    *
     F*  J. WATANABE  2023.08.11                           *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR05C'
     F*                    PARM           P@SHN  12
     F*                    PARM           P@DPT   4
     F*                    PARM           P@DAT   8
     F*                    PARM           O@LOC   6
     F*                    PARM           O@TYP   1
     F*  IN  P@SHN  12   IAF PART#
     F*  "   P@DPT   4   DEPT
     F*  "   P@DAT   8   DATE   (BLANK=TODAY)
     F*  OUT O#LOC   6   LOCATION
     F*  "   O#TYP   1   KANBAN TYPE
      ******************************************************
      * MAIN ROUTINE
      ******************************************************
     E                    LC         15  6               LOCATION
      * LOCATION
     I            DS
     I                                        1  90 LC
     I                                        1   6 $L1
     I                                        7  12 $L2
     I                                       13  18 $L3
     I                                       19  24 $L4
     I                                       25  30 $L5
     I                                       31  36 $L6
     I                                       37  42 $L7
     I                                       43  48 $L8
ADD  I                                       49  54 $L9
 .   I                                       55  60 $LA
 .   I                                       61  66 $LB
     I                                       67  72 $LC
     I                                       73  78 $LD
     I                                       79  84 $LE
     I                                       85  90 $LF
      *=====================================================
     C           *ENTRY    PLIST
     C                     PARM           P@SHN  12
     C                     PARM           P@DPT   4
     C                     PARM           P@DAT   8
     C                     PARM           O@LOC   6
     C                     PARM           O@TYP   1
     C                     MOVE *BLANK    O@LOC
     C                     MOVE *BLANK    O@TYP
      *
     C                     CALL 'UEXR05B'
     C                     PARM           P@SHN  12
     C                     PARM           P@DPT   4
     C                     PARM           P@DAT   8
     C                     PARM           O@##    2
     C                     PARM           O@TYP   1
     C                     MOVELO@##      IX      20
      *
     C           IX        IFNE 0
     C                     CALL 'UTLR21K'
     C                     PARM           P@SHN
     C                     PARM           P@DAT
     C                     PARM           $L1
     C                     PARM           $L2
     C                     PARM           $L3
     C                     PARM           $L4
     C                     PARM           $L5
     C                     PARM           $L6
     C                     PARM           $L7
     C                     PARM           $L8
     C                     PARM           $RTN    1
      *
     C           $RTN      IFEQ *BLANK
     C                     MOVELLC,IX     O@LOC
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
