     H            Y.
     F** UEXR31E ********************************************
     F*  PROGRAM: CHECK HONDA ASN# IN AB#PP2F               *
     F*  WRITTEN: JW (SRA) 2024.06.25                       *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR31E'
     F*                    PARM           $TOKU   4
     F*                    PARM           $NONY   4
     F*                    PARM           $NKOJ   1
     F*                    PARM           $NUKE   4
     F*                    PARM           $SHDT   8
     F*                    PARM           $BIN    2
     F*                    PARM           $ODRN  10
     F*                    PARM           $MHIN  20
     F*                    PARM           $ASN    8
     F*                    PARM           $RTN    1
     F*  IN  $TOKU   4A DELIVERY#
     F*      $NONY   4A PO#
     F*      $NKOJ   1A PO#
     F*      $NUKE   4A PO#
     F*      $SHDT   8A PO#
     F*      $BIN    2A PO#
     F*      $ODRN  10A PO#
     F*      $MHIN  20A PO#
     F*      $ASN    8A PO#
     F*  OUT $RTN    1A RETURN CODE (Y:UPDATED SUCCESSFULLY)
     F*                             (N:NO DATA TO UPDATE)
     F******************************************************
     FAB#PL2F7UF  E           K        DISK
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      * SKIP
     C           $TOKU     IFEQ '3411'
     C           $TOKU     OREQ '5149'
     C                     GOTO SKIP1
     C                     ENDIF
      *
     C           K#PL2F    SETLLAB#PL2F7
      * CHECK AB#PL2AC
     C                     DO   *HIVAL
     C           K#PL2F    READEAB#PL2F7                 98
     C   98                LEAVE
      * CHECK MHIN
     C                     MOVELAFMHIN    $FLD1     P
     C                     CALL 'EDTR02C'
     C                     PARM           $FLD1  25
     C                     PARM           $FLD2  25
     C                     MOVEL$FLD2     XMHIN  20
      *
     C           XMHIN     IFNE @MHIN
     C                     ITER
     C                     ENDIF
      *
     C           AFASNO    IFNE $ASN
     C                     MOVEL$ASN      AFASNO
     C                     UPDATAB#PP2F1
     C                     ADD  1         UCNT
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           SKIP1     TAG
      *
     C           UCNT      IFEQ 0
     C                     MOVE 'N'       $RTN
     C                     ELSE
     C                     MOVE 'Y'       $RTN
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $SHDT   8
     C                     PARM           $BIN    2
     C                     PARM           $ODRN  10
     C                     PARM           $MHIN  20
     C                     PARM           $ASN    8
     C                     PARM           $RTN    1
      *
     C           K#PL2F    KLIST
     C                     KFLD           K#TOKU  40
     C                     KFLD           K#NONY  40
     C                     KFLD           K#NKOJ  1
     C                     KFLD           K#NUKE  4
     C                     KFLD           K#SHDT  80
     C                     KFLD           K#BIN   20
     C                     KFLD           K#ODRN 10
     C**                   KFLD           K#MHIN 20
      * SET KEY
     C                     MOVEL$TOKU     K#TOKU
     C                     MOVEL$NONY     K#NONY
     C                     MOVEL$NKOJ     K#NKOJ
     C                     MOVEL$NUKE     K#NUKE
     C                     MOVEL$SHDT     K#SHDT
     C                     MOVEL$BIN      K#BIN
     C                     MOVEL$ODRN     K#ODRN
     C**                   MOVEL$MHIN     K#MHIN
      * REMOVE BLANK
     C                     MOVEL$MHIN     $FLD1     P
     C                     CALL 'EDTR02C'
     C                     PARM           $FLD1  25
     C                     PARM           $FLD2  25
     C                     MOVEL$FLD2     @MHIN  20
      *
     C                     Z-ADD0         UCNT    30
     C                     MOVEL'N'       $RTN
      *
     C                     ENDSR
