     H            Y.
     F** UEXR19 *********************************************
     F*  PROGRAM: EXSUB - GET ADVICS DOCK CODE              *
     F*  WRITTEN: JW (SRA) 2020.02.12                       *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR19'
     F*                    PARM           $NONY   4
     F*                    PARM           $MHIN  20
     F*                    PARM           $NUKE   4
     F*                    PARM           $RTN    1
     F*  IN  $NONY :  4A DELIVERY#
     F*      $MHIN : 20A USER PART
     F*      $NUKE :  4A DOCK CODE
     F*  OUT $RTN  :  1A RETURN CODE (OK:BLANK, *:ERROR)
     F******************************************************
     FAB#PL19 IF  E           K        DISK
     FEDIPL46 IF  E           K        DISK
      *===================================================
      * SYSTEM DATE
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      * KEY FIELDS
     I            DS
     I                                        1   80K#NOHZ
     I                                        1   40K#NOYY
     I                                        5   60K#NOMM
     I                                        7   80K#NODD
     I            DS
     I                                        1  20 K#MHIN
     I                                        1   5 K#MHN1
     I                                        6  10 K#MHN2
     I                                       11  15 K#MHN3
     I                                       16  20 K#MHN4
     I            DS
     I                                        1  20 E5MHIN
     I                                        1   5 E5MHN1
     I                                        6  10 E5MHN2
     I                                       11  15 E5MHN3
     I                                       16  20 E5MHN4
     I            DS
     I                                        1  20 BAMHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      * GET IAF PART
     C                     MOVEL$NONY     K0NONY
     C                     MOVEL$MHIN     K0MHIN
     C           KEY0      CHAINEDIPL46              97
     C           *IN97     IFEQ *ON
     C                     GOTO ENDP
     C                     ENDIF
      * SET KEY
     C                     MOVEL$NONY     @NONY   40
     C                     MOVELE5MHIN    K#MHIN
     C           KEY1      SETLLAB#PL19
      *
     C                     DO   *HIVAL
     C                     READPAB#PL19                  98
     C   98                LEAVE
      *
     C           BAMHIN    IFNE E5MHIN
     C                     LEAVE
     C                     ENDIF
      *
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           BANONY    IFNE @NONY
     C                     ITER
     C                     ENDIF
      *
     C           BANUKE    IFNE '00  '
     C           BANUKE    ANDNE'    '
     C                     MOVELBANUKE    $NUKE
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           ENDP      TAG
     C           $NUKE     IFEQ *BLANK
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $MHIN  20
     C                     PARM           $NUKE   4
     C                     PARM           $RTN    1
      *
     C           KEY0      KLIST
     C                     KFLD           K0NONY  40
     C                     KFLD           K0MHIN 20
      *
     C           KEY1      KLIST
     C                     KFLD           K#MHN1  5
     C                     KFLD           K#MHN2  5
     C                     KFLD           K#MHN3  5
     C                     KFLD           K#MHN4  5
     C                     KFLD           K#NOYY  40
     C                     KFLD           K#NOMM  20
     C                     KFLD           K#NODD  20
      *
     C                     TIME           SDATE
     C                     MOVE *BLANK    $RTN
     C                     MOVE *BLANK    $NUKE
     C                     Z-ADD9999      K#NOYY
     C                     Z-ADD99        K#NOMM
     C                     Z-ADD99        K#NODD
      *
     C                     ENDSR
