     H            Y.
     F** UEXR36E ********************************************
     F*  PROGRAM: EXSUB - GET TTAI LOCATION                 *
     F*  WRITTEN: JW (SRA) 2020.12.11                       *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR36E'
     F*                    PARM           $NONY   4
     F*                    PARM           $MHIN  20
     F*                    PARM           $LOC   10
     F*  IN  $NONY   4A  IAF PART
     F*      $MHIN  20A  USER PART
     F*  OUT $LOC   10A  LOCATION
     F******************************************************
     FEDIPP46 IF  E           K        DISK
      *===================================================
      * SYSTEM DATE
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C           K#PP46    CHAINEDIPP46              98
     C           *IN98     IFEQ *OFF
     C                     MOVELE6LOC     $LOC
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $MHIN  20
     C                     PARM           $LOC   10
      *
     C           K#PP46    KLIST
     C                     KFLD           K#NONY  40
     C                     KFLD           K#MHIN 20
      *
     C                     MOVEL$NONY     K#NONY
     C                     MOVEL$MHIN     K#MHIN
     C                     MOVE *BLANK    $LOC
     C                     TIME           SDATE
      *
     C                     ENDSR
