     H            Y.
      ** UEXR58T ***************************************************
      *  GET GENTRAN INFO FROM REFERENCE# (TOYOTA)                 *
      *  JW     2025.03.25                                         *
      **************************************************************
      *  CALLING SEQ.
      *                    CALL 'UEXR58TA'
      *                    PARM           $PRTN  30
      *                    PARM           $RCVD1  8
      *                    PARM           $RCVT1  4
      *                    PARM           $RCVD2  8
      *                    PARM           $RCVT2  6
      *                    PARM           $BCH#   7
      *                    PARM           $INT#  14
      *   IN  $PRTN  30A  PARTNER ID
      *       $RCVD1  8A  RECEIVED DATE
      *       $RCVT1  4A  RECEIVED TIME (4 DIGITS)
      *   OUT $RCVD2  8A  RECEIVED DATE
      *       $RCVT2  6A  RECEIVED TIME
      *       $BCH#   7A  BATCH#
      *       $INT#  14A  INTERCHANGE#
      ***********************************************************
     FAUDREC98IF  E           K        DISK
      ***********************************************************
     C                     EXSR #INIT
      *
     C           @RCVD1    SUB  19000000  NUM8    80
     C                     MOVEL'T'       K#DTYP
     C                     MOVE 'S'       K#DSRS
     C                     Z-ADDNUM8      K#DCDT
     C                     MOVEL$PRTN     K#DIPT
     C                     MOVELXRCVTF    K#DCTM
     C           KEY01A    SETLLAUDREC98
     C                     DO   *HIVAL
     C           KEY01B    READEAUDREC98                 98
     C   98                LEAVE
      * END
     C                     MOVELAFDIPT    AFPR10 10
     C           AFPR10    IFNE XXPR10
     C                     ITER
     C                     ENDIF
      * IGNORE
     C           AFDCTM    IFLT XRCVTF
     C           AFDCTM    ORGT XRCVTT
     C           AFDIPT    ORNE $PRTN
     C                     ITER
     C                     ENDIF
      * SELECT
     C           AFDTID    IFNE '856'
     C                     ITER
     C                     ENDIF
      *
     C           AFDCDT    ADD  19000000  DAT8    80
     C                     MOVELDAT8      $RCVD2
     C                     Z-ADDAFDTIM    TIM8    80
     C                     MOVELTIM8      $RCVT2
     C                     MOVELAFDBNB    $BCH#
     C                     MOVELAFDINB    $INT#
     C                     LEAVE
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      ***********************************************************
      * INITIAL SETTINGS
      ***********************************************************
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $PRTN  30        IN
     C                     PARM           $RCVD1  8
     C                     PARM           $RCVT1  4
      *
     C                     PARM           $RCVD2  8        OUT
     C                     PARM           $RCVT2  6
     C                     PARM           $BCH#   7
     C                     PARM           $INT#  14
      *
     C           KEY01A    KLIST
     C                     KFLD           K#DTYP  1        T
     C                     KFLD           K#DSRS  1        R/S
     C                     KFLD           K#DCDT  70       RCVD DATE
     C                     KFLD           K#DIPT 30        PARTNER ID
     C                     KFLD           K#DCTM  4        RCSV TIME
      *
     C           KEY01B    KLIST
     C                     KFLD           K#DTYP           T
     C                     KFLD           K#DSRS           R/S
     C                     KFLD           K#DCDT           RCVD DATE
      *
     C                     MOVEL$RCVD1    @RCVD1  80
     C                     MOVEL$PRTN     XXPR10 10
      * GET TIME RANGE
     C                     MOVEL$RCVT1    @RCVT1  40
      * RANGE FROM
     C           @RCVT1    MULT 100       NUM6    60
     C                     MOVELNUM6      $TM1
     C                     MOVE '-'       $SIGN
     C                     MOVEL'0060'    $SEC
     C                     CALL 'UTLR19A'
     C                     PARM           $TM1    6
     C                     PARM           $SIGN   1
     C                     PARM           $SEC    4
     C                     PARM           $TM2    6
     C                     MOVEL$TM2      XRCVTF  4
      * RANGE TO
     C                     MOVELNUM6      $TM1
     C                     MOVE '+'       $SIGN
     C                     MOVEL'0900'    $SEC
     C                     CALL 'UTLR19A'
     C                     PARM           $TM1    6
     C                     PARM           $SIGN   1
     C                     PARM           $SEC    4
     C                     PARM           $TM2    6
     C                     MOVEL$TM2      XRCVTT  4
      * CLEAR OUT FIELDS
     C                     MOVE *ALL'0'   $RCVD2
     C                     MOVE *ALL'0'   $RCVT2
     C                     MOVE *ALL'0'   $BCH#
     C                     MOVE *BLANK    $INT#
      *
     C                     ENDSR
