     H            Y.
     F** UEXR11 ********************************************************
     F*  PROGRAM: CHECK AND GET SUBARU BIN#                            *
     F*           TO AVOID ADDING ORDER ONTO SHIPPED ORDER             *
     F*           FIND THE MINIMUM # OF BIN# THAT ARE                  *
     F*           GREATER THAN OR EQUAL TO THE SPECIFIED BIN#          *
     F*           AND THAT DO NOT CURRENTLY EXIST IN PP10              *
     F*  WRITTEN: JW (SRA) 2019.08.01                                  *
     F*----------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR11'
     F*                    PARM           $NONY   4
     F*                    PARM           $SHPDT  8
     F*                    PARM           $BIN1   2
     F*                    PARM           $BIN2   2
     F*                    PARM           $RTN    1
     F*  IN  $NONY :  4A DELIVERY#
     F*      $SHPDT:  8A SHIP DATE
     F*      $BIN1 :  2A BIN# TO BE CHECKED
     F*  OUT $BIN2 :  2A BIN# RESULT
     F*      $RTN  :  1A RETURN CODE (OK:BLANK, *:ERROR)
     F******************************************************
     FAB#PL08 IF  E           K        DISK
      *===================================================
      * SYSTEM DATE
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      * KEY FIELDS
     I            DS
     I                                        1   80K#NOHZ
     I                                        1   40K#NOYY
     I                                        5   60K#NOMM
     I                                        7   80K#NODD
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C                     MOVEL$BIN1     K#NOBN
     C                     SUB  1         K#NOBN
      *
     C                     DO   *HIVAL
     C                     ADD  1         K#NOBN
     C                     EXSR #CHK1
      *
     C           *IN85     IFEQ *OFF
     C                     LEAVE
     C                     ENDIF
      *
     C           K#NOBN    IFEQ 99
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN85     IFEQ *OFF
     C                     MOVELK#NOBN    $BIN2
     C                     MOVE ' '       $RTN
     C                     ELSE
     C                     MOVEL'00'      $BIN2
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * CHECK BIN#
      *======================================================
     C           #CHK1     BEGSR
      *
     C           K#PL08    CHAINAB#PL08              88
      *
     C           *IN88     IFEQ *ON
     C                     MOVE *OFF      *IN85
     C                     GOTO #CHK1X
     C                     ENDIF
      *
     C           *IN88     IFEQ *OFF
     C           BAURYY    ANDEQ0
     C                     MOVE *OFF      *IN85
     C                     GOTO #CHK1X
     C                     ENDIF
      *
     C                     MOVE *ON       *IN85
      *
     C           #CHK1X    ENDSR
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $SHPDT  8
     C                     PARM           $BIN1   2
     C                     PARM           $BIN2   2
     C                     PARM           $RTN    1
      *
     C           K#PL08    KLIST
     C                     KFLD           K#NONY  40
     C                     KFLD           K#NKOJ  1
     C                     KFLD           K#NUKE  4
     C                     KFLD           K#NOYY  40
     C                     KFLD           K#NOMM  20
     C                     KFLD           K#NODD  20
     C                     KFLD           K#NOBN  20
      * SET KEY
     C                     MOVEL$NONY     K#NONY
     C                     MOVEL'0'       K#NKOJ
     C                     MOVEL'00'      K#NUKE
     C                     MOVEL$SHPDT    K#NOHZ
      *
     C                     TIME           SDATE
     C                     MOVEL' '       $RTN
     C                     MOVEL$BIN1     $BIN2
      *
     C                     ENDSR
      *====================================================
