     H            Y.
      ** UEXR60  ***************************************************
      *  CHECK EDI ASN CUSTOMER?                                   *
      *  JW    2025.05.22                                          *
      **************************************************************
      *  CALLING SEQ.
      *                    CALL 'UEXR60 '
      *                    PARM           $NONY   4
      *                    PARM           $RTN    1
      *   IN  $NONY   4A  DELIVERY CODE
      *   OUT $RTN    1A  Y: USING EDI ASN, N:NOT USE EDI
      ***********************************************************
     FAB#EP02 IF  E           K        DISK
      ***********************************************************
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $RTN    1
      *
     C                     MOVEL$NONY     @NONY   40
     C                     MOVE 'N'       $RTN
      *
     C           @NONY     CHAINAB#EP02              98
      *
     C           *IN98     IFEQ *OFF
     C           P2FLG1    ANDEQ'Y'
     C                     MOVE 'Y'       $RTN
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
