     H            Y.
      ** UEXR58HA **************************************************
      *  GET GENTRAN INFO FROM REFERENCE# (HONDA) -856             *
      *  JW     2025.04.29                                         *
      **************************************************************
      *  CALLING SEQ.
      *                    CALL 'UEXR58HA'
      *                    PARM           $PRTN  30
      *                    PARM           $REF#  14
      *                    PARM           $RCVD   8
      *                    PARM           $RCVT   6
      *                    PARM           $BCH#   7
      *                    PARM           $INT#  14
      *   IN  $PRTN  30A  PARTNER ID
      *       $REF#  14A  REFERENCE#
      *   OUT $RCVD   8A  RECEIVED DATE
      *       $RCVT   6A  RECEIVED TIME
      *       $BCH#   7A  BATCH#
      *       $INT#  14A  INTERCHANGE#
      ***********************************************************
     FAUDREC  IF  E           K        DISK
      ***********************************************************
     C                     EXSR #INIT
      *
     C                     MOVE 'T'       KTYP    1
     C                     MOVEL$PRTN     KPRTN
     C                     MOVEL'9999'    KDIQL
     C           KEY01A    SETGTAUDREC
     C                     DO   *HIVAL
     C           KEY01B    REDPEAUDREC                   98
     C   98                LEAVE
      * SELECT
     C           AFDTID    IFNE '856'
     C                     ITER
     C                     ENDIF
     C           AFDSRS    IFNE 'S'
     C                     ITER
     C                     ENDIF
      * END
     C           AFDCDT    ADD  19000000  DAT8    80
     C           DAT8      IFLE 20241231
     C                     LEAVE
     C                     ENDIF
      * SELECT
     C           AFDIDF    IFNE $REF#
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELDAT8      $RCVD
     C                     Z-ADDAFDTIM    TIM8    80
     C                     MOVELTIM8      $RCVT
     C                     MOVELAFDBNB    $BCH#
     C                     MOVELAFDINB    $INT#
     C                     LEAVE
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      ***********************************************************
      * INITIAL SETTINGS
      ***********************************************************
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $PRTN  30
     C                     PARM           $REF#  14
     C                     PARM           $RCVD   8
     C                     PARM           $RCVT   6
     C                     PARM           $BCH#   7
     C                     PARM           $INT#  14
      *
     C           KEY01A    KLIST
     C                     KFLD           KTYP    1
     C                     KFLD           KPRTN  30
     C                     KFLD           KDIQL   4
      *
     C           KEY01B    KLIST
     C                     KFLD           KTYP    1
     C                     KFLD           KPRTN  30
      *
     C                     MOVEL$REF#     @REF#   70
      * CLEAR OUT FIELDS
     C                     MOVE *ALL'0'   $RCVD
     C                     MOVE *ALL'0'   $RCVT
     C                     MOVE *ALL'0'   $BCH#
     C                     MOVE *BLANK    $INT#
      *
     C                     ENDSR
