     H            Y.
     F** UEXR36H ********************************************
     F*  PROGRAM: EXSUB - GET MASTER# FOR FLEX N GATE       *
     F*  WRITTEN: JW (SRA) 2024.07.03                       *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR36H'
     F*                    PARM           $PCK    9
     F*                    PARM           $MAST  20
     F*  IN  $PCK    9A  PACKING LIST#
     F*  OUT $MAST  20A  MASTER LABEL#
     F******************************************************
     FSV#WP2EMIF  E           K        DISK
      *
     C           *ENTRY    PLIST
     C                     PARM           $PCK    9
     C                     PARM           $MAST  20
      *
     C                     MOVE *BLANK    $MAST
      *===================================================
      *           MAIN ROUTINE
      *===================================================
      *
     C           $PCK      SETLLSV#WP2EM
     C                     DO   *HIVAL
     C           $PCK      READESV#WP2EM                 98
     C   98                LEAVE
      *
     C                     MOVELE2SERL    $MAST
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
