     H            Y.                                    1
     F** UEXR13 **********************************
     F* GET CODE 39 BY QR CONTENS                *
     F*     T.SAKAKI             2019.10.07      *
     F********************************************
      *
      * INTRA KANBAN
     IW@QR        DS
     I                                        1 256 W@QR1
     I                                      257 512 W@QR2
     I                                        1   3 W@QKBN
     I                                        4   4 W@HKKB
     I                                        5   5 W@HKK1
     I                                       11  15 W@PAG2
     I                                       30  33 W@ZETJ
     I                                       46  48 W@KOTJ
     I                                       88  88 W@KSNK
     I                                       89  90 W@ATOH
     I                                       91  95 W@PAGE
      * A-PICS, VINYL
     I                                       49  52 B@SZET
     I                                       53  55 B@STHI
     I                                       56  60 B@SPAG
     I                                       61  61 B@NIJI
     I                                       62  62 B@TAIS
     I                                       63  63 B@SYKO
     I                                       64  64 B@HKSY
      *
     I*  INTRA
     I@QI         DS
     I                                        1   1 @QIKSN
     I                                        2   5 @QIZET
     I                                        6   7 @QIATO
     I                                        8   8 @QIHKK
     I                                        9  11 @QIKOT
     I                                       12  14 @QIPAG
     I* A-PICS
     I@QA         DS
     I                                        1   1 @QAKAN
     I                                        2   5 @QAZET
     I                                        6   8 @QATHI
     I                                        9  10 @QAPAG
     I                                       11  11 @QANIJ
     I                                       12  12 @QATAI
     I                                       13  13 @QASYK
     I                                       14  14 @QAHKS
      *
     I            DS
     I                                        1  15 W@BAR
     I                                        1  14 W@Q
     I                                       15  15 W@CD
      ***********************************************
      * ENTRY LIST
      ***********************************************
     C           *ENTRY    PLIST
     C                     PARM           P1QR1 256
     C                     PARM           P1QR2 256
     C                     PARM           P9BAR  20
      ***********************************************
      * MAIN
      ***********************************************
     C                     MOVELP1QR1     W@QR1
     C                     MOVELP1QR2     W@QR2
     C                     CLEAR@Q
     C                     MOVEL*BLANK    P9BAR
      * INTRA KANBAN
     C           W@HKK1    IFEQ 'A'
     C           W@HKK1    OREQ 'Y'
     C           W@HKK1    OREQ 'B'
     C                     MOVELW@KSNK    @QIKSN
     C                     MOVELW@ZETJ    @QIZET
      *
     C                     MOVELW@ATOH    @QIATO
     C           @QIATO    IFEQ *BLANK
     C                     MOVEL'00'      @QIATO
     C           W@HKK1    IFEQ 'B'
     C                     MOVEL'01'      @QIATO
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVELW@HKK1    @QIHKK
     C                     MOVELW@KOTJ    @QIKOT
      *
     C                     MOVE W@PAGE    @QIPAG
     C           @QIPAG    IFEQ *BLANK
     C                     MOVE W@PAG2    @QIPAG
     C                     ENDIF
      *
     C                     MOVEL@QI       @Q     14
      *
      * A-PICS, PLASTIC
     C                     ELSE
     C                     MOVELW@HKKB    @QAKAN
     C                     MOVELB@SZET    @QAZET
     C                     MOVELB@STHI    @QATHI
      *   PLATSIC  RE-CALCULATE LOT NO FOR OVER 100 SHEETS
     C           W@QKBN    IFEQ 'B01'
     C           W@HKK1    ANDEQ'C'
     C***                  MOVE B@STHI    X@STH1  30
     C                     MOVE B@SPAG    X@SPA1  30
     C           X@SPA1    DIV  100       X@SPA2  10
     C           999       SUB  X@SPA2    X@STH3  30
     C                     MOVELX@STH3    @QATHI
     C                     ENDIF
      *
     C                     MOVE B@SPAG    @QAPAG
     C                     MOVELB@NIJI    @QANIJ
     C                     MOVELB@TAIS    @QATAI
     C                     MOVELB@SYKO    @QASYK
     C                     MOVELB@HKSY    @QAHKS
     C                     MOVEL@QA       @Q
      *
     C                     ENDIF
      *
     C                     MOVEL@Q        PMAREA
     C                     MOVEL'014'     PMBYTE
     C                     CALL 'ALBRCC'
     C                     PARM           PMAREA100        * FIELD
     C                     PARM           PMBYTE  3        * LENGTH
     C                     PARM           PMCHK   1        * CHECK DIGIT
     C                     PARM           PMRTCD  1        * RETURN CODE
     C                     MOVEL*BLANK    W@BAR
     C                     MOVEL*BLANK    W@Q
     C                     MOVEL*BLANK    W@CD
     C                     MOVEL@Q        W@Q
     C                     MOVELPMCHK     W@CD
     C                     MOVELW@BAR     P9BAR
      *
     C                     SETON                     LR
     C                     RETRN
