     H            Y.
     F** UEXR36I ********************************************
     F*  PROGRAM: EXSUB - GET FORD MIX LABEL SEQ#           *
     F*  WRITTEN: JW (SRA) 2024.09.18                       *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR36I'
     F*                    PARM           $SEQ1   7
     F*                    PARM           $SEQ2   7
     F*                    PARM           $PL#    9
     F*  IN  $SEQ1   7A  CURRENT SEQ#
     F*  OUT $SEQ2   7A  ORIGINAL SEQ#
     F*  OUT $PL#    9A  PACKING LIST#
     F*  ----------------------------------
     F*  IF MIX LABEL DOES NOT EXIST --> $SEQ2 & $PL# = BLANK
     F******************************************************
     FSV#WP2EMIF  E           K        DISK
      *
     C           *ENTRY    PLIST
     C                     PARM           $PCK    9
     C                     PARM           $MAST  20
      *
     C                     MOVE *BLANK    $MAST
      *===================================================
      *           MAIN ROUTINE
      *===================================================
      *
     C           $PCK      SETLLSV#WP2EM
     C                     DO   *HIVAL
     C           $PCK      READESV#WP2EM                 98
     C   98                LEAVE
      *
     C                     MOVELE2SERL    $MAST
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
