     H            Y.
     F** UEXR34A ********************************************
     F*  PROGRAM: CHECK WIRE SUPPLIER                       *
     F*  WRITTEN: J.WATANABE    2021.04.15                  *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR34A'
     F*                    PARM           $ZAIS  15
     F*                    PARM           $ZAIK   5
     F*                    PARM           $SUPP   4
     F*                    PARM           $RTN    1
     F*  IN  $ZAIS : 15A  MATERIAL NAME
     F*      $ZAIK :  5A  WIRE DIAMETER (5,2)
     F*      $SUPP :  4A  SUPPLIER CODE
     F*  OUT $RTN  :  1A  RETURN CODE (Y:MATCHED, N=NOT MATCHED)
     F******************************************************
     FIZAPL01 IF  E           K        DISK
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C           K#KEY     SETGTIZAPL011
     C                     DO   *HIVAL
     C           K#KEY     REDPEIZAPL011                 92
     C   92                LEAVE
      *
     C           ZCSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           ZCKAKE    IFEQ @SUPP
     C                     MOVEL'Y'       $RTN
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $ZAIS  15
     C                     PARM           $ZAIK   5
     C                     PARM           $SUPP   4
     C                     PARM           $RTN    1
      *
     C           K#KEY     KLIST
     C                     KFLD           KZAIS
     C                     KFLD           KZAIK
      *
     C                     MOVEL$ZAIS     KZAIS  15
     C                     MOVEL$ZAIK     KZAIK   52
     C                     MOVEL$SUPP     @SUPP   40
     C                     MOVEL'N'       $RTN
      *
     C                     ENDSR
