     H            Y.
     F** UEXR31G *****************************************************
     F*  PROGRAM: CHECK PPE1(824 LOG) STATUS IF THERE IS TA, TE      *
     F*  WRITTEN: JW (SRA) 2024.10.10                                *
     F*--------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR31G'
     F*                    PARM           $SHID  15
     F*                    PARM           $STT    1
     F*  IN  $SHID  15A SHIP ID
     F*  OUT $STT    1A (Y=STATUS EXISTS N=NOT EXIST)
     F******************************************************
     FAB#PLE1 IF  E           K        DISK
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C           $SHID     SETLLAB#PLE1
     C                     DO   *HIVAL
     C           $SHID     READEAB#PLE1                  98
     C   98                LEAVE
      *
     C           M6ACKC    IFEQ 'TA'
     C           M6ACKC    OREQ 'TE'
     C                     MOVEL'Y'       $STT
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $SHID  15
     C                     PARM           $STT    1
      *
     C                     MOVE 'N'       $STT
      *
     C                     ENDSR
