     H            Y.
     F** UEXR07 ********************************************
     F*  PROGRAM: GET ORDER QTY BY DELIVERY# + SHIP DATE   *
     F*  WRITTEN: JW (SRA) 2019.01.08                      *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR07'
     F*                    PARM           $NONY   4
     F*                    PARM           $SHN   12
     F*                    PARM           $DATE   8
     F*                    PARM           $QTY    8
     F*                    PARM           $BOX    3
     F*                    PARM           $RTN    1
     F*  IN  $NONY :  4A DELIVERY CODE
     F*      $SHN  : 12A IAF PART
     F*      $DATE :  8A SHIP DATE (BLANK=TODAY)
     F*  OUT $QTY  :  8A ORDER QTY
     F*      $BOX  :  3A ORDER BOX
     F*      $RTN  :  1A RETURN CODE (BLANK/*)
     F******************************************************
     FAB#PL1M IF  E           K        DISK
      *===================================================
      * SYSTEM DATE
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      * KEY FIELDS
     I            DS
     I                                        1  12 K#SHIN
     I                                        1   5 K#SHN1
     I                                        6  10 K#SHN2
     I                                       11  12 K#SHN3
      * KEY FIELDS
     I            DS
     I                                        1   80K#NOHZ
     I                                        1   40K#NOYY
     I                                        5   60K#NOMM
     I                                        7   80K#NODD
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C                     MOVEL$SHIN     K#SHIN
     C                     MOVEL$NONY     K#NONY
     C                     MOVELTODAY     K#NOHZ
     C           K#PP1M    SETLLAB#PL1M
     C                     DO   *HIVAL
     C           K#PP1M    READEAB#PL1M                  88
     C   88                LEAVE
      *
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  BASRYO    @QTY    80
      * SAVE Q/C
     C                     Z-ADD0         WCPQ    60
      *
     C           BASYOS    IFNE 0
     C                     Z-ADDBASYOS    WCPQ
     C                     ENDIF
     C           BASYOS    IFEQ 0
     C           BAUSYS    ANDNE0
     C                     Z-ADDBAUSYS    WCPQ
     C                     ENDIF
      *
     C           WCPQ      IFGT @CPQ
     C                     Z-ADDWCPQ      @CPQ
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           @CPQ      IFEQ 0
     C                     Z-ADD1         @BOX    30
     C                     ELSE
     C           @QTY      DIV  @CPQ      @BOX
     C                     ENDIF
      *
     C                     MOVEL@QTY      $QTY
     C                     MOVEL@BOX      $BOX
      *
     C           @QTY      IFEQ 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $SHIN  12
     C                     PARM           $DATE   8
     C                     PARM           $QTY    8
     C                     PARM           $BOX    3
     C                     PARM           $RTN    1
      *
     C           K#PP1M    KLIST
     C                     KFLD           K#SHN1  5
     C                     KFLD           K#SHN2  5
     C                     KFLD           K#SHN3  2
     C                     KFLD           K#NONY  40
     C                     KFLD           K#NOYY  40
     C                     KFLD           K#NOMM  20
     C                     KFLD           K#NODD  20
      * SYSTEM DATE
     C                     TIME           SDATE
     C                     MOVE *ALL'0'   $QTY
     C                     MOVE *ALL'0'   $BOX
     C                     MOVE *BLANK    $RTN
     C                     Z-ADD0         @CPQ    60
      *
     C           $DATE     IFNE *BLANK
     C                     MOVEL$DATE     TODAY
     C                     ENDIF
      *
     C                     ENDSR
      *====================================================
