     H            Y.
     F** UEXR45C ********************************************
     F*  PROGRAM: EXSUB - GET PO ISSUE DATE                 *
     F*  WRITTEN: JW (SRA) 2022.04.14                       *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UEXR45C'
     F*                    PARM           $NONY   4
     F*                    PARM           $SHPD   8
     F*                    PARM           $MHIN  20
     F*                    PARM           $ODRN  10
     F*                    PARM           $TDAT   8
     F*  IN  $NONY :  4A DELIVERY#
     F*      $SHPD :  8A SHIP DATE
     F*      $MHIN : 20A USER PART#
     F*      $ODRN : 10A ORDER#
     F*  OUT $TDAT :  8A PO ISSUE DATE
     F******************************************************
     FAB#EL4S2IF  E           K        DISK
      *===================================================
      * SYSTEM DATE
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      * KEY FIELDS
     I            DS
     I                                        1   80K#NOHZ
     I                                        1   40K#NOYY
     I                                        5   60K#NOMM
     I                                        7   80K#NODD
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C           KEY1      SETLLAB#EL4S2
      *
     C                     DO   *HIVAL
     C           KEY1      READEAB#EL4S2                 98
     C   98                LEAVE
      *
     C                     Z-ADDEPODT     @PODT   80
     C                     Z-ADDECRDT     @CRDT   80
     C                     ENDDO
      *
     C           @PODT     IFEQ 0
     C                     MOVEL@CRDT     $TDAT
     C                     ELSE
     C                     MOVEL@PODT     $TDAT
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $SHPD   8
     C                     PARM           $MHIN  20
     C                     PARM           $ODRN  10
     C                     PARM           $TDAT   8
      *
     C           KEY1      KLIST
     C                     KFLD           K#NONY  4
     C                     KFLD           K#SHPD  80
     C                     KFLD           K#MHIN 30
     C                     KFLD           K#ODRN 10
      * SET KEY
     C                     MOVEL$NONY     K#NONY
     C                     MOVEL$SHPD     K#SHPD
     C                     MOVEL$MHIN     K#MHIN
     C                     MOVEL$ODRN     K#ODRN
      *
     C                     TIME           SDATE
     C                     MOVE '00000000'$TDAT
      *
     C                     ENDSR
      *====================================================
