     H            Y.
     F** UTLR01B *******************************************
     F*  PROGRAM: UTILITY - CHECK TIME                     *
     F*  WRITTEN: JW (SRA) 2021.04.26                      *
     F*  FUNCTION: VALIDATE TIME                           *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR01B'
     F*                    PARM           $TIME   4
     F*                    PARM           $RTN    1
     F*   IN  $TIME :  4A TIME (00:01 - 23:59)
     F*   OUT $RTN  :  1A RETURN FLAG (BLANK=OK, *=ERROR)
      *--------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           $TIME   4
     C                     PARM           $RTN    1
      *
     C                     MOVE *BLANK    $RTN
     C                     MOVEL$TIME     @HH     2
     C                     MOVE $TIME     @MM     2
      *
     C           $TIME     IFLT '0000'
     C           $TIME     ORGT '2359'
     C                     MOVE '*'       $RTN
     C                     GOTO ENDP
     C                     ENDIF
      *
     C           @HH       IFLT '00'
     C           @HH       ORGT '23'
     C                     MOVE '*'       $RTN
     C                     GOTO ENDP
     C                     ENDIF
      *
     C           @MM       IFLT '00'
     C           @MM       ORGT '59'
     C                     MOVE '*'       $RTN
     C                     GOTO ENDP
     C                     ENDIF
      *
     C           ENDP      TAG
     C                     SETON                     LR
     C                     RETRN
