     H            Y.
     F** UTLR63 ***************************************************
     F*  PROGRAM: UTILITY- CHECK DELETED RECORDS OVER 300  (Y/N)  *
     F*  WRITTEN: JW (SRA)                                        *
     F*           09/24/2018                                      *
     F*-----------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR63'
     F*                    PARM           $FILE  10
     F*                    PARM           $RTN    1
     F*  IN  $FILE : 10A FILE NAME
     F*  OUT $RTN  :  1A RETURN CODE (Y=DELETED RCD IS OVER 300, N=NOT)
     F******************************************************
     FVVVPP30 IF  E           K        DISK
     FVVVPP31 IF  E           K        DISK
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C           $FILE     CHAINVVVPP30              99
     C           *IN99     IFEQ *OFF
     C           MBNDTR    ANDGE300
     C                     MOVE 'Y'       $RTN
     C                     GOTO ENDP
     C                     ENDIF
      *
     C           $FILE     CHAINVVVPP31              99
     C           *IN99     IFEQ *OFF
     C           MBNDTR    ANDGE300
     C                     MOVE 'Y'       $RTN
     C                     GOTO ENDP
     C                     ENDIF
      *
     C           ENDP      TAG
     C                     SETON                     LR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $FILE  10
     C                     PARM           $RTN    1
      *
     C                     MOVE 'N'       $RTN
      *
     C                     ENDSR
      *====================================================
