     H            Y.
     F** UTLR19A *******************************************
     F*  PROGRAM: GET MINUTE = TIME1 + SECONDS             *
     F*  WRITTEN: JW (SRA)  2025.04.01                     *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR19A'
     F*                    PARM           $TM1    6
     F*                    PARM           $SIGN   1
     F*                    PARM           $SEC    4
     F*                    PARM           $TM2    6
     F*   IN  $TM1  :  6A FROM TIME (HHMMSS)
     F*   IN  $SIGN :  1A + OR -
     F*   IN  $SEC  :  4A SECONDS
     F*   OUT $TM2  :  6A CALCULATED TIME
     F*-SAMPLE---------------------------------------
     F*   $TM1(01:59:30), $SIGN(+), $SEC(60) --> $TM2(02:00:30)
     F******************************************************
     I            DS
     I                                        1   60W1TM
     I                                        1   20W1HH
     I                                        3   40W1MM
     I                                        5   60W1SS
     I            DS
     I                                        1   60W2TM
     I                                        1   20W2HH
     I                                        3   40W2MM
     I                                        5   60W2SS
      *
     C           *ENTRY    PLIST
     C                     PARM           $TM1    6
     C                     PARM           $SIGN   1
     C                     PARM           $SEC    4
     C                     PARM           $TM2    6
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      *
     C                     MOVEL$TM1      W1TM
     C                     MOVEL$SEC      @SEC    40
     C                     Z-ADD0         @SEC1   60
     C                     Z-ADD0         @SEC2   60
     C                     Z-ADD0         @SEC3   60
      * CONVERT TM1
     C           W1HH      MULT 3600      @SEC1
     C           W1MM      MULT 60        @SEC2
     C           @SEC1     ADD  @SEC2     @SEC3
     C                     ADD  W1SS      @SEC3
      *
     C           $SIGN     IFEQ '+'
     C           @SEC3     ADD  @SEC      @SEC3
     C                     ELSE
     C           @SEC3     SUB  @SEC      @SEC3
     C                     ENDIF
      *
     C           @SEC3     DIV  3600      W2HH
     C                     MVR            @REM    60
      *
     C           @REM      DIV  60        W2MM
     C                     MVR            W2SS
      *
     C                     MOVELW2TM      $TM2
      *
     C                     SETON                     LR
     C                     RETRN
