     H            Y.
     F** UTLR80 ****************************************************************
     F*  GET INVENTORY BY IAF PART# (NZUPP01)                                  *
     F*  J.WATANABE   2021.03.25                                               *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR80'
     F*                    PARM           $SHIN  12
     F*                    PARM           $INV    5
     F*                    PARM           $RTN    1
     F*   IN  $SHIN : 12A IAF PART
     F*   OUT $INV  :  5A INVENTOY
     F*       $RTN  :  1A RETURN FLAG (BLANK=OK, *=ERROR)
     F**************************************************************************
     FNZUPL02 IF  E           K        DISK
      *----------------------------------------------------*
     I            DS
     I                                        1  12 K#SHIN
     I                                        1   5 K#SHN1
     I                                        6  10 K#SHN2
     I                                       11  12 K#SHN3
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *----------------------------------------------------*
      *                    MAIN ROUTINE                    *
      *----------------------------------------------------*
     C                     EXSR #INIT
      * SET KEY
     C                     Z-ADD0         @REC    60
     C           KEYN11    SETLLNZUPL02
     C                     DO   *HIVAL
     C           KEYN12    READENZUPL02                  81
     C   81                LEAVE
      *
     C                     ADD  1         @REC
     C                     SELEC
     C           N2DEHZ    WHNE 0
     C                     ADD  1         @IN
     C                     ADD  1         @OUT
     C           N2NYHZ    WHNE 0
     C                     ADD  1         @IN
     C                     ENDSL
      *
     C                     ENDDO
      *
     C           @IN       SUB  @OUT      @INV
     C                     MOVEL@INV      $INV
      * PART NOT EXIST
     C           @REC      IFEQ 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $SHIN  12
     C                     PARM           $INV    5
     C                     PARM           $RTN    1
      *
     C           KEYN11    KLIST
     C                     KFLD           K#SHN1  5
     C                     KFLD           K#SHN2  5
     C                     KFLD           K#SHN3  2
     C                     KFLD           K#HAHZ  80
      *
     C           KEYN12    KLIST
     C                     KFLD           K#SHN1
     C                     KFLD           K#SHN2
     C                     KFLD           K#SHN3
      *
     C                     MOVE *ALL'0'   $INV
     C                     MOVE *BLANK    $RTN
     C                     TIME           SDATE
     C                     MOVEL$SHIN     K#SHIN
     C                     Z-ADD0         @IN     50
     C                     Z-ADD0         @OUT    50
     C                     Z-ADD0         @INV    50
      * 12 MONTHS AGO
     C                     MOVELTODAY     $DT8
     C                     MOVE '-'       $SIGN
     C                     MOVEL'0365'    $DAYS
     C                     MOVE 'N'       $IAF
     C                     CALL 'UTLR10'
     C                     PARM           $DT8    8
     C                     PARM           $SIGN   1
     C                     PARM           $DAYS   4
     C                     PARM           $IAF    1
     C                     PARM           $TGT8   8
     C                     PARM           $RTN    1
     C                     MOVEL$TGT8     K#HAHZ
      *
     C                     ENDSR
