     H            Y.
     F** UTLR51C ************************************************************
     F*  UTILITY - GET PACKING LIST# FROM XP01A (BY SERIAL#)                *
     F*  WRITTEN: JW (SRA)   2024.10.08                                     *
     F*---------------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR51C'
     F*                    PARM           $SERL  18
     F*                    PARM           $CRHZ   8
     F*                    PARM           $FILE  10
     F*                    PARM           $PICK#  9
     F*   IN  $SERL  18  SERIAL#
     F*       $CRHZ   8  CRT DATE
     F*       $FILE  10  LABEL WORK FILE
     F*   OUT $PICK#  9  PICK SLIP#
     F******************************************************
     FAB#XL01BIF  E           K        DISK
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
     C                     EXSR #INIT
      *
     C           KEY1      SETLLAB#XL01B
      *
     C                     DO   *HIVAL
     C           KEY1      READEAB#XL01B                 98
     C   98                LEAVE
      *
     C           IXPL#     IFNE *BLANK
     C                     MOVELIXPL#     $PICK#
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $CRHZ   8
     C                     PARM           $FILE  10
     C                     PARM           $USER  10
     C                     PARM           $PLNT   5
     C                     PARM           $SEQ#   6
     C                     PARM           $PICK#  9
      *
     C           KEY1      KLIST
     C                     KFLD           IXKOHZ
     C                     KFLD           IXWRKF
     C                     KFLD           IXKOUS
     C                     KFLD           KSER1F
     C                     KFLD           KSER1T
      * XXXX
     C           *LIKE     DEFN IXKOHZ    KXKOHZ
     C           *LIKE     DEFN IXWRKF    KXWRKF
     C           *LIKE     DEFN IXKOUS    KXKOUS
     C           *LIKE     DEFN SER1F     KSER1F
     C           *LIKE     DEFN SER1T     KSER1T
      *
     C                     MOVEL$CRHZ     KXKOHZ
     C                     MOVEL$FILE     KXWRKF
     C                     MOVEL$USER     KXKOUS
     C                     MOVEL$PLNT     KSER1F    P
     C                     MOVEL$SEQ#     KSER1T    P
      *
     C                     MOVE *BLANK    $PICK#
      *
     C                     ENDSR
