     H            Y.
     F** UTLR35D *******************************************
     F*  GET QPC BY IAF OR USR PART / DATE                 *
     F*      (MASS PRODUCTION AND SERVICE PART)            *
     F*  WRITTEN: JW (SRA) 2024.10.28                      *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR35D'
     F*                    PARM           $TOKU   4
     F*                    PARM           $NONY   4
     F*                    PARM           $MHIN  20
     F*                    PARM           $HTYP   3
     F*                    PARM           $DATE   8
     F*                    PARM           $SYOS   6
     F*                    PARM           $RTN    1
     F*  IN  $TOKU :  4A CUST# (BLANK=ALL)
     F*      $NONY :  4A DELIVERY CODE (BLANK=ALL)
     F*      $MHIN : 20A USER PART     (BLANK WILL BE IGNORED)
     F*      $HTYP :  3A PART TYPE (USR=USER, IAF=IAF)
     F*      $DATE :  8A TARGET DATE
     F*  OUT $SYOS :  6A QTY/BOX (QPC)
     F*      $RTN  :  1A RETURN CODE (BLANK=OK, *=ERROR, 1=NOT EFFECTIVE)
     F******************************************************
     FFAAPL05 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFCEPL30 IF  E           K        DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  20 @MHIN
     I                                        1   5 $MHN1
     I                                        6  10 $MHN2
     I                                       11  15 $MHN3
     I                                       16  20 $MHN4
      *
     I            DS
     I                                        1  20 K@MHIN
     I                                        1   5 K@MHN1
     I                                        6  10 K@MHN2
     I                                       11  15 K@MHN3
     I                                       16  20 K@MHN4
      *
     I            DS
     I                                        1  12 K@SHIN
     I                                        1   5 K@SHN1
     I                                        6  10 K@SHN2
     I                                       11  12 K@SHN3
      *
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      *
     I            DS
     I                                        1   80A2TAHZ
     I                                        1   40A2TAYY
     I                                        5   60A2TAMM
     I                                        7   80A2TADD
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
     C                     EXSR #INIT
      *
     C           $HTYP     IFNE 'USR'
     C           $HTYP     ANDNE'IAF'
     C                     MOVEL'IAF'     $HTYP
     C                     ENDIF
      * DEFAULT
     C                     MOVEL$MHN1     K@SHN1
     C                     MOVEL$MHN2     K@SHN2
     C                     MOVEL$MHN3     K@SHN3
      *
     C           $HTYP     IFEQ 'IAF'
     C                     EXSR #FCEP
     C                     GOTO ENDP
     C                     ENDIF
      * EDIT
     C                     MOVEL$MHIN     $FLD1
     C                     CALL 'EDTR02C'
     C                     PARM           $FLD1  25
     C                     PARM           $FLD2  25
     C                     MOVEL$FLD2     $MHIN
      * GET IAF PART FROM USER PART
     C                     CALL 'BBHR51'
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $MHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @FLG    1
      *
     C           @FLG      IFEQ ' '
     C                     MOVEL@SHIN     K@SHIN
     C                     EXSR #FCEP
     C                     GOTO ENDP
     C                     ENDIF
      * TOYOTA?
     C           @FLG      IFNE ' '
     C           $TOKU     ANDEQ'3411'
     C           K@MHN3    ANDEQ'00   '
     C           K@MHN4    ANDEQ*BLANK
     C                     EXSR #TOYO
     C                     GOTO ENDP
     C                     ENDIF
      *
      * END PROCESS
     C           ENDP      TAG
     C           WSYOS     IFEQ 0
     C                     MOVEL'*'       $RTN
     C                     ELSE
     C                     MOVELWSYOS     $SYOS
     C                     ENDIF
      *
     C           E#FLG     IFEQ 'N'
     C           WSYOS     ANDNE0
     C                     MOVEL'1'       $RTN             NOT EFFECTIVE
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *=============================================================
      * IAF PART
      *=============================================================
     C           #FCEP     BEGSR
      *
     C                     Z-ADD0         EFDATE  80
      *
      * READ FCEPL01 =====================
     C           KEY2      SETLLFCEPL01
     C                     DO   *HIVAL
     C           KEY2      READEFCEPL01                  98
     C   98                LEAVE
      *
     C           A2GSKD    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           A2SYHZ    IFGT PDATE
     C                     Z-ADDA2KSYS    WSYOS            OLD
     C                     ELSE
     C                     Z-ADDA2SSYS    WSYOS            NEW
     C                     ENDIF
      *
     C                     Z-ADDA2TAHZ    EFDATE
      *
     C                     LEAVE
     C                     ENDDO
      * EFFECTIVE FLAG
     C           WSYOS     IFNE 0
     C           EFDATE    IFNE 0
     C           EFDATE    ANDLEPDATE
     C                     MOVE 'Y'       E#FLG   1
     C                     ELSE
     C                     MOVE 'N'       E#FLG
     C                     ENDIF
     C                     GOTO XFCEP
     C                     ENDIF
      *===================================
      * SERVICE PART
     C           WSYOS     IFEQ 0
     C           KEY2      SETLLFCEPL30
     C                     DO   *HIVAL
     C           KEY2      READEFCEPL30                  93
     C   93                LEAVE
      *
      *
     C           F3GSKD    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           F3SYMD    IFGT PDATE
     C                     Z-ADDF3KSYS    WSYOS            OLD
     C                     ELSE
     C                     Z-ADDF3SSYS    WSYOS            NEW
     C                     ENDIF
      *
     C                     MOVE 'Y'       E#FLG
     C                     LEAVE
     C                     ENDDO
     C                     ENDIF
      *
     C           XFCEP     ENDSR
      *=============================================================
      * TOYOTA CASE
      *=============================================================
     C           #TOYO     BEGSR
      *
     C                     MOVEL@MHIN     K@MHIN
     C                     MOVE *BLANK    K@MHN3
     C                     MOVEL$TOKU     K@TOKU
     C                     MOVEL$NONY     K@NONY
     C           KEY1      SETLLFAAPL05
     C                     DO   *HIVAL
     C           KEY1      READEFAAPL05                  94
     C   94                LEAVE
     C           B7SKBN    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELB7SHN1    K@SHN1
     C                     MOVELB7SHN2    K@SHN2
     C                     MOVELB7SHN3    K@SHN3
     C                     LEAVE
     C                     ENDDO
      *
     C           *IN94     IFEQ *OFF
     C                     EXSR #FCEP
     C                     GOTO XTOYO
     C                     ENDIF
      *
     C           XTOYO     ENDSR
      *=============================================================
      * INITIAL SETING
      *=============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $MHIN  20
     C                     PARM           $HTYP   3
     C                     PARM           $DATE   8
     C                     PARM           $SYOS   6
     C                     PARM           $RTN    1
      *
     C           KEY1      KLIST
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
     C                     KFLD           K@TOKU  40
     C                     KFLD           K@NONY  40
      *
     C           KEY1B     KLIST
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
      *
     C           KEY2      KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
      * EDIT MHIN
     C                     MOVEL$MHIN     $FLD1     P
     C                     CALL 'EDTR02C'                  REMOVE BLANK, -
     C                     PARM           $FLD1  25
     C                     PARM           $FLD2  25
     C                     MOVEL$FLD2     @MHIN
      *
     C                     CLEAR$RTN
     C                     Z-ADD0         WSYOS   60
     C                     MOVEL'000000'  $SYOS
     C                     MOVE *BLANK    $RTN
     C                     MOVEL$TOKU     K@TOKU  40
     C                     MOVEL$NONY     K@NONY  40
     C                     MOVEL@MHIN     K@MHIN
      *
     C           $HTYP     IFEQ *BLANK
     C                     MOVEL'USR'     $HTYP
     C                     ENDIF
      *
     C                     TIME           SDATE
     C           $DATE     IFEQ *BLANK
     C           $DATE     OREQ *ZERO
     C                     Z-ADDTODAY     PDATE   80
     C                     ELSE
     C                     MOVEL$DATE     PDATE
     C                     ENDIF
      *
     C                     ENDSR
