     H            Y.
     F** UTLR07C***********************************************
     F*  PROGRAM: UTILITY - STAMP LOG (SAVE MENU PASS LOG) *
     F*  WRITTEN: JW (SRA)                                    *
     F*  SET TO : JW (SRA)                                    *
     F*  DATE   : 10/11/2019                                  *
     F*-------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR07C'
     F*                    PARM           $TYP    4
     F*                    PARM           $PGM   10
     F*                    PARM           $COM1  10
     F*                    PARM           $COM2  10
     F*  IN  $TYP   :   4A : MENU/JOB
     F*      $PGM   :  10A : PROGRAM
     F*      $COM1  :  10A : COMMENT1 PASSED FROM CL
     F*      $COM2  :  10A : COMMENT2 PASSED FROM CL
     F******************************************************
     FUTLPP02 O   E                    DISK
      *--------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I                                      264 269 #JOB
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      *
     C           *ENTRY    PLIST
     C                     PARM           $TYP    4
     C                     PARM           $PGM   10
     C                     PARM           $COM1  10
     C                     PARM           $COM2  10
      *
     C                     MOVEL#WSID     U2WSID
     C                     MOVEL#USER     U2USER
     C                     MOVEL$PGM      U2PGM     P
     C                     Z-ADD*DATE     U2CRDT
     C                     TIME           U2CRTM
     C                     MOVEL$COM1     U2COM1
     C                     MOVEL$COM2     U2COM2
     C                     MOVEL$TYP      U2TYP
     C                     MOVEL#JOB      U2JOB#
      *
     C                     WRITEUTLPP021
      *
     C                     SETON                     LR
     C                     RETRN
