     H            Y.
     F** UTLR08 ****************************************************************
     F*  PROGRAM    : RETRIEVE DATE/TIME IMAGE (CCYYMMDD HH.MN.SS.XXX)         *
     F*  WRITTEN    : 06/24/2016                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F*  FUNCTION   :                                                          *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR08'
     F*                    PARM           $STAMP 21
     F*  OUT $STAMP: 21A DATE/TIME STAMP
     F**************************************************************************
     I* STAMP IMAGE ('CCYYMMDD HH.MN.SS.000')
     I*             ('20160624 17.51.19.372')
     I            DS
     I                                        1  21 STAMP1
     I                                        1   2 CENT
     I                                        3   4 YEAR
     I                                        5   6 MONTH
     I                                        7   8 DAY
     I                                        9   9 SP1
     I                                       10  11 HR
     I                                       12  12 SP2
     I                                       13  14 MIN
     I                                       15  15 SP3
     I                                       16  17 SEC
     I                                       18  18 SP4
     I                                       19  21 MIS
      *
     I            DS
     I                                        1  16 OVAL
     I                                        1   1 OCENT
     I                                        2   3 OYEAR
     I                                        4   5 OMONTH
     I                                        6   7 ODAY
     I                                        8   9 OHR
     I                                       10  11 OMIN
     I                                       12  13 OSEC
     I                                       14  16 OMIS
      *
     I            DS
     I                                        1  15 ERROR
     I                                    B   1   40ERLEN
     I                                        9  15 MSGID
      *
     C           *ENTRY    PLIST
     C                     PARM           #STAMP 21
      *
     C                     MOVE ' '       SP1     1
     C                     MOVE '.'       SP2     1
     C                     MOVE '.'       SP3     1
     C                     MOVE '.'       SP4     1
      ****************************
      * MAIN                     *
      ****************************
     C*                    EVAL      ERRORLEN = %SIZE(ERROR)
     C                     MOVEL'*CURRENT'INPUTF
     C                     MOVEL'*YMD'    OUTPUT
     C                     CALL 'QWCCVTDT'
     C                     PARM           INPUTF 10
     C                     PARM           INPUTV  1
     C                     PARM           OUTPUT 10
     C                     PARM           OVAL   16
     C                     PARM           ERROR
      *
     C           OCENT     IFEQ '0'
     C                     MOVEL'19'      CENT
     C                     ELSE
     C                     MOVEL'20'      CENT
     C                     ENDIF
      *
     C                     MOVELOYEAR     YEAR
     C                     MOVELOMONTH    MONTH
     C                     MOVELODAY      DAY
     C                     MOVELOHR       HR
     C                     MOVELOMIN      MIN
     C                     MOVELOSEC      SEC
     C                     MOVELOMIS      MIS
      *
     C                     MOVELSTAMP1    #STAMP
      *
     C                     MOVEL*ON       *INLR
     C                     RETRN
