     H            Y.
     F** UTLR50D ***********************************************************
     F*  UTILITY - CHECK DUPLICATE ORDER 1 (AB#EP40S)                      *
     F*  WRITTEN: JW (SRA)   2024.04.04                                    *
     F*  FUNCTION: CHECK ORDER BY NONY/NKOJ/NUKE/NOHZ/MHIN/ODRN            *
     F*--------------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR50D'
     F*                    PARM           $NONY   4
     F*                    PARM           $NKOJ   1
     F*                    PARM           $NUKE   4
     F*                    PARM           $NOHZ   8
     F*                    PARM           $MHIN  20
     F*                    PARM           $ODRN  10
     F*                    PARM           $RTN    1
     F*   IN  $NONY   4A DELIVERY#
     F*       $NKOJ   1A FACTORY
     F*       $NUKE   4A DOCK
     F*       $NOHZ   8A SHIP DATE
     F*       $MHIN  20A USER PART#
     F*       $ODRN  10A ORDER#
     F*   OUT $RTN    1A RETURN (Y=ORDER EXISTS, N=ORDER NOT EXISTS)
     F******************************************************
     FAB#EL4S2IF  E           K        DISK
      *--------------------------------------------------------
     E                    DAT        10  1
      *--------------------------------------------------------
     I            DS
     I                                        1   80@NOHZ
     I                                        1   40@NOYY
     I                                        5   60@NOMM
     I                                        7   80@NODD
     I            DS
     I                                        1  20 @MHIN
     I                                        1   5 @MHN1
     I                                        6  10 @MHN2
     I                                       11  15 @MHN3
     I                                       16  20 @MHN4
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $NOHZ   8
     C                     PARM           $MHIN  20
     C                     PARM           $ODRN  10
     C                     PARM           $RTN    1
      *
     C           KEY1      KLIST
     C                     KFLD           KNONY   4
     C                     KFLD           KNDATE  80
     C                     KFLD           KMHIN  30
     C                     KFLD           KODRN  10
      *
     C                     MOVEL$NONY     KNONY
     C                     MOVEL$NOHZ     KNDATE
     C                     MOVEL$MHIN     KMHIN
     C                     MOVEL$ODRN     KODRN
     C                     MOVE 'N'       $RTN
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      *
     C           KEY1      SETLLAB#EL4S2
     C                     DO   *HIVAL
     C           KEY1      READEAB#EL4S2                 98
     C   98                LEAVE
      *
     C           EUPID     IFEQ 'D'
     C           EUPID     OREQ '1'
     C                     ITER
     C                     ENDIF
      *
     C           $NKOJ     IFNE ' '
     C           $NKOJ     ANDNEENKOJ
     C                     ITER
     C                     ENDIF
      *
     C           $NUKE     IFNE ' '
     C           $NUKE     ANDNEENUKE
     C                     ITER
     C                     ENDIF
      *
     C                     MOVE 'Y'       $RTN
     C                     LEAVE
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
