     H            Y.
     F** UTLR75C **********************************************************
     F*  UTILITY- GET IAF FINAL GODDS PART FROM COMPONENT PART
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR75C' PLST1 ...
     F*                    PARM           $CPART 12
     F*                    PARM           $FPRT1 12
     F*                    PARM           $FPRT2 12
     F*                    PARM           $FPRT3 12
     F*                    PARM           $FPRT4 12
     F*                    PARM           $FPRT5 12
     F*   IN  $IPART 12A   IAF PART
     F*   OUT PLST1 ...
     F*       $FPRT1 12A   FINAL PART 1
     F*       $FPRT2 12A   FINAL PART 2
     F*       $FPRT3 12A   FINAL PART 3
     F*       $FPRT4 12A   FINAL PART 4
     F*       $FPRT5 12A   FINAL PART 5
     F******************************************************************
     FFCEPL01BIF  E           K        DISK
     F******************************************************************
     E                    PRT        50 12
     I            DS
     I                                        1  12 #SHIN
     I                                        1   5 #SHN1
     I                                        6  10 #SHN2
     I                                       11  12 #SHN3
     I            DS
     I                                        1  12 A2SHIN
     I                                        1   5 A2BHB1
     I                                        6  10 A2BHB2
     I                                       11  12 A2BHB3
     I            DS
     I                                        1 600 PRT
     I                                        1  12 PRT01
     I                                       13  24 PRT02
     I                                       25  36 PRT03
     I                                       37  48 PRT04
     I                                       49  60 PRT05
     I                                       61  72 PRT06
     I                                       73  84 PRT07
     I                                       85  96 PRT08
     I                                       97 108 PRT09
     I                                      109 120 PRT10
     I                                      121 132 PRT11
     I                                      133 144 PRT12
     I                                      145 156 PRT13
     I                                      157 168 PRT14
     I                                      169 180 PRT15
     I                                      181 192 PRT16
     I                                      193 204 PRT17
     I                                      205 216 PRT18
     I                                      217 228 PRT19
     I                                      229 240 PRT20
     I                                      241 252 PRT21
     I                                      253 264 PRT22
     I                                      265 276 PRT23
     I                                      277 288 PRT24
     I                                      289 300 PRT25
     I                                      301 312 PRT26
     I                                      313 324 PRT27
     I                                      325 336 PRT28
     I                                      337 348 PRT29
     I                                      349 360 PRT30
     I                                      361 372 PRT31
     I                                      373 384 PRT32
     I                                      385 396 PRT33
     I                                      397 408 PRT34
     I                                      409 420 PRT35
     I                                      421 432 PRT36
     I                                      433 444 PRT37
     I                                      445 456 PRT38
     I                                      457 468 PRT39
     I                                      469 480 PRT40
     I                                      481 492 PRT41
     I                                      493 504 PRT42
     I                                      505 516 PRT43
     I                                      517 528 PRT44
     I                                      529 540 PRT45
     I                                      541 552 PRT46
     I                                      553 564 PRT47
     I                                      565 576 PRT48
     I                                      577 588 PRT49
     I                                      589 600 PRT50
      *----------------------------------------------------
      * MAIN ROUTINE
      *----------------------------------------------------
     C                     EXSR #INIT
      *
     C                     Z-ADD0         CNT     10
     C                     MOVEL$CPART    #SHIN
      * GENERATION 1
     C                     MOVEL#SHN1     G1SHN1           W0612
     C                     MOVEL#SHN2     G1SHN2
     C                     MOVEL#SHN3     G1SHN3
     C           G1PL01    SETLLFCEPL01B
     C                     DO   *HIVAL
     C           G1PL01    READEFCEPL01B                 91
     C   91                LEAVE
     C                     EXSR #CHKP                      IAF IS P?
     C           PFLG      IFEQ 'N'
     C                     EXSR #GEN2
     C                     ENDIF
     C                     ENDDO
      *
     C                     EXSR #MOVE
      *
     C                     SETON                     LR
     C                     RETRN
      *******************************************************
      * MOVE PARAMETER
      *******************************************************
     C           #MOVE     BEGSR
      *
     C                     MOVELPRT01     $FPR01
     C                     MOVELPRT02     $FPR02
     C                     MOVELPRT03     $FPR03
     C                     MOVELPRT04     $FPR04
     C                     MOVELPRT05     $FPR05
     C                     MOVELPRT06     $FPR06
     C                     MOVELPRT07     $FPR07
     C                     MOVELPRT08     $FPR08
     C                     MOVELPRT09     $FPR09
     C                     MOVELPRT10     $FPR10
     C                     MOVELPRT11     $FPR11
     C                     MOVELPRT12     $FPR12
     C                     MOVELPRT13     $FPR13
     C                     MOVELPRT14     $FPR14
     C                     MOVELPRT15     $FPR15
     C                     MOVELPRT16     $FPR16
     C                     MOVELPRT17     $FPR17
     C                     MOVELPRT18     $FPR18
     C                     MOVELPRT19     $FPR19
     C                     MOVELPRT20     $FPR20
     C                     MOVELPRT21     $FPR21
     C                     MOVELPRT22     $FPR22
     C                     MOVELPRT23     $FPR23
     C                     MOVELPRT24     $FPR24
     C                     MOVELPRT25     $FPR25
     C                     MOVELPRT26     $FPR26
     C                     MOVELPRT27     $FPR27
     C                     MOVELPRT28     $FPR28
     C                     MOVELPRT29     $FPR29
     C                     MOVELPRT30     $FPR30
     C                     MOVELPRT31     $FPR31
     C                     MOVELPRT32     $FPR32
     C                     MOVELPRT33     $FPR33
     C                     MOVELPRT34     $FPR34
     C                     MOVELPRT35     $FPR35
     C                     MOVELPRT36     $FPR36
     C                     MOVELPRT37     $FPR37
     C                     MOVELPRT38     $FPR38
     C                     MOVELPRT39     $FPR39
     C                     MOVELPRT40     $FPR40
     C                     MOVELPRT41     $FPR41
     C                     MOVELPRT42     $FPR42
     C                     MOVELPRT43     $FPR43
     C                     MOVELPRT44     $FPR44
     C                     MOVELPRT45     $FPR45
     C                     MOVELPRT46     $FPR46
     C                     MOVELPRT47     $FPR47
     C                     MOVELPRT48     $FPR48
     C                     MOVELPRT49     $FPR49
     C                     MOVELPRT50     $FPR50
      *
     C                     ENDSR
      *******************************************************
      * CHECK PARENT
      *******************************************************
     C           #CHKP     BEGSR
      *
     C                     MOVE 'N'       PFLG    1
     C                     MOVELA2BHB1    P#SHN1
     C                     MOVELA2BHB2    P#SHN2
     C                     MOVELA2BHB3    P#SHN3
     C           P#PL01    CHAINFCEPL01B             99
      *
     C           *IN99     IFEQ *ON
     C                     MOVE 'Y'       PFLG
     C           1         DO   60        IX      20
     C           PRT,IX    IFNE *BLANK
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELA2SHIN    PRT,IX
     C                     LEAVE
     C                     ENDDO
     C                     ENDIF
      *
     C                     ENDSR
      *******************************************************
      * GENERATION 2
      *******************************************************
     C           #GEN2     BEGSR
      *
     C                     MOVELP#SHN1    G2SHN1           AA061
     C                     MOVELP#SHN2    G2SHN2
     C                     MOVELP#SHN3    G2SHN3
     C           G2PL01    SETLLFCEPL01B
     C                     DO   *HIVAL
     C           G2PL01    READEFCEPL01B                 92
     C   92                LEAVE
     C                     EXSR #CHKP                      IAF IS P?
     C           PFLG      IFEQ 'N'
     C                     EXSR #GEN3
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *******************************************************
      * GENERATION 3
      *******************************************************
     C           #GEN3     BEGSR
      *
     C                     MOVELP#SHN1    G3SHN1           90119
     C                     MOVELP#SHN2    G3SHN2
     C                     MOVELP#SHN3    G3SHN3
     C           G3PL01    SETLLFCEPL01B
     C                     DO   *HIVAL
     C           G3PL01    READEFCEPL01B                 93
     C   93                LEAVE
     C                     EXSR #CHKP                      IAF IS P?
     C           PFLG      IFEQ 'N'
     C                     EXSR #GEN4
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *******************************************************
      * GENERATION 4
      *******************************************************
     C           #GEN4     BEGSR
      *
     C                     MOVELP#SHN1    G4SHN1           90119
     C                     MOVELP#SHN2    G4SHN2
     C                     MOVELP#SHN3    G4SHN3
     C           G4PL01    SETLLFCEPL01B
     C                     DO   *HIVAL
     C           G4PL01    READEFCEPL01B                 93
     C   93                LEAVE
     C                     EXSR #CHKP                      IAF IS P?
     C**         PFLG      IFEQ 'N'
     C**                   EXSR #GEN5
     C**                   ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *******************************************************
      * INITIAL SET
      *******************************************************
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $CPART 12
     C                     PARM           $FPR01 12
     C                     PARM           $FPR02 12
     C                     PARM           $FPR03 12
     C                     PARM           $FPR04 12
     C                     PARM           $FPR05 12
     C                     PARM           $FPR06 12
     C                     PARM           $FPR07 12
     C                     PARM           $FPR08 12
     C                     PARM           $FPR09 12
     C                     PARM           $FPR10 12
     C                     PARM           $FPR11 12
     C                     PARM           $FPR12 12
     C                     PARM           $FPR13 12
     C                     PARM           $FPR14 12
     C                     PARM           $FPR15 12
     C                     PARM           $FPR16 12
     C                     PARM           $FPR17 12
     C                     PARM           $FPR18 12
     C                     PARM           $FPR19 12
     C                     PARM           $FPR20 12
     C                     PARM           $FPR21 12
     C                     PARM           $FPR22 12
     C                     PARM           $FPR23 12
     C                     PARM           $FPR24 12
     C                     PARM           $FPR25 12
     C                     PARM           $FPR26 12
     C                     PARM           $FPR27 12
     C                     PARM           $FPR28 12
     C                     PARM           $FPR29 12
     C                     PARM           $FPR30 12
     C                     PARM           $FPR31 12
     C                     PARM           $FPR32 12
     C                     PARM           $FPR33 12
     C                     PARM           $FPR34 12
     C                     PARM           $FPR35 12
     C                     PARM           $FPR36 12
     C                     PARM           $FPR37 12
     C                     PARM           $FPR38 12
     C                     PARM           $FPR39 12
     C                     PARM           $FPR40 12
     C                     PARM           $FPR41 12
     C                     PARM           $FPR42 12
     C                     PARM           $FPR43 12
     C                     PARM           $FPR44 12
     C                     PARM           $FPR45 12
     C                     PARM           $FPR46 12
     C                     PARM           $FPR47 12
     C                     PARM           $FPR48 12
     C                     PARM           $FPR49 12
     C                     PARM           $FPR50 12
      *
     C           G1PL01    KLIST
     C                     KFLD           G1SHN1  5
     C                     KFLD           G1SHN2  5
     C                     KFLD           G1SHN3  2
      *
     C           G2PL01    KLIST
     C                     KFLD           G2SHN1  5
     C                     KFLD           G2SHN2  5
     C                     KFLD           G2SHN3  2
      *
     C           G3PL01    KLIST
     C                     KFLD           G3SHN1  5
     C                     KFLD           G3SHN2  5
     C                     KFLD           G3SHN3  2
      *
     C           G4PL01    KLIST
     C                     KFLD           G4SHN1  5
     C                     KFLD           G4SHN2  5
     C                     KFLD           G4SHN3  2
      *
     C           P#PL01    KLIST
     C                     KFLD           P#SHN1  5
     C                     KFLD           P#SHN2  5
     C                     KFLD           P#SHN3  2
      *
     C                     MOVE *BLANK    PRT
     C                     MOVE *BLANK    $FPR01
     C                     MOVE *BLANK    $FPR02
     C                     MOVE *BLANK    $FPR03
     C                     MOVE *BLANK    $FPR04
     C                     MOVE *BLANK    $FPR05
     C                     MOVE *BLANK    $FPR06
     C                     MOVE *BLANK    $FPR07
     C                     MOVE *BLANK    $FPR08
     C                     MOVE *BLANK    $FPR09
     C                     MOVE *BLANK    $FPR10
     C                     MOVE *BLANK    $FPR11
     C                     MOVE *BLANK    $FPR12
     C                     MOVE *BLANK    $FPR13
     C                     MOVE *BLANK    $FPR14
     C                     MOVE *BLANK    $FPR15
     C                     MOVE *BLANK    $FPR16
     C                     MOVE *BLANK    $FPR17
     C                     MOVE *BLANK    $FPR18
     C                     MOVE *BLANK    $FPR19
     C                     MOVE *BLANK    $FPR20
     C                     MOVE *BLANK    $FPR21
     C                     MOVE *BLANK    $FPR22
     C                     MOVE *BLANK    $FPR23
     C                     MOVE *BLANK    $FPR24
     C                     MOVE *BLANK    $FPR25
     C                     MOVE *BLANK    $FPR26
     C                     MOVE *BLANK    $FPR27
     C                     MOVE *BLANK    $FPR28
     C                     MOVE *BLANK    $FPR29
     C                     MOVE *BLANK    $FPR30
     C                     MOVE *BLANK    $FPR31
     C                     MOVE *BLANK    $FPR32
     C                     MOVE *BLANK    $FPR33
     C                     MOVE *BLANK    $FPR34
     C                     MOVE *BLANK    $FPR35
     C                     MOVE *BLANK    $FPR36
     C                     MOVE *BLANK    $FPR37
     C                     MOVE *BLANK    $FPR38
     C                     MOVE *BLANK    $FPR39
     C                     MOVE *BLANK    $FPR40
     C                     MOVE *BLANK    $FPR41
     C                     MOVE *BLANK    $FPR42
     C                     MOVE *BLANK    $FPR43
     C                     MOVE *BLANK    $FPR44
     C                     MOVE *BLANK    $FPR45
     C                     MOVE *BLANK    $FPR46
     C                     MOVE *BLANK    $FPR47
     C                     MOVE *BLANK    $FPR48
     C                     MOVE *BLANK    $FPR49
     C                     MOVE *BLANK    $FPR50
      *
     C                     ENDSR
