     H            Y.
      ** UTLR79B**********************************************
      *  UTILITY- SELECT PRINTER OPTION                      *
      *  JW       2024.06.26                                 *
      *---------------------------------
      *  CALLING SEQ.
      *                    CALL 'UTLR79B'
      *                    PARM           $PRT01 25
      *                    PARM           $PRT02 25
      *                    PARM           $PRT03 25
      *                    PARM           $PRT04 25
      *                    PARM           $PRT05 25
      *                    PARM           $PRT06 25
      *                    PARM           $PRT07 25
      *                    PARM           $PRT08 25
      *                    PARM           $OUTQ  10
      *                    PARM           $RTN    1
      *  IN  $PRT01: 25A PRINTER NAME 1
      *      $PRT02: 25A PRINTER NAME 2
      *      $PRT03: 25A PRINTER NAME 3
      *      $PRT04: 25A PRINTER NAME 4
      *      $PRT05: 25A PRINTER NAME 5
      *      $PRT06: 25A PRINTER NAME 6
      *      $PRT07: 25A PRINTER NAME 7
      *      $PRT08: 25A PRINTER NAME 8
      *  OUT $OUTQ : 10A OUTQ
      *      $RTN  :  1A RETURN CODE (BLANK/*)
      *------------------------------------------------------
      *
      ********************************************************
     FUTLPW79BCF  E                    WORKSTN
      *
     E                    ERR     1   4 60
     E                    PRT         8 25
      *
     I            DS
     I                                        1 200 PRT
     I                                        1  25 XPRT01
     I                                       26  50 XPRT02
     I                                       51  75 XPRT03
     I                                       76 100 XPRT04
     I                                      101 125 XPRT05
     I                                      126 150 XPRT06
     I                                      151 175 XPRT07
     I                                      176 200 XPRT08
      *-----------------------------------------------------------*
      *     M  A  I  N   R O U T I N E                            *
      *-----------------------------------------------------------*
     C                     EXSR #INIT
      *
     C           PCNT      IFNE 0
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      @DSP1
     C                     ENDCS
     C                     ENDDO
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *************************************************************
      *  DISPLAY 1
      *************************************************************
     C           @DSP1     BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANKS   XMSG
     C                     MOVE *OFF      *IN85
     C                     MOVE *OFF      *IN41
      * F1: CANCEL
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      W@ID
     C                     MOVE '*'       $RTN
     C                     GOTO @END1
     C                     ENDIF
      *
     C                     EXSR #CHK1
      * F5: RUN
     C           *IN85     IFEQ *OFF
     C           *INKE     IFEQ *ON
     C                     MOVEL'99'      W@ID
     C                     GOTO @END1
     C                     ENDIF
      *
     C                     MOVEL'01'      W@ID
     C                     MOVELERR,2     XMSG
     C                     GOTO @END1
     C                     ENDIF
      *
     C           @END1     ENDSR
      *************************************************************
      *  CHECK OPTION
      *************************************************************
     C           #CHK1     BEGSR
      *
     C           XOPT      IFEQ '1'
     C           XOPT      OREQ '2'
     C           XOPT      OREQ '3'
     C           XOPT      OREQ '4'
     C           XOPT      OREQ '5'
     C           XOPT      OREQ '6'
     C           XOPT      OREQ '7'
     C           XOPT      OREQ '8'
     C                     ELSE
     C                     MOVELERR,1     XMSG
     C                     SETON                     4185
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C                     MOVELXOPT      @OPT    10
     C           @OPT      IFGT PCNT
     C           @OPT      ANDNE9
     C                     MOVELERR,1     XMSG
     C                     SETON                     4185
     C                     GOTO XCHK1
     C                     ENDIF
      * IF NO ERROR...
     C           *IN85     IFEQ *OFF
     C           @OPT      IFEQ 9                          9 FOR PROGRAMMER
     C                     MOVEL'QDKT'    $OUTQ     P
     C                     ELSE
     C                     Z-ADD@OPT      IX      10
     C                     MOVE PRT,IX    LTR8    8
     C                     MOVELLTR8      $OUTQ
     C                     ENDIF
     C                     ENDIF
      *
     C           XCHK1     ENDSR
      *************************************************************
      * INITIAL SET
      *************************************************************
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $PRT01 25
     C                     PARM           $PRT02 25
     C                     PARM           $PRT03 25
     C                     PARM           $PRT04 25
     C                     PARM           $PRT05 25
     C                     PARM           $PRT06 25
     C                     PARM           $PRT07 25
     C                     PARM           $PRT08 25
     C                     PARM           $OUTQ  10
     C                     PARM           $RTN    1
      *
     C                     MOVE *BLANK    $RTN
     C                     MOVE *BLANK    $OUTQ
     C                     MOVEL'01'      W@ID    2
     C                     MOVE '*'       XOPT
      * MOVE TO TABLE
     C                     MOVEL$PRT01    XPRT01
     C                     MOVEL$PRT02    XPRT02
     C                     MOVEL$PRT03    XPRT03
     C                     MOVEL$PRT04    XPRT04
     C                     MOVEL$PRT05    XPRT05
     C                     MOVEL$PRT06    XPRT06
     C                     MOVEL$PRT07    XPRT07
     C                     MOVEL$PRT08    XPRT08
      * CHECK # OF PRINTER
     C                     SELEC
     C           $PRT01    WHEQ *BLANK
     C                     Z-ADD0         PCNT    10
     C                     MOVE '*'       $RTN
     C           $PRT02    WHEQ *BLANK
     C                     Z-ADD1         PCNT
     C           $PRT03    WHEQ *BLANK
     C                     Z-ADD2         PCNT
     C           $PRT04    WHEQ *BLANK
     C                     Z-ADD3         PCNT
     C           $PRT05    WHEQ *BLANK
     C                     Z-ADD4         PCNT
     C           $PRT06    WHEQ *BLANK
     C                     Z-ADD5         PCNT
     C           $PRT07    WHEQ *BLANK
     C                     Z-ADD6         PCNT
     C           $PRT08    WHEQ *BLANK
     C                     Z-ADD7         PCNT
     C                     OTHER
     C                     Z-ADD8         PCNT
     C                     ENDSL
      *
     C                     ENDSR
** (ERR) --------------------------------------------------> (60)
PRINTER OPTION IS INVALID !
PRESS F5 TO RUN...


