     H            Y.
     F** UTLR07D **********************************************
     F*  PROGRAM: UTILITY - STAMP LOG (SAVE PROGRAM PASS LOG) *
     F*  WRITTEN: JW (SRA) 2022.04.05                         *
     F*-------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR07D'
     F*                    PARM           $KEY   10
     F*                    PARM           $COM   30
     F*  IN  $KEY   :  10A : KEY (PROGRAM NAME)
     F*      $COM   :  30A : COMMENT PASSED FROM CL
     F******************************************************
     FUTLWP07DO   E                    DISK
ADD  FUTLPP07DO   E                    DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      *
     C           *ENTRY    PLIST
     C                     PARM           $KEY   10
     C                     PARM           $COM   30
      *
     C                     TIME           SDATE
     C                     MOVEL#WSID     U1WSID
     C                     MOVEL#USER     U1USER
     C                     MOVEL#PGM      U1PGM
     C                     Z-ADDTODAY     U1CRDT
     C                     Z-ADDNOW       U1CRTM
     C                     MOVEL$KEY      U1KEY
     C                     MOVEL$COM      U1COM
     C                     WRITEUTLWP7D1
ADD  C                     WRITEUTLPP7D1
     C                     SETON                     LR
     C                     RETRN
