     H            Y.
     F** UTLR50 *************************************************
     F*  UTILITY - CHECK DUPLICATE ORDER 1                      *
     F*  WRITTEN: JW (SRA)                                      *
     F*           09/02/2016                                    *
     F*  FUNCTION: CHECK ORDER BY NONY/NKOJ/NUKE/NOHZ/NOBN      *
     F*---------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR50'
     F*                    PARM           $NONY   4
     F*                    PARM           $NKOJ   1
     F*                    PARM           $NUKE   4
     F*                    PARM           $NOHZ   8
     F*                    PARM           $NOBN   2
     F*                    PARM           $RTN    1
     F*   IN  $NONY   4A DELIVERY#
     F*       $NKOJ   1A FACTORY
     F*       $NUKE   4A DOCK
     F*       $NOHZ   8A SHIP DATE
     F*       $NOBN   2A BIN#
     F*   OUT $RTN    1A RETURN FLAG (BLANK=OK, 1=ERROR)
     F******************************************************
     FAB#PL1A IF  E           K        DISK
     FAB#PL2J IF  E           K        DISK
      *--------------------------------------------------------
     E                    DAT        10  1
      *--------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $NOHZ   8
     C                     PARM           $NOBN   2
     C                     PARM           $RTN    1
      *
     C           KEY1      KLIST
     C                     KFLD           @NOHZ
     C                     KFLD           @NOBN
     C                     KFLD           @NONY
     C                     KFLD           $NKOJ
     C                     KFLD           $NUKE
      *
     C           KEY2      KLIST
     C                     KFLD           @NONY
     C                     KFLD           $NKOJ
     C                     KFLD           $NUKE
     C                     KFLD           @NOHZ
     C                     KFLD           @NOBN
      *
     C                     MOVEL$NOHZ     @NOHZ   80
     C                     MOVEL$NOBN     @NOBN   20
     C                     MOVEL$NONY     @NONY   40
     C                     MOVE *BLANK    $RTN
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      *
     C           KEY1      CHAINAB#PL1A              91
     C           *IN91     IFEQ *OFF
     C                     MOVE '1'       $RTN
     C                     GOTO ENDP
     C                     ENDIF
      *
     C           KEY2      CHAINAB#PL2J              92
     C           *IN92     IFEQ *OFF
     C                     MOVE '2'       $RTN
     C                     GOTO ENDP
     C                     ENDIF
      *
     C           ENDP      TAG
     C                     SETON                     LR
     C                     RETRN
