     H            Y.
     F** UTLR59B *******************************************
     F*  PROGRAM: UTILITY- GET CITY, STATE, ZIP, COUNTRY   *
     F*  WRITTEN: JW (SRA) 2024.08.27                      *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR59B'
     F*                    PARM           $DLV    4
     F*                    PARM           $CITY  50
     F*                    PARM           $STAT  50
     F*                    PARM           $ZIP   50
     F*                    PARM           $CNTR  50
     F*  IN  $DLV  :  4A DELIVERY#
     F*  OUT $ADDR1: 50A ADDRESS 1     ==== NOT FINISH YET ====
     F*      $ADDR2: 50A ADDRESS 2
     F*      $ADDR3: 50A ADDRESS 3
     F*      $ADDR4: 50A ADDRESS 4
     F*      $ADDR5: 50A ADDRESS 5
     F*      $ADDR6: 50A ADDRESS 6
     F******************************************************
     FEDIPL40 IF  E           K        DISK
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C           $DLV      CHAINEDIPL40              99
     C           *IN99     IFEQ *OFF
     C                     MOVELE4ADD1    $ADDR1
     C                     MOVELE4ADD2    $ADDR2
     C                     MOVELE4ADD3    $ADDR3
     C                     MOVELE4ADD4    $ADDR4
     C                     MOVELE4ADD5    $ADDR5
     C                     MOVELE4ADD6    $ADDR6
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $DLV    4
     C                     PARM           $ADDR1 50
     C                     PARM           $ADDR2 50
     C                     PARM           $ADDR3 50
     C                     PARM           $ADDR4 50
     C                     PARM           $ADDR5 50
     C                     PARM           $ADDR6 50
      *
     C                     MOVE *BLANK    $ADDR1
     C                     MOVE *BLANK    $ADDR2
     C                     MOVE *BLANK    $ADDR3
     C                     MOVE *BLANK    $ADDR4
     C                     MOVE *BLANK    $ADDR5
     C                     MOVE *BLANK    $ADDR6
      *
     C                     ENDSR
