     H            Y.
     F** UTLR02N ********************************************
     F*  GET NEXT BUSINESS DATE (TOMORROW)                  *
     F*  JW  2024.11.11                                     *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR02N'
     F*                    PARM           $DT8    8
     F*  OUT  $DT8  :  8A TODAY
     F*******************************************************
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     C*
     C           *ENTRY    PLIST
     C                     PARM           $DT8    8
      *
     C                     TIME           SDATE
      *
     C                     MOVE TODAY     $DT8
     C                     MOVE '+'       $SIGN
     C                     MOVE '0001'    $DAYS
     C                     MOVE 'Y'       $IAF
     C                     CALL 'UTLR10A'
     C                     PARM           $DT8    8
     C                     PARM           $SIGN   1
     C                     PARM           $DAYS   4
     C                     PARM           $IAF    1
     C                     PARM           $TGT8   8
     C                     PARM           $RTN    1
     C*
     C                     MOVEL$TGT8     $DT8
      *
     C                     SETON                     LR
     C                     RETRN
