     H            Y.
     F** UTLR31   ****************************************************
     F*  PROGRAM    : RETRIEVE USER NAME                             *
     F*  WRITTEN    : 10/26/2016                                     *
     F*  WRITTEN BY : JW (SRA)                                       *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR31'
     F*                    PARM           $USER  10
     F*                    PARM           $NAME  15
     F*   IN  $USER : 10A USER ID
     F*   OUT $NAME : 15A USER NAME
     F****************************************************************
     FRGAPL11 IF  E           K        DISK
      *---------------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ******************************************************
      *                    MAIN PROCESS
      ******************************************************
     C           *ENTRY    PLIST
     C                     PARM           $USER  10
     C                     PARM           $NAME  15
     C                     MOVE *BLANK    $NAME
      *
     C           $USER     CHAINRGAPL11              91
     C           *IN91     IFEQ *OFF
     C                     MOVELJ8NAME    $NAME
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
