     H            Y.
     F** UTLR11 ********************************************
     F*  PROGRAM: GET LATEST EFFECTIVE DATE OF PRICE M/F   *
     F*  WRITTEN: JW (SRA)                                 *
     F*           12/20/2016                               *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR12'
     F*                    PARM           $TOKU   4
     F*                    PARM           $NONY   4
     F*                    PARM           $HPRT1  5
     F*                    PARM           $HPRT2  5
     F*                    PARM           $HPRT3  5
     F*                    PARM           $HPRT4  5
     F*                    PARM           $DATE   8
     F*                    PARM           $RTN    1
     F*  IN  $TOKU  :  4A CUSTOMER#
     F*      $NONY  :  4A DELEIVERY CODE
     F*      $HPRT1 :  5A PART1 USER
     F*      $HPRT2 :  5A PART2
     F*      $HPRT3 :  5A PART3
     F*      $HPRT4 :  5A PART4
     F*  OUT $DATE  :  8A EFFECTIVE DATE
     F*      $RTN   :  1A RETURN
     F******************************************************
     FFBCPL07 IF  E           K        DISK
      *--------------------------------------------------------
     E                    DAT        10  1
     I            DS
     I                                        1   80FBEFHZ
     I                                        1   40FBTKYY
     I                                        5   60FBTKMM
     I                                        7   80FBTKDD
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      *
     C                     EXSR @INIT
      *
     C           KEY1      SETLLFBCPL07
     C           *IN98     DOWEQ*OFF
     C           KEY1      READEFBCPL07                  98
     C           *IN98     IFEQ *OFF
     C                     MOVELFBEFHZ    $DATE
     C                     ENDIF
     C                     ENDDO
      *
     C           $DATE     IFEQ '00000000'
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *=============================================================
      *                    INITIAL PROCESS
      *=============================================================
     C           @INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $HPRT1  5
     C                     PARM           $HPRT2  5
     C                     PARM           $HPRT3  5
     C                     PARM           $HPRT4  5
     C                     PARM           $DATE   8
     C                     PARM           $RTN    1
      *
     C           KEY1      KLIST
     C                     KFLD           KBTOKU
     C                     KFLD           KBNONY
     C                     KFLD           KBMHN1
     C                     KFLD           KBMHN2
     C                     KFLD           KBMHN3
     C                     KFLD           KBMHN4
     C           *LIKE     DEFN FBTOKU    KBTOKU
     C           *LIKE     DEFN FBNONY    KBNONY
     C           *LIKE     DEFN FBMHN1    KBMHN1
     C           *LIKE     DEFN FBMHN2    KBMHN2
     C           *LIKE     DEFN FBMHN3    KBMHN3
     C           *LIKE     DEFN FBMHN4    KBMHN4
      *
     C                     MOVEL$TOKU     KBTOKU
     C                     MOVEL$NONY     KBNONY
     C                     MOVEL$HPRT1    KBMHN1
     C                     MOVEL$HPRT2    KBMHN2
     C                     MOVEL$HPRT3    KBMHN3
     C                     MOVEL$HPRT4    KBMHN4
     C                     CLEAR$RTN
     C                     MOVE *ALL'0'   $DATE
      *
     C                     ENDSR
