     H            Y.
     F** UTLR02Y ********************************************
     F*  GET YESTERDAY                                      *
     F*  JW  2024.05.021                                    *
     F*-----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR02Y'
     F*                    PARM           $DT8    8
     F*  OUT  $DT8  :  8A YESTERDAY
     F*******************************************************
     C*
     C           *ENTRY    PLIST
     C                     PARM           $DT8    8
      *
     C                     MOVE *BLANK    $DT8
     C                     MOVE '-'       $SIGN
     C                     MOVE '0001'    $DAYS
     C                     MOVE 'N'       $IAF
     C                     CALL 'UTLR10A'
     C                     PARM           $DT8    8
     C                     PARM           $SIGN   1
     C                     PARM           $DAYS   4
     C                     PARM           $IAF    1
     C                     PARM           $TGT8   8
     C                     PARM           $RTN    1
     C*
     C                     MOVEL$TGT8     $DT8
     C*
     C                     SETON                     LR
     C                     RETRN
