     H            Y.
     F** UTLR57 ********************************************
     F*  PROGRAM: UTILITY- GET SAFETY INVENTORY BY PART#   *
     F*  WRITTEN: JW (SRA) 2018.12.21                      *
JW1  F*  JW     : 2019.11.13 ADD CALL UTLR21B              *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR67'
     F*                    PARM           $SHN   12
     F*                    PARM           $DATE   8
     F*                    PARM           $MAXH   3
     F*                    PARM           $RTN    1
     F*  IN  $SHN  : 12A IAF PART
     F*      $DATE :  8A  TARGET DATE  (YYYYMMDD) : BLANK = TODAY
     F*  OUT $MAXH :  3A SAFETY INVENTORY  (OVERLAP + DIFFERENCE)
     F*      $RTN  :  1A RETURN CODE (BLANK/*)
     F******************************************************
     FAAFPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FAAPPL03 IF  E           K        DISK
     FAANPL03 IF  E           K        DISK
      *===================================================
      * SYSTEM DATE
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      * LOCATION
     I            DS
     I                                        1   6 K@LOC
     I                                        1   1 K@LOC1
     I                                        2   3 K@LOC2
     I                                        4   5 K@LOC3
     I                                        6   6 K@LOC4
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      * GET LAST LOCATION
     C                     MOVEL$SHIN     P@SHIN
     C                     CALL 'UTLR21B'
     C                     PARM           P@SHIN 12
ADD  C                     PARM           $DATE   8
     C                     PARM           $LLOC   6
     C                     PARM           $LQC    50
     C                     PARM           $LPRC   3
     C                     PARM           $LDPT   40
     C                     PARM           $LMCN   3
     C                     PARM           $ZETI   4
     C                     PARM           $MQTY   90
     C                     PARM           $RTN1   1
      *
     C                     EXSR #AAF
      *
     C           $MAXH     IFEQ *BLANK
     C                     EXSR #AAH
     C                     ENDIF
      *
     C           $MAXH     IFEQ *BLANK
     C                     EXSR #AAP
     C                     ENDIF
      *
     C           $MAXH     IFEQ *BLANK
     C                     EXSR #AAN
     C                     ENDIF
      *
     C           $MAXH     IFEQ *BLANK
     C                     MOVEL'0000'    $MAXH
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *===================================================
      *          CHECK AAF
      *===================================================
     C           #AAF      BEGSR
      *
     C                     MOVEL$LLOC     K@LOC
     C           LOCKEY    SETLLAAFPL03
     C                     DO   *HIVAL
     C           LOCKEY    READEAAFPL03                  88
     C   88                LEAVE
      *
     C           A3SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           A3DUPH    IFEQ 0
     C           A3HLTS    ANDEQ0
     C                     ITER
     C                     ENDIF
      *
     C           @DATE     IFLT A3UKHZ
     C           @DATE     ORGT A3STHZ
     C                     ITER
     C                     ENDIF
      *
     C**                   MOVELA3DUPH    $MAXH
     C           A3HLTS    ADD  A3DUPH    @NUM3   30
     C                     MOVEL@NUM3     $MAXH
     C                     LEAVE
      *
     C                     ENDDO
      *
     C                     ENDSR
      *===================================================
      *          CHECK AAH
      *===================================================
     C           #AAH      BEGSR
      *
     C                     MOVEL$LLOC     K@LOC
     C           LOCKEY    SETLLAAHPL03
     C                     DO   *HIVAL
     C           LOCKEY    READEAAHPL03                  88
     C   88                LEAVE
      *
     C           L6SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           L6DUPH    IFEQ 0
     C           L6HLTS    ANDEQ0
     C                     ITER
     C                     ENDIF
      *
     C           @DATE     IFLT L6UKHZ
     C           @DATE     ORGT L6STHZ
     C                     ITER
     C                     ENDIF
      *
     C**                   MOVELL6DUPH    $MAXH
     C           L6HLTS    ADD  L6DUPH    @NUM3   30
     C                     MOVEL@NUM3     $MAXH
     C                     LEAVE
      *
     C                     ENDDO
      *
     C                     ENDSR
      *===================================================
      *          CHECK AAP
      *===================================================
     C           #AAP      BEGSR
      *
     C                     MOVEL$LLOC     K@LOC
     C           LOCKEY    SETLLAAPPL03
     C                     DO   *HIVAL
     C           LOCKEY    READEAAPPL03                  88
     C   88                LEAVE
      *
     C           L5SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           L5DUPH    IFEQ 0
     C           L5HLTS    ANDEQ0
     C                     ITER
     C                     ENDIF
      *
     C           @DATE     IFLT L5UKHZ
     C           @DATE     ORGT L5STHZ
     C                     ITER
     C                     ENDIF
      *
     C**                   MOVELL5DUPH    $MAXH
     C           L5HLTS    ADD  L5DUPH    @NUM3   30
     C                     MOVEL@NUM3     $MAXH
     C                     LEAVE
      *
     C                     ENDDO
      *
     C                     ENDSR
      *===================================================
      *          CHECK AAN
      *===================================================
     C           #AAN      BEGSR
      *
     C                     MOVEL$LLOC     K@LOC
     C           LOCKEY    SETLLAANPL03
     C                     DO   *HIVAL
     C           LOCKEY    READEAANPL03                  88
     C   88                LEAVE
      *
     C           L7SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           L7DUPH    IFEQ 0
     C           L7HLTS    ANDEQ0
     C                     ITER
     C                     ENDIF
      *
     C           @DATE     IFLT L7UKHZ
     C           @DATE     ORGT L7STHZ
     C                     ITER
     C                     ENDIF
      *
     C**                   MOVELL7DUPH    $MAXH
     C           L7HLTS    ADD  L7DUPH    @NUM3   30
     C                     MOVEL@NUM3     $MAXH
     C                     LEAVE
      *
     C                     ENDDO
      *
     C                     ENDSR
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $SHIN  12
ADD  C                     PARM           $DATE   8
     C                     PARM           $MAXH   3
     C                     PARM           $RTN    1
      *
     C           LOCKEY    KLIST
     C                     KFLD           K@LOC1  1
     C                     KFLD           K@LOC2  2
     C                     KFLD           K@LOC3  2
     C                     KFLD           K@LOC4  1
      * SYSTEM DATE
     C                     TIME           SDATE
      *
     C           $DATE     IFEQ *BLANK
     C           $DATE     OREQ '00000000'
     C                     MOVELTODAY     $DATE
     C                     ENDIF
     C                     MOVEL$DATE     @DATE   80
      *
     C                     MOVE *BLANK    $MAXH
     C                     MOVE *BLANK    $RTN
      *
     C                     ENDSR
      *====================================================
