     H            Y.
     F** UTLR62 ********************************************
     F*  PROGRAM: UTILITY- RETRIEVE CUSTOMER GROUP CODE    *
     F*  WRITTEN: JW (SRA)  2018.05.03                     *
     F*  -------------------------------                   *
     F*  * SEE SIMILAR FUNCTION --> UTLR16, UTLR62B        *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR62'
     F*                    PARM           $DLV    4
     F*                    PARM           $GRP    3
     F*                    PARM           $NAME1 15
     F*                    PARM           $NAME2 50
     F*                    PARM           $RTN    1
     F*  IN  $DLV  :  4A DELIVERY#
     F*  OUT $GRP  :  3A GROUP CODE
     F*      $NAME1: 15A SHORT NAME
     F*      $NAME2: 50A SHIP TO NAME
     F*      $RTN  :  1A RETURN CODE (BLANK/*)
     F*  *   GROUP: TYT=TOYOTA, HND=HONDA, FRD=FORD
     F******************************************************
     FEDIPP42 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FEDIPL40 IF  E           K        DISK
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
      * GET GROUP CODE FROM EDIPP42
     C           $DLV      CHAINEDIPP42              99
     C           *IN99     IFEQ *OFF
     C                     MOVELE4GRP     $GRP
     C                     ELSE
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
      * GET NAME1 FROM FGBPL01
     C                     MOVEL$DLV      @NONY   40
     C           @NONY     CHAINFGBPL01              98
     C           *IN98     IFEQ *OFF
     C                     MOVELB2SMEI    $NAME1
     C                     ELSE
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
      * GET NAME2 FROM EDIPL40
     C           $DLV      CHAINEDIPL40              97
     C           *IN97     IFEQ *OFF
     C                     MOVELE4ADD1    $NAME2
     C                     ELSE
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $DLV    4
     C                     PARM           $GRP    3
     C                     PARM           $NAME1 15
     C                     PARM           $NAME2 50
     C                     PARM           $RTN    1
      *
     C                     MOVE *BLANK    $GRP
     C                     MOVE *BLANK    $NAME1
     C                     MOVE *BLANK    $NAME2
     C                     MOVE *BLANK    $RTN
      *
     C                     ENDSR
      *====================================================
