     H            Y.
     F* UTLR31E  ****************************************************
     F* PROGRAM   : GET PART NAME BY CUSTOMER PART#                 *
     F* WRITTEN   : J.WATANABE    2025.07.24                        *
     F*-------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR31E '
     F*                    PARM           $NONY   4
     F*                    PARM           $MHIN  20
     F*                    PARM           $NAME  15
     F*   IN  $NONY :  4A DLIVERY CODE
     F*   IN  $MHIN : 20A CUSTOMER PART#
     F*   OUT $NAME : 15A PART NAME
     F****************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ******************************************************
      *                    MAIN PROCESS
      ******************************************************
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $MHIN  20
     C                     PARM           $NAME  15
     C                     MOVE *BLANK    $NAME
      * GET MHIN
     C                     MOVE *BLANK    $TOKU
     C                     MOVE $NONY     $NONY
     C                     MOVE *BLANK    $NKOJ
     C                     MOVE *BLANK    $NUKE
     C                     MOVE $MHIN     $MHIN
     C                     CALL 'BBHR51'                        *
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $MHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @FLG    1
      * GET NAME
     C                     CALL 'UTLR31C'
     C                     PARM           $SHIN  12
     C                     PARM           $NAME
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
