     H            Y.
     F** UTLR52A ***************************************************
     F*  UTILITY - RETRIEVE PACKING LIST TYPE                      *
     F*  WRITTEN: JW (SRA)  2025.03.03                             *
     F*------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR52A'
     F*                    PARM           $NONY   4
     F*                    PARM           $PTYP   2
     F*   IN  $NONY   4  DELIVERY
     F*   OUT $PTYP   2  PACKING LIST TYPE
     F******************************************************
     FAB#PL90 IF  E           K        DISK
      *--------------------------------------------------------
      *
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $PTYP   2
     C                     MOVE *BLANK    $PTYP
      *
     C           $NONY     SETLLAB#PL90
     C                     DO   *HIVAL
     C           $NONY     READEAB#PL90                  98
     C   98                LEAVE
      *
     C                     MOVELYATYPE    $PTYP
     C                     LEAVE
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
