     H            Y.
     F** UTLR21E *******************************************
     F*  PROGRAM: GET FINAL LOCATION BY IAF PART# (V.3)    *
     F*  WRITTEN: JW (SRA)  2025.08.01                     *
     F*  -----------------------------                     *
     F*  JW    2025.08.01 ADD $WGT TO UTLR21B              *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR21E'
     F*                    PARM           $SHIN  12
     F*                    PARM           $DATE   8
     F*                    PARM           $LLOC   6
     F*                    PARM           $LQC    50
     F*                    PARM           $LPRC   3
     F*                    PARM           $LDPT   40
     F*                    PARM           $LMCN   3
     F*                    PARM           $ZETI   4
     F*                    PARM           $MQTY   90
     F*                    PARM           $WGT    72
     F*  IN  $SHIN : 12A  IAF PART
     F*      $DATE :  8A  TARGET DATE  (YYYYMMDD) : BLANK = TODAY
     F*  OUT $LLOC :  6A  CURRENT LAST/FINAL LOCATION
     F*      $LQC  :  5,0 CURRENT QPC
     F*      $LPRC :  3A  LAST/FINAL PROCESS
     F*      $LDPT :  4,0 LAST/FINAL DEPARTMENT
     F*      $LMCN :  3A  LAST/FINAL MACHINE
     F*      $ZETI :  4A  ID#   (BLANK=PART MASTER NOT FOUND)
     F*      $MQTY :  9,0 MONTHLY SETTING QTY
     F*      $WGT  :  7,2 WEIGHT
     F*  ** WHEN $ZETI=BLANK, IT MEANS PART MASTER NOT FOUND
     F******************************************************
     FFCEPL01 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     F******************************************************
     E                    PRN        15  3
     E                    PRX        15  3
     E                    DPN        15  4 0
     E                    DPX        15  4 0
     E                    LCN        15  6
     E                    LCX        15  6
     E                    MCN        15  3
     E                    MCX        15  3
     E                    CHG        15 10 0
      * PROCESS TABLE NEW
     I            DS
     I                                        1  45 PRN
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
      * PROCESS TABLE OLD
     I            DS
     I                                        1  45 PRX
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
      * DEPT TABLE NEW
     I            DS
     I                                        1  600DPN
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
      * DEPT TABLE OLD
     I            DS
     I                                        1  600DPX
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
      * LOCATION NEW
     I            DS
     I                                        1  90 LCN
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
      * LOCATION OLD
     I            DS
     I                                        1  90 LCX
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
      * MACHINE TABLE NEW
     I            DS
     I                                        1  45 MCN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
      * MACHINE TABLE OLD
     I            DS
     I                                        1  45 MCX
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN00
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
      * CHG DATE
     I            DS
     I                                        1 1500CHG
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
      * CHG DATE
     I            DS
     I                                        1  100WSCHG
     I                                        1   80@@CHG
      * Q/C CHG DATE
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1  12 @WSHN
     I                                        1   5 @WSHN1
     I                                        6  10 @WSHN2
     I                                       11  12 @WSHN3
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        1   20WSHH
     I                                        3   40WSMN
     I                                        5   60WSSS
     I                                        7  100WSYY
     I                                       11  120WSMM
     I                                       13  140WSDD
     I                                        1   40WSTM4
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
     C                     EXSR @INIT
      *
     C           KEY1      CHAINFCEPL01              99
     C           *IN99     IFEQ *OFF
     C                     EXSR @FCE
     C                     EXSR @AAM
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *=============================================================
      * GET DATA FROM FCEPP11
      *=============================================================
     C           @FCE      BEGSR
      * Q/C
     C           A2SYHZ    IFGT @DATE
     C                     Z-ADDA2KSYS    $LQC
     C                     ELSE
     C                     Z-ADDA2SSYS    $LQC
     C                     ENDIF
      * ZETI
     C                     MOVELA2ZETI    $ZETI
      * MONTHLY SETTING QTY
     C                     Z-ADDA2GEKN    $MQTY
      * WEIGHT
     C                     Z-ADDA2KASI    $WGT
      *
     C                     ENDSR
      *=============================================================
      * GET DATA FROM AAMPP11
      *=============================================================
     C           @AAM      BEGSR
      *
     C           KEY1      CHAINAAMPL11              98
     C           *IN98     IFEQ *OFF
      * LAST VALUE
     C           1         DO   15        IX      20
     C                     Z-ADDCHG,IX    WSCHG
      *
     C           @@CHG     IFLE @DATE
     C           PRN,IX    IFEQ *BLANK
     C                     LEAVE
     C                     ELSE
     C                     EXSR #NEW
     C                     ENDIF
     C                     ENDIF
      *
     C           @@CHG     IFGT @DATE
     C           PRX,IX    IFEQ *BLANK
     C                     LEAVE
     C                     ELSE
     C                     EXSR #OLD
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDDO
     C                     ENDIF
      *
     C                     ENDSR
      *=============================================================
      * GET DATA FROM NEW TABLE
      *=============================================================
     C           #NEW      BEGSR
      *
     C           LCN,IX    IFNE *BLANK
     C                     MOVELLCN,IX    $LLOC
     C                     ENDIF
      *
     C           PRN,IX    IFNE *BLANK
     C                     MOVELPRN,IX    $LPRC
     C                     ENDIF
      *
     C           DPN,IX    IFNE 0
     C                     Z-ADDDPN,IX    $LDPT
     C                     ENDIF
      *
     C           MCN,IX    IFNE *BLANK
     C                     MOVELMCN,IX    $LMCN
     C                     ENDIF
      *
     C                     ENDSR
      *=============================================================
      * GET DATA FROM OLD TABLE
      *=============================================================
     C           #OLD      BEGSR
      *
     C           LCX,IX    IFNE *BLANK
     C                     MOVELLCN,IX    $LLOC
     C                     ENDIF
      *
     C           PRX,IX    IFNE *BLANK
     C                     MOVELPRN,IX    $LPRC
     C                     ENDIF
      *
     C           DPX,IX    IFNE 0
     C                     Z-ADDDPN,IX    $LDPT
     C                     ENDIF
      *
     C           MCX,IX    IFNE *BLANK
     C                     MOVELMCX,IX    $LMCN
     C                     ENDIF
      *
     C                     ENDSR
      *=============================================================
      * INITIAL PROCESS
      *=============================================================
     C           @INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $SHIN  12
ADD  C                     PARM           $DATE   8
     C                     PARM           $LLOC   6
     C                     PARM           $LQC    50
     C                     PARM           $LPRC   3
     C                     PARM           $LDPT   40
     C                     PARM           $LMCN   3
     C                     PARM           $ZETI   4
ADD  C                     PARM           $MQTY   90
     C                     PARM           $WGT    72
      *
     C           KEY1      KLIST
     C                     KFLD           @WSHN1
     C                     KFLD           @WSHN2
     C                     KFLD           @WSHN3
      * RETRIEVE SYSTEM TIME
     C                     TIME           WSDT
      *
     C           $DATE     IFEQ *BLANK
     C           $DATE     OREQ '00000000'
     C                     MOVELTODAY     $DATE
     C                     ENDIF
     C                     MOVEL$DATE     @DATE   80
      *
     C                     CLEAR$LLOC
     C                     CLEAR$LQC
     C                     CLEAR$LPRC
     C                     CLEAR$LDPT
     C                     CLEAR$LMCN
     C                     CLEAR$ZETI
     C                     CLEAR$MQTY
     C                     CLEAR$WGT
      *
     C                     MOVEL$SHIN     @WSHN
      *
     C                     ENDSR
