     H            Y.
     F** UTLR35 ********************************************
     F*  GET QTY/BOX BY IAF PART / DATE                    *
     F*  WRITTEN: JW (SRA)  2020/06/02                     *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR35B'
     F*                    PARM           $SHIN  12
     F*                    PARM           $DATE   8
     F*                    PARM           $SRV    1
     F*                    PARM           $QPC    6
     F*                    PARM           $RTN    1
     F*  IN  $SHIN : 12A IAF PART
     F*      $DATE :  8A TARGET DATE
     F*      $SRV  :  1A CHECK SERVICE PART? (Y/N)
     F*  OUT $QPC  :  6A QTY/BOX (QPC)
     F*      $RTN  :  1A RETURN CODE (BLANK/*)
     F******************************************************
     FFCEPL01 IF  E           K        DISK
     FFCEPL30 IF  E           K        DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  12 @SHIN
     I                                        1   5 $SHN1
     I                                        6  10 $SHN2
     I                                       11  12 $SHN3
     I**                                     16  20 $SHN4
     I            DS
     I                                        1  12 K@SHIN
     I                                        1   5 K@SHN1
     I                                        6  10 K@SHN2
     I                                       11  12 K@SHN3
     I**                                     16  20 K@SHN4
      *
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1  140@SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      *
     C                     EXSR #INIT
      * GET QPC FROM FCEPP01
     C                     EXSR #MASS
      * GET QPC FROM FCEPP30
     C           $SRV      IFEQ 'Y'
     C           WSYOS     ANDEQ0
     C                     EXSR #SRV
     C                     ENDIF
      * END PROCESS
     C           ENDP      TAG
     C           WSYOS     IFEQ 0
     C                     MOVEL'*'       $RTN
     C                     ELSE
     C                     MOVELWSYOS     $QPC
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *=============================================================
      *  CHECK PASS PRODUCTION PART (FCEPP01)
      *=============================================================
     C           #MASS     BEGSR
      *
     C           KEY1      CHAINFCEPL01              92
     C           *IN92     IFEQ *OFF
     C           A2GSKD    ANDEQ*BLANK
     C           A2SYHZ    IFGT WDATE
     C                     Z-ADDA2KSYS    WSYOS            OLD
     C                     ELSE
     C                     Z-ADDA2SSYS    WSYOS            NEW
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *=============================================================
      *  CHECK SERVICE PART (FCEPP30)
      *=============================================================
     C           #SRV      BEGSR
      *
     C           KEY1      CHAINFCEPL30              93
     C           *IN93     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C           F3SYMD    IFGT WDATE
     C                     Z-ADDF3KSYS    WSYOS
     C                     ELSE
     C                     Z-ADDF3SSYS    WSYOS
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *=============================================================
      *                    INITIAL PROCESS
      *=============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $SHIN  12
     C                     PARM           $DATE   8
     C                     PARM           $SRV    1
     C                     PARM           $QPC    6
     C                     PARM           $RTN    1
      *
     C           KEY1      KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
      *
     C                     MOVEL'000000'  $QPC
     C                     MOVE *BLANK    $RTN
     C                     Z-ADD0         WSYOS   60
     C                     TIME           @SDATE
      *
     C                     MOVEL$SHIN     @SHIN
     C                     MOVEL$SHN1     K@SHN1
     C                     MOVEL$SHN2     K@SHN2
     C                     MOVEL$SHN3     K@SHN3
      *
     C           $SRV      IFNE 'Y'
     C                     MOVEL'N'       $SRV
     C                     ENDIF
      *
     C           $DATE     IFEQ *BLANK
     C           $DATE     OREQ '00000000'
     C                     Z-ADDTODAY     WDATE   80
     C                     ELSE
     C                     MOVEL$DATE     WDATE
     C                     ENDIF
      *
     C                     ENDSR
