     H            Y.
     F** UTLR62B***********************************************
     F*  PROGRAM: UTILITY- RETRIEVE CUSTOMER GROUP (BY ORDER) *
     F*  WRITTEN: JW (SRA)                                    *
     F*           10/16/2019                                  *
     F*  -------------------------------                      *
     F*  * SEE SIMILAR FUNCTION --> UTLR16, UTLR62            *
     F*-------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR62B'
     F*                    PARM           $DLV    4
     F*                    PARM           $GRP    3
     F*                    PARM           $NAME1 15
     F*                    PARM           $NAME2 50
     F*                    PARM           $RTN    1
     F*  IN  $DLV  :  4A DELIVERY#
     F*  OUT $GRP  :  3A GROUP CODE
     F*      $NAME1: 15A SHORT NAME
     F*      $NAME2: 50A SHIP TO NAME
     F*      $RTN  :  1A RETURN CODE (BLANK/*)
     F*  *   GROUP: TYT=TOYOTA, HND=HONDA, FRD=FORD
     F******************************************************
     FEDIPP42 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FEDIPL40 IF  E           K        DISK
     FAB#PLHN IF  E           K        DISK
     FABF9L01 IF  E           K        DISK
     FAB#PL11 IF  E           K        DISK
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      * GET GROUP
     C                     EXSR #GRP
      *
      * GET NAME1 FROM FGBPL01
     C           @NONY     CHAINFGBPL01              98
     C           *IN98     IFEQ *OFF
     C                     MOVELB2SMEI    $NAME1
     C                     ENDIF
      *
      * GET NAME2 FROM EDIPL40
     C           $DLV      CHAINEDIPL40              97
     C           *IN97     IFEQ *OFF
     C                     MOVELE4ADD1    $NAME2
     C                     ENDIF
      *
     C           $GRP      IFEQ *BLANK
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *======================================================
      * GET GROUP
      *======================================================
     C           #GRP      BEGSR
      * GET HONDA
     C           $GRP      IFEQ *BLANK
     C           @NONY     CHAINAB#PLHN              99
     C  N99                MOVEL'HND'     $GRP
     C                     ENDIF
      * GET FORD
     C           $GRP      IFEQ *BLANK
     C           $DLV      CHAINABF9L01              99
     C  N99                MOVEL'FRD'     $GRP
     C                     ENDIF
      * GET TOYOTA
     C           $GRP      IFEQ *BLANK
     C           @NONY     CHAINAB#PL11              99
     C           *IN99     IFEQ *OFF
     C           BATOKU    ANDEQ3411
     C                     MOVEL'TYT'     $GRP
     C                     ENDIF
     C                     ENDIF
      * EXCEPTION
     C                     SELEC
     C           $DLV      WHEQ '0541'
     C           $DLV      OREQ '0542'
     C                     MOVEL'TYT'     $GRP
     C                     ENDSL
      *
     C           $GRP      IFEQ *BLANK
     C           $DLV      CHAINEDIPP42              99
     C           *IN99     IFEQ *OFF
     C                     SELEC
     C           $GRP      WHEQ 'TYT'
     C                     MOVEL'*TY'     $GRP
     C           $GRP      WHEQ 'HND'
     C                     MOVEL'*HN'     $GRP
     C           $GRP      WHEQ 'FRD'
     C                     MOVEL'*FR'     $GRP
     C                     OTHER
     C                     MOVELE4GRP     $GRP
     C                     ENDSL
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $DLV    4
     C                     PARM           $GRP    3
     C                     PARM           $NAME1 15
     C                     PARM           $NAME2 50
     C                     PARM           $RTN    1
      *
     C                     MOVEL$DLV      @NONY   40
     C                     MOVE *BLANK    $GRP
     C                     MOVE *BLANK    $NAME1
     C                     MOVE *BLANK    $NAME2
     C                     MOVE *BLANK    $RTN
      *
     C                     ENDSR
      *====================================================
