     H            Y.
     F** UTLR34E  ****************************************************
     F*  PROGRAM    : UTILITY- GET DELIVERY# BY PLANT CODE ONLY      *
     F*             : (USING ADDRESS MASTER (ABF9P01)                *
     F*  WRITTEN    : 2022.02.14                                     *
     F*  WRITTEN BY : JW (SRA)                                       *
     F*--------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR34E'
     F*                    PARM           $PLNT   5
     F*                    PARM           $NONY1  4
     F*                    PARM           $NONY2  4
     F*   IN  $PLNT   5A  PLANT CODE
     F*   OUT $NONY1  4A  DELIVERY CODE 1
     F*       $NONY2  4A  DELIVERY CODE 2
     F****************************************************************
     FABFDL02 IF  E           K        DISK
      *---------------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ******************************************************
      *                    MAIN PROCESS
      ******************************************************
     C           *ENTRY    PLIST
     C                     PARM           $PLNT   5
     C                     PARM           $NONY1  4
     C                     PARM           $NONY2  4
      *
     C                     MOVE '0000'    $NONY1
     C                     MOVE '0000'    $NONY2
      *
     C           $PLNT     SETLLABFDL02
      *
     C                     DO   *HIVAL
     C           $PLNT     READEABFDL02                  91
     C   91                LEAVE
      *
     C           QASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      * SET
     C                     MOVELQANONY    XNONY   4
     C           $NONY1    IFEQ '0000'
     C                     MOVELXNONY     $NONY1
     C                     ELSE
     C           $NONY2    IFEQ '0000'
     C           $NONY1    ANDNEXNONY
     C                     MOVELXNONY     $NONY2
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
