     H            Y.
     F** UTLR31D  ****************************************************
     F*  PROGRAM    : RETRIEVE USER OR WORKER NAME                   *
     F*  WRITTEN    : 2023.06.07                                     *
     F*  WRITTEN BY : JW (SRA)                                       *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR31D'
     F*                    PARM           $USER  10
     F*                    PARM           $NAME  15
     F*   IN  $USER : 10A USER ID
     F*   OUT $NAME : 15A USER NAME
     F****************************************************************
     FRGAPL11 IF  E           K        DISK
      *---------------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ******************************************************
      *                    MAIN PROCESS
      ******************************************************
     C           *ENTRY    PLIST
     C                     PARM           $USER  10
     C                     PARM           $NAME  15
     C                     MOVE *BLANK    $NAME
      *
     C                     MOVEL$USER     @LTR5   5
     C                     MOVEL@LTR5     @LTR10 10 P
     C           @LTR10    CHAINRGAPL11              91
     C           *IN91     IFEQ *OFF
     C                     MOVELJ8NAME    $NAME
     C                     ENDIF
      * CHECK WORKER CD
     C           *IN91     IFEQ *ON
     C                     MOVEL$USER     @LTR6   6
     C                     MOVEL@LTR6     $WKCD     P
     C                     CALL 'UTLR31B'
     C                     PARM           $WKCD   6
     C                     PARM           $NAME  15
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
