     H            Y.
     F** UTLR51B ************************************************************
     F*  UTILITY - GET PACKING LIST# FROM XP01A (LABEL DATA)                *
     F*  WRITTEN: JW (SRA)   2024.10.08                                     *
     F*---------------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR51B'
     F*                    PARM           $CRHZ   8
     F*                    PARM           $FILE  10
     F*                    PARM           $USER  10
     F*                    PARM           $NONY   4
     F*                    PARM           $NOHZ   8
     F*                    PARM           $ODRN  10
     F*                    PARM           $PICK#  9
     F*   IN  $CRHZ   8  CRT DATE
     F*       $FILE  10  LABEL WORK FILE
     F*       $USER  10  CRT USER
     F*       $NONY   4  DELIVERY#
     F*       $NOHZ   8  SHIP DATE
     F*       $ODRN  10  ORDER#
     F*   OUT $PICK#  9  PICK SLIP#
     F******************************************************
     FAB#XL01AIF  E           K        DISK
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
     C                     EXSR #INIT
      *
     C           KEY1      SETLLAB#XL01A
      *
     C                     DO   *HIVAL
     C           KEY1      READEAB#XL01A                 98
     C   98                LEAVE
      *
     C           IXPL#     IFNE *BLANK
     C                     MOVELIXPL#     $PICK#
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $CRHZ   8
     C                     PARM           $FILE  10
     C                     PARM           $USER  10
     C                     PARM           $NONY   4
     C                     PARM           $NOHZ   8
     C                     PARM           $ODRN  10
     C                     PARM           $PICK#  9
      *
     C           KEY1      KLIST
     C                     KFLD           KXKOHZ
     C                     KFLD           KXWRKF
     C                     KFLD           KXKOUS
     C                     KFLD           KXNONY
     C                     KFLD           KXDEDT
     C                     KFLD           KXODRN
      * XXXX
     C           *LIKE     DEFN IXKOHZ    KXKOHZ
     C           *LIKE     DEFN IXWRKF    KXWRKF
     C           *LIKE     DEFN IXKOUS    KXKOUS
     C           *LIKE     DEFN IXNONY    KXNONY
     C           *LIKE     DEFN IXDEDT    KXDEDT
     C           *LIKE     DEFN IXODRN    KXODRN
      *
     C                     MOVEL$CRHZ     KXKOHZ
     C                     MOVEL$FILE     KXWRKF
     C                     MOVEL$USER     KXKOUS
     C                     MOVEL$NONY     KXNONY
     C                     MOVEL$NOHZ     KXDEDT
     C                     MOVEL$ODRN     KXODRN
      *
     C                     MOVE *BLANK    $PICK#
      *
     C                     ENDSR
