     H            Y.                                    1
     H** UTLR14 ****************************************************************
     H*  GET CURRENT/PREVIOUS MACHINE BY PART/CURRENT PROCESS
     H*  FROM AAMPP11
     H*  JW   08/07/2017
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR14'
     F*                    PARM           PMHIN1  5
     F*                    PARM           PMHIN2  5
     F*                    PARM           PMHIN3  2
     F*                    PARM           PMPRCC  3
     F*                    PARM           PMPRCP  3
     F*                    PARM           PMMCNC  3
     F*                    PARM           PMMCNP  3
     F*                    PARM           PMMCN1  3
     F*                    PARM           PMRTN   1
     F*   IN  PMHIN1:  5A PART1
     F*       PMHIN2:  5A PART2
     F*       PMHIN3:  2A PART3
     F*       PMPRCC:  3A CURRENT  PROCESS
     F*   OUT PMPRCP:  3A PREVIOUS PROCESS
     F*       PMMCNC:  3A CURRENT  MACHINE
     F*       PMMCNP:  3A PREVIOUS MACHINE
     F*       PMMCN1:  3A FIRST PROCESS MACHINE
     F*       PMRTN :  1A RETURN FLAG (BLANK=OK, *=ERROR)
     H**************************************************************************
     FAAMPL11 IF  E           K        DISK
      **************************************************************************
      * TABLE
     E                    PRC        15  3
     E                    MCN        15  3
     E                    LOC        15  6
      * PROCESS TABLE
     I            DS
     I                                        1  45 PRC
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I* MACHINE TABLE
     I            DS
     I                                        1  45 MCN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I* LOCATION TABLE
     I            DS
     I                                        1  90 LOC
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *----------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           PMHIN1  5
     C                     PARM           PMHIN2  5
     C                     PARM           PMHIN3  2
     C                     PARM           PMPRCC  3
     C                     PARM           PMPRCP  3
     C                     PARM           PMMCNC  3
     C                     PARM           PMMCNP  3
     C                     PARM           PMMCN1  3
     C                     PARM           PMRTN   1
      *
     C                     MOVE *BLANK    PMMCNP
     C                     MOVE *BLANK    PMMCNC
     C                     MOVE *BLANK    PMMCN1
     C                     MOVE *BLANK    PMRTN
      *
     C                     TIME           WSDT
      *
     C           K#AMP     KLIST
     C                     KFLD           PMHIN1
     C                     KFLD           PMHIN2
     C                     KFLD           PMHIN3
      *
     C           K#AMP     SETLLAAMPL11
     C           *IN99     DOWEQ*OFF
     C           K#AMP     READEAAMPL11                  99
     C           *IN99     IFEQ *OFF
     C           CKSKJY    ANDEQ*BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN99     IFEQ *ON
     C                     MOVE '*'       PMRTN
     C                     ELSE
     C                     MOVELMCN,1     PMMCN1
     C           1         DO   15        IX      20
     C           PMPRCC    IFEQ PRC,IX
     C                     MOVELMCN,IX    PMMCNC
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      * SET PREVIOUS MACHINE
     C                     Z-ADDIX        IY      20
     C           1         DO   15
     C                     SUB  1         IY      20
     C           IY        IFLE 0
     C                     LEAVE
     C                     ENDIF
     C           LOC,IY    IFNE '------'
     C                     MOVELPRC,IY    PMPRCP
     C                     MOVELMCN,IY    PMMCNP
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEL*ON       *INLR
     C                     RETRN
