     H            Y.
     F** UTLR74 ***********************************************************
     F*  UTILITY- GET NONY FROM AB#PPHN (HONDA)
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR74'
     F*                    PARM           $PLANT  3
     F*                    PARM           $SHCD  10
     F*                    PARM           $TOKU   4
     F*                    PARM           $NONY   4
     F*                    PARM           $RTN    1
     F*   IN  $PLANT  3A   HONDA PLANT CPDE
     F*       $SHCD  10A   HONDA SHIP TO CODE
     F*   OUT $TOKU   4A   CUSTOMER CODE
     F*       $NONY   4A   DELIVERY CODE
     F*       $RTN    1A   RETURN (BLANK: OK, *: ERROR)
     F******************************************************************
     FAB#PPHN IF  E           K        DISK
     F******************************************************************
     C                     EXSR #INIT
      *
     C                     MOVEL$$SHCD    @@SHP   4
     C                     EXSR #NONY
      *
     C           WKTOKU    IFNE 0
     C           WKNONY    ANDNE0
     C                     GOTO ENDP
     C                     ENDIF
      *
      * CHECK SHIP TO CODE MASTER
     C           K#SHC     KLIST
     C                     KFLD           K@PLNT  3
     C                     KFLD           K@SHCD 10
      *
     C                     MOVEL$$PLNT    K@PLNT
     C                     MOVEL$$SHCD    K@SHCD
      *
     C                     SETOF                     98
     C           K#SHC     SETGTAB#PPHN
     C                     DO   *HIVAL
     C           K#SHC     REDPEAB#PPHN                  98
     C   98                LEAVE
     C           AHSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C                     Z-ADDAHTOKU    WKTOKU
     C                     Z-ADDAHNONY    WKNONY
     C                     LEAVE
     C                     ENDDO
      * GET NONY FROM WILD CHARACTER(*)
     C           WKNONY    IFEQ 0
     C                     MOVEL'*'       K@SHCD    P
     C           K#SHC     CHAINAB#PPHN              98
     C           *IN98     IFEQ *OFF
     C           AHSKJY    ANDNE'D'
     C                     Z-ADDAHTOKU    WKTOKU
     C                     Z-ADDAHNONY    WKNONY
     C                     ENDIF
     C                     ENDIF
      *
     C           WKTOKU    IFEQ 0
     C           WKNONY    OREQ 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C           ENDP      TAG
     C                     MOVELWKTOKU    $TOKU
     C                     MOVELWKNONY    $NONY
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------
      * SET DELIVERY CODE
      *----------------------------------------------------
     C           #NONY     BEGSR
     C** PLANT CODE
     C                     SELEC
      * HMA ------------------------------------
     C           $$PLNT    WHEQ 'HMA'
     C                     Z-ADD0294      WKTOKU
     C** HMA & SHIP TO CODE
     C                     SELEC
     C           $$SHCD    WHEQ 'HMA1  03'
     C           $$SHCD    OREQ 'GNM01 B6'
     C           $$SHCD    OREQ '16245013'
     C                     Z-ADD0293      WKNONY
     C           @@SHP     WHEQ 'NSE4'
     C                     Z-ADD*ZERO     WKNONY
     C           $$SHCD    WHEQ '51062202'
     C                     Z-ADD0290      WKNONY
     C           $$SHCD    WHEQ '51388402'
     C                     Z-ADD0289      WKNONY
     C           $$SHCD    WHEQ '20143001'
     C                     Z-ADD0298      WKNONY
     C           $$SHCD    WHEQ 'GNM01 D2'
     C                     Z-ADD0288      WKNONY
     C           $$SHCD    WHEQ '51756701'
     C                     Z-ADD0287      WKNONY
     C           $$SHCD    WHEQ '51189503'
     C                     Z-ADD0299      WKNONY
     C           $$SHCD    WHEQ '50485601'
     C                     Z-ADD0284      WKNONY
     C                     OTHER
      **                   Z-ADD0294      WKNONY
     C                     ENDSL
      * V  -------------------------------------
     C           $$PLNT    WHEQ 'V  '
     C                     Z-ADD0294      WKTOKU
     C                     Z-ADD0293      WKNONY
      * HTM ------------------------------------
     C           $$PLNT    WHEQ 'HTM'
     C                     Z-ADD0296      WKTOKU
     C                     Z-ADD0296      WKNONY
      * MAP, PMC -------------------------------
     C           $$PLNT    WHEQ '200'
     C           $$PLNT    OREQ 'AP9'
     C           $$PLNT    OREQ 'MAP'
     C           $$PLNT    OREQ 'PMC'
     C                     Z-ADD0390      WKTOKU
     C** 200 AP9 MAP PMC & SHIP TO CODE
     C                     SELEC
     C           $$SHCD    WHEQ '51062202'
     C                     Z-ADD4127      WKNONY
     C           $$SHCD    WHEQ '50340001'
     C                     Z-ADD4128      WKNONY
     C           $$SHCD    WHEQ 'ARWNM1L9'
     C           $$SHCD    OREQ 'ARWNM1N4'
     C           $$SHCD    OREQ 'ARWNM1N6'
     C           $$SHCD    OREQ '06104301'
     C                     Z-ADD4155      WKNONY
     C           $$SHCD    WHEQ '16102012'
     C                     Z-ADD0392      WKNONY
     C           $$SHCD    WHEQ '51606101'
     C                     Z-ADD0394      WKNONY
     C           $$SHCD    WHEQ 'ARWNM1P4'
     C           $$SHCD    OREQ 'ARWNM1Q0'
     C           $$SHCD    OREQ 'ARWNM1Q4'
     C                     Z-ADD4129      WKNONY
     C           $$SHCD    WHEQ '51062201'
     C                     Z-ADD04131     WKNONY
     C           $$SHCD    WHEQ '51189503'
     C                     Z-ADD04130     WKNONY
     C           $$SHCD    WHEQ 'YMEINMB0'
     C                     Z-ADD4126      WKNONY
     C           $$SHCD    WHEQ '51964502'
     C                     Z-ADD3115      WKNONY
     C                     OTHER
     C**                   Z-ADD4126      WKNONY
     C                     ENDSL
      * A --------------------------------------
     C           $$PLNT    WHEQ 'A  '
     C                     Z-ADD0390      WKTOKU
     C                     Z-ADD4155      WKNONY
      * ELP ------------------------------------
     C           $$PLNT    WHEQ '210'
     C           $$PLNT    OREQ 'ELP'
     C           $$PLNT    OREQ 'TP9'
     C                     Z-ADD0390      WKTOKU
     C** 210 ELP TP9 & SHIP TO CODE
     C                     SELEC
     C           $$SHCD    WHEQ '13197007'
     C                     Z-ADD3126      WKNONY
     C           $$SHCD    WHEQ '51062202'
     C                     Z-ADD3127      WKNONY
     C           $$SHCD    WHEQ 'TNEXBU04'
     C           $$SHCD    OREQ 'ELPNM1O1'
     C           $$SHCD    OREQ '19065001'
     C                     Z-ADD3130      WKNONY
     C           $$SHCD    WHEQ '50340001'
     C                     Z-ADD3125      WKNONY
     C           $$SHCD    WHEQ '11031001'
     C                     Z-ADD3124      WKNONY
     C           $$SHCD    WHEQ '51143203'
     C                     Z-ADD0393      WKNONY
     C           $$SHCD    WHEQ '16102012'
     C                     Z-ADD0395      WKNONY
     C                     OTHER
      **                   Z-ADD3128      WKNONY
     C                     ENDSL
     C* 240 ------------------------------------
     C           $$PLNT    WHEQ '240'
     C                     Z-ADD5379      WKTOKU
     C                     Z-ADD5379      WKNONY
      * 260, IPS -------------------------------
     C           $$PLNT    WHEQ '260'
     C           $$PLNT    OREQ 'Q  '
     C           $$PLNT    OREQ 'QP9'
     C           $$PLNT    OREQ 'IPS'
     C                     Z-ADD0390      WKTOKU
     C           $$SHCD    IFEQ 'QIPS1 02'
     C                     Z-ADD0403      WKNONY
     C                     ELSE
     C**                   Z-ADD0402      WKNONY
     C                     END
      * AEP ---------------------------------------
     C           $$PLNT    WHEQ 'AEP'
     C           $$PLNT    OREQ 'N  '
     C                     Z-ADD0390      WKTOKU
     C                     Z-ADD2418      WKNONY
      * HMI ---------------------------------------
     C           $$PLNT    WHEQ 'HMI'
     C                     Z-ADD3135      WKTOKU
     C                     MOVEL$$SHCD    W@0005  5
     C** HMI & SHIP TO CODE
     C                     SELEC
     C           $$SHCD    WHEQ '50340001'
     C                     Z-ADD3134      WKNONY
     C           W@0005    WHEQ 'IOSL1'
     C                     Z-ADD3135      WKNONY
     C                     OTHER
     C**                   Z-ADD3136      WKNONY
     C                     ENDSL
      * HDM ---------------------------------------
     C           $$PLNT    WHEQ 'HDM'
     C                     Z-ADD00391     WKTOKU
     C                     Z-ADD00391     WKNONY
      * HCL ---------------------------------------
     C           $$PLNT    WHEQ 'HCL'
     C                     Z-ADD00391     WKTOKU
     C           $$SHCD    IFEQ '51918402'
     C                     Z-ADD00401     WKNONY
     C                     ELSE
     C**                   Z-ADD00286     WKNONY
     C                     END
      * TOH ---------------------------------------
     C           $$PLNT    WHEQ 'TOH'
     C           WKTOKU    IFEQ 0
     C                     Z-ADD1602      WKTOKU
     C                     ENDIF
     C           WKNONY    IFEQ 0
     C           $$SHCD    IFEQ 'NEX 3'
     C           $$SHCD    OREQ 'NEX  3'
     C                     Z-ADD1630      WKNONY
     C                     ELSE
     C                     Z-ADD1620      WKNONY
     C                     ENDIF
     C                     ENDIF
      * AHM ---------------------------------------
     C           $$PLNT    WHEQ 'AHM'
     C                     Z-ADD0400      WKTOKU
     C                     Z-ADD0411      WKNONY
      * HCM ---------------------------------------
     C           $$PLNT    WHEQ 'HCM'
     C           $$PLNT    OREQ 'C  '
     C                     Z-ADD0295      WKTOKU
      ** HCM & SHIP TO CODE
     C                     SELEC
     C           @@SHP     WHEQ 'SPS1'
     C           @@SHP     OREQ 'HCM1'
     C           $$SHCD    OREQ 'HCS1  09'
     C           $$SHCD    OREQ 'NMW1  U6'
     C           $$SHCD    OREQ 'NMW1  V0'
     C                     Z-ADD2021      WKNONY
     C           @@SHP     WHEQ 'SPS2'
     C           @@SHP     OREQ 'HCM2'
     C           @@SHP     OREQ 'HCM3'
     C                     Z-ADD2022      WKNONY
     C           @@SHP     WHEQ 'NIS2'
     C           @@SHP     OREQ 'NIS1'
     C           $$SHCD    OREQ '02157006'
     C           $$SHCD    OREQ '08172202'
     C           $$SHCD    OREQ '50670501'
     C           $$SHCD    OREQ 'NMW2  19'
     C           $$SHCD    OREQ 'NMW3  X7'
     C           $$SHCD    OREQ 'NMW1  X5'
     C           $$SHCD    OREQ 'NMW1  X6'
     C           $$SHCD    OREQ '50971901'
     C           $$SHCD    OREQ '06057001'
     C           $$SHCD    OREQ 'NMW1  Y6'
     C           $$SHCD    OREQ 'NMW1  Y3'
     C           $$SHCD    OREQ 'NMW1  Y8'
     C           $$SHCD    OREQ '14066002'
     C                     Z-ADD0295      WKNONY
     C           $$SHCD    WHEQ '52019103'
     C                     Z-ADD2031      WKNONY
     C           $$SHCD    WHEQ '01900701'
     C           $$SHCD    OREQ '01900751'
     C           $$SHCD    OREQ '50561151'
     C           $$SHCD    OREQ '50561101'
     C                     Z-ADD2020      WKNONY
     C           $$SHCD    WHEQ 'NFD2  H2'
     C           $$SHCD    OREQ 'NFD2  G3'
     C           $$SHCD    OREQ 'NFD2  G4'
     C           $$SHCD    OREQ '03684001'
     C           $$SHCD    OREQ 'NFD2  G5'
     C           $$SHCD    OREQ 'NFD1  A7'
     C           $$SHCD    OREQ 'NFD1  F2'
     C           $$SHCD    OREQ 'NFD1  A3'
     C           $$SHCD    OREQ 'NFD2  G6'
     C           $$SHCD    OREQ 'NFD1  A8'
     C           $$SHCD    OREQ 'NFD1  B0'
     C           $$SHCD    OREQ 'NFD1  H5'
     C           $$SHCD    OREQ 'NFD2  19'
     C           $$SHCD    OREQ 'NFD1  D8'
     C           $$SHCD    OREQ 'NFD1  D7'
     C           $$SHCD    OREQ 'NFD2  A1'
     C           $$SHCD    OREQ 'NFD1  I5'
     C           $$SHCD    OREQ 'NFD1  I6'
     C           $$SHCD    OREQ 'NFD1  I7'
     C           $$SHCD    OREQ 'NFD1  J6'
     C           $$SHCD    OREQ 'NFD1  J7'
     C           $$SHCD    OREQ 'NFD2  10'
     C           $$SHCD    OREQ 'NFD2  J0'
     C           $$SHCD    OREQ 'NFD2  J1'
     C           $$SHCD    OREQ 'NFD1  K2'
     C           $$SHCD    OREQ 'NFD1  K4'
     C           $$SHCD    OREQ 'NFD1  K3'
     C           $$SHCD    OREQ 'NFD1  K5'
     C           $$SHCD    OREQ 'NFD2  K9'
     C           $$SHCD    OREQ 'NFD2  L4'
     C           $$SHCD    OREQ 'NFD2  L5'
     C           $$SHCD    OREQ 'NFD2  L1'
     C           $$SHCD    OREQ 'NFD2  L6'
     C           $$SHCD    OREQ 'NFD1  20'
     C           $$SHCD    OREQ 'NFD2  L7'
     C           $$SHCD    OREQ 'NFD1  O7'
     C           $$SHCD    OREQ 'NFD1  M5'
     C           $$SHCD    OREQ '50235001'
     C           $$SHCD    OREQ 'NFD1  M0'
     C           $$SHCD    OREQ 'NFD1  M9'
     C           $$SHCD    OREQ 'NFD1  O2'
     C           $$SHCD    OREQ 'NFD1  M1'
     C           $$SHCD    OREQ 'NFD1  M6'
     C           $$SHCD    OREQ 'NFD1  M2'
     C           $$SHCD    OREQ 'NFD1  N0'
     C           $$SHCD    OREQ '01433001'
     C           $$SHCD    OREQ 'NFD1  N1'
     C           $$SHCD    OREQ 'NFD1  M7'
     C           $$SHCD    OREQ 'NFD1  P1'
     C           $$SHCD    OREQ 'NFD1  M3'
     C           $$SHCD    OREQ 'NFD2  P2'
     C           $$SHCD    OREQ 'NMW2  P4'
     C           $$SHCD    OREQ 'NMW2  Q1'
     C           $$SHCD    OREQ 'NMW2  Q3'
     C           $$SHCD    OREQ 'NMW1  P1'
     C           $$SHCD    OREQ '08172205'
     C           $$SHCD    OREQ 'NMW2  Q4'
     C           $$SHCD    OREQ 'NMW1  Q9'
     C           @@SHP     OREQ 'SPS3'
     C                     Z-ADD2023      WKNONY
     C           $$SHCD    WHEQ '20321002'
     C           $$SHCD    OREQ '20321006'
     C                     Z-ADD2019      WKNONY
     C           $$SHCD    WHEQ '06057001'
     C                     Z-ADD3001      WKNONY
     C           $$SHCD    WHEQ '50340001'
     C                     Z-ADD2025      WKNONY
     C           $$SHCD    WHEQ '51062202'
     C                     Z-ADD2026      WKNONY
     C           $$SHCD    WHEQ '11145001'
     C                     Z-ADD2027      WKNONY
     C           $$SHCD    WHEQ 'NMW1  R7'
     C           $$SHCD    OREQ 'NMW1  T6'
     C           $$SHCD    OREQ 'NMW1  R0'
     C           $$SHCD    OREQ 'NMW1  T7'
     C           $$SHCD    OREQ 'NMW1  R8'
     C           $$SHCD    OREQ 'NMW2  T0'
     C           $$SHCD    OREQ 'NMW1  R1'
     C           $$SHCD    OREQ 'NMW1  R9'
     C           $$SHCD    OREQ 'NMW1  R2'
     C           $$SHCD    OREQ 'NMW1  20'
     C           $$SHCD    OREQ 'NMW1  U4'
     C           $$SHCD    OREQ 'NMW1  U8'
     C           $$SHCD    OREQ 'NMW1  U5'
     C           $$SHCD    OREQ 'NMW1  V7'
     C           $$SHCD    OREQ 'NMW1  U9'
     C           $$SHCD    OREQ 'NMW1  W9'
     C           $$SHCD    OREQ 'NMW1  U7'
     C           $$SHCD    OREQ 'NMW1  V1'
     C           $$SHCD    OREQ 'NMW1  X0'
     C                     Z-ADD2028      WKNONY
     C           $$SHCD    WHEQ 'NMW2  S8'
     C           $$SHCD    OREQ 'NMW2  W3'
     C           $$SHCD    OREQ 'NMW2  W4'
     C           $$SHCD    OREQ 'NMW2  W5'
     C           $$SHCD    OREQ 'NMW1  Y9'
     C           $$SHCD    OREQ 'NMW1  Z2'
     C           $$SHCD    OREQ 'NMW1  AE'
     C           $$SHCD    OREQ 'NMW3  Z5'
     C           $$SHCD    OREQ 'NMW3  AC'
     C           $$SHCD    OREQ 'NMW1  AG'
     C           $$SHCD    OREQ 'NMW3  AK'
     C           $$SHCD    OREQ 'NMW1  AL'
     C                     Z-ADD2029      WKNONY
     C           $$SHCD    WHEQ 'S3P1  01'
     C           $$SHCD    OREQ 'S3P1  03'
     C                     Z-ADD2029      WKNONY
     C           $$SHCD    WHEQ 'S3P2  02'
     C                     Z-ADD2030      WKNONY
     C           $$SHCD    WHEQ '09094112'
     C                     Z-ADD3004      WKNONY
     C           $$SHCD    WHEQ '06075001'
     C                     Z-ADD2035      WKNONY
     C           $$SHCD    WHEQ '50274604'
     C                     Z-ADD2036      WKNONY
     C                     ENDSL
      * HSP -------------------------------------
     C**         $$PLNT    WHEQ 'HSP'
     C**                   SELEC
     C**         $$SHCD    WHEQ '51189503'
     C**                   Z-ADD0295      WKTOKU
     C**                   Z-ADD3003      WKNONY
     C**         $$SHCD    WHEQ '51189506'
     C**                   Z-ADD0295      WKTOKU
     C**                   Z-ADD0332      WKNONY
     C**                   ENDSL
      *
     C                     ENDSL
      *
     C                     ENDSR
      **************
      * INITIAL SET
      **************
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $$PLNT  3
     C                     PARM           $$SHCD 10
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $RTN    1
      *
     C                     MOVE *BLANK    $RTN
     C                     Z-ADD0         WKTOKU  40
     C                     Z-ADD0         WKNONY  40
      *
     C                     ENDSR
