     H            Y.
     H** UTLR65A **********************************************************
     H*  GET LAST 10 CHARACTERS
     H*----------------------------------------------------*
     H*  CALLING SEQ.
     H*                    CALL 'UTLR65A'
     H*                    PARM           $IN    30
     H*                    PARM           $OUT   10
     H*   IN  $IN     30A  SOURCE
     H*   OUT $OUT    10A  RESULT
     H*
     H*   EX.
     H*   $IN = '    ABC  D  EFG    ' --> $OUT= 'BC  D  EFG'
     H*   $IN = '         D  EFG    ' --> $OUT= 'D  EFG    ' REMOVE LEADING BLNK
      *********************************************************************
     E                    IN         30  1
     E                    OT         10  1
      ******************************************************************
     C           *ENTRY    PLIST
     C                     PARM           $IN    30
     C                     PARM           $OUT   10
      *
     C                     MOVEA$IN       IN
     C                     MOVEA*BLANK    OT
     C                     MOVE *BLANK    $OUT
     C                     Z-ADD31        IX      30
     C                     Z-ADD11        IY      30
     C                     MOVE 'Y'       FIRST   1
      *
     C                     DO   30
     C                     SUB  1         IX
      * IGNORE
     C           IX        IFEQ 0
     C                     LEAVE
     C                     ENDIF
      * IGNORE
     C           FIRST     IFEQ 'Y'
     C           IN,IX     ANDEQ*BLANK
     C                     ITER
     C                     ENDIF
      * MOVE
     C                     MOVE 'N'       FIRST
     C                     SUB  1         IY
     C           IY        IFEQ 0
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVELIN,IX     OT,IY
      *
     C                     ENDDO
      *
     C                     MOVEAOT        $OUT
      * REMOVE LEADING BLANKS
     C           OT,1      IFEQ *BLANK
     C                     MOVEL$OUT      PIN
     C                     CALL 'UTLR32C'
     C                     PARM           PIN    30
     C                     PARM           POUT   30
     C                     MOVELPOUT      $OUT
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
