     H            Y.
     F** UTLR68B *******************************************
     F*  PROGRAM: UTILITY- GET MONTHLY SET# BY AAFPP01     *
     F*  SUMMARIZE SET# BY COMMON PART                     *
     F*  WRITTEN: JW (SRA) 2020.08.14                      *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR68C'
     F*                    PARM           $SHN   12
     F*                    PARM           $PRC    3
     F*                    PARM           $SET#   9
     F*                    PARM           $RTN    1
     F*  IN  $SHN  : 12A IAF PART
     F*      $PRC  :  3A PROCESS
     F*  OUT $SET# :  9A MONTHLY SET#
     F*      $RTN  :  1A RETURN CODE (BLANK/*)
     F******************************************************
     FGHCPL22 IF  E           K        DISK
      *===================================================
      * SYSTEM DATE
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I            DS
     I                                        1  12 MMJHN
     I                                        1   5 MMJHN1
     I                                        6  10 MMJHN2
     I                                       11  12 MMJHN3
      * KEY FIELDS
     I            DS
     I                                        1  12 K#SHN
     I                                        1   5 K#SHN1
     I                                        6  10 K#SHN2
     I                                       11  12 K#SHN3
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C           K#PL22    SETLLGHCPL22
     C                     DO   *HIVAL
     C           K#PL22    READEGHCPL22                  88
     C   88                LEAVE
      *  GET SET#
     C                     MOVELMMJHN     PSHN
     C                     CALL 'UTLR68B'
     C                     PARM           PSHN   12
     C                     PARM           PSET#   9
     C                     PARM           PRTN    1
      *
     C           PRTN      IFEQ *BLANK
     C                     MOVELPSET#     NUM90   90
     C                     ADD  NUM90     @SET
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVEL@SET      $SET#
      *
     C           @SET      IFEQ 0
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $SHIN  12
     C                     PARM           $PRC    3
     C                     PARM           $SET#   9
     C                     PARM           $RTN    1
      *
     C           K#PL22    KLIST
     C                     KFLD           K#SHN1  5
     C                     KFLD           K#SHN2  5
     C                     KFLD           K#SHN3  2
     C                     KFLD           K#PRC   3
      * SYSTEM DATE
     C                     TIME           SDATE
     C                     MOVE *BLANK    $RTN
     C                     MOVE *ALL'0'   $SET#
     C                     Z-ADD0         @SET    90
      * SET KEY
     C                     MOVEL$SHIN     K#SHN
     C                     MOVEL$PRC      K#PRC
      *
     C                     ENDSR
      *====================================================
