     H            Y.
     F** UTLR01C *******************************************
     F*  PROGRAM: UTILITY - CHECK TIME                     *
     F*  WRITTEN: JW (SRA) 2021.06.18                      *
     F*  FUNCTION: VALIDATE TIME AND FORMAT                *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR01C'
     F*                    PARM           $TIME6  6
     F*                    PARM           $TIME8  8
     F*                    PARM           $RTN    1
     F*   IN  $TIME6:  6A TIME (00:00:00 - 23:59:59)
     F*   OUT $TIME8:  8A HH:MM:SS
     F*       $RTN  :  1A RETURN FLAG (BLANK=OK, *=ERROR)
      *--------------------------------------------------------
     I            DS
     I                                        1   6 @TIME
     I                                        1   2 @HH
     I                                        3   4 @MM
     I                                        5   6 @SS
     I            DS
     I                                        1   8 #TIME
     I                                        1   2 #HH
     I                                        3   3 #C1
     I                                        4   5 #MM
     I                                        6   6 #C2
     I                                        7   8 #SS
     C           *ENTRY    PLIST
     C                     PARM           $TIME6  6
     C                     PARM           $TIME8  8
     C                     PARM           $RTN    1
      *
     C                     MOVE *BLANK    $TIME8
     C                     MOVE *BLANK    $RTN
     C                     MOVEL$TIME6    @TIME
     C                     MOVE ':'       #C1
     C                     MOVE ':'       #C2
      *
     C                     EXSR #CHK1
      *
     C           *IN85     IFEQ *OFF
     C                     MOVE @HH       #HH
     C                     MOVE @MM       #MM
     C                     MOVE @SS       #SS
     C                     MOVEL#TIME     $TIME8
     C                     ELSE
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *=============================================================
      * CHECK
      *=============================================================
     C           #CHK1     BEGSR
      *
     C                     MOVE *OFF      *IN85
      *
     C           $TIME6    IFLT '000000'
     C           $TIME6    ORGT '235959'
     C                     MOVE *ON       *IN85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           @HH       IFLT '00'
     C           @HH       ORGT '23'
     C                     MOVE *ON       *IN85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           @MM       IFLT '00'
     C           @MM       ORGT '59'
     C                     MOVE *ON       *IN85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           @SS       IFLT '00'
     C           @SS       ORGT '59'
     C                     MOVE *ON       *IN85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           XCHK1     ENDSR
