     H            Y.
     F** UTLR11 ********************************************
     F*  PROGRAM: UTILITY - GET DESIGN CHANGE LEBEL        *
     F*  WRITTEN: JW (SRA)                                 *
     F*           12/20/2016                               *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR11'
     F*                    PARM           $CGRP   3
     F*                    PARM           $PART  20
     F*                    PARM           $NONY   4
     F*                    PARM           $PTYP   1
     F*                    PARM           $SHDT   8
     F*                    PARM           $DCL    6
     F*                    PARM           $RTN    1
     F*  IN  $CGRP  :  3A CUSTOMER GROUP (HND:HONDA)
     F*      $PART  : 20A PART#
     F*      $NONY  :  4A DELIVERY CODE
     F*      $PTYP  :  1A PART# TYPE (I:IAF, I<>:CUST)
     F*      $SHPDT :  8A SHIP DATE
     F*  OUT $DCL   :  6A DESIGN CHANGE LEVEL
     F*      $RTN   :  1A RETURN CODE (BLANK/*)
     F******************************************************
     FAB#PL57 IF  E           K        DISK
     FAB#PL56 IF  E           K        DISK
     F            AB#PP551                          KRENAMEAB#PL561
      *--------------------------------------------------------
     E                    DAT        10  1
     I            DS
     I                                        1  20 WHIN
     I                                        1   5 WHIN1
     I                                        6  10 WHIN2
     I                                       11  15 WHIN3
     I                                       11  12 WHIN3I
     I                                       16  20 WHIN4
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      *
     C                     EXSR @INIT
     C                     SELEC
      * GET FROM IAF  PART ----------------------------
     C           $PTYP     WHEQ 'I'
     C                     MOVE *OFF      *IN91
     C                     MOVEL$PART     WHIN
     C                     MOVEL$NONY     K5NONY
     C           KEY1      CHAINAB#PL57              91
     C           *IN91     IFEQ *OFF
     C           A5SHDT    ANDLE@SHDT
     C           A5SHDT    ANDNE0
     C                     MOVELA5DCLV    $DCL
     C                     GOTO @END
     C                     ENDIF
      * DELIVERY=0(DEFAULT)
     C                     MOVE *OFF      *IN91
     C                     MOVEL$PART     WHIN
     C                     Z-ADD0         K5NONY
     C           KEY1      CHAINAB#PL57              91
     C           *IN91     IFEQ *OFF
     C           A5SHDT    ANDLE@SHDT
     C           A5SHDT    ANDNE0
     C                     MOVELA5DCLV    $DCL
     C                     GOTO @END
     C                     ENDIF
     C                     MOVE '*'       $RTN
      *
      * GET FROM CUSTOMER PART -----------------------
     C                     OTHER
     C                     MOVE *OFF      *IN91
     C                     MOVEL$PART     WHIN
     C                     MOVEL$NONY     K5NONY
     C           KEY2      CHAINAB#PL56              91
     C           *IN91     IFEQ *OFF
     C           A5SHDT    ANDLE@SHDT
     C           A5SHDT    ANDNE0
     C                     MOVELA5DCLV    $DCL
     C                     GOTO @END
     C                     ENDIF
      * DELIVERY=0(DEFAULT)
     C                     MOVE *OFF      *IN91
     C                     MOVEL$PART     WHIN
     C                     Z-ADD0         K5NONY
     C           KEY2      CHAINAB#PL56              91
     C           *IN91     IFEQ *OFF
     C           A5SHDT    ANDLE@SHDT
     C           A5SHDT    ANDNE0
     C                     MOVELA5DCLV    $DCL
     C                     GOTO @END
     C                     ENDIF
     C                     MOVE '*'       $RTN
      *
     C                     ENDSL
      *
     C           @END      TAG
     C           $DCL      IFEQ *BLANK
     C                     MOVE '*'       $RTN
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *=============================================================
      *                    INITIAL PROCESS
      *=============================================================
     C           @INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $CGRP   3
     C                     PARM           $PART  20
     C                     PARM           $NONY   4
     C                     PARM           $PTYP   1
     C                     PARM           $SHDT   8
     C                     PARM           $DCL    6
     C                     PARM           $RTN    1
      *
     C           KEY1      KLIST
JW1  C                     KFLD           @CGRP
     C                     KFLD           WHIN1
     C                     KFLD           WHIN2
     C                     KFLD           WHIN3I
     C                     KFLD           K5NONY
      *
     C           KEY2      KLIST
JW1  C                     KFLD           @CGRP
     C                     KFLD           WHIN1
     C                     KFLD           WHIN2
     C                     KFLD           WHIN3
     C                     KFLD           WHIN4
     C                     KFLD           K5NONY
      *
     C           *LIKE     DEFN A5NONY    K5NONY
      *
     C                     CLEAR$DCL
     C                     CLEAR$RTN
     C                     MOVEL$CGRP     @CGRP   3
     C                     MOVEL$SHDT     @SHDT   80
      *
     C                     ENDSR
