     H            Y.
     F** UTLR33   ****************************************************
     F*  PROGRAM    : RETRIEVE ORDER INFO (INVN)                     *
     F*  WRITTEN    : 02/03/2017                                     *
     F*  WRITTEN BY : JW (SRA)                                       *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR33'
     F*                    PARM           $NONY   4
     F*                    PARM           $NKOJ   1
     F*                    PARM           $NUKE   4
     F*                    PARM           $NOHZ   8
     F*                    PARM           $NOBN   2
     F*                    PARM           $ODRN  10
     F*                    PARM           $MHIN  20
     F*                    PARM           $INVN  16
     F*                    PARM           $RTN    1
     F*   IN  $NONY :  4A DELIVERY#
     F*       $NKOJ :  1A FACTORY
     F*       $NUKE :  4A DOCK
     F*       $NOHZ :  8A SHIP DATE
     F*       $NOBN :  2A BIN#
     F*       $ODRN : 10A ORDER#
     F*       $MHIN : 20A USER PART#
     F*   OUT $INVN : 16A INVOICE#  (TARGET)
     F*       $RTN  :  1A RETURN CODE
     F****************************************************************
     FAB#PL1J IF  E           K        DISK
      *---------------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ******************************************************
      *                    MAIN PROCESS
      ******************************************************
     C           *ENTRY    PLIST
     C                     PARM           P@NONY  4
     C                     PARM           P@NKOJ  1
     C                     PARM           P@NUKE  4
     C                     PARM           P@NOHZ  8
     C                     PARM           P@NOBN  2
     C                     PARM           P@ODRN 10
     C                     PARM           P@MHIN 20
     C                     PARM           P@INVN 16
     C                     PARM           P@RTN   1
      *
     C                     MOVE *BLANK    P@RTN
     C                     MOVELP@NONY    P#NONY
     C                     MOVELP@NOHZ    P#NOHZ
     C                     MOVELP@NOBN    P#NOBN
      *
     C           KEY01     KLIST
     C                     KFLD           P#NONY  40
     C                     KFLD           P@NKOJ
     C                     KFLD           P@NUKE
     C                     KFLD           P#NOHZ  80
     C                     KFLD           P#NOBN  20
     C                     KFLD           P@ODRN
     C                     KFLD           P@MHIN
      *
     C           KEY01     CHAINAB#PL1J              91
     C           *IN91     IFEQ *OFF
     C           BASKJY    ANDNE'D'
     C                     MOVELBAINVN    P@INVN
     C                     ELSE
     C                     MOVE '*'       P@RTN
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
