     H            Y.
     F** UTLR08 ********************************************
     F*  GET QTY/BOX BY DATE                               *
     F*  THIS PROGRAM IS OLD ... NEW --> UTLR35            *
     F*  WRITTEN: JW (SRA)                                 *
     F*           09/06/2016                               *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR09'
     F*                    PARM           $TOKU   4
     F*                    PARM           $NONY   4
     F*                    PARM           $MHIN  20
     F*                    PARM           $DATE   8
     F*                    PARM           $SYOS   6
     F*                    PARM           $RTN    1
     F*  IN  $TOKU :  4A CUST#
     F*      $NONY :  4A DELIVERY CODE
     F*      $MHIN : 20A USER PART
     F*      $DATE :  8A TARGET DATE
     F*  OUT $SYOS :  6A QTY/BOX (QPC)
     F*      $RTN  :  1A RETURN CODE (BLANK/*)
     F******************************************************
     FFAAPL05 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  20 K@MHIN
     I                                        1   5 K@MHN1
     I                                        6  10 K@MHN2
     I                                       11  15 K@MHN3
     I                                       16  20 K@MHN4
      *
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      *
     C                     EXSR #INIT
      *
     C           KEY1      CHAINFAAPL05              91
     C           *IN91     IFEQ *OFF
     C                     MOVELB7SHN1    K@SHN1
     C                     MOVELB7SHN2    K@SHN2
     C                     MOVELB7SHN3    K@SHN3
     C           KEY2      CHAINFCEPL01              92
     C           *IN92     IFEQ *OFF
     C           A2SYHZ    IFGT WDATE
     C           WDATE     ANDNE0
     C                     Z-ADDA2KSYS    WSYOS
     C                     ELSE
     C                     Z-ADDA2SSYS    WSYOS
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C           WSYOS     IFEQ 0
     C                     MOVEL'*'       $RTN
     C                     ELSE
     C                     MOVELWSYOS     $SYOS
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *=============================================================
      *                    INITIAL PROCESS
      *=============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $MHIN  20
     C                     PARM           $DATE   8
     C                     PARM           $SYOS   6
     C                     PARM           $RTN    1
      *
     C           KEY1      KLIST
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
     C                     KFLD           K@TOKU  40
     C                     KFLD           K@NONY  40
      *
     C           KEY2      KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
      *
     C                     CLEAR$RTN
     C                     Z-ADD0         WSYOS   60
     C                     MOVEL$TOKU     K@TOKU  40
     C                     MOVEL$NONY     K@NONY  40
     C                     MOVEL$MHIN     K@MHIN
     C           $DATE     IFEQ *BLANK
     C                     Z-ADD0         WDATE   80
     C                     ELSE
     C                     MOVEL$DATE     WDATE
     C                     ENDIF
      *
     C                     ENDSR
