     H            Y.
      ** UTLR56B ************************************************
      *  GET EDI856 SHID# FROM AB#PPCT                          *
      *  J.WATANABE   2021.08.12                                *
      ***********************************************************
      *  CALLING SEQ.                                           *
      *                    CALL 'UTLR56B'
      *                    PARM           $UPD    1
      *                    PARM           $SHID  10
      *   IN  $UPD    1A "Y"= UPDATE FILE                       *
      *                  "N"= NOT UPDATE                        *
      ***********************************************************
     FAB#PPCT UF  E           K        DISK                      A
      ***********************************************************
     I            DS
     I                                        1  140WSDT
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        7  120@YYMM
      *
     I            DS
     I                                        1  10 WSHP#
     I                                        1   40W4
     I                                        5  100W6
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *==================================================
     C           *ENTRY    PLIST
     C                     PARM           $UPD    1
     C                     PARM           $SHID  10
     C                     MOVE *BLANK    $SHID
     C                     TIME           WSDT
      ****************************************************
      * MAIN ROUTINE
      ****************************************************
     C                     MOVEL'EDI856  '#KEY8   8
     C           #KEY8     CHAINAB#PPCT              98
     C           *IN98     IFEQ *ON
     C                     CLEARAB#PPCT1
     C                     MOVEL#KEY8     CTKEY1
     C                     Z-ADD@YYMM     CTNBR1
     C                     Z-ADD1         CTNBR2
      *
     C           $UPD      IFEQ 'Y'
     C                     WRITEAB#PPCT1
     C                     ENDIF
      *
     C                     ELSE
     C           CTNBR1    IFEQ @YYMM
     C                     ADD  1         CTNBR2
     C                     ELSE
     C                     Z-ADD@YYMM     CTNBR1
     C                     Z-ADD1         CTNBR2
     C                     ENDIF
      *
     C           $UPD      IFEQ 'Y'
     C                     UPDATAB#PPCT1
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     Z-ADDCTNBR1    NUM60   60
     C                     MOVE NUM60     W4
     C                     Z-ADDCTNBR2    W6
     C                     MOVELWSHP#     $SHID
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
