     H            Y.
     F** UTLR32C **********************************************************
     F*  CONVERT CHAR -> CHAR(BLANK SUPPRESSION)                          *
     F*  JW      2024.02.09                                               *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR32C'
     F*                    PARM           PIN    30
     F*                    PARM           POUT   30
     F*   IN  PIN   : 30A    TEXT
     F*   OUT POUT  : 30A    TEXT
     F*   EX.                                                             *
     F*   '   123 4' --> "123 4  "        REMOVE LEADING BLANKS           *
     F*********************************************************************
     E                    IN         30  1
     E                    OUT        30  1
     F******************************************************************
     I            DS
     I                                        1  30 IN
     I                                        1  30 WPIN
      ******************************************************************
     C           *ENTRY    PLIST
     C                     PARM           PIN    30
     C                     PARM           POUT   30
      *
     C                     MOVELPIN       WPIN
     C                     MOVE *BLANK    OUT
     C                     MOVE *BLANK    POUT
     C                     SETOF                     90
     C                     Z-ADD0         IX      20
     C                     Z-ADD0         MX      20
     C                     MOVE 'Y'       FIRST   1
     C* SEARCH FIRST
     C                     DO   *HIVAL
     C                     ADD  1         IX
     C           IX        IFGT 30
     C                     LEAVE
     C                     ENDIF
      *
     C           FIRST     IFEQ 'Y'
     C           IN,IX     ANDEQ*BLANK
     C                     ITER
     C                     ENDIF
      *
     C                     MOVE 'N'       FIRST
     C                     ADD  1         MX
     C                     MOVE IN,IX     OUT,MX
     C                     ENDDO
      *
     C                     MOVEAOUT       POUT
      *
     C                     SETON                     LR
     C                     RETRN
