     H            Y.
     F** UTLR40 ****************************************************
     F*  PROGRAM: UTILITY- GET TOYOTA BIN#                         *
     F*  WRITTEN: JW (SRA)  2020.07.10                             *
     F*------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR40'
     F*                    PARM           $SDATE  8
     F*                    PARM           $STIME  6
     F*                    PARM           $BIN    2
     F*                    PARM           $RTN    1
     F* ----------------------------
     F*   IN  $$SDATE 8A :  SHIP DATE
     F*       $$STIME 6A :  SHIP TIME
     F*       $$BIN   2A :  BIN#
     F*   OUT $RTN    1A :  "*" ERROR
     F******************************************************
     FAB#PP80 IF  E           K        DISK         KINFDS INF1
     E                    FM         30  4 0
     E                    TO         30  4 0
     IINF1        DS
     I                                     *STATUS  @STTS
     I                                       83  92 #FILE
     I                                       93 102 #LIB
     I                                    B 156 1590#RCNT
     I                                        1 256 ARA
     I            DS
     I                                        1 120 FM
     I                                        1   40A8FR01
     I                                        5   80A8FR02
     I                                        9  120A8FR03
     I                                       13  160A8FR04
     I                                       17  200A8FR05
     I                                       21  240A8FR06
     I                                       25  280A8FR07
     I                                       29  320A8FR08
     I                                       33  360A8FR09
     I                                       37  400A8FR10
     I                                       41  440A8FR11
     I                                       45  480A8FR12
     I                                       49  520A8FR13
     I                                       53  560A8FR14
     I                                       57  600A8FR15
     I                                       61  640A8FR16
     I                                       65  680A8FR17
     I                                       69  720A8FR18
     I                                       73  760A8FR19
     I                                       77  800A8FR20
     I                                       81  840A8FR21
     I                                       85  880A8FR22
     I                                       89  920A8FR23
     I                                       93  960A8FR24
     I                                       97 1000A8FR25
     I                                      101 1040A8FR26
     I                                      105 1080A8FR27
     I                                      109 1120A8FR28
     I                                      113 1160A8FR29
     I                                      117 1200A8FR30
     I            DS
     I                                        1 120 TO
     I                                        1   40A8TO01
     I                                        5   80A8TO02
     I                                        9  120A8TO03
     I                                       13  160A8TO04
     I                                       17  200A8TO05
     I                                       21  240A8TO06
     I                                       25  280A8TO07
     I                                       29  320A8TO08
     I                                       33  360A8TO09
     I                                       37  400A8TO10
     I                                       41  440A8TO11
     I                                       45  480A8TO12
     I                                       49  520A8TO13
     I                                       53  560A8TO14
     I                                       57  600A8TO15
     I                                       61  640A8TO16
     I                                       65  680A8TO17
     I                                       69  720A8TO18
     I                                       73  760A8TO19
     I                                       77  800A8TO20
     I                                       81  840A8TO21
     I                                       85  880A8TO22
     I                                       89  920A8TO23
     I                                       93  960A8TO24
     I                                       97 1000A8TO25
     I                                      101 1040A8TO26
     I                                      105 1080A8TO27
     I                                      109 1120A8TO28
     I                                      113 1160A8TO29
     I                                      117 1200A8TO30
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
     C                     EXSR #INIT
      *
     C           #SDATE    SETGTAB#PP80
     C                     READPAB#PP80                  98
     C           *IN98     IFEQ *OFF
      ***
     C           A8FRDT    IFGE 20080519
     C           1         DO   30        IX      20
     C           #STIME    IFGE FM,IX
     C           #STIME    ANDLETO,IX
     C                     Z-ADDIX        #BIN
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     ELSE
      *
     C           1         DO   30        IX      20
     C           #STIME    IFLE TO,IX
     C                     Z-ADDIX        #BIN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVEL#BIN      $BIN
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------------
      * INITIAL SETTING
      *--------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $SDATE  8
     C                     PARM           $STIME  6
     C                     PARM           $BIN    2
     C                     PARM           $RTN    1
      *
     C                     MOVEL$SDATE    #SDATE  80
     C                     MOVEL$STIME    #STIME  40
     C                     MOVE '00'      $BIN
     C                     MOVE *BLANK    $RTN
     C                     Z-ADD0         #BIN    20
      *
     C                     ENDSR
