     H            Y.
     F** UTLR51F ************************************************************
     F*  UTILITY - GET PACKING LIST# BY NONY/SHID                           *
     F*  WRITTEN: JW (SRA) 2022.06.21                                       *
     F*---------------------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR51F'
     F*                    PARM           $NONY   4
     F*                    PARM           $SHID  10
     F*                    PARM           $PL#    9
     F*   IN  $NONY   4  DELIVERY CODE
     F*       $SHID  10  SHID (EDI856)
     F*  OUT  $PL#    9  PACKING LIST#
     F******************************************************
     FAB#EL6# IF  E           K        DISK
      *--------------------------------------------------------
     E                    DAT        10  1
      *--------------------------------------------------------
     I            DS
     I                                        1   80WNOHZ
     I                                        1   40WNOYY
     I                                        5   60WNOMM
     I                                        7   80WNODD
     I            DS
     I                                        1   80WRLHZ
     I                                        1   40WRLYY
     I                                        5   60WRLMM
     I                                        7   80WRLDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
     C                     EXSR #INZ
      *
     C           KEY1      SETLLAB#EL6#
      *
     C                     DO   *HIVAL
     C           KEY1      READEAB#EL6#                  91
     C   91                LEAVE
      *
     C                     MOVELEAPS#     $PL#
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
     C           #INZ      BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
     C                     PARM           $SHID  10
     C                     PARM           $PL#    9
      *
     C           KEY1      KLIST
     C                     KFLD           K#NONY  40
     C                     KFLD           K#SHID 10
      *
     C                     MOVEL$NONY     K#NONY
     C                     MOVEL$SHID     K#SHID
     C                     MOVE *BLANK    $PL#
      *
     C                     ENDSR
