     H            Y.
     F** UTLR20 ********************************************
     F*  PROGRAM: GET GENTRAN CHECK TIME                   *
     F*  WRITTEN: JW (SRA)                                 *
     F*           12/19/2017                               *
     F*----------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UTLR20'
     F*                    PARM           $CTIM   6
     F*                    PARM           $STIM   6
     F*                    PARM           $RTN    1
     F*   IN  $CTM  :  6A CURRENT TIME
     F*   OUT $STM  :  6A SCHEDULE TIME
     F*       $RTN  :  1A RETURN FLAG (BLANK=OK, 1=ERROR)
     F******************************************************
     FSCHEDULEIF  F       6            DISK
      *--------------------------------------------------------
     ISCHEDULEAA  01
     I                                        1   6 ITIM
      *
     I            DS
     I                                        1   60WTIM
     I                                        1   20WHH
     I                                        3   40WMM
     I                                        5   60WSS
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * PARAMETER
     C           *ENTRY    PLIST
     C                     PARM           $CTIM   6
     C                     PARM           $STIM   6
     C                     PARM           $RTN    1
      *--------------------------------------------------------
      *                    MAIN PROCESS
      *--------------------------------------------------------
      * DEFAULT
     C                     MOVEL'001000'  $STIM
     C                     MOVE *BLANK    $RTN
      *
     C           *IN98     DOWEQ*OFF
     C                     READ SCHEDULE                 98
     C           *IN98     IFEQ *OFF
     C           ITIM      IFGE $CTIM
     C                     EXSR #CALC
     C                     MOVELWTIM      $STIM
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *=============================================================
      *          ADD 10 MIN TO SCHEDIULED TIME
      *=============================================================
     C           #CALC     BEGSR
      *
     C                     MOVELITIM      WTIM
     C                     ADD  10        WMM
     C           WMM       IFGE 60
     C                     SUB  60        WMM
     C                     ADD  1         WHH
     C                     ENDIF
      *
     C           WHH       IFGE 24
     C                     SUB  24        WHH
     C                     ENDIF
      *
     C                     ENDSR
