     H            Y.
     F** UUUR02 ****************************************
     F*  EDIT IAF PART WITH HYPHEN                     *
     F*  J.WATANABE    2021.02.12                      *
     F*------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'UUUR02'
     F*                    PARM           $SHIN  12
     F*                    PARM           $SHIN2 14
     F*  IN  $SHIN : 12A IAF PART#
     F*  OUT $SHIN2: 14A IAF PART# WITH HYPHEN
     F**************************************************
     I            DS
     I                                        1  12 @1SHIN
     I                                        1   5 @1SHN1
     I                                        6  10 @1SHN2
     I                                       11  12 @1SHN3
     I            DS
     I                                        1  14 @2SHIN
     I                                        1   5 @2SHN1
     I                                        6   6 @2HF1
     I                                        7  11 @2SHN2
     I                                       12  12 @2HF2
     I                                       13  14 @2SHN3
     C           *ENTRY    PLIST
     C                     PARM           $SHIN  12
     C                     PARM           $SHIN2 14
      *
     C                     MOVEL$SHIN     @1SHIN
      *
     C                     MOVEL@1SHN1    @2SHN1
     C                     MOVEL@1SHN2    @2SHN2
     C                     MOVEL@1SHN3    @2SHN3
      *
     C           @1SHN2    IFEQ *BLANK
     C                     MOVE ' '       @2HF1
     C                     ELSE
     C                     MOVE '-'       @2HF1
     C                     END
      *
     C           @1SHN3    IFEQ *BLANK
     C                     MOVE ' '       @2HF2
     C                     ELSE
     C                     MOVE '-'       @2HF2
     C                     END
      *
     C                     MOVEL@2SHIN    $SHIN2
      *
     C                     SETON                     LR
     C                     RETRN
