     H            Y.
     F** VB#R01   **************************************************************
     F*  PROGRAM    : COPY AB#PP10 TO TFILE1 BY SHIP DATE                      *
     F*  WRITTEN    : 2017.04.04                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FAB#PL0B IF  E           K        DISK         KINFDS INF1
     FAB#PL0M UF  E           K        DISK         KINFDS INF2  A
     F            AB#PL0M1                          KRENAMEAB#PPXX
     IINF1        DS
     I                                    B 156 1590RCNT1
     I                                        1 256 RCD1
     I                                       93 100 LIB1
     IINF2        DS
     I                                    B 156 1590RCNT2
     I                                        1 256 RCD2
     I                                       93 100 LIB2
     I            DS
     I                                        1   80@NOHZ
     I                                        1   40@NOYY
     I                                        5   60@NOMM
     I                                        7   80@NODD
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR @INIT
      * DELETE
     C           KEY       SETLLAB#PL0M
     C           *IN98     DOWEQ*OFF
     C           KEY       READEAB#PL0M                  98
     C           *IN98     IFEQ *OFF
     C                     DELETAB#PPXX
     C                     ADD  1         DCNT    40
     C                     ENDIF
     C                     ENDDO
      * COPY
     C           KEY       SETLLAB#PL0B
     C           *IN97     DOWEQ*OFF
     C           KEY       READEAB#PL0B                  97
     C           *IN97     IFEQ *OFF
     C                     WRITEAB#PPXX
     C                     ADD  1         ACNT    60
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVELACNT      $CNT
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           @INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $NOHZ   8
     C                     PARM           $CNT    6
     C                     PARM           $RTN    1
      *
     C           KEY       KLIST
     C                     KFLD           @NOYY
     C                     KFLD           @NOMM
     C                     KFLD           @NODD
      *
     C                     MOVEL$NOHZ     @NOHZ
     C                     MOVE *BLANK    $RTN
      *
      * OUTPUT LIBRARY MUST BE TEST LIBRARY
      *
     C           LIB2      IFNE 'TFILE1'
     C           LIB2      ANDNE'TWFILE1'
     C                     MOVE '*'       $RTN
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
      *
     C                     ENDSR
