     H            Y.
     F** VJBR19 **********************************
     F*  FILE REFORMATION MASTER  REFERENCE      *
     F*      I-HASADA              87.11.04      *
JW1  F*  JW  2018.10.08 CHG FILE TO 8A           *
     F********************************** VJBR19 **
     FVJBPW19 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
     FVJBPL11 IF  E           K        DISK
     FDGAPL01 IF  E           K        DISK
     E                    KE         12  2 0             PLAN DAY
     E**JW1               HFIL       12  7               FILE NAME
JW1  E                    HFIL       12  8               FILE NAME
     I            DS
     I                                        1  240KE
     I                                        1   20FEKE01
     I                                        3   40FEKE02
     I                                        5   60FEKE03
     I                                        7   80FEKE04
     I                                        9  100FEKE05
     I                                       11  120FEKE06
     I                                       13  140FEKE07
     I                                       15  160FEKE08
     I                                       17  180FEKE09
     I                                       19  200FEKE10
     I                                       21  220FEKE11
     I                                       23  240FEKE12
     I            DS
     I                                        1   80FENUKI
     I                                        3   80FENUKH
     I                                        1   40FENUYY
     I                                        5   60FENUMM
     I                                        7   80FENUDD
     I            DS
     I                                        1   80YMD
     I                                        1   60YM
     I                                        1   40Y
     I                                        5   60M
     I                                        7   80D
     C           FKEY1     KLIST
     C                     KFLD           KEY1
      *
     C                     Z-ADD12        SFLSIZ  20
     C                     Z-ADD*DATE     YMD
     C                     Z-ADD0         RRN     40
     C                     MOVE *BLANK    HFIL
      *
     C           STP0      TAG
     C                     WRITEVJBPW193
     C                     EXFMTVJBPW191
     C                     Z-ADD0         A       20
     C           FKEY1     SETLLVJBPL111
     C                     EXSR SFLSET
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C                     WRITEVJBPW192
      *
     C                     DO   *HIVAL
      *
     C* DISPLAY SUB-FILE
     C           RRN       COMP 0                    20
     C                     SETON                     21
     C                     WRITEVJBPW193
     C                     EXFMTSFLCTL
     C                     SETOF                     102021
     C                     SETOF                     3199
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C           *INKC     IFEQ '1'
     C                     WRITEVJBPW194
     C                     MOVE *BLANK    KEY1
     C                     GOTO STP0
     C                     END
      *
     C* ROLL UP/DOWN
     C           *IN25     IFEQ '1'
     C           *IN26     OREQ '1'
     C                     EXSR ROLLUD
     C                     EXSR SFLSET
     C                     ELSE
     C                     END
     C                     END
      *
     C*****************************************************************
     C           ROLLUD    BEGSR
     C*****************************************************************
     C           *IN26     IFEQ '1'
     C           HFIL,12   IFEQ *BLANK
     C                     ADD  1         A
     C                     ADD  1         C
     C                     END
     C           SFLSIZ    ADD  C         ROLLL#  20
     C           1         DO   ROLLL#
     C           STP1      TAG
     C                     SETOF                     9097
     C                     READPVJBPL111                 90
     C           *IN90     IFEQ '1'
     C                     SUB  1         A
     C           *LOVAL    SETLLVJBPL111
     C                     GOTO STP3
     C                     END
      *
     C           FEFILE    IFLT KEY1
     C                     SETON                     90
     C                     SUB  1         A
     C                     GOTO STP3
     C                     END
     C           FESKJY    IFEQ 'D'
     C           FESKHZ    ANDLE*DATE
     C                     GOTO STP1
     C                     END
     C           KE,M      IFEQ 0
     C                     GOTO STP1
     C                     END
     C                     SUB  1         A
     C           STP3      TAG
     C  N90                END
     C                     END
     C                     ENDSR
      *
     C*****************************************************************
     C           SFLSET    BEGSR
     C*****************************************************************
     C                     SETOF                     8090
     C                     Z-ADD0         RRN
     C                     SETON                     22
     C                     WRITESFLCTL
     C                     SETOF                     22
      *
     C           *IN90     DOWEQ'0'
     C                     SETOF                     90
     C                     READ VJBPL111                 90
     C           *IN90     IFEQ '0'
     C           FESKJY    IFEQ 'D'
     C           FESKHZ    ANDLE*DATE
     C                     GOTO STP2
     C                     END
     C           KE,M      IFEQ 0
     C                     GOTO STP2
     C                     END
      *
     C           *IN80     IFEQ '0'
     C                     SETON                     80
     C                     Z-ADD0         C       20
     C                     MOVE *BLANK    HFIL
     C                     END
      *
     C                     ADD  1         RRN
     C                     ADD  1         A
     C                     ADD  1         C
     C                     MOVE FEFILE    HFIL,C
     C                     EXSR MOV001
     C                     WRITESFL                      90
     C                     ELSE
      *
     C           HFIL,12   IFEQ *BLANK
     C           *HIVAL    SETLLVJBPL111
     C                     ELSE
      *
     C           *HIVAL    SETGTVJBPL111
     C           *IN97     IFEQ '0'
     C                     SETON                     97
     C                     ADD  1         A
     C                     ADD  1         C
     C                     END
     C                     END
      *
     C                     END
     C           STP2      TAG
     C                     END
     C                     ENDSR
      *
     C*****************************************************************
     C           MOV001    BEGSR
     C*****************************************************************
     C                     SETOF                     3032
     C                     Z-ADDA         CNO
      *
     C           FESGYO    IFEQ 0
     C           KE,M      ANDLED
     C                     SETON                     30
     C                     END
      *
     C                     MOVE *BLANK    WFINM
     C           FEFILE    CHAINDGAPL011             32
     C           *IN32     IFEQ '0'
     C                     MOVELA1TXTN    WFINM
     C                     END
     C                     ENDSR
