     H            Y.
     F*** VJBR13 **********************************
     F*    FILE REFORMATION INPUT M/F LIST        *
     F*           H.ITO          87.10.15         *
     F********************************** VJBR13 ***
     FVJBPL11 IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I            DS
     I                                        1   80FESKHZ
     I                                        1   40FESKYY
     I                                        5   60FESKMM
     I                                        7   80FESKDD
     C/SPACE 1
     C                     SETOF                     0102
     C           *IN03     IFEQ '0'
     C                     MOVE FENUKI    FENUKH  60
     C                     MOVE FESGYO    FESGYH  60
     C                     TIME           WTIME   60
     C                     SETON                     0203
     C                     END
     C           FESKJY    IFEQ 'D'
     C           FESKHZ    ANDLE*DATE
     C                     GOTO END
     C                     END
     C                     SETON                     01
     C           END       TAG
     OQPRINT  H  102   02
     O       OR        OF
     O                                  131 '.....................'
     O        H  1     02
     O       OR        OF
     O                                  131 '.         .         .'
     O        H  1     02
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME Y   98
     O                                  131 '.         .         .'
     O        H  2     02
     O       OR        OF
     O                                   10 'VJBR13-1'
     O                                   33 'IN THE ORDER OF FILE'
     O                                   41 '* *'
     O                                   60 'FILE REFORMATION'
     O                                   68 'MASTER'
     O                                   80 'LIST   * *'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        H  2     02
     O       OR        OF
     O                                   13 'FILE NAME'
     O                                   27 'LAST DATE'
     O                                   51 'CURRENT DATA COUNTS'
     O                                   67 'REFORM DATE'
     O                                   79 'LIBRARY'
     O                                   92 'PROGRAM'
     O                                  107 'REFORM DATE'
     O        D  1     01
     O                         FEFILE    12
     O                         FENUKHY   26
     O                         FERECD1   46
     O                         FEKENS1   65
     O                         FELIBL    80
     O                         FEJPGM    91
     O                         FESGYHY  105
