     H            Y.                                    1
     F** VJBR51 ****************************
     F*   PRINT PGM-PGM (PARENT) REPORT    *
     F*   JW    4/6/2016                   *
     F**************************************
     FVVVPLB0 IF  E           K        DISK
     FVVVPLB2 IF  E           K        DISK
     FVVVPLB3 IF  E           K        DISK
     FVVVPLB4 IF  E           K        DISK
     FVVVPLB5 IF  E           K        DISK
     FVVVPLB6 IF  E           K        DISK
     FVVVPLB7 IF  E           K        DISK
     FVVVPLB8 IF  E           K        DISK
     FVVVPLB9 IF  E           K        DISK
     FEGBPL13 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I            DS
     I                                        1  10 VWPNAM
     I                                        4   4 SRID
      ****************************************************
     C           *ENTRY    PLIST
     C                     PARM           XPGM    8
      *
     C                     Z-ADD*DATE     @DATE   80
     C                     TIME           @TIME   60
     C                     Z-ADD99        LIN#    30
     C                     EXSR #F0
      *
     C                     MOVELXPGM      K@VV1  11
     C           K@VV1     SETLLVVVPLB0
      *
     C           *IN80     DOWEQ*OFF
     C           K@VV1     READEVVVPLB0                  80
     C           *IN80     IFEQ *OFF
     C           SRID      ANDEQ'C'
     C           *IN80     OREQ *OFF
     C           SRID      ANDEQ'R'
     C           *IN80     OREQ *OFF
     C           SRID      ANDEQ'E'
     C           *IN80     OREQ *OFF
     C           SRID      ANDEQ' '
     C                     MOVELVWFNAM    @PGM    8
     C                     MOVELVWPNAM    @LINK1    P
     C                     MOVEL@LINK1    K@VV2  11
     C                     EXSR #F2
     C                     ENDIF
     C                     ENDDO
      * PRINT LAST LINE
     C                     EXSR #LAST
      * PRINT FOOTER
     C           LIN#      IFEQ 99
     C**                   MOVE 'X'       XPGM
     C                     EXCPT@HDR
     C                     EXCPT@FOT
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *******************
      * F0: INITIALIZE  *
      *******************
     C           #F0       BEGSR
     C                     MOVE *BLANK    @LINK1  9
     C                     MOVE *BLANK    @LINK2  9
     C                     MOVE *BLANK    @LINK3  9
     C                     MOVE *BLANK    @LINK4  9
     C                     MOVE *BLANK    @LINK5  9
     C                     MOVE *BLANK    @LINK6  9
     C                     MOVE *BLANK    @LINK7  9
     C                     MOVE *BLANK    @LINK8  9
     C                     MOVE *BLANK    @LINK9  9
     C                     ENDSR
      *******************
      * F2              *
      *******************
     C           #F2       BEGSR
     C                     MOVE 'Y'       @C2     1
     C                     MOVE *OFF      *IN82
     C           K@VV2     SETLLVVVPLB2
     C           *IN82     DOWEQ*OFF
     C           K@VV2     READEVVVPLB2                  82
     C**                   MOVELVWPNAM    TEMP
     C**                   MOVE TEMP      SRID
     C           *IN82     IFEQ *OFF
     C           SRID      ANDEQ'C'
     C           *IN82     OREQ *OFF
     C           SRID      ANDEQ'R'
     C           *IN82     OREQ *OFF
     C           SRID      ANDEQ'E'
     C           *IN82     OREQ *OFF
     C           SRID      ANDEQ' '
     C                     MOVELVWPNAM    @LINK2    P
     C                     MOVEL@LINK2    K@VV3  11
     C                     EXSR #F3
     C                     MOVE ' '       @C2
     C                     MOVE *BLANK    @LINK2
     C                     ELSE
     C           @C2       IFEQ 'Y'
     C                     MOVEL@LINK1    K@PGM   6
     C           K@PGM     CHAINEGBPL13              99
     C           *IN99     IFEQ *OFF
     C           SRID      OREQ ' '
     C                     MOVE '*'       @LINK1
     C                     ENDIF
     C                     EXSR #PRINT
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
      *******************
      * F3              *
      *******************
     C           #F3       BEGSR
     C                     MOVE 'Y'       @C3     1
     C                     MOVE *OFF      *IN83
     C           K@VV3     SETLLVVVPLB3
     C           *IN83     DOWEQ*OFF
     C           K@VV3     READEVVVPLB3                  83
     C**                   MOVELVWPNAM    TEMP
     C**                   MOVE TEMP      SRID
     C           *IN83     IFEQ *OFF
     C           SRID      ANDEQ'C'
     C           *IN83     OREQ *OFF
     C           SRID      ANDEQ'R'
     C           *IN83     OREQ *OFF
     C           SRID      ANDEQ'E'
     C           *IN82     OREQ *OFF
     C           SRID      ANDEQ' '
     C                     MOVELVWPNAM    @LINK3    P
     C                     MOVEL@LINK3    K@VV4  11
     C                     EXSR #F4
     C                     MOVE ' '       @C3
     C                     MOVE *BLANK    @LINK3
     C                     ELSE
     C           @C3       IFEQ 'Y'
     C                     MOVEL@LINK2    K@PGM
     C           K@PGM     CHAINEGBPL13              99
     C           *IN99     IFEQ *OFF
     C           SRID      OREQ ' '
     C                     MOVE '*'       @LINK2
     C                     ENDIF
     C                     EXSR #PRINT
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
      *******************
      * F4              *
      *******************
     C           #F4       BEGSR
     C                     MOVE 'Y'       @C4     1
     C                     MOVE *OFF      *IN84
     C           K@VV4     SETLLVVVPLB4
     C           *IN84     DOWEQ*OFF
     C           K@VV4     READEVVVPLB4                  84
     C**                   MOVELVWPNAM    TEMP
     C**                   MOVE TEMP      SRID
     C           *IN84     IFEQ *OFF
     C           SRID      ANDEQ'C'
     C           *IN84     OREQ *OFF
     C           SRID      ANDEQ'R'
     C           *IN84     OREQ *OFF
     C           SRID      ANDEQ'E'
     C           *IN82     OREQ *OFF
     C           SRID      ANDEQ' '
     C                     MOVELVWPNAM    @LINK4    P
     C                     MOVEL@LINK4    K@VV5  11
     C                     EXSR #F5
     C                     MOVE ' '       @C4
     C                     MOVE *BLANK    @LINK4
     C                     LEAVE
     C                     ELSE
     C           @C4       IFEQ 'Y'
     C                     MOVEL@LINK3    K@PGM
     C           K@PGM     CHAINEGBPL13              99
     C           *IN99     IFEQ *OFF
     C           SRID      OREQ ' '
     C                     MOVE '*'       @LINK3
     C                     ENDIF
     C                     EXSR #PRINT
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
      *******************
      * F5              *
      *******************
     C           #F5       BEGSR
     C                     MOVE 'Y'       @C5     1
     C                     MOVE *OFF      *IN85
     C           K@VV5     SETLLVVVPLB5
     C           *IN85     DOWEQ*OFF
     C           K@VV5     READEVVVPLB5                  85
     C**                   MOVELVWPNAM    TEMP
     C**                   MOVE TEMP      SRID
     C           *IN85     IFEQ *OFF
     C           SRID      ANDEQ'C'
     C           *IN85     OREQ *OFF
     C           SRID      ANDEQ'R'
     C           *IN85     OREQ *OFF
     C           SRID      ANDEQ'E'
     C           *IN82     OREQ *OFF
     C           SRID      ANDEQ' '
     C                     MOVELVWPNAM    @LINK5    P
     C                     MOVEL@LINK5    K@VV6  11
     C                     EXSR #F6
     C                     MOVE ' '       @C5
     C                     MOVE *BLANK    @LINK5
     C                     LEAVE
     C                     ELSE
     C           @C5       IFEQ 'Y'
     C                     MOVEL@LINK4    K@PGM
     C           K@PGM     CHAINEGBPL13              99
     C           *IN99     IFEQ *OFF
     C           SRID      OREQ ' '
     C                     MOVE '*'       @LINK4
     C                     ENDIF
     C                     EXSR #PRINT
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
      *******************
      * F6              *
      *******************
     C           #F6       BEGSR
     C                     MOVE 'Y'       @C6     1
     C                     MOVE *OFF      *IN86
     C           K@VV6     SETLLVVVPLB6
     C           *IN86     DOWEQ*OFF
     C           K@VV6     READEVVVPLB6                  86
     C**                   MOVELVWPNAM    TEMP
     C**                   MOVE TEMP      SRID
     C           *IN86     IFEQ *OFF
     C           SRID      ANDEQ'C'
     C           *IN86     OREQ *OFF
     C           SRID      ANDEQ'R'
     C           *IN86     OREQ *OFF
     C           SRID      ANDEQ'E'
     C           *IN82     OREQ *OFF
     C           SRID      ANDEQ' '
     C                     MOVELVWPNAM    @LINK6    P
     C                     MOVEL@LINK6    K@VV7  11
     C                     EXSR #F7
     C                     MOVE ' '       @C6
     C                     MOVE *BLANK    @LINK6
     C                     LEAVE
     C                     ELSE
     C           @C6       IFEQ 'Y'
     C                     MOVEL@LINK5    K@PGM
     C           K@PGM     CHAINEGBPL13              99
     C           *IN99     IFEQ *OFF
     C           SRID      OREQ ' '
     C                     MOVE '*'       @LINK5
     C                     ENDIF
     C                     EXSR #PRINT
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
      *******************
      * F7              *
      *******************
     C           #F7       BEGSR
     C                     MOVE 'Y'       @C7     1
     C                     MOVE *OFF      *IN87
     C           K@VV7     SETLLVVVPLB7
     C           *IN87     DOWEQ*OFF
     C           K@VV7     READEVVVPLB7                  87
     C**                   MOVELVWPNAM    TEMP
     C**                   MOVE TEMP      SRID
     C           *IN87     IFEQ *OFF
     C           SRID      ANDEQ'C'
     C           *IN87     OREQ *OFF
     C           SRID      ANDEQ'R'
     C           *IN87     OREQ *OFF
     C           SRID      ANDEQ'E'
     C           *IN82     OREQ *OFF
     C           SRID      ANDEQ' '
     C                     MOVELVWPNAM    @LINK7    P
     C                     MOVEL@LINK7    K@VV8  11
     C                     EXSR #F8
     C                     MOVE ' '       @C7
     C                     MOVE *BLANK    @LINK7
     C                     LEAVE
     C                     ELSE
     C           @C7       IFEQ 'Y'
     C                     MOVEL@LINK6    K@PGM
     C           K@PGM     CHAINEGBPL13              99
     C           *IN99     IFEQ *OFF
     C           SRID      OREQ ' '
     C                     MOVE '*'       @LINK6
     C                     ENDIF
     C                     EXSR #PRINT
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
      *******************
      * F8              *
      *******************
     C           #F8       BEGSR
     C                     MOVE 'Y'       @C8     1
     C                     MOVE *OFF      *IN88
     C           K@VV8     SETLLVVVPLB8
     C           *IN88     DOWEQ*OFF
     C           K@VV8     READEVVVPLB8                  88
     C**                   MOVELVWPNAM    TEMP
     C**                   MOVE TEMP      SRID
     C           *IN88     IFEQ *OFF
     C           SRID      ANDEQ'C'
     C           *IN88     OREQ *OFF
     C           SRID      ANDEQ'R'
     C           *IN88     OREQ *OFF
     C           SRID      ANDEQ'E'
     C           *IN82     OREQ *OFF
     C           SRID      ANDEQ' '
     C                     MOVELVWPNAM    @LINK8    P
     C                     MOVEL@LINK8    K@VV9  11
     C                     EXSR #F9
     C                     MOVE ' '       @C8
     C                     MOVE *BLANK    @LINK8
     C                     LEAVE
     C                     ELSE
     C           @C8       IFEQ 'Y'
     C                     MOVEL@LINK7    K@PGM
     C           K@PGM     CHAINEGBPL13              99
     C           *IN99     IFEQ *OFF
     C           SRID      OREQ ' '
     C                     MOVE '*'       @LINK7
     C                     ENDIF
     C                     EXSR #PRINT
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
      *******************
      * F9              *
      *******************
     C           #F9       BEGSR
     C                     MOVE 'Y'       @C9     1
     C                     MOVE *OFF      *IN89
     C           K@VV9     SETLLVVVPLB9
     C           *IN89     DOWEQ*OFF
     C           K@VV9     READEVVVPLB9                  89
     C**                   MOVELVWPNAM    TEMP
     C**                   MOVE TEMP      SRID
     C           *IN89     IFEQ *OFF
     C           SRID      ANDEQ'C'
     C           *IN89     OREQ *OFF
     C           SRID      ANDEQ'R'
     C           *IN89     OREQ *OFF
     C           SRID      ANDEQ'E'
     C           *IN82     OREQ *OFF
     C           SRID      ANDEQ' '
     C                     MOVELVWPNAM    @LINK9    P
     C                     MOVEL@LINK9    K@VVA  11
     C                     EXSR #FA
     C                     MOVE ' '       @C9
     C                     MOVE *BLANK    @LINK9
     C                     LEAVE
     C                     ELSE
     C           @C9       IFEQ 'Y'
     C                     MOVEL@LINK8    K@PGM
     C           K@PGM     CHAINEGBPL13              99
     C           *IN99     IFEQ *OFF
     C           SRID      OREQ ' '
     C                     MOVE '*'       @LINK8
     C                     ENDIF
     C                     EXSR #PRINT
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
      *******************
      * FA              *
      *******************
     C           #FA       BEGSR
     C                     MOVE 'Y'       @CA     1
     C           @CA       IFEQ 'Y'
     C                     MOVEL@LINK9    K@PGM
     C           K@PGM     CHAINEGBPL13              99
     C           *IN99     IFEQ *OFF
     C           SRID      OREQ ' '
     C                     MOVE '*'       @LINK9
     C                     ENDIF
     C                     EXSR #PRINT
     C                     ENDIF
      *
     C                     ENDSR
      ************************************
      * LAST LAINE (CHECK MENUED PROGRAM)
      ************************************
     C           #LAST     BEGSR
     C                     EXSR #F0
      *
     C                     MOVELXPGM      K@PGM
     C           K@PGM     CHAINEGBPL13              99
     C           *IN99     IFEQ *OFF
     C                     MOVELXPGM      @PGM
     C                     MOVE '*'       @PGM
     C                     EXSR #PRINT
     C                     ENDIF
      *
     C                     ENDSR
      *******************
      * PRINT           *
      *******************
     C           #PRINT    BEGSR
     C           LIN#      IFGT 60
     C                     Z-ADD0         LIN#
     C                     EXCPT@HDR
     C                     ENDIF
      *
     C                     ADD  1         LIN#
     C                     EXCPT@DTL
      *
     C                     ENDSR
      **************************************
     OQPRINT  E   01           @HDR
     O                                    7 'VJBR51'
     O                                   50 '** PGM-PGM (PARENT) '
     O                                   60 'REPORT ** '
     O                                   99 'DATE'
     O                         @DATE    102 '    .  .  '
     O                         @TIME    112 '  :  :  '
     O                                  115 'P.'
     O                         PAGE  Z  119
     O        E   02           @HDR
     O                                    9 'PROGRAM'
     O                                   18 'PARENT1'
     O                                   28 'PARENT2'
     O                                   38 'PARENT3'
     O                                   48 'PARENT4'
     O                                   58 'PARENT5'
     O                                   68 'PARENT6'
     O                                   78 'PARENT7'
     O                                   88 'PARENT8'
     O                                   98 'PARENT9'
      *
     O        E 1              @DTL
     O                         @PGM      10
     O                         @LINK1    20
     O                         @LINK2    30
     O                         @LINK3    40
     O                         @LINK4    50
     O                         @LINK5    60
     O                         @LINK6    70
     O                         @LINK7    80
     O                         @LINK8    90
     O                         @LINK9   100
      *
     O        E 1              @FOT
     O                         XPGM      12
     O                                   34 ': THERE IS NO PARENT'
     O                                   54 ' PROPGRAM! OR NOT UP'
     O                                   74 'DATED VVVPPB0!      '
