     H            Y.
      ** VRFR24 ****************************************
      *  REFORMATION FOR ALDPP25                       *
      *  J-WATANABE  CRT 2017.04.06                    *
      **************************************************
     FALDPL28 UF  E           K        DISK         KINFDS INF1
     FALDPP25BO   E                    DISK
     F            ALDPP251                          KRENAMEALDPP25X
      ***************************************************
     IINF1        DS
     I                                    B 156 1590RCNT
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ***************************************************
     C           *ENTRY    PLIST
     C                     PARM           PDATE   8
     C                     PARM           PREC1   9
     C                     PARM           PREC2   9
     C                     MOVE PDATE     XDATE   80
      * MAIN LOOP
     C           *LOVAL    SETLLALDPL28
     C           *IN90     DOWEQ*OFF
     C                     READ ALDPL28                  90
     C           *IN90     IFEQ *OFF
      *
     C           A9KODT    IFLT XDATE
     C                     ADD  1         WDEL    90
     C                     WRITEALDPP25X
     C                     DELETALDPP251
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      * FOOT
     C                     Z-ADDRCNT      WREC1   90
     C                     MOVE WREC1     PREC1
     C           WREC1     SUB  WDEL      WREC2   90
     C                     MOVE WREC2     PREC2
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
