     H            Y.
     F** VRFR26 ****************************************
     F*  REFORMATION FOR AU#PP21                       *
     F*  COPIED FROM AU#R80                            *
     F*  J-WATANABE         2017.04.09                 *
     F**************************************************
     FAU#PL25 UP  E           K        DISK         KINFDS INF1
     FAU#PP21BO   E                    DISK
     F            AU#PP211                          KRENAMEAU#PP21X
      ***************************************************
     IINF1        DS
     I                                    B 156 1590RCNT
     I            DS
     I                                        1   80CQNOHZ
     I                                        1   40CQNOYY
     I                                        5   60CQNOMM
     I                                        7   80CQNODD
     C           *ENTRY    PLIST
     C                     PARM           PDATE   8
     C                     PARM           PREC1   9
     C                     PARM           PREC2   9
     C                     MOVE PDATE     XDATE   80
      *
     C           CQNOHZ    IFGT XDATE
     C                     MOVE '1'       *INLR
     C                     ELSE
     C                     DELETAU#PP211
     C                     WRITEAU#PP21X
     C                     ADD  1         WDEL    90
     C                     ENDIF
      *
     CLR                   Z-ADDRCNT      WREC    90
     CLR                   MOVE WREC      PREC1
     CLR         WREC      SUB  WDEL      WREC
     CLR                   MOVE WREC      PREC2
