     H            Y.
     F** VVVR94  **********************************************************
     F*  DELETE GARBAGE FROM VVVPP50C                                     *
     F*  J.WATANABE   2024.06.10                                          *
     F*********************************************************************
     FVVVPP50CUF  E           K        DISK
      *****************************************************
      *
     C                     DO   *HIVAL
     C                     READ VVVPP50C                 98
     C   98                LEAVE
      *
     C                     MOVELMLSEU     SEU1    1
      * DELETE
     C           MLSEU     IFNE 'CLLE'
     C           MLSEU     ANDNE'CLP '
     C           MLSEU     ANDNE'CMD '
     C           MLSEU     ANDNE'DSPF'
     C           MLSEU     ANDNE'LF  '
     C           MLSEU     ANDNE'PF  '
     C           MLSEU     ANDNE'PRTF'
     C           MLSEU     ANDNE'RPG '
     C           MLSEU     ANDNE'RPGL'
     C           MLSEU     ANDNE'SQLR'
     C**         MLSEU     ANDNE'TXT '
     C           MLSEU     ANDNE'    '
     C           MLFILE    OREQ 'EVFEVENT'
     C           MLFILE    OREQ 'FMTSRC  '
     C           MLFILE    OREQ 'MAISRC  '
     C           MLFILE    OREQ 'JOESRC  '
     C           SEU1      OREQ 'J'                        JW
     C           SEU1      OREQ 'L'                        LEC
     C                     DELETQWHFDML
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
