     H            Y.
     F** VVVR60C **********************************************************
     F*  DELETE EMPTY FILE                                                *
     F*  J.WATANABE   2024.06.10                                          *
     F*********************************************************************
     FVVVPP60 UF  E           K        DISK
      *****************************************************
      *
     C                     DO   *HIVAL
     C                     READ VVVPP60                  98
     C   98                LEAVE
      *
     C           V6SEQ     IFEQ 0
     C                     DELETVVVPP601
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
