     H            Y.
     F** WK303R *******************************************
     F* DIE COMPONENT M/F INQUIRY                         *
     F*                                    2020.10.28     *
     F*****************************************************
     F*         ファイル定義                            *
     F*****************************************************
     FWK303D0 CF  E                    WORKSTN
     F                                        #RRN1 KSFILE WK303D0S
     F                                              KINFDS INFDS
     FWK400L1 IF  E           K        DISK
     FFCQPL31 IF  E           K        DISK
     FFCQPL21 IF  E           K        DISK
     FGCQPL31 IF  E           K        DISK
     FGCQTL13 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     E*****************************************************
     E*         配列定義                                *
     E*****************************************************
     E                    @MSG    1  10 60                xｮﾈｰﾆﾞmｰﾎﾞﾓ
     E                    KOJY    1   5  4   KOJ     1   工場ﾃｰnﾞmｰﾎﾞﾓ
     E*
     E                    KS1      9999  2               *型番１STR
     E                    KS2      9999  4               *型番２STR
     E                    KE1      9999  2               *型番１END
     E                    KE2      9999  4               *型番２END
     E                    NOS      9999  3 0             *№STR
     E                    NOE      9999  3 0             *№END
     E*
     E                    KOT        15  3               PROCESS
     E                    KBM        15  4 0             DEPARTMENT
     E                    QKO        15  3               OLD PROCESS
     E                    QBM        15  4 0             OLD DEPARTMENT
     E                    NKO        15  3               NEW PROCESS
     E                    NBM        15  4 0             NEW DEPARTMENT
     E                    KHZ        15 10 0             KANBAN CHG.DATE
     I*****************************************************
     I*         データ構造                              *
     I*****************************************************
     I*==< SYSTEM情報>==*
     I           SDS
     I                                     *PROGRAM @@PGM
     I                                      244 253 @@WSID
     I                                      254 263 @@USER
     I                                      264 269 @@JBNO
     I*==< WROKSTATION情報>==*
     IINFDS       DS
     I                                      273 282 $$WSNM
     I                                    B 370 3710$$CUR
     I                                    B 378 3790$$RRN
     I*==<組型番の編集>==*
     I            DS
     I                                        1   7 D#@KKT
     I                                        1   2 D#@KK1
     I                                        3   3 D#@HIF
     I                                        4   7 D#@KK2
     I*
     I            DS
     I                                        1  11 #BAN
     I                                        3  11 #BANX
     I                                        1   1 #BAN1
     I                                        2   2 #BANA
     I                                        3   4 #BAN2
     I                                        5   5 #BANB
     I                                        6   7 #BAN3
     I                                        8   8 #BANC
     I                                        9   9 #BAN4
     I                                       10  10 #BAND
     I                                       11  11 #BAN5
     I*
     I            DS
     I                                        1  45 KOT
     I                                        1   3 A2KOT1
     I                                        4   6 A2KOT2
     I                                        7   9 A2KOT3
     I                                       10  12 A2KOT4
     I                                       13  15 A2KOT5
     I                                       16  18 A2KOT6
     I                                       19  21 A2KOT7
     I                                       22  24 A2KOT8
     I                                       25  27 A2KOT9
     I                                       28  30 A2KO10
     I                                       31  33 A2KO11
     I                                       34  36 A2KO12
     I                                       37  39 A2KO13
     I                                       40  42 A2KO14
     I                                       43  45 A2KO15
     I            DS
     I                                        1  600KBM
     I                                        1   40A2KBM1
     I                                        5   80A2KBM2
     I                                        9  120A2KBM3
     I                                       13  160A2KBM4
     I                                       17  200A2KBM5
     I                                       21  240A2KBM6
     I                                       25  280A2KBM7
     I                                       29  320A2KBM8
     I                                       33  360A2KBM9
     I                                       37  400A2KB10
     I                                       41  440A2KB11
     I                                       45  480A2KB12
     I                                       49  520A2KB13
     I                                       53  560A2KB14
     I                                       57  600A2KB15
     I            DS
     I                                        1  45 QKO
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600QBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  45 NKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600NBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1 1500KHZ
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     C*****************************************************
     C*         パラメーター ＬＩＳＴ                 *
     C*****************************************************
     C*==<受取・受渡>==*
     C           *ENTRY    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@KAT1  2
     C                     PARM           P@KAT2  4
     C                     PARM           P@KOJO  4
     C*****************************************************
     C*         キー　ＬＩＳＴ                          *
     C*****************************************************
     C*
     C           K@KAT@    KLIST
     C                     KFLD           K@KAT1  2        組型番　型番１
     C                     KFLD           K@KAT2  4        組型番　型番２
     C           K@KKT@    KLIST
     C                     KFLD           K@KKT1  2        構成型番・型番１
     C                     KFLD           K@KKT2  4        構成型番・型番２
     C           K@KEY1    KLIST
     C                     KFLD           K@KAT1           組型番　型番１
     C                     KFLD           K@KAT2           組型番　型番２
     C                     KFLD           K@KKT1           構成型番・型番１
     C                     KFLD           K@KKT2           構成型番・型番２
     C*
     C           KEY1      KLIST
     C                     KFLD           HIN1    5
     C                     KFLD           HIN2    5
     C                     KFLD           HIN3    2
     C*
     C           T6KEY1    KLIST
     C                     KFLD           K@KTX1  2
     C                     KFLD           K@KTX2  4
     C*
     C           DFKEY1    KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
     C*****************************************************
     C*         内部ＷＯＲＫ項目                        *
     C*****************************************************
     C                     MOVEL'EDT1'    S@PROC  4        処理制御
     C                     Z-ADD*ZERO     W@ENDL  50
     C                     MOVEL'0'       F@READ  1
     C                     Z-ADD*ZERO     #RRN1   40        RRN
     C                     Z-ADD*ZERO     S@RRN1  40        SFL表示RRN
     C                     MOVEL*BLANK    W@KOJ   1
     C*
     C                     SETOF                     50
     C                     Z-ADD1         M       20
     C           P@KOJO    LOKUPKOJY,M                   50
     C           *IN50     IFEQ '1'
     C                     MOVELKOJ,M     W@KOJ
     C                     ENDIF
     C                     SETOF                     41
     C           W@KOJ     IFNE '6'
     C           W@KOJ     ANDNE'7'
     C                     SETON                     41
     C                     ENDIF
     C*
     C*****************************************************
     C*         メインルーチン                          *
     C*****************************************************
     C*==<主処理>==*
     C           S@PROC    DOWNE'EXIT'
     C                     SELEC
     C           S@PROC    WHEQ 'EDT1'
     C                     EXSR $EDT1                      照会画面初期
     C           S@PROC    WHEQ 'DSP1'
     C                     EXSR $DSP1                      照会画面表示
     C           S@PROC    WHEQ 'EDT2'
     C                     EXSR $EDT2                      照会画面編集
     C                     ENDSL
     C                     ENDDO
     C*==<終了処理>==*
     C                     SETON                     LR
     C                     RETRN
     C*****************************************************
     C*  $EDT1  照会画面初期設定                        *
     C*****************************************************
     C           $EDT1     BEGSR
     C*==<画面項目初期値>==*
     C                     MOVEL*BLANK    D#KAT1           組型番１
     C                     MOVEL*BLANK    D#KAT2           組型番２
     C                     MOVEL*BLANK    D#KKNM           組型番名称
     C                     MOVEL*BLANK    D#TKRO           所番地
     C                     MOVEL*BLANK    D#EMSG            xｮﾈｰﾆﾞ
     C                     MOVEL*ALL'*'   D$KAT1           組型番１
     C                     MOVEL*ALL'*'   D$KAT2           組型番２
     C                     SETOF                     3199
     C*==<次処理>==*
     C                     Z-ADD*ZERO     S@RRN1            SFL表示RRN
     C                     SETOF                     7071   ﾅﾎﾞﾎｦbﾓ非表示
     C           P@KAT1    IFNE *BLANK
     C                     MOVELP@KAT1    D#KAT1
     C                     MOVELP@KAT2    D#KAT2
     C                     MOVELD#KAT1    D$KAT1           組型番１
     C                     MOVELD#KAT2    D$KAT2           組型番２
     C                     EXSR $CHK1
     C                     ELSE
     C                     MOVEL'DSP1'    S@PROC
     C                     ENDIF
     C*
     C           $EDT1E    ENDSR
     C*****************************************************
     C*  $DSP1  照会画面表示                            *
     C*****************************************************
     C           $DSP1     BEGSR
     C*==<画面表示>==*
     C                     Z-ADDS@RRN1    #RRN1
     C                     WRITEWK303D09
     C                     EXFMTWK303D0C
     C                     SETOF                     3199
     C                     Z-ADD$$RRN     S@RRN1            SFL表示RRN
     C                     MOVEL*BLANK    D#EMSG            xｮﾈｰﾆﾞ
     C*
     C           *IN02     IFEQ '0'
     C           D#KAT1    IFNE D$KAT1
     C           D#KAT2    ORNE D$KAT2
     C                     EXSR $CHK1
     C                     MOVELD#KAT1    D$KAT1           組型番１
     C                     MOVELD#KAT2    D$KAT2           組型番２
     C                     ENDIF
     C                     ENDIF
     C*==<次処理>==*
     C                     SELEC
     C           *IN02     WHEQ '1'                        < F2押下>
     C                     MOVEL'EXIT'    S@PROC            ﾎﾟﾜhﾞ[w終了
     C*
     C           *IN25     WHEQ '1'
     C           *IN99     IFEQ '0'
     C           *IN91     IFEQ '1'
     C                     SETON                     99
     C                     MOVEL@MSG,4    D#EMSG            xｮﾈｰﾆﾞ
     C                     MOVEL'DSP1'    S@PROC           照会画面編集
     C                     ELSE
     C                     EXSR $ROLU                      * ROLL-UP
     C                     ENDIF
     C                     ENDIF
     C*
     C           *IN26     WHEQ '1'
     C           *IN99     IFEQ '0'
     C           I         IFEQ 1
     C                     SETON                     99
     C                     MOVEL@MSG,4    D#EMSG            xｮﾈｰﾆﾞ
     C                     MOVEL'DSP1'    S@PROC           照会画面編集
     C                     ELSE
     C                     EXSR $ROLD                      * ROLL-DOWN
     C                     ENDIF
     C                     ENDIF
     C*
     C                     OTHER                           <実行gｰ押下>
     C                     ENDSL
     C*
     C           $DSP1E    ENDSR
     C*****************************************************
     C*  $CHK1  構成型番入力チェック                    *
     C*****************************************************
     C           $CHK1     BEGSR
     C*==<初期hﾒa >==*
     C                     SETOF                     7071   ﾅﾎﾞﾎｦbﾓ非表示
     C                     SETOF                     3199
     C                     MOVEL*BLANK    D#EMSG            xｮﾈｰﾆﾞ
     C                     Z-ADD1         X       40
     C                     MOVEL*BLANK    D#TKRO           所番地
     C                     MOVEL*BLANK    D#KKNM           構成型番名称
     C*==<構成型番>==*
     C*        (入力チェック)
     C           D#KAT1    IFEQ *BLANK
     C           D#KAT2    ANDEQ*BLANK
     C                     MOVEL@MSG,1    D#EMSG            xｮﾈｰﾆﾞ
     C                     SETON                     3199
     C                     MOVEL'DSP1'    S@PROC           画面表示へ
     C                     GOTO $CHK1E
     C                     ENDIF
     C*        (存在チェック)
     C                     MOVELD#KAT1    K@KAT1           組型番・型番１
     C                     MOVELD#KAT2    K@KAT2           組型番・型番２
     C           K@KAT@    SETLLWK400L1
     C                     EXSR $4002
     C           *IN91     IFEQ '1'
     C                     MOVEL@MSG,2    D#EMSG            xｮﾈｰﾆﾞ
     C                     SETON                     3199
     C                     MOVEL'DSP1'    S@PROC           画面表示へ
     C                     GOTO $CHK1E
     C                     ENDIF
     C*        (名称取得)
     C                     MOVELD#KAT1    K@KKT1           型番１
     C                     EXSR $CQ21                       FCQPL21 READ
     C                     MOVELO9KANM    D#KKNM           構成型番名称
     C*        (型仕様マスター確認)
     C                     MOVELD#KAT1    K@KKT1           構成型番・型番１
     C                     MOVELD#KAT2    K@KKT2           構成型番・型番２
     C           K@KKT@    SETLLFCQPL31
     C                     EXSR $CQ31
     C           *IN93     IFEQ '1'
     C                     MOVEL@MSG,3    D#EMSG            xｮﾈｰﾆﾞ
     C                     SETON                     31
     C                     ENDIF
      *
     C                     MOVELD#KAT1    K@KTX1           型番１
     C                     MOVELD#KAT2    K@KTX2           型番２
     C                     EXSR $TKRS
     C                     MOVEL#BANX     D#TKRO           所番地
     C*==<次処理>==*
     C                     MOVEL'DSP1'    S@PROC           照会画面表示
     C           *IN99     IFEQ '0'
     C                     MOVEL'EDT2'    S@PROC           照会画面編集
     C                     ENDIF
     C*
     C           $CHK1E    ENDSR
     C*===================================================*
     C*  $4002   WK400L1 READ                             *
     C*===================================================*
     C           $4002     BEGSR
     C*
     C           $40021    TAG
     C           K@KAT@    READEWK400L1                  91
     C           *IN91     CABEQ'1'       $4002E
     C*==< SKIP >==*
     C           K4SKJY    IFEQ 'D'
     C           K4SKHZ    ANDLE*DATE
     C                     GOTO $40021
     C                     ENDIF
     C*
     C           K4OYAK    IFEQ 'O'
     C                     GOTO $40021
     C                     ENDIF
     C*
     C           $4002E    ENDSR
     C*===================================================*
     C*  $CQ21   FCQPL21 READ                             *
     C*===================================================*
     C           $CQ21     BEGSR
     C*
     C                     MOVEL'0'       F@READ
     C*
     C           K@KKT1    SETLLFCQPL21
     C           K@KKT1    READEFCQPL21                  92
     C           *IN93     DOWEQ'0'
     C           F@READ    ANDEQ'0'
     C           O9SKJY    IFEQ 'D'
     C           O9SKHZ    ANDLE*DATE
     C           K@KKT1    READEFCQPL21                  92
     C                     ELSE
     C                     MOVEL'1'       F@READ
     C                     ENDIF
     C                     ENDDO
     C*
     C           *IN92     IFEQ '1'
     C                     MOVEL*BLANK    O9KANM           型番名称
     C                     ENDIF
     C*
     C           $CQ21E    ENDSR
     C*===================================================*
     C*  $CQ31   FCQPL31 READ                             *
     C*===================================================*
     C           $CQ31     BEGSR
     C*
     C           $CQ311    TAG
     C           K@KKT@    READEFCQPL31                  93
     C           *IN93     CABEQ'1'       $CQ31E
     C*==< SKIP >==*
     C           Q4SKJY    IFEQ 'D'
     C           Q4SKHZ    ANDLE*DATE
     C                     GOTO $CQ311
     C                     ENDIF
     C*
     C           $CQ31E    ENDSR
     C*****************************************************
     C*  $EDT2                                            *
     C*****************************************************
     C           $EDT2     BEGSR
     C*==< ﾅﾎﾞﾎｦbﾓ初期化>==*
     C                     SETON                     70     SFLCLR
     C                     WRITEWK303D0C                    ﾅﾎﾞﾎｦbﾓ hﾒa
     C                     SETOF                     70     SFLDSPCTL
     C                     Z-ADD*ZERO     #RRN1             RRN ﾒﾈｮn
     C                     Z-ADD*ZERO     S@RRN1            SFL表示RRN
     C                     MOVEL*BLANK    KS1              型番１STR
     C                     MOVEL*BLANK    KS2              型番２STR
     C                     MOVEL*BLANK    KE1              型番１END
     C                     MOVEL*BLANK    KE2              型番２END
     C                     Z-ADD*ZERO     NOS              №STR
     C                     Z-ADD*ZERO     NOE              №END
     C                     Z-ADD1         I       50       添え字
     C                     Z-ADD*ZERO     IX      50       添え字
     C*<<明細表示>>
     C                     MOVELD#KAT1    K@KAT1           構成型番・型番１
     C                     MOVELD#KAT2    K@KAT2           構成型番・型番２
     C           K@KAT@    SETLLWK400L1
     C                     EXSR $4002
     C           *IN91     DOWEQ'0'
     C           S@RRN1    ANDLT26
     C                     ADD  1         IX               添え字
     C                     Z-ADDIX        D#1NO            №
     C                     MOVEL*BLANK    D#1KKT           組型番
     C                     MOVEL*BLANK    D#1KKN           組型番名称
     C                     MOVELK4KKT1    D#@KK1
     C                     MOVEL'-'       D#@HIF
     C                     MOVELK4KKT2    D#@KK2
     C                     MOVELD#@KKT    D#1KKT           組型番
     C*
     C                     MOVELK4KKT1    K@KKT1           構成型番・型番１
     C                     MOVELK4KKT2    K@KKT2           構成型番・型番２
     C*        (名称取得)
     C                     EXSR $CQ21                       FCQPL21 READ
     C                     MOVELO9KANM    D#1KKN           組型番名称
     C*        (型仕様マスター確認)
     C                     SETOF                     32
     C           K@KKT@    SETLLFCQPL31
     C                     EXSR $CQ31
     C           *IN93     IFEQ '1'
     C                     SETON                     32
     C                     ENDIF
     C                     Z-ADDK4KOSU    D#1SU
     C*        (所番地セット)
     C                     MOVELK4KKT1    K@KTX1           型番１
     C                     MOVELK4KKT2    K@KTX2           型番２
     C                     EXSR $TKRS
     C                     MOVEL#BANX     D#1TKR           所番地
     C*
     C           S@RRN1    IFEQ *ZERO
     C                     MOVELD#@KK1    KS1,I            型番１STR
     C                     MOVELD#@KK2    KS2,I            型番２STR
     C                     Z-ADDD#1NO     NOS,I            №STR
     C                     ENDIF
     C                     MOVELD#@KK1    KE1,I            型番１END
     C                     MOVELD#@KK2    KE2,I            型番２END
     C                     Z-ADDD#1NO     NOE,I            №END
     C                     ADD  1         #RRN1             RRN + 1
     C                     ADD  1         S@RRN1            SFL表示RRN
     C                     WRITEWK303D0S
     C*
     C                     EXSR $4002
     C                     ENDDO
     C*==<次処理>==*
     C                     Z-ADD1         S@RRN1            SFL表示RRN
     C                     SETON                     71     ﾅﾎﾞﾎｦbﾓ表示
     C                     MOVEL'DSP1'    S@PROC            KEY入力画面表示
     C*
     C           $EDT2E    ENDSR
     C*****************************************************
     C*  $ROLU                                            *
     C*****************************************************
     C           $ROLU     BEGSR
     C*<<画面初期処理>>
     C                     SETON                     70     SFLCLR
     C                     WRITEWK303D0C                    ﾅﾎﾞﾎｦbﾓ hﾒa
     C                     SETOF                     70     SFLDSPCTL
     C*
     C                     Z-ADD*ZERO     #RRN1             RRN ﾒﾈｮn
     C                     Z-ADD*ZERO     S@RRN1           SFL表示RRN
     C                     ADD  1         I                添え字
     C           I         SUB  1         L       40
     C                     Z-ADDNOE,L     IX               添え字
     C*<<明細部>>
     C                     MOVELD#KAT1    K@KAT1           組型番　型番１
     C                     MOVELD#KAT2    K@KAT2           組型番　型番２
     C                     MOVELKE1,L     K@KKT1           構成型番　型番１
     C                     MOVELKE2,L     K@KKT2           構成型番　型番２
     C           K@KEY1    SETGTWK400L1
     C                     EXSR $4002
     C           *IN91     DOWEQ'0'
     C           S@RRN1    ANDLT26
     C           IX        IFGE 999
     C                     Z-ADD*ZERO     IX               添え字
     C                     ENDIF
     C                     ADD  1         IX               添え字
     C                     Z-ADDIX        D#1NO            №
     C                     MOVEL*BLANK    D#1KKT           型番
     C                     MOVEL*BLANK    D#1KKN           型番名称
     C                     SETOF                     32
     C                     MOVELK4KKT1    D#@KK1
     C                     MOVEL'-'       D#@HIF
     C                     MOVELK4KKT2    D#@KK2
     C                     MOVELD#@KKT    D#1KKT           型番
     C                     MOVELD#@KK1    K@KKT1           型番１
     C                     MOVELD#@KK2    K@KKT2           型番２
     C                     EXSR $CQ21                       FCQPL21 READ
     C                     MOVELO9KANM    D#1KKN           組型番名称
     C           K@KKT@    SETLLFCQPL31
     C                     EXSR $CQ31
     C           *IN93     IFEQ '1'
     C                     SETON                     32
     C                     ENDIF
     C                     Z-ADDK4KOSU    D#1SU
     C*        (所番地セット)
     C                     MOVELK4KKT1    K@KTX1           型番１
     C                     MOVELK4KKT2    K@KTX2           型番２
     C                     EXSR $TKRS
     C                     MOVEL#BANX     D#1TKR           所番地
     C           S@RRN1    IFEQ *ZERO
     C                     MOVELD#@KK1    KS1,I            型番１STR
     C                     MOVELD#@KK2    KS2,I            型番２STR
     C                     Z-ADDD#1NO     NOS,I            №STR
     C                     ENDIF
     C                     MOVELD#@KK1    KE1,I            型番１END
     C                     MOVELD#@KK2    KE2,I            型番２END
     C                     Z-ADDD#1NO     NOE,I            №END
     C                     ADD  1         #RRN1             RRN + 1
     C                     ADD  1         S@RRN1           SFL表示RRN
     C                     WRITEWK303D0S
     C                     EXSR $4002
     C                     ENDDO
     C*
     C                     Z-ADD1         S@RRN1           SFL表示RRN
     C                     SETON                     71    ﾅﾎﾞﾎｦbﾓ表示
     C*==<次処理>==*
     C                     MOVEL'DSP1'    S@PROC           照会画面表示
     C*
     C                     ENDSR
     C*****************************************************
     C*  $ROLD                                            *
     C*****************************************************
     C           $ROLD     BEGSR
     C*<<画面初期処理>>
     C                     SETON                     70     SFLCLR
     C                     WRITEWK303D0C                    ﾅﾎﾞﾎｦbﾓ hﾒa
     C                     SETOF                     70     SFLDSPCTL
     C*
     C                     Z-ADD*ZERO     #RRN1             RRN ﾒﾈｮn
     C                     Z-ADD*ZERO     S@RRN1           SFL表示RRN
     C                     SUB  1         I                添え字
     C           NOS,I     SUB  1         IX               添え字
     C*<<明細部>>
     C                     MOVELD#KAT1    K@KAT1           組型番　型番１
     C                     MOVELD#KAT2    K@KAT2           組型番　型番２
     C                     MOVELKS1,I     K@KKT1           構成型番　型番１
     C                     MOVELKS2,I     K@KKT2           構成型番　型番２
     C           K@KEY1    SETLLWK400L1
     C                     EXSR $4002
     C           *IN91     DOWEQ'0'
     C           S@RRN1    ANDLT26
     C           IX        IFGE 999
     C                     Z-ADD*ZERO     IX               添え字
     C                     ENDIF
     C                     ADD  1         IX               添え字
     C                     Z-ADDIX        D#1NO            №
     C                     MOVEL*BLANK    D#1KKT           型番
     C                     MOVEL*BLANK    D#1KKN           型番名称
     C                     MOVELK4KKT1    D#@KK1
     C                     MOVEL'-'       D#@HIF
     C                     MOVELK4KKT2    D#@KK2
     C                     MOVELD#@KKT    D#1KKT           型番
     C                     MOVELD#@KK1    K@KKT1           型番１
     C                     MOVELD#@KK2    K@KKT2           型番２
     C                     EXSR $CQ21                       FCQPL21 READ
     C                     MOVELO9KANM    D#1KKN           組型番名称
     C           K@KKT@    SETLLFCQPL31
     C                     EXSR $CQ31
     C           *IN93     IFEQ '1'
     C                     SETON                     32
     C                     ENDIF
     C                     Z-ADDK4KOSU    D#1SU
     C*        (所番地セット)
     C                     MOVELK4KKT1    K@KTX1           型番１
     C                     MOVELK4KKT2    K@KTX2           型番２
     C                     EXSR $TKRS
     C                     MOVEL#BANX     D#1TKR           所番地
     C           S@RRN1    IFEQ *ZERO
     C                     MOVELD#@KK1    KS1,I            型番１STR
     C                     MOVELD#@KK2    KS2,I            型番２STR
     C                     Z-ADDD#1NO     NOS,I            №STR
     C                     ENDIF
     C                     MOVELD#@KK1    KE1,I            型番１END
     C                     MOVELD#@KK2    KE2,I            型番２END
     C                     Z-ADDD#1NO     NOE,I            №END
     C                     ADD  1         #RRN1            RRN + 1
     C                     ADD  1         S@RRN1           SFL表示RRN
     C                     WRITEWK303D0S
     C                     EXSR $4002
     C                     ENDDO
     C*
     C                     Z-ADD1         S@RRN1           SFL表示RRN
     C                     SETON                     71    ﾅﾎﾞﾎｦbﾓ表示
     C*==<次処理>==*
     C                     MOVEL'DSP1'    S@PROC           照会画面表示
     C*
     C                     ENDSR
     C*===================================================*
     C*  $TKRS  所番地の取得                            *
     C*===================================================*
     C           $TKRS     BEGSR
     C*
     C                     MOVEL*BLANK    #BAN
     C*
     C           T6KEY1    SETLLGCQTL131
     C           T6KEY1    READEGCQTL131                 98
     C           *IN98     DOWEQ'0'
     C           T6SKJY    IFEQ 'D'
     C           T6SKHZ    ANDLE*DATE
     C                     ELSE
     C           T6TKR1    IFEQ W@KOJ
     C                     MOVELT6TKR1    #BAN1
     C                     MOVELT6TKR2    #BAN2
     C                     MOVELT6TKR3    #BAN3
     C                     MOVELT6TKR4    #BAN4
     C                     MOVELT6TKR5    #BAN5
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C           T6KEY1    READEGCQTL131                 98
     C                     ENDDO
     C           *IN98     CABEQ'1'       $TKRS1
     C*
     C                     MOVELP@HIN1    K@SHN1
     C                     MOVELP@HIN2    K@SHN2
     C                     MOVELP@HIN3    K@SHN3
     C           DFKEY1    SETLLGCQPL311
     C           DFKEY1    READEGCQPL311                 98
     C           *IN98     DOWEQ'0'
     C           DFSKJY    IFEQ 'D'
     C           DFSKHZ    ANDLE*DATE
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
     C           DFKEY1    READEGCQPL311                 98
     C                     ENDDO
     C           *IN98     CABEQ'1'       $TKRS1
     C*
     C                     MOVELDFSHN1    HIN1
     C                     MOVELDFSHN2    HIN2
     C                     MOVELDFSHN3    HIN3
     C           KEY1      CHAINAAMPL111             98
     C           *IN98     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C                     GOTO $TKRS1
     C                     ENDIF
     C                     ELSE
     C                     GOTO $TKRS1
     C                     ENDIF
     C*
     C                     Z-ADD1         A       20
     C                     Z-ADD0         B       20
     C                     DO   15        A
     C                     MOVELKHZ,A     WHZ     80
     C           *DATE     IFLT WHZ
     C           QKO,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVELQKO,A     KOT,B
     C                     Z-ADDQBM,A     KBM,B
     C                     ENDIF
     C                     ELSE
     C           NKO,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVELNKO,A     KOT,B
     C                     Z-ADDNBM,A     KBM,B
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C*
     C                     MOVE P@KOJO    W@KOJO  40
     C                     DO   15        Q       20
     C           DFKOTI    IFEQ KOT,Q
     C           KBM,Q     IFNE W@KOJO
     C                     MOVEL*BLANK    #BAN
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C*  (編集)
     C           $TKRS1    TAG
     C*
     C           #BAN2     IFNE *BLANK
     C                     MOVEL'-'       #BANA
     C                     ENDIF
     C           #BAN3     IFNE *BLANK
     C                     MOVEL'-'       #BANB
     C                     ENDIF
     C           #BAN4     IFNE *BLANK
     C                     MOVEL'-'       #BANC
     C                     ENDIF
     C           #BAN5     IFNE *BLANK
     C                     MOVEL'-'       #BAND
     C                     ENDIF
     C*
     C           $TKRSE    ENDSR
----+-*--1----+----2----+----3----+----4----+----5----+----6----+----7
** @MSG :メッセージテーブル
E-01 INPUT FINISHED DIE.
E-02 NON EXISTENT IN DIE COMPONENT M/F.
E-03 THIS DATA HAS BEEN ERASED FROM DIE SPEC M/F.
E-04 EXCEEDED THE FIRST OR LAST RECORD TO ROLL UP OR DOWN.
E-05
E-06
E-07
E-08
E-09
E-10
** KOJY / KOJ :工場コードテーブル
01116
0755C
00947
0831C
0170A
