     H            Y.
     F** WK316R **********************************
     F* PUBLISHMENT OF DIE ALLOTMENT M/F LIST    *
     F*型構成マスター対応       2020.11.09     *
     F************************ COPY FROM GCQR33 **
     FGCQWP33 IP  F     512            DISK
     FFGBPL01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FWK420L3 IF  E           K        DISK
     FWK350W0 IF  E           K        DISK
     FWK316V0 O   E                    PRINTER
     E                    HKO        10  3               PROCESS      HD
     E                    HKJ        10 10               FACTORY NAME HD
     E                    HBM        10  4 0             DEPARTMENT   HD
     E                    HKN        10  3               MACHINE NO   HD
     E                    HKS        10 10               MACHINE TYPE HD
     E                    WTI        63  3               PROCESS      DT
     E                    WSI        63  2               COMPONENT NO DT
     E                    WKT        63 11               DIE NO       DT
     E                    WKN        63 10               DIE NO NAME  DT
     E                    WSU        63  2 0             COUNT        DT
     E                    WTR        63  9               LOCATION     DT
     E                    AST        63  1               *
     E                    KOJ        10  1               FACTORY NAME CHK
     E                    CMT     1   1 22               MSG
     IGCQWP33 AA  01
     I                                        1   5 ISHN1 L2
     I                                        6  10 ISHN2 L2
     I                                       11  12 ISHN3 L2
     I                                       13  15 IKOTI
     I                                       16  17 IKSEI L1
     I                                       18  32 IMKAT
     I                                       33  340IKOSU
     I                                       35  35 IKUBN
     I                                       36  36 IKSKB
     I                                       37  46 IKANM
     I                                       47  61 IKATA
     I                                       62  91 HKO
     I                                       92 1310HBM
     I                                      132 161 HKN
     I                                      162 261 HKS
     I                                      272 280 ITKRO
     I                                      350 350 PKOJ
     I                                      400 400 IKTBN L2
     I                                      507 507 OYAFLG
     I            DS
     I                                        1  30 HKO
     I                                        1   3 KO1
     I                                        4   6 KO2
     I                                        7   9 KO3
     I                                       10  12 KO4
     I                                       13  15 KO5
     I                                       16  18 KO6
     I                                       19  21 KO7
     I                                       22  24 KO8
     I                                       25  27 KO9
     I                                       28  30 KO10
     I            DS
     I                                        1  400HBM
     I                                        1   40BM1
     I                                        5   80BM2
     I                                        9  120BM3
     I                                       13  160BM4
     I                                       17  200BM5
     I                                       21  240BM6
     I                                       25  280BM7
     I                                       29  320BM8
     I                                       33  360BM9
     I                                       37  400BM10
     I            DS
     I                                        1 100 HKJ
     I                                        1  10 KJ1
     I                                       11  20 KJ2
     I                                       21  30 KJ3
     I                                       31  40 KJ4
     I                                       41  50 KJ5
     I                                       51  60 KJ6
     I                                       61  70 KJ7
     I                                       71  80 KJ8
     I                                       81  90 KJ9
     I                                       91 100 KJ10
     I            DS
     I                                        1  30 HKN
     I                                        1   3 KI1
     I                                        4   6 KI2
     I                                        7   9 KI3
     I                                       10  12 KI4
     I                                       13  15 KI5
     I                                       16  18 KI6
     I                                       19  21 KI7
     I                                       22  24 KI8
     I                                       25  27 KI9
     I                                       28  30 KI10
     I            DS
     I                                        1 100 HKS
     I                                        1  10 KS1
     I                                       11  20 KS2
     I                                       21  30 KS3
     I                                       31  40 KS4
     I                                       41  50 KS5
     I                                       51  60 KS6
     I                                       61  70 KS7
     I                                       71  80 KS8
     I                                       81  90 KS9
     I                                       91 100 KS10
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1  14 WSHIN
     I                                        1   5 WSHN1
     I                                        6   6 W1
     I                                        7  11 WSHN2
     I                                       12  12 W2
     I                                       13  14 WSHN3
     I            DS
     I                                        1  11 W@KATA
     I                                        1   2 W@FIL1
     I                                        3  11 W@KAT@
     I            DS
     I                                        1  11 W@KAT#
     I                                        1   2 W@KAT1
     I                                        4   7 W@KAT2
     I                                        9   9 W@FLG1
     C           KEY       KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
     C*
     C           KEY01     KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
     C*
     C           KEY02     KLIST
     C                     KFLD           K@OKT1  2
     C                     KFLD           K@OKT2  4
     C                     KFLD           K@KOJY  4
      *
     C           *IN02     IFEQ '0'
     C                     SETON                     02
     C           *ENTRY    PLIST
     C                     PARM           USER   10
     C                     PARM           PKBN    1
      *
     C*------------------------*
     C*  UPDATE  PERSON NAME
     C*------------------------*
     C                     SETOF                     10
     C           USER      CHAINRGAPL111             10
     C           *IN10     IFEQ '0'
     C           J8SKJY    ANDEQ'D'
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVELJ8NAME    USNM
     C                     END
     C                     END
      *
     C           *INL2     IFEQ '1'
     C                     Z-ADD0         E       20
     C                     MOVE *BLANK    HKJ
     C                     MOVE *BLANK    WTI
     C                     MOVE *BLANK    WSI
     C                     MOVE *BLANK    WKT
     C                     MOVE *BLANK    AST
     C                     MOVE *BLANK    WKN
     C                     Z-ADD0         WSU
     C                     MOVE *BLANK    WTR
     C                     MOVE ISHN1     WSHN1
     C                     MOVE '-'       W1
     C                     MOVE ISHN2     WSHN2
     C                     MOVE '-'       W2
     C                     MOVE ISHN3     WSHN3
     C                     BITOF'01234567'OE      1
     C                     BITON'456'     OE
     C                     BITOF'01234567'OF      1
     C                     BITON'4567'    OF
      *
      *--------------------*
      *発行方法　型部品  *
      *--------------------*
     C                     SETOF                     19
     C                     MOVEL*BLANK    @OMIT1
     C                     MOVEL*BLANK    @OMIT2
     C           IKTBN     IFEQ '1'
     C                     SETON                     19
     C                     MOVE '********'@OMIT1
     C                     MOVE '********'@OMIT2
     C                     ENDIF
      *----------------------*
      *型部品の存在チェック*
      *----------------------*
     C                     MOVE *BLANK    @MSG
     C           IKTBN     IFEQ ' '
     C           KEY01     SETLLWK350W0
     C           KEY01     READEWK350W0                  81
     C           *IN81     IFEQ '0'
     C                     MOVELCMT,1     @MSG
     C                     ENDIF
     C                     ENDIF
      *工場名
     C                     SELEC
     C           PKOJ      WHEQ '6'                        ＩＡＦ
     C                     MOVEL'0111'    K@KOJY
     C           PKOJ      WHEQ '7'                        ＡＴＣ
     C                     MOVEL'0094'    K@KOJY
     C           PKOJ      WHEQ 'A'                        ＡＣＺ
     C                     MOVEL'0170'    K@KOJY
     C           PKOJ      WHEQ 'C'                        ＡＦＳ
     C                     MOVEL'0755'    K@KOJY
     C           PKOJ      WHEQ 'D'                        ＡＦＤ
     C                     MOVEL'0831'    K@KOJY
     C                     ENDSL
     C*------------------*
     C*  FACTORY NAME
     C*------------------*
     C                     SETOF                     11
     C                     Z-ADD1         A       20
     C           1         DO   10        A
     C           HBM,A     IFEQ 0
     C                     SETON                     11
     C                     ELSE
      *
     C                     SETOF                     10
     C           HBM,A     CHAINFGBPL011             10
     C           *IN10     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
      *
     C*--------------------------------*
     C*   ..０Ｅ・０Ｆ　ＣＨＥＣＫ..   *
     C*--------------------------------*
     C           *IN10     IFEQ '0'
     C                     SETOF                     10
     C                     Z-ADD1         B       20
     C                     Z-ADD11        C       20
     C                     MOVELB2SMEI    WKEMI  10
     C                     MOVEAWKEMI     KOJ
     C           1         DO   10        B
     C                     SUB  1         C
     C           KOJ,C     IFEQ OF
     C                     SETON                     10
     C                     ELSE
     C           KOJ,C     IFEQ OE
     C                     SETON                     10
     C                     MOVE OF        KOJ,10
     C                     END
     C                     END
     C  N10                END
     C                     MOVEAKOJ       HKJ,A
     C                     END
     C                     END
     C  N11                END
      *
     C*------------------------*
     C*  PART M/F
     C*------------------------*
     C                     SETOF                     10
     C           KEY       CHAINFCEPL011             10    PART M/F
     C           *IN10     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '1'
     C                     MOVE *BLANK    A2ZANM
     C                     Z-ADD0         A2KAZI
     C                     Z-ADD0         A2TAYY
     C                     Z-ADD0         A2TAMM
     C                     Z-ADD0         A2TADD
     C                     Z-ADD0         A2GEKN
     C                     END
      *
     C                     WRITEHD
      *
     C                     END
      *
     C                     ADD  1         E
     C           E         IFGT 63
     C                     Z-ADD1         E
     C                     EXSR SUBRTN
     C                     WRITEHD
     C                     END
      *
     C                     MOVE IKOTI     WTI,E
     C                     MOVE IKSEI     WSI,E
     C                     MOVELIKATA     WKT,E
     C           IKATA     IFEQ *BLANK
     C                     MOVELIMKAT     WKT,E
     C                     END
     C*
     C           OYAFLG    IFEQ '1'
     C                     MOVEL*BLANK    W@FIL1
     C                     MOVELIKATA     W@KAT@
     C           IKATA     IFEQ *BLANK
     C                     MOVELIMKAT     W@KAT@
     C                     ENDIF
     C                     MOVELW@KATA    WKT,E
     C                     ELSE
     C                     MOVELIKATA     W@KAT#
     C*
     C                     EXSR #WK000
     C           W@KFLG    IFEQ '1'
     C           IKTBN     ANDNE'1'
     C                     MOVEL'#'       W@FLG1
     C                     ENDIF
     C                     MOVELW@KAT#    WKT,E
     C           IKATA     IFEQ *BLANK
     C                     MOVELIMKAT     W@KAT#
     C                     MOVELW@KAT#    WKT,E
     C                     END
     C                     ENDIF
     C*
     C                     MOVE IKANM     WKN,E
     C                     Z-ADDIKOSU     WSU,E
     C           IKUBN     IFEQ '0'
     C                     MOVE '*'       AST,E
     C                     END
     C                     MOVE ITKRO     WTR,E
      *
      *-- MSK 05.02.99 (ADD)
TCHK1C*L1                   ADD  3         E
     CL1         E         IFGT 63
     CL1                   Z-ADD1         E
     CL1                   EXSR SUBRTN
     CL1                   WRITEHD
     CL1                   END
      *--
      *-- MSK 05.02.99 (CHG L1-->L2)
     CL2                   EXSR SUBRTN
      *
     C*----------------------*
     C*   SUB ROUTIN
     C*  OUTPUT DETAIL
     C*----------------------*
     C           SUBRTN    BEGSR
     C                     Z-ADD1         B
     C*                    Z-ADD22        C
     C                     Z-ADD21        C
     C*                    Z-ADD44        D       20
     C                     Z-ADD42        D       20
     C                     MOVE *BLANK    WTIB    3
     C                     MOVE *BLANK    WTIC    3
     C                     MOVE *BLANK    WTID    3
     C                     MOVE *BLANK    WSIB    2
     C                     MOVE *BLANK    WSIC    2
     C                     MOVE *BLANK    WSID    2
     C*          1         DO   22        B
     C           1         DO   21        B
     C                     SETOF                     101112
     C                     SETOF                     202122
     C                     ADD  1         C
     C                     ADD  1         D
      *
     C                     MOVE WTI,B     DKTI1
     C                     MOVE WSI,B     DKSI1
     C                     MOVE WKT,B     DKAT1
     C                     MOVE AST,B     DAST1
     C                     MOVE WKN,B     DKAN1
     C                     Z-ADDWSU,B     DKOS1
     C                     MOVE WTR,B     DTKR1
      *
     C                     MOVE WTI,C     DKTI2
     C                     MOVE WSI,C     DKSI2
     C                     MOVE WKT,C     DKAT2
     C                     MOVE AST,C     DAST2
     C                     MOVE WKN,C     DKAN2
     C                     Z-ADDWSU,C     DKOS2
     C                     MOVE WTR,C     DTKR2
      *
     C                     MOVE WTI,D     DKTI3
     C                     MOVE WSI,D     DKSI3
     C                     MOVE WKT,D     DKAT3
     C                     MOVE AST,D     DAST3
     C                     MOVE WKN,D     DKAN3
     C                     Z-ADDWSU,D     DKOS3
     C                     MOVE WTR,D     DTKR3
      *
     C*------------------------*
     C*    PROCESS CHECK
     C*------------------------*
     C           WTI,B     IFNE *BLANK
     C           WTI,B     IFEQ WTIB
     C                     SETON                     10
     C                     ELSE
     C                     MOVE WTI,B     WTIB
     C                     END
     C                     END
     C           WTI,C     IFNE *BLANK
     C           WTI,C     IFEQ WTIC
     C                     SETON                     11
     C                     ELSE
     C                     MOVE WTI,C     WTIC
     C                     END
     C                     END
     C           WTI,D     IFNE *BLANK
     C           WTI,D     IFEQ WTID
     C                     SETON                     12
     C                     ELSE
     C                     MOVE WTI,D     WTID
     C                     END
     C                     END
      *
     C*--------------------------*
     C*    CHECK OF COMPONENTS NO
     C*--------------------------*
     C           WSI,B     IFNE *BLANK
     C           WSI,B     IFEQ WSIB
     C                     SETON                     20
     C                     ELSE
     C                     MOVE WSI,B     WSIB
     C                     END
     C                     END
     C           WSI,C     IFNE *BLANK
     C           WSI,C     IFEQ WSIC
     C                     SETON                     21
     C                     ELSE
     C                     MOVE WSI,C     WSIC
     C                     END
     C                     END
     C           WSI,D     IFNE *BLANK
     C           WSI,D     IFEQ WSID
     C                     SETON                     22
     C                     ELSE
     C                     MOVE WSI,D     WSID
     C                     END
     C                     END
      *
     C                     WRITEDT
      *
     C                     END
      *
     C                     MOVE *BLANK    WTI
     C                     MOVE *BLANK    WSI
     C                     MOVE *BLANK    WKT
     C                     MOVE *BLANK    AST
     C                     MOVE *BLANK    WKN
     C                     Z-ADD0         WSU
     C                     MOVE *BLANK    WTR
      *
     C                     ENDSR
     C*================================================================
     C*<< WK420L3 >>
     C*================================================================
     C           #WK000    BEGSR
     C*
     C                     MOVEL'0'       W@KFLG  1
     C                     MOVELW@KAT1    K@OKT1
     C                     MOVELW@KAT2    K@OKT2
     C           KEY02     SETLLWK420L31
     C           KEY02     READEWK420L31                 89
     C           *IN89     DOWEQ'0'
     C           K2SKJY    IFEQ 'D'
     C           K2SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'1'       W@KFLG
     C                     ENDIF
     C           KEY02     READEWK420L31                 89
     C                     ENDDO
      *
     C***        *IN89     IFEQ '0'
     C*                    MOVEL'1'       W@KFLG
     C***                  ENDIF
     C*
     C                     ENDSR
**
*DIE PARTS REGISTERED*
