             PGM


             DCL        VAR(&INVN) TYPE(*CHAR) LEN(16)

/*  PROGRAM TO RETRIEVE INVOICE FROM AB#EP70S AND AB#EP71S     */

             CLRPFM     FILE(QTEMP/AB#EP70)
             CLRPFM     FILE(QTEMP/AB#EP71)

/*  PROGRAM TO UPDATE INVOICE # (ADD Z TO END), CHANGE ISSUE DATE */
             CALL       AB#R7071FX

             RUNQRY     QRYFILE((QTEMP/AB#EP70))
             RUNQRY     QRYFILE((QTEMP/AB#EP71))

       /* IF OK, COPY FILES OVER TO TFILE1  */
             CPYF FROMFILE(QTEMP/AB#EP70) TOFILE(TFILE1/AB#EP70) MBROPT(*ADD)
             CPYF FROMFILE(QTEMP/AB#EP71) TOFILE(TFILE1/AB#EP71) MBROPT(*ADD)

             ENDPGM
