     A***************************************
     A* TEST
     A***************************************
     A          R @DTL                      SKIPB(2)
     A            LIN1          50         1UNDERLINE
     A            LIN11         20        70UNDERLINE
     A                                      TXTRTT(90)
     A            @BAR01        13         3BARCODE(CODE3OF9 3 *NOHRI)
     A            @BAR03        13        75BARCODE(CODE3OF9 3 *NOHRI *VRT)
     A                                      TXTRTT(90)
     A                                      SPACEA(2)
     A            @BAR02        13        47BARCODE(CODE3OF9 3 *NOHRI)
     A                                      SPACEA(2)
     A            LIN2          50         1UNDERLINE
     A                                      SPACEA(2)
     A            @TXT          10         3CHRSIZ(2 2)
     A*
