     A**********************************************************************
     A*            DDS-ID         DC#PR13                                  *
     A*            DDS-TYPE       PRINTER-FILE                             *
     A*            CODING-DATE    97/02/18                                 *
     A*            REMARKS        DELIVERY INFORMATION / SUBJECT PARTS TAG *
     A**********************************************************************
     A*----------------------------------------------------------------
     A* DELIVERY INFORMATION
     A          R DC#PR131
     A*----------------------------------------------------------------
     A* LINE 1
     A                                  2  3'<< DELIVERY INFORMATION >>'
     A                                      CHRSIZ(1.2 1.2)
     A* LINE 3
     A                                  3  3'< RECEIVING CO >'
     A                                  3 37'< ORDER NO >'
     A            B8ODNO        10      3 56TEXT('ORDER NO')
     A                                  3 66'-'
     A            B8ODED         3S 0   3 67TEXT('ORDER NO SUB')
     A* LINE 4
     A            B8NONY         4S 0   4  3TEXT('RECEIVING CO')
     A                                  4 37'< DELIVERY DATE >'
     A            BXMEYY        11      4 56TEXT('DELIVERY DATE YY')
     A* LINE 5
     A            D1TOK1        30      5  3TEXT('CUSTOMER NAME1')
     A                                  5 37'< FACTORY >'
     A            B8NKOJ         1      5 51TEXT('       F')
     A* LINE 6
     A            D1TOK2        30      6  3TEXT('CUSTOMER NAME2')
     A                                  6 37'< RECEIVING >'
     A            B8NUKE         4      6 51TEXT('       RCV')
     A* LINE 7
     A                                  7  3'< PART-NO >'
     A                                  7 37'< USER-PART-NO >'
     A            B8MHN1         5      7 54TEXT('USER PARTS NO 1')
     A                                  7 59'-'
     A            B8MHN2         5      7 60TEXT('              2')
     A                                  7 65'-'
     A            B8MHN3         5      7 66TEXT('              3')
     A                                  7 71'-'
     A            B8MHN4         5      7 72TEXT('              4')
     A* LINE 8
     A            B8SHN1         5      8  3TEXT('PARTS NO  1')
     A                                      CHRSIZ(1.2 1.2)
     A                                  8 13'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8SHN2         5      8 15TEXT('          2')
     A                                      CHRSIZ(1.2 1.2)
     A                                  8 25'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8SHN3         2      8 27TEXT('          3')
     A                                      CHRSIZ(1.2 1.2)
     A                                  8 37'< CUSTOMER >'
     A                                  8 50'< FACTORY >'
     A                                  8 62'< RECEIVING >'
     A* LINE 9
     A            B8TOKU         4S 0   9 41TEXT('CUSTOMER CD')
     A            B8TKOJ         1      9 56TEXT('         F')
     A            B8TUKE         4      9 67TEXT('         RCV')
     A* LINE 10
     A                                 10  3'< LOCATION CD >'
     A                                 10 37'< REMARKS >'
     A            B8TKKI        30     10 49TEXT('REMARKS')
     A* LINE 11
     A            B8TKR1         1     11  3TEXT('LOCATION CD 1')
     A                                      CHRSIZ(1.2 1.2)
     A                                 11  5'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8TKR2         2     11  7TEXT('            2')
     A                                      CHRSIZ(1.2 1.2)
     A                                 11 11'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8TKR3         2     11 13TEXT('            3')
     A                                      CHRSIZ(1.2 1.2)
     A                                 11 17'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8TKR4         1     11 19TEXT('            4')
     A                                      CHRSIZ(1.2 1.2)
     A* LINE 12
     A                                 12  3'< SHIPPING ORDER DATE >'
     A                                 12 37'< DELIVERY METHOD >'
     A            B8HIKI         1     12 57TEXT('DELIVERY METHOD')
     A* LINE 13
     A            BXTEYY        11     13  3TEXT('                YY')
     A            WKHIKI        30     13 49TEXT('DELIVERY METHOD')
     A* LINE 14
     A                                 14  3'< DELIVERY QTY >'
     A                                 14 24'< FRACTION >'
     A                                 14 45'< QUANTITY IN BOX >'
     A* LINE 15
     A            B8SRYO         7S 0  15  3TEXT('DELIVERY QTY')
     A                                      EDTCDE(2)
     A                                      CHRSIZ(1.2 1.2)
     A            B8HASU         5S 0  15 23TEXT('FRACTION')
     A                                      EDTCDE(2)
     A                                      CHRSIZ(1.2 1.2)
     A            B8SYUY         5S 0  15 44TEXT('QUANTITY')
     A                                      EDTCDE(2)
     A                                 15 54'X'
     A            B8HAKO         3S 0  15 56TEXT('BOX')
     A                                      EDTCDE(2)
     A*******>>   BAR           14     17 31BARCODE(CODE3OF9 2 *NOHRI )
     A*******>>   BARC          12     20 31
%0001A            BARC          12     16 31BARCODE(CODE3OF9 3 *HRI )
     A*           BARC          12     16 31BARCODE(CODE3OF9)
     A*----------------------------------------------------------------
     A* SUBJECT PARTS TAG
     A          R DC#PR132
     A*----------------------------------------------------------------
     A* LINE 2
     A                                  2  3'<< SUBJECT PARTS`TAG >>'
     A                                      CHRSIZ(1.2 1.2)
     A                                  2 66'COUNT'
     A            B8CT1          2S 0   2 72TEXT('COUNT')
     A                                      EDTCDE(4)
     A                                  2 74'/'
     A            B8CT2          2S 0   2 75TEXT('COUNT')
     A                                      EDTCDE(4)
     A* LINE 5
     A                                  5  3'< PART-NO >'
     A                                  5 40'< RECEIVING CO >'
     A* LINE 6
     A            B8NONY         4S 0   6 47TEXT('RECEIVING CO')
     A* LINE 7
     A            B8SHN1         5      7  5TEXT('PARTS NO  1')
     A                                      CHRSIZ(1.2 1.2)
     A                                  7 15'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8SHN2         5      7 17TEXT('          2')
     A                                      CHRSIZ(1.2 1.2)
     A                                  7 27'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8SHN3         2      7 29TEXT('          3')
     A                                      CHRSIZ(1.2 1.2)
     A            D1TOK1        30      7 47TEXT('CUSTOMER NAME 1')
     A* LINE 8
     A            D1TOK2        30      8 47TEXT('CUSTOMER NAME 2')
     A* LINE 9
     A                                  9  3'< LOCATION CD >'
     A* LINE 10
     A                                 10 40'< FACTORY >'
     A* LINE 11
     A            B8TKR1         1     11  5TEXT('LOCATION CD 1')
     A                                      CHRSIZ(1.2 1.2)
     A                                 11  7'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8TKR2         2     11  9TEXT('            2')
     A                                      CHRSIZ(1.2 1.2)
     A                                 11 13'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8TKR3         2     11 15TEXT('            3')
     A                                      CHRSIZ(1.2 1.2)
     A                                 11 19'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8TKR4         1     11 21TEXT('            4')
     A                                      CHRSIZ(1.2 1.2)
     A            B8NKOJ         1     11 47TEXT('            F')
     A* LINE 12
     A            WKFAN1        30     12 47TEXT('FACTORY NAME 1')
     A* LINE 13
     A                                 13  3'< QUANTITY IN BOX >'
     A            WKFAN2        30     13 47TEXT('FACTORY NAME 2')
     A* LINE 15
     A            B8SYSU         7S 0  15  5TEXT('QUANTITY IN BOX')
     A                                      EDTCDE(2)
     A                                      CHRSIZ(1.2 1.2)
     A                                 15 40'< RECEIVING >'
     A* LINE 16
     A            B8NUKE         4     16 47TEXT('       RCV')
     A* LINE 17
     A                                 17  3'< DELIVERY DATE >'
     A            WKUKN1        30     17 47TEXT('RCV NAME   1')
     A* LINE 18
     A            WKUKN2        30     18 47TEXT('RCV NAME   2')
     A* LINE 19
     A            BXMEYY        11     19  5TEXT('DELIVERY DATE YY')
     A                                      CHRSIZ(1.2 1.2)
     A* LINE 20
     A                                 20 40'< ORDER-NO >'
     A            B8ODNO        10     20 53TEXT('ORDER NO')
     A                                 20 63'-'
     A            B8ODED         3S 0  20 64TEXT('ORDER NO SUB')
     A*----------------------------------------------------------------
     A* SALES VOTES
     A          R DC#PR133
     A*----------------------------------------------------------------
     A* LINE 2
     A                                  2  3'<< SALES VOTES >>'
     A                                      CHRSIZ(1.2 1.2)
     A* LINE 4
     A                                  4  3'< RECEIVING CO >'
     A                                  4 40'< ORDER NO >'
     A            B8ODNO        10      4 54TEXT('ORDER NO')
     A                                  4 64'-'
     A            B8ODED         3S 0   4 65TEXT('ORDER NO SUB')
     A* LINE 5
     A            B8NONY         4S 0   5  3TEXT('RECEIVING CO')
     A* LINE 6
     A            D1TOK1        30      6  3TEXT('CUSTOMER NAME 1')
     A                                  6 40'< FACTORY >'
     A            B8NKOJ         1      6 55TEXT('            F')
     A* LINE 7
     A            D1TOK2        30      7  3TEXT('CUSTOMER NAME 2')
     A                                  7 40'< RECEIVING >'
     A            B8NUKE         4      7 55TEXT('        RCV')
     A* LINE 9
     A                                  9  3'< USER-PART-NO >'
     A* LINE 9
     A            B8MHN1         5     10  3TEXT('USER PARTS NO 1')
     A                                      CHRSIZ(1.2 1.2)
     A                                 10 13'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8MHN2         5     10 15TEXT('              2')
     A                                      CHRSIZ(1.2 1.2)
     A                                 10 25'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8MHN3         5     10 27TEXT('              3')
     A                                      CHRSIZ(1.2 1.2)
     A                                 10 37'-'
     A                                      CHRSIZ(1.2 1.2)
     A            B8MHN4         5     10 39TEXT('              4')
     A                                      CHRSIZ(1.2 1.2)
     A* LINE 12
     A                                 12  3'< CUSTOMER >'
     A                                 12 16'< FACTORY >'
     A                                 12 28'< RECEIVING >'
     A* LINE 13
     A            B8TOKU         4S 0  13  6TEXT('CUSTOMER CD')
     A            B8TKOJ         1     13 21TEXT('          F')
     A            B8TUKE         4     13 33TEXT('          RCV')
     A* LINE 15
     A                                 15  3'< DELIVERY QTY >'
     A* LINE 16
     A            B8SRYO         7S 0  16  7TEXT('DELIVERY QTY')
     A                                      EDTCDE(2)
     A                                      CHRSIZ(1.2 1.2)
     A* LINE 18
     A                                 18  3'< DELIVERY DATE >'
     A* LINE 19
     A            BXMEYY        11     19  7TEXT('SHIP ORDER DATE YY')
     A**          BAR2          10     17 34
     A*******>>   BAR2          10     17 34BARCODE(CODE3OF9 3 *NOHRI )
     A*******>>   BARC2          8     20 34
%0001A            BARC2          8     16 34BARCODE(CODE3OF9 3 *HRI)
     A*           BARC2          8     16 34BARCODE(CODE3OF9)
     A*----------------------------------------------------------------
     A* DUMMY
     A          R DC#PR134
     A*----------------------------------------------------------------
     A* LINE 2
     A                                  2  3'  '
     A                                 10  3'  '
     A                                 20  3'  '
