     A          R MEKPR011                  SKIPB(3)
     A                                     5' '
     A          R MEKPR012
     A            BARN          15         9
     A            DAK            5        35
     A                                      SPACEA(1)
     A                                     2'!@&913'
     A                                     8'*'
     A            BARC          15         9
     A                                    24'*'
     A                                    25'!@&1'
     A                                      SPACEA(2)
